
//
// raytrace/raytrace.cpp
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 160
//	classes: 2
//	structs: 2
//

// <0637AFB4> raytrace/raytrace.cpp:21
// variables: 25
// function calls: 83
void RayTracingResultMulti_t::RegisterIntersection(const fltx4& fl4HitMask, const fltx4& fl4U, const fltx4& fl4V, int nTriangleIndex, const fltx4& isect_t, const FourVectors& N, const RayTracingEnvironment* pRtEnv, const InstancedRayTracingEnvironmentReference_t* pInstance, uint64 nMaterial)
{
	int nNewIdx; // 23
	CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1143
	FourVectors::FourVectors(); // 435
	RayTracingResult_t::RayTracingResult_t(); // 1479
	Construct<RayTracingResult_t>(RayTracingResult_t* pMemory); // 1148
	CUtlMemory<RayTracingResult_t, int>::Base(); // 112
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
			int num);  // 1145
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(); // 23
	CUtlMemory<RayTracingResult_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
			int i);  // 24
	memset(void* __dest,
		int __ch,
		size_t __len);  // 459
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 463
	FourVectors::DuplicateVector(
			const Vector& v);  // 463
	RayTracingResult_t::SetRayTraceEnv(
			const RayTracingEnvironment* pEnv);  // 464
	memset(void* __dest,
		int __ch,
		size_t __len);  // 466
	RayTracingResult_t::Init(); // 24
	{
		__m128i retVal; // 1105
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 648
		_mm_set1_epi32(int __A); // 1106
	}
	ReplicateIX4<>(int nValue); // 482
	{
		fltx4 retVal; // 1076
		_mm_castsi128_ps(__m128i __A); // 1077
	}
	CastToFltx4<>(const i32x4& a); // 482
	{
		fltx4 retVal; // 602
		_mm_load_ps(const float* __P); // 603
	}
	LoadAlignedSIMD<>(const void* pSIMD); // 485
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 485
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 484
	{
		fltx4 retVal; // 875
		_mm_or_ps(__m128 __A,
				__m128 __B);  // 876
	}
	OrSIMD<>(const fltx4& a,
		const fltx4& b);  // 484
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 488
	_mm_store_ps(float* __P,
			__m128 __A);  // 273
	StoreAlignedSIMD<>(float* pSIMD,
				const fltx4& a);  // 483
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 489
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 490
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 212
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 213
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 214
	FourVectors::MaskedAssign(
			FLTX4 fl4Writemask,
			const FourVectors& v4NewValues);  // 491
	_mm_movemask_ps(__m128 __A); // 1805
	TestSignSIMD<>(const fltx4& a); // 493
	RayTracingResult_t::RegisterIntersection(
				const fltx4& fl4HitMask,
				const fltx4& fl4U,
				const fltx4& fl4V,
				int nTriangleIndex,
				const fltx4& isect_t,
				const FourVectors& N,
				const RayTracingEnvironment* pRtEnv,
				const InstancedRayTracingEnvironmentReference_t* pInstance,
				uint64 nTriangleMaterial);  // 26
	CUtlMemory<RayTracingResult_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
			int i);  // 25
	RayTracingResult_t::SetRayTraceEnv(
			const RayTracingEnvironment* pEnv);  // 25
	CUtlMemory<RayTracingResult_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
			int i);  // 26
} /* size: 792, variables: 1, inline expansions: 58 (1275 bytes) */

// <0634E483> raytrace/raytrace.cpp:21
// variable: 1
inline void RayTracingResultMulti_t::RegisterIntersection(const fltx4& fl4HitMask, const fltx4& fl4U, const fltx4& fl4V, int nTriangleIndex, const fltx4& isect_t, const FourVectors& N, const RayTracingEnvironment* pRtEnv, const InstancedRayTracingEnvironmentReference_t* pInstance, uint64 nMaterial)
{
	int nNewIdx; // 23
} /* size: 0, variables: 1 */

// <0634CDB2> raytrace/raytrace.cpp:29
// variables: 5
// function calls: 96
void RayTracingResultMulti_t::MergeInSubResult(const RayTracingResultMulti_t& srcSubResult, int nIdx)
{
	int nOldDestCount; // 48
	{
		int i; // 32
		{
			RayTracingResult_t tmpEmpty; // 42
			SubFloat<>(const fltx4& a,
					int idx);  // 580
			SubFloat<>(fltx4& a,
					int idx);  // 268
			FourVectors::Z(
				int idx);  // 585
			SubFloat<>(const fltx4& a,
					int idx);  // 582
			SubFloat<>(fltx4& a,
					int idx);  // 258
			FourVectors::X(
				int idx);  // 583
			SubFloat<>(fltx4& a,
					int idx);  // 263
			FourVectors::Y(
				int idx);  // 584
			SubFloat<>(const fltx4& a,
					int idx);  // 581
			SubFloat<>(fltx4& a,
					int idx);  // 580
			SubFloat<>(fltx4& a,
					int idx);  // 581
			SubFloat<>(fltx4& a,
					int idx);  // 582
			SubFloat<>(fltx4& a,
					int idx);  // 273
			FourVectors::X(
				int idx);  // 583
			SubFloat<>(fltx4& a,
					int idx);  // 278
			FourVectors::Y(
				int idx);  // 584
			SubFloat<>(fltx4& a,
					int idx);  // 283
			FourVectors::Z(
				int idx);  // 585
			RayTracingResult_t::MergeInSubResult(
					const RayTracingResult_t& srcSubResult,
					int nIdx);  // 44
			RayTracingResult_t::SetRayTraceEnv(
					const RayTracingEnvironment* pEnv);  // 464
			memset(void* __dest,
				int __ch,
				size_t __len);  // 459
			memset(void* __dest,
				int __ch,
				size_t __len);  // 466
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 463
			FourVectors::DuplicateVector(
					const Vector& v);  // 463
			RayTracingResult_t::Init(); // 43
			FourVectors::FourVectors(); // 435
			RayTracingResult_t::RayTracingResult_t(); // 42
			CUtlMemory<RayTracingResult_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
					int i);  // 44
		}
		CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 32
		CUtlMemory<RayTracingResult_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
				int i);  // 37
		CUtlMemory<RayTracingResult_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
				int i);  // 37
		SubFloat<>(const fltx4& a,
				int idx);  // 580
		SubFloat<>(fltx4& a,
				int idx);  // 580
		SubFloat<>(const fltx4& a,
				int idx);  // 581
		SubFloat<>(fltx4& a,
				int idx);  // 581
		SubFloat<>(const fltx4& a,
				int idx);  // 582
		SubFloat<>(fltx4& a,
				int idx);  // 582
		SubFloat<>(fltx4& a,
				int idx);  // 258
		FourVectors::X(
			int idx);  // 583
		SubFloat<>(fltx4& a,
				int idx);  // 273
		FourVectors::X(
			int idx);  // 583
		SubFloat<>(fltx4& a,
				int idx);  // 263
		FourVectors::Y(
			int idx);  // 584
		SubFloat<>(fltx4& a,
				int idx);  // 278
		FourVectors::Y(
			int idx);  // 584
		SubFloat<>(fltx4& a,
				int idx);  // 268
		FourVectors::Z(
			int idx);  // 585
		SubFloat<>(fltx4& a,
				int idx);  // 283
		FourVectors::Z(
			int idx);  // 585
		RayTracingResult_t::MergeInSubResult(
				const RayTracingResult_t& srcSubResult,
				int nIdx);  // 37
		CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 34
	}
	{
		int i; // 49
		{
			RayTracingResult_t tmpEmpty; // 51
			SubFloat<>(const fltx4& a,
					int idx);  // 580
			SubFloat<>(fltx4& a,
					int idx);  // 283
			FourVectors::Z(
				int idx);  // 585
			SubFloat<>(fltx4& a,
					int idx);  // 580
			SubFloat<>(fltx4& a,
					int idx);  // 581
			SubFloat<>(fltx4& a,
					int idx);  // 582
			SubFloat<>(fltx4& a,
					int idx);  // 273
			FourVectors::X(
				int idx);  // 583
			SubFloat<>(fltx4& a,
					int idx);  // 278
			FourVectors::Y(
				int idx);  // 584
			SubFloat<>(const fltx4& a,
					int idx);  // 581
			SubFloat<>(const fltx4& a,
					int idx);  // 582
			SubFloat<>(fltx4& a,
					int idx);  // 258
			FourVectors::X(
				int idx);  // 583
			SubFloat<>(fltx4& a,
					int idx);  // 263
			FourVectors::Y(
				int idx);  // 584
			SubFloat<>(fltx4& a,
					int idx);  // 268
			FourVectors::Z(
				int idx);  // 585
			RayTracingResult_t::MergeInSubResult(
					const RayTracingResult_t& srcSubResult,
					int nIdx);  // 53
			memset(void* __dest,
				int __ch,
				size_t __len);  // 459
			memset(void* __dest,
				int __ch,
				size_t __len);  // 466
			RayTracingResult_t::SetRayTraceEnv(
					const RayTracingEnvironment* pEnv);  // 464
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 463
			FourVectors::DuplicateVector(
					const Vector& v);  // 463
			RayTracingResult_t::Init(); // 52
			CUtlMemory<RayTracingResult_t, int>::operator[](
					int i);  // 602
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
				int i);  // 1201
			FourVectors::FourVectors(
					const FourVectors& src);  // 435
			RayTracingResult_t::RayTracingResult_t(
						const RayTracingResult_t  &);  // 1520
			CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
								const RayTracingResult_t& src);  // 1201
			CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
			CUtlMemory<RayTracingResult_t, int>::Base(); // 112
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
					int num);  // 1198
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
					const RayTracingResult_t& src);  // 54
			FourVectors::FourVectors(); // 435
			RayTracingResult_t::RayTracingResult_t(); // 51
			CUtlMemory<RayTracingResult_t, int>::operator[](
					int i);  // 595
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
					int i);  // 53
		}
		Max<int>(const int& val1,
			const int& val2);  // 49
		CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 49
	}
} /* size: 1574, variables: 1 */

// <0634CD4A> raytrace/raytrace.cpp:59
// variables: 2
int TraceResultDistanceCompareFN(const RayTracingSingleResult_t* a, const RayTracingSingleResult_t* b)
{
	float flDistanceA; // 61
	float flDistanceB; // 62
} /* size: 51, variables: 2 */

// <0634CC17> raytrace/raytrace.cpp:69
// function calls: 5
void RayTracingResultMulti_t::RemoveAll()
{
	CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::RemoveAll(); // 71
	CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 72
	CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 73
	CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 74
	CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 75
} /* size: 0, inline expansions: 5 (0 bytes) */

// <0634C4B0> raytrace/raytrace.cpp:79
// variables: 3
// function calls: 34
void RayTracingResultMulti_t::PostTraceFixup()
{
	{
		int nSubRay; // 82
		{
			int i; // 84
			{
				RayTracingSingleResult_t& out; // 89
				CUtlMemory<RayTracingSingleResult_t, int>::NumAllocated(); // 1143
				Vector::Vector(); // 360
				RayTracingSingleResult_t::RayTracingSingleResult_t(); // 1479
				Construct<RayTracingSingleResult_t>(RayTracingSingleResult_t* pMemory); // 1148
				CUtlMemory<RayTracingSingleResult_t, int>::IsGrowable(); // 823
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 859
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 861
				CUtlMemory<RayTracingSingleResult_t, int>::Grow(
					int num);  // 806
				CUtlMemory<RayTracingSingleResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Base(); // 368
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 824
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::GrowMemory(
						int num);  // 1145
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::AddToTail(); // 89
				CUtlMemory<RayTracingSingleResult_t, int>::operator[](
						int i);  // 588
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::operator[](
						int i);  // 89
				CUtlMemory<RayTracingResult_t, int>::operator[](
						int i);  // 588
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
						int i);  // 90
				SubFloat<>(const fltx4& a,
						int idx);  // 628
				SubFloat<>(const fltx4& a,
						int idx);  // 629
				SubFloat<>(const fltx4& a,
						int idx);  // 630
				SubFloat<>(fltx4& a,
						int idx);  // 268
				FourVectors::Z(
					int idx);  // 288
				SubFloat<>(fltx4& a,
						int idx);  // 263
				FourVectors::Y(
					int idx);  // 288
				SubFloat<>(fltx4& a,
						int idx);  // 258
				FourVectors::X(
					int idx);  // 288
				Vector::Vector(
					vec_t X,
					vec_t Y,
					vec_t Z);  // 288
				FourVectors::Vec(
					int idx);  // 631
				Vector::operator=(
						const Vector& vOther);  // 631
				RayTracingResult_t::ExtractSingleResult(
							int nSubIdx,
							RayTracingSingleResult_t& out);  // 90
			}
			CUtlMemory<RayTracingResult_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
					int i);  // 86
			CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 84
		}
		CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Count(); // 93
	}
} /* size: 603 */

// <0634C42D> raytrace/raytrace.cpp:101
// variables: 4
void FourRays::CalculateDirectionSignMask()
{
	int nRet; // 106
	int nOrMask; // 107
	int nAndMask; // 108
	const int32* pDirectionCastToInt; // 109
} /* size: 247, variables: 4 */

// <0634C3D1> raytrace/raytrace.cpp:172
// variables: 3
void ComputeInvAndSignSelect(FourVectors* pDirSignSelect, FourVectors* pInvDir, const FourVectors& vRayDir)
{
	fltx4 xdir; // 175
	fltx4 ydir; // 176
	fltx4 zdir; // 177
} /* size: 0, variables: 3 */

// <0634A71D> raytrace/raytrace.cpp:188
// variables: 73
// function calls: 95
bool IntersectRayAgainstAABB(const VectorAligned& vAABBMins, const VectorAligned& vAABBMaxs, const FourVectors& vOrigin, const FourVectors& vDirSignSelect, const FourVectors& vInvDir, const fltx4& t0, const fltx4& t1)
{
	FourVectors v4AABBMins; // 190
	FourVectors v4AABBMaxs; // 191
	fltx4 tx1; // 193
	fltx4 tx2; // 194
	fltx4 ty1; // 196
	fltx4 ty2; // 197
	fltx4 tz1; // 199
	fltx4 tz2; // 200
	fltx4 txmin; // 202
	fltx4 txmax; // 203
	fltx4 tymin; // 205
	fltx4 tymax; // 206
	fltx4 tzmin; // 208
	fltx4 tzmax; // 209
	fltx4 tmins; // 211
	fltx4 tmaxs; // 212
	fltx4 validMask; // 214
	{
		__v4sf __r0; // 2491
		__v4sf __r1; // 2491
		__v4sf __r2; // 2491
		__v4sf __r3; // 2491
		__v4sf __t0; // 2491
		__v4sf __t1; // 2491
		__v4sf __t2; // 2491
		__v4sf __t3; // 2491
	}
	TransposeSIMD<>(fltx4& x,
			fltx4& y,
			fltx4& z,
			fltx4& w);  // 368
	FourVectors::LoadAndSwizzle(
			const VectorAligned& a,
			const VectorAligned& b,
			const VectorAligned& c,
			const VectorAligned& d);  // 85
	FourVectors::FourVectors(
			const VectorAligned& a,
			const VectorAligned& b,
			const VectorAligned& c,
			const VectorAligned& d);  // 190
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 193
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 193
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 199
	{
		__v4sf __r0; // 2491
		__v4sf __r1; // 2491
		__v4sf __r2; // 2491
		__v4sf __r3; // 2491
		__v4sf __t0; // 2491
		__v4sf __t1; // 2491
		__v4sf __t2; // 2491
		__v4sf __t3; // 2491
	}
	TransposeSIMD<>(fltx4& x,
			fltx4& y,
			fltx4& z,
			fltx4& w);  // 368
	FourVectors::LoadAndSwizzle(
			const VectorAligned& a,
			const VectorAligned& b,
			const VectorAligned& c,
			const VectorAligned& d);  // 85
	FourVectors::FourVectors(
			const VectorAligned& a,
			const VectorAligned& b,
			const VectorAligned& c,
			const VectorAligned& d);  // 191
	{
		fltx4 retVal; // 2067
		_mm_cmplt_ps(__m128 __A,
				__m128 __B);  // 2068
	}
	CmpLtSIMD<>(const fltx4& a,
			const fltx4& b);  // 216
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 194
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 200
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 194
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 196
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 197
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 196
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 199
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 197
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 200
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 202
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 205
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 203
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 206
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 208
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	{
		fltx4 retVal; // 826
		_mm_xor_ps(__m128 __A,
				__m128 __B);  // 827
	}
	XorSIMD<>(const fltx4& a,
			const fltx4& b);  // 1259
	MaskedAssign<>(const fltx4& ReplacementMask,
			const fltx4& a,
			const fltx4& b);  // 209
	{
		fltx4 retVal; // 2228
		_mm_max_ps(__m128 __A,
				__m128 __B);  // 2229
	}
	MaxSIMD<>(const fltx4& a,
			const fltx4& b);  // 211
	{
		fltx4 retVal; // 2228
		_mm_max_ps(__m128 __A,
				__m128 __B);  // 2229
	}
	MaxSIMD<>(const fltx4& a,
			const fltx4& b);  // 211
	{
		fltx4 retVal; // 2200
		_mm_min_ps(__m128 __A,
				__m128 __B);  // 2201
	}
	MinSIMD<>(const fltx4& a,
			const fltx4& b);  // 212
	{
		fltx4 retVal; // 1981
		_mm_cmpgt_ps(__m128 __A,
				__m128 __B);  // 1982
	}
	CmpGtSIMD<>(const fltx4& a,
			const fltx4& b);  // 215
	{
		fltx4 retVal; // 2200
		_mm_min_ps(__m128 __A,
				__m128 __B);  // 2201
	}
	MinSIMD<>(const fltx4& a,
			const fltx4& b);  // 212
	{
		fltx4 retVal; // 2095
		_mm_cmple_ps(__m128 __A,
				__m128 __B);  // 2096
	}
	CmpLeSIMD<>(const fltx4& a,
			const fltx4& b);  // 214
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 215
	{
		fltx4 retVal; // 718
		_mm_and_ps(__m128 __A,
				__m128 __B);  // 719
	}
	AndSIMD<>(const fltx4& a,
			const fltx4& b);  // 216
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 2324
	_mm_movemask_ps(__m128 __A); // 1805
	TestSignSIMD<>(const fltx4& a); // 2324
	IsAllZeros<>(const fltx4& var); // 217
} /* size: 236, variables: 17, inline expansions: 55 (377 bytes) */

// <0634A5C5> raytrace/raytrace.cpp:221
// function calls: 5
void RayTracingEnvironment::MakeRoomForTriangles(int ntris)
{
	CUtlMemory<Vector, int>::IsGrowable(); // 881
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 888
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::EnsureCapacity(
			int num);  // 225
} /* size: 0, inline expansions: 5 (0 bytes) */

// <0634A592> raytrace/raytrace.cpp:228
// variable: 1
void RegisterAsChildOf(RayTracingEnvironment* pChild, RayTracingEnvironment* pParent)
{
	int idx; // 230
} /* size: 0, variables: 1 */

// <0634A53B> raytrace/raytrace.cpp:239
// variables: 3
void UnregisterAsChildOf(RayTracingEnvironment* pChild, RayTracingEnvironment* pParent)
{
	int nIdx; // 241
	const char   __FUNCTION__; // 5101
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 254
	}
} /* size: 0, variables: 2 */

// <02F6F050> raytrace/raytrace.cpp:239
// variables: 3
void UnregisterAsChildOf(RayTracingEnvironment* pChild, RayTracingEnvironment* pParent)
{
	int nIdx; // 241
	const char   __FUNCTION__; // 11767
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 254
	}
} /* size: 0, variables: 2 */

// <01758C88> raytrace/raytrace.cpp:239
// variables: 3
void UnregisterAsChildOf(RayTracingEnvironment* pChild, RayTracingEnvironment* pParent)
{
	int nIdx; // 241
	const char   __FUNCTION__; // 1951
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 254
	}
} /* size: 0, variables: 2 */

// <06355549> raytrace/raytrace.cpp:258
// variables: 9
// function calls: 35
void MarkBVHNodesDirty(RayTracingEnvironment* pEnv)
{
	{
		int i; // 262
		CUtlVectorBase<RayTracingEnvironment::Count(); // 262
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingEnvironment::operator[](
				int i);  // 264
		{
			int i; // 262
			CUtlVectorBase<RayTracingEnvironment::Count(); // 262
			CUtlMemory<RayTracingEnvironment::operator[](
					int i);  // 588
			CUtlVectorBase<RayTracingEnvironment::operator[](
					int i);  // 264
			{
				int i; // 262
				CUtlVectorBase<RayTracingEnvironment::Count(); // 262
				CUtlMemory<RayTracingEnvironment::operator[](
						int i);  // 588
				CUtlVectorBase<RayTracingEnvironment::operator[](
						int i);  // 264
				{
					int i; // 262
					CUtlVectorBase<RayTracingEnvironment::Count(); // 262
					CUtlMemory<RayTracingEnvironment::operator[](
							int i);  // 588
					CUtlVectorBase<RayTracingEnvironment::operator[](
							int i);  // 264
					{
						int i; // 262
						CUtlVectorBase<RayTracingEnvironment::Count(); // 262
						CUtlMemory<RayTracingEnvironment::operator[](
								int i);  // 588
						CUtlVectorBase<RayTracingEnvironment::operator[](
								int i);  // 264
						{
							int i; // 262
							CUtlVectorBase<RayTracingEnvironment::Count(); // 262
							CUtlMemory<RayTracingEnvironment::operator[](
									int i);  // 588
							CUtlVectorBase<RayTracingEnvironment::operator[](
									int i);  // 264
							{
								int i; // 262
								CUtlVectorBase<RayTracingEnvironment::Count(); // 262
								CUtlMemory<RayTracingEnvironment::operator[](
										int i);  // 588
								CUtlVectorBase<RayTracingEnvironment::operator[](
										int i);  // 264
								{
									int i; // 262
									CUtlVectorBase<RayTracingEnvironment::Count(); // 262
									CUtlMemory<RayTracingEnvironment::operator[](
											int i);  // 588
									CUtlVectorBase<RayTracingEnvironment::operator[](
											int i);  // 264
									{
										int i; // 262
										CUtlVectorBase<RayTracingEnvironment::Count(); // 262
										CUtlMemory<RayTracingEnvironment::operator[](
												int i);  // 588
										CUtlVectorBase<RayTracingEnvironment::operator[](
												int i);  // 264
									}
									MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
								}
								MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
							}
							MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
						}
						MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
					}
					MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
				}
				MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
			}
			MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
		}
		MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 264
	}
} /* size: 787 */

// <0634A511> raytrace/raytrace.cpp:258
// variable: 1
void MarkBVHNodesDirty(RayTracingEnvironment* pEnv)
{
	{
		int i; // 262
	}
} /* size: 0 */

// <063495E4> raytrace/raytrace.cpp:268
// variables: 3
// function calls: 64
void RayTracingEnvironment::AddInstancedEnv(RayTracingEnvironment* pEnv, const matrix3x4a_t& matTransform, void* pUserData)
{
	InstancedRayTracingEnvironmentReference_t* pNode; // 274
	{
		int i; // 1531
		CUtlVectorBase<RayTracingEnvironment::Count(); // 1531
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 609
		CUtlVectorBase<RayTracingEnvironment::Element(
			int i);  // 1533
	}
	CUtlVectorBase<RayTracingEnvironment::Find(
		RayTracingEnvironment* const& src);  // 230
	CUtlVectorBase<RayTracingEnvironment::IsValidIndex(
			int i);  // 231
	CUtlMemory<int, int>::operator[](
			int i);  // 588
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 236
	CUtlMemory<RayTracingEnvironment::NumAllocated(); // 1196
	CUtlMemory<RayTracingEnvironment::operator[](
			int i);  // 602
	CUtlVectorBase<RayTracingEnvironment::Element(
		int i);  // 1201
	CopyConstruct<RayTracingEnvironment*>(RayTracingEnvironment** pMemory,
						RayTracingEnvironment* const& src);  // 1201
	CUtlMemory<RayTracingEnvironment::IsGrowable(); // 823
	CUtlMemory<RayTracingEnvironment::IsExternallyAllocated(); // 859
	CUtlMemory<RayTracingEnvironment::IsExternallyAllocated(); // 861
	CUtlMemory<RayTracingEnvironment::Grow(
		int num);  // 806
	CUtlVectorBase<RayTracingEnvironment::ResetDbgInfo(); // 824
	CUtlVectorBase<RayTracingEnvironment::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<RayTracingEnvironment::AddToTail(
			RayTracingEnvironment* const& src);  // 233
	CUtlMemory<int, int>::NumAllocated(); // 1247
	CUtlMemory<int, int>::operator[](
			int i);  // 602
	CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
		int i);  // 1252
	Construct<int, int>(int* pMemory); // 1252
	CUtlMemory<int, int>::Base(); // 112
	CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 368
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<int, CUtlMemory<int, int> >::GrowMemory(
			int num);  // 1249
	CUtlVectorBase<int, CUtlMemory<int, int> >::AddToTail(
			int& src);  // 234
	RegisterAsChildOf(RayTracingEnvironment* pChild,
				RayTracingEnvironment* pParent);  // 270
	{
		int i; // 262
		CUtlVectorBase<RayTracingEnvironment::Count(); // 262
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingEnvironment::operator[](
				int i);  // 264
	}
	MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 272
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::NumAllocated(); // 1196
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::Base(); // 112
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Base(); // 368
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::ResetDbgInfo(); // 824
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::IsGrowable(); // 823
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::IsExternallyAllocated(); // 859
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::IsExternallyAllocated(); // 861
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::Grow(
		int num);  // 806
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::GrowMemory(
			int num);  // 1198
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 602
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
		int i);  // 1201
	CopyConstruct<InstancedRayTracingEnvironmentReference_t*>(InstancedRayTracingEnvironmentReference_t** pMemory,
									InstancedRayTracingEnvironmentReference_t* const& src);  // 1201
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::AddToTail(
			InstancedRayTracingEnvironmentReference_t* const& src);  // 278
	matrix3x4_t::matrix3x4_t(); // 303
	matrix3x4a_t::matrix3x4a_t(); // 338
	matrix3x4_t::matrix3x4_t(); // 303
	matrix3x4a_t::matrix3x4a_t(); // 338
	Vector::Vector(); // 24
	Vector::Vector(); // 24
	AABB_t::AABB_t(); // 338
	CUtlMemory<long long unsigned int, int>::ValidateGrowSize(); // 475
	CUtlMemory<long long unsigned int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVector(); // 308
	CUtlMemory<long long unsigned int, int>::ValidateGrowSize(); // 475
	CUtlMemory<long long unsigned int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVector(); // 308
	CRaytraceMaterialRemapTable::CRaytraceMaterialRemapTable(); // 338
	InstancedRayTracingEnvironmentReference_t::InstancedRayTracingEnvironmentReference_t(); // 274
} /* size: 961, variables: 1, inline expansions: 58 (2616 bytes) */

// <06348618> raytrace/raytrace.cpp:285
// variables: 9
// function calls: 67
void RayTracingEnvironment::RemoveInstancedEnv(InstancedRayTracingEnvironmentReference_t* pChild)
{
	int nIdx; // 291
	const char   __FUNCTION__; // 5074
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 301
	}
	{
		int i; // 1531
		CUtlVectorBase<RayTracingEnvironment::Count(); // 1531
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 609
		CUtlVectorBase<RayTracingEnvironment::Element(
			int i);  // 1533
	}
	CUtlVectorBase<RayTracingEnvironment::Find(
		RayTracingEnvironment* const& src);  // 241
	CUtlVectorBase<RayTracingEnvironment::IsValidIndex(
			int i);  // 243
	CUtlMemory<int, int>::operator[](
			int i);  // 588
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 245
	CUtlMemory<int, int>::operator[](
			int i);  // 588
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 246
	CUtlMemory<RayTracingEnvironment::operator[](
			int i);  // 602
	CUtlVectorBase<RayTracingEnvironment::Element(
		int i);  // 1575
	Destruct<RayTracingEnvironment*>(RayTracingEnvironment** pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 602
		CUtlVectorBase<RayTracingEnvironment::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<RayTracingEnvironment::FastRemove(
			int elem);  // 248
	CUtlMemory<int, int>::operator[](
			int i);  // 602
	CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
		int i);  // 1575
	Destruct<int>(int* pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<int, int>::operator[](
				int i);  // 602
		CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::FastRemove(
			int elem);  // 249
	{
	}
	UnregisterAsChildOf(RayTracingEnvironment* pChild,
				RayTracingEnvironment* pParent);  // 287
	{
		int i; // 262
		CUtlVectorBase<RayTracingEnvironment::Count(); // 262
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingEnvironment::operator[](
				int i);  // 264
	}
	MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 289
	{
		int i; // 1531
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Count(); // 1531
		CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
				int i);  // 609
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
			int i);  // 1533
	}
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Find(
		InstancedRayTracingEnvironmentReference_t* const& src);  // 291
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::IsValidIndex(
			int i);  // 293
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 588
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 295
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 299
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 299
	CRaytraceMaterialRemapTable::~CRaytraceMaterialRemapTable(); // 338
	InstancedRayTracingEnvironmentReference_t::~InstancedRayTracingEnvironmentReference_t(); // 295
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 602
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
		int i);  // 1575
	Destruct<InstancedRayTracingEnvironmentReference_t*>(InstancedRayTracingEnvironmentReference_t** pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
				int i);  // 602
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::FastRemove(
			int elem);  // 297
} /* size: 0, variables: 2, inline expansions: 46 (1347 bytes) */

// <02F6D12D> raytrace/raytrace.cpp:285
// variables: 9
// function calls: 67
void RayTracingEnvironment::RemoveInstancedEnv(InstancedRayTracingEnvironmentReference_t* pChild)
{
	int nIdx; // 291
	const char   __FUNCTION__; // 11740
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 301
	}
	{
		int i; // 1531
		CUtlVectorBase<RayTracingEnvironment::Count(); // 1531
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 609
		CUtlVectorBase<RayTracingEnvironment::Element(
			int i);  // 1533
	}
	CUtlVectorBase<RayTracingEnvironment::Find(
		RayTracingEnvironment* const& src);  // 241
	CUtlVectorBase<RayTracingEnvironment::IsValidIndex(
			int i);  // 243
	CUtlMemory<int, int>::operator[](
			int i);  // 588
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 245
	CUtlMemory<int, int>::operator[](
			int i);  // 588
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 246
	CUtlMemory<RayTracingEnvironment::operator[](
			int i);  // 602
	CUtlVectorBase<RayTracingEnvironment::Element(
		int i);  // 1575
	Destruct<RayTracingEnvironment*>(RayTracingEnvironment** pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 602
		CUtlVectorBase<RayTracingEnvironment::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<RayTracingEnvironment::FastRemove(
			int elem);  // 248
	CUtlMemory<int, int>::operator[](
			int i);  // 602
	CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
		int i);  // 1575
	Destruct<int>(int* pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<int, int>::operator[](
				int i);  // 602
		CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::FastRemove(
			int elem);  // 249
	{
	}
	UnregisterAsChildOf(RayTracingEnvironment* pChild,
				RayTracingEnvironment* pParent);  // 287
	{
		int i; // 262
		CUtlVectorBase<RayTracingEnvironment::Count(); // 262
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingEnvironment::operator[](
				int i);  // 264
	}
	MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 289
	{
		int i; // 1531
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Count(); // 1531
		CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
				int i);  // 609
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
			int i);  // 1533
	}
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Find(
		InstancedRayTracingEnvironmentReference_t* const& src);  // 291
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::IsValidIndex(
			int i);  // 293
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 588
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 295
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 299
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 299
	CRaytraceMaterialRemapTable::~CRaytraceMaterialRemapTable(); // 338
	InstancedRayTracingEnvironmentReference_t::~InstancedRayTracingEnvironmentReference_t(); // 295
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
			int i);  // 602
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
		int i);  // 1575
	Destruct<InstancedRayTracingEnvironmentReference_t*>(InstancedRayTracingEnvironmentReference_t** pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
				int i);  // 602
		CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::FastRemove(
			int elem);  // 297
} /* size: 0, variables: 2, inline expansions: 46 (0 bytes) */

// <06348339> raytrace/raytrace.cpp:305
// variables: 2
// function calls: 8
void RayTracingEnvironment::SetChildTransform(InstancedRayTracingEnvironmentReference_t* pChild, const matrix3x4a_t& matTransform)
{
	const RayTracingEnvironment* pEnv; // 312
	{
		int i; // 262
		CUtlVectorBase<RayTracingEnvironment::Count(); // 262
		CUtlMemory<RayTracingEnvironment::operator[](
				int i);  // 588
		CUtlVectorBase<RayTracingEnvironment::operator[](
				int i);  // 264
	}
	MarkBVHNodesDirty(RayTracingEnvironment* pEnv); // 307
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 138
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 139
	AABB_t::MakeInvalid(); // 317
	matrix3x4_t::TransformAABB(
			const Vector& vecMinsIn,
			const Vector& vecMaxsIn,
			Vector& vecMinsOut,
			Vector& vecMaxsOut);  // 321
} /* size: 253, variables: 1, inline expansions: 5 (132 bytes) */

// <06347C58> raytrace/raytrace.cpp:325
// variable: 1
// function calls: 27
void RayTracingEnvironment::AddTriangle(int32 id, TraceVertex_t* v1, TraceVertex_t* v2, TraceVertex_t* v3, uint16 flags, uint64 materialIndex)
{
	int i; // 327
	CUtlMemory<TraceVertex_t::NumAllocated(); // 1196
	CUtlMemory<TraceVertex_t::operator[](
			int i);  // 602
	CUtlVectorBase<TraceVertex_t::Element(
		int i);  // 1201
	CopyConstruct<TraceVertex_t*>(TraceVertex_t** pMemory,
					TraceVertex_t* const& src);  // 1201
	CUtlMemory<TraceVertex_t::Base(); // 112
	CUtlVectorBase<TraceVertex_t::Base(); // 368
	CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 824
	CUtlVectorBase<TraceVertex_t::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<TraceVertex_t::AddToTail(
			TraceVertex_t* const& src);  // 329
	CUtlMemory<TraceVertex_t::NumAllocated(); // 1196
	CUtlMemory<TraceVertex_t::operator[](
			int i);  // 602
	CUtlVectorBase<TraceVertex_t::Element(
		int i);  // 1201
	CopyConstruct<TraceVertex_t*>(TraceVertex_t** pMemory,
					TraceVertex_t* const& src);  // 1201
	CUtlMemory<TraceVertex_t::Base(); // 112
	CUtlVectorBase<TraceVertex_t::Base(); // 368
	CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 824
	CUtlVectorBase<TraceVertex_t::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<TraceVertex_t::AddToTail(
			TraceVertex_t* const& src);  // 330
	CUtlMemory<TraceVertex_t::NumAllocated(); // 1196
	CUtlMemory<TraceVertex_t::operator[](
			int i);  // 602
	CUtlVectorBase<TraceVertex_t::Element(
		int i);  // 1201
	CopyConstruct<TraceVertex_t*>(TraceVertex_t** pMemory,
					TraceVertex_t* const& src);  // 1201
	CUtlMemory<TraceVertex_t::Base(); // 112
	CUtlVectorBase<TraceVertex_t::Base(); // 368
	CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 824
	CUtlVectorBase<TraceVertex_t::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<TraceVertex_t::AddToTail(
			TraceVertex_t* const& src);  // 331
} /* size: 0, variables: 1, inline expansions: 27 (0 bytes) */

// <06398D87> raytrace/raytrace.cpp:337
void RayTracingEnvironment::AddTriangle(int32 id, const Vector& v1, const Vector& v2, const Vector& v3, const Vector& color)
{
} /* size: 0 */

// <06346961> raytrace/raytrace.cpp:344
// variables: 2
// function calls: 80
void RayTracingEnvironment::AddTriangle(int32 id, const Vector& v1, const Vector& v2, const Vector& v3, const Vector& color, uint16 flags, uint64 materialIndex)
{
	CacheOptimizedTriangle_t tmptri; // 348
	int nTriangle; // 354
	Vector::operator=(
			const Vector& vOther);  // 350
	Vector::operator=(
			const Vector& vOther);  // 351
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::NumElementsInBlock(); // 227
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::NumAllocated(); // 1196
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::MajorIndex(
			int i);  // 243
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::IsIdxValid(
			int i);  // 191
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::MajorIndex(
			int i);  // 192
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::MinorIndex(
			int i);  // 193
	{
	}
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::Element(
		int i);  // 1201
	CopyConstruct<CacheOptimizedTriangle_t>(CacheOptimizedTriangle_t* pMemory,
						const CacheOptimizedTriangle_t& src);  // 1201
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::Grow(
		int num);  // 247
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::Grow(
		int num);  // 806
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::AddToTail(
			const CacheOptimizedTriangle_t& src);  // 354
	Vector::operator=(
			const Vector& vOther);  // 352
	CUtlMemory<Vector, int>::NumAllocated(); // 1196
	CUtlMemory<Vector, int>::operator[](
			int i);  // 602
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
		int i);  // 1201
	CopyConstruct<Vector>(Vector* pMemory,
				const Vector& src);  // 1201
	CUtlMemory<Vector, int>::Base(); // 112
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 368
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddToTail(
			const Vector& src);  // 358
	CUtlMemory<long long unsigned int, int>::NumAllocated(); // 1196
	CUtlMemory<long long unsigned int, int>::operator[](
			int i);  // 602
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Element(
		int i);  // 1201
	CopyConstruct<long long unsigned int>(long long unsigned int* pMemory,
						const long long unsigned int& src);  // 1201
	CUtlMemory<long long unsigned int, int>::Base(); // 112
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Base(); // 368
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::AddToTail(
			const long long unsigned int& src);  // 363
	CUtlBlockMemory<Vector2D, int>::NumElementsInBlock(); // 227
	CUtlBlockMemory<Vector2D, int>::NumAllocated(); // 1196
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 243
	CUtlBlockMemory<Vector2D, int>::IsIdxValid(
			int i);  // 191
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 192
	CUtlBlockMemory<Vector2D, int>::MinorIndex(
			int i);  // 193
	{
	}
	CUtlBlockMemory<Vector2D, int>::operator[](
			int i);  // 602
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::Element(
		int i);  // 1201
	Vector2D::Vector2D(
		const Vector2D& vOther);  // 1520
	CopyConstruct<Vector2D>(Vector2D* pMemory,
				const Vector2D& src);  // 1201
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 247
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 806
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::AddToTail(
			const Vector2D& src);  // 368
	CUtlBlockMemory<Vector2D, int>::NumElementsInBlock(); // 227
	CUtlBlockMemory<Vector2D, int>::NumAllocated(); // 1196
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 243
	CUtlBlockMemory<Vector2D, int>::IsIdxValid(
			int i);  // 191
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 192
	CUtlBlockMemory<Vector2D, int>::MinorIndex(
			int i);  // 193
	{
	}
	CUtlBlockMemory<Vector2D, int>::operator[](
			int i);  // 602
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::Element(
		int i);  // 1201
	Vector2D::Vector2D(
		const Vector2D& vOther);  // 1520
	CopyConstruct<Vector2D>(Vector2D* pMemory,
				const Vector2D& src);  // 1201
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 247
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 806
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::AddToTail(
			const Vector2D& src);  // 369
	CUtlBlockMemory<Vector2D, int>::NumElementsInBlock(); // 227
	CUtlBlockMemory<Vector2D, int>::NumAllocated(); // 1196
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 243
	CUtlBlockMemory<Vector2D, int>::IsIdxValid(
			int i);  // 191
	CUtlBlockMemory<Vector2D, int>::MajorIndex(
			int i);  // 192
	CUtlBlockMemory<Vector2D, int>::MinorIndex(
			int i);  // 193
	{
	}
	CUtlBlockMemory<Vector2D, int>::operator[](
			int i);  // 602
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::Element(
		int i);  // 1201
	Vector2D::Vector2D(
		const Vector2D& vOther);  // 1520
	CopyConstruct<Vector2D>(Vector2D* pMemory,
				const Vector2D& src);  // 1201
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 247
	CUtlBlockMemory<Vector2D, int>::Grow(
		int num);  // 806
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::AddToTail(
			const Vector2D& src);  // 370
} /* size: 0, variables: 2, inline expansions: 80 (0 bytes) */

// <0634632C> raytrace/raytrace.cpp:379
// function calls: 22
void RayTracingEnvironment::SetTexcoord0(int index, const Vector2D& t1, const Vector2D& t2, const Vector2D& t3)
{
	{
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 243
		CUtlBlockMemory<Vector2D, int>::IsIdxValid(
				int i);  // 191
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 192
		CUtlBlockMemory<Vector2D, int>::MinorIndex(
				int i);  // 193
		{
		}
		CUtlBlockMemory<Vector2D, int>::operator[](
				int i);  // 588
		CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::operator[](
				int i);  // 383
		Vector2D::operator=(
				const Vector2D& vOther);  // 383
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 243
		CUtlBlockMemory<Vector2D, int>::IsIdxValid(
				int i);  // 191
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 192
		CUtlBlockMemory<Vector2D, int>::MinorIndex(
				int i);  // 193
		{
		}
		CUtlBlockMemory<Vector2D, int>::operator[](
				int i);  // 588
		CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::operator[](
				int i);  // 384
		Vector2D::operator=(
				const Vector2D& vOther);  // 384
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 243
		CUtlBlockMemory<Vector2D, int>::IsIdxValid(
				int i);  // 191
		CUtlBlockMemory<Vector2D, int>::MajorIndex(
				int i);  // 192
		CUtlBlockMemory<Vector2D, int>::MinorIndex(
				int i);  // 193
		{
		}
		CUtlBlockMemory<Vector2D, int>::operator[](
				int i);  // 588
		CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::operator[](
				int i);  // 385
		Vector2D::operator=(
				const Vector2D& vOther);  // 385
		_DebuggerBreakInlineExpressionWrapper(void); // 381
	}
} /* size: 0 */

// <06398E31> raytrace/raytrace.cpp:389
// variable: 1
// function calls: 2
void RayTracingEnvironment::AddQuad(int32 id, const Vector& v1, const Vector& v2, const Vector& v3, const Vector& v4, const Vector& color)
{
	int nFirstTriangle; // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <063462B9> raytrace/raytrace.cpp:389
// variable: 1
void RayTracingEnvironment::AddQuad(int32 id, const Vector& v1, const Vector& v2, const Vector& v3, const Vector& v4, const Vector& color)
{
	int nFirstTriangle; // 394
} /* size: 0, variables: 1 */

// <06344FEC> raytrace/raytrace.cpp:400
// function calls: 42
void RayTracingEnvironment::AddAxisAlignedRectangularSolid(int id, Vector minc, Vector maxc, const Vector& color)
{
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 405
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 408
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 407
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 407
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 406
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 413
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 410
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 412
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 412
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 411
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 420
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 416
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 418
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 419
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 417
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 426
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 422
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 425
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 424
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 423
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 433
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 429
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 432
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 431
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 430
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 439
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 394
	RayTracingEnvironment::AddTriangle(
			int32 id,
			const Vector& v1,
			const Vector& v2,
			const Vector& v3,
			const Vector& color);  // 395
	RayTracingEnvironment::AddQuad(
		int32 id,
		const Vector& v1,
		const Vector& v2,
		const Vector& v3,
		const Vector& v4,
		const Vector& color);  // 435
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 438
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 437
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 436
} /* size: 0, inline expansions: 42 (0 bytes) */

// <06344D85> raytrace/raytrace.cpp:444
// variables: 4
// function calls: 7
Vector GetEdgeEquation(Vector vVertex1, Vector vVertex2, int nAxisIndex0, int nAxisIndex1, Vector vPointInsideEdge)
{
	float flNx; // 446
	float flNy; // 447
	float flD; // 448
	float flTrialDistance; // 453
	Vector::operator[](
			int i);  // 446
	Vector::operator[](
			int i);  // 447
	Vector::operator[](
			int i);  // 446
	Vector::operator[](
			int i);  // 447
	Vector::operator[](
			int i);  // 453
	Vector::operator[](
			int i);  // 453
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 465
} /* size: 172, variables: 4, inline expansions: 7 (6 bytes) */

// <06344940> raytrace/raytrace.cpp:468
// variables: 13
// function calls: 13
void CacheOptimizedTriangle_t::ChangeIntoIntersectionFormat()
{
	TriGeometryData_t srcTri; // 473
	Vector p1; // 478
	Vector p2; // 479
	Vector p3; // 480
	Vector e1; // 482
	Vector e2; // 483
	Vector N; // 485
	int drop_axis; // 488
	int nCoordSelect0; // 499
	int nCoordSelect1; // 500
	Vector edge1; // 506
	Vector edge2; // 511
	{
		int c; // 489
		Vector::operator[](
				int i);  // 490
	}
	VectorSubtract(const Vector& a,
			const Vector& b,
			Vector& c);  // 1444
	Vector::Vector(); // 1443
	Vector::operator-(
			const Vector& v);  // 483
	VectorSubtract(const Vector& a,
			const Vector& b,
			Vector& c);  // 1444
	Vector::Vector(); // 1443
	Vector::operator-(
			const Vector& v);  // 482
	CrossProduct(const Vector& a,
			const Vector& b,
			Vector& result);  // 1488
	Vector::Vector(); // 1487
	Vector::Cross(
		const Vector& vOther);  // 485
	Vector::NormalizeInPlace(); // 486
	DotProduct(const Vector& a,
			const Vector& b);  // 1167
	Vector::Dot(
		const Vector& vOther);  // 493
} /* size: 584, variables: 12, inline expansions: 12 (245 bytes) */

// <0627E373> raytrace/raytrace.cpp:546
// member variables: 3
// struct size: 48
struct NodeToVisit {
	const class CacheOptimizedKDNode_t * m_pNode; /* 0 8 */
	fltx4 m_fl4TMin; /* 16 16 */
	fltx4 m_fl4TMax; /* 32 16 */
};

// <063760CC> raytrace/raytrace.cpp:557
// variables: 133
// function calls: 286
void TraceAgainstChildren<CFilterNone, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap, CFilterNone filter)
{
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
	}
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
		{
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				FourVectors::FourVectors(); // 435
				RayTracingResult_t::RayTracingResult_t(); // 606
				RayTracingResult_t::SetInstanceEnv(
						const InstancedRayTracingEnvironmentReference_t* pInstance);  // 608
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				RayTracingResult_t::HasAnyIntersections(); // 623
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 515
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 514
				{
					fltx4 retVal; // 767
					_mm_andnot_ps(__m128 __A,
							__m128 __B);  // 768
				}
				AndNotSIMD<>(const fltx4& a,
						const fltx4& b);  // 513
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 512
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 512
				{
					fltx4 retVal; // 875
					_mm_or_ps(__m128 __A,
							__m128 __B);  // 876
				}
				OrSIMD<>(const fltx4& a,
					const fltx4& b);  // 511
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 516
				{
					fltx4 fl4OldIndex; // 523
					fltx4 fl4NewIndex; // 524
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 519
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 520
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 525
					_mm_store_ps(float* __P,
							__m128 __A);  // 273
					StoreAlignedSIMD<>(float* pSIMD,
								const fltx4& a);  // 525
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 521
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 212
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 213
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 214
					FourVectors::MaskedAssign(
							FLTX4 fl4Writemask,
							const FourVectors& v4NewValues);  // 522
					{
						int i; // 531
					}
				}
				RayTracingResult_t::MergeInResult(
						const RayTracingResult_t& other);  // 628
			}
		}
	}
} /* size: 0, variables: 4, inline expansions: 17 (0 bytes) */

// <0630AA90> raytrace/raytrace.cpp:557
// variables: 106
// function calls: 293
void TraceAgainstChildren<CFilterTags, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterTags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					int i; // 694
					CUtlMemory<RayTracingResult_t, int>::Base(); // 112
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
							int num);  // 1198
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
						int i);  // 1201
					FourVectors::FourVectors(
							const FourVectors& src);  // 435
					RayTracingResult_t::RayTracingResult_t(
								const RayTracingResult_t  &);  // 1520
					CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
										const RayTracingResult_t& src);  // 1201
					CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
							const RayTracingResult_t& src);  // 696
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 694
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 595
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 696
				}
				RayTracingResultMulti_t::MergeInResult(
						const RayTracingResultMulti_t& other);  // 628
				CUtlMemory<RayTracingResult_t, int>::CUtlMemory(
						RayTracingResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, RayTracingResult_t>::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<8, RayTracingSingleResult_t>::AlignedByteArray_t(); // 228
				CUtlMemory<RayTracingSingleResult_t, int>::CUtlMemory(
						RayTracingSingleResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingSingleResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingSingleResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				RayTracingResultMulti_t::RayTracingResultMulti_t(); // 606
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CFilterTags::ShouldSkip(
						const InstancedRayTracingEnvironmentReference_t* instance);  // 603
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 687
				RayTracingResultMulti_t::HasAnyIntersections(); // 623
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 1798
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 577
				CUtlMemory<RayTracingSingleResult_t, int>::ConvertToExternalMemory(
							RayTracingSingleResult_t* pMemory,
							int numElements,
							int nCopyElements,
							bool bSetGrowable,
							uint32 nGrowable_GrowSize);  // 207
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingSingleResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Base(); // 368
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Purge(); // 560
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingSingleResult_t>(void); // 508
				CUtlMemory<RayTracingSingleResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::~CUtlVectorFixedGrowable(); // 650
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 237
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::Purge(
					int numElements);  // 1799
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::RemoveAll(); // 1798
				CUtlMemory<RayTracingResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Purge(); // 560
				CUtlMemory<RayTracingResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingResult_t>(void); // 508
				CUtlMemory<RayTracingResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::~CUtlVectorFixedGrowable(); // 650
				RayTracingResultMulti_t::~RayTracingResultMulti_t(); // 599
				{
					int i; // 740
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 740
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 588
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 742
				}
				RayTracingResultMulti_t::TransformFromModelSpaceToWorldSpace(
									const FourRays& origRays,
									const FourRays& transformedRays,
									const matrix3x4a_t& matModelToWorld);  // 625
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	CFilterTags::ShouldSkip(
			const RayTracingEnvironment* pRayTracingEnvironment);  // 565
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 2495, variables: 5, inline expansions: 18 (249 bytes) */

// <063061AF> raytrace/raytrace.cpp:557
// variables: 136
// function calls: 288
void TraceAgainstChildren<CFilterTags, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, CFilterTags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CFilterTags::ShouldSkip(
						const InstancedRayTracingEnvironmentReference_t* instance);  // 603
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				FourVectors::FourVectors(); // 435
				RayTracingResult_t::RayTracingResult_t(); // 606
				RayTracingResult_t::SetInstanceEnv(
						const InstancedRayTracingEnvironmentReference_t* pInstance);  // 608
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				RayTracingResult_t::HasAnyIntersections(); // 623
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 515
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 514
				{
					fltx4 retVal; // 767
					_mm_andnot_ps(__m128 __A,
							__m128 __B);  // 768
				}
				AndNotSIMD<>(const fltx4& a,
						const fltx4& b);  // 513
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 512
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 512
				{
					fltx4 retVal; // 875
					_mm_or_ps(__m128 __A,
							__m128 __B);  // 876
				}
				OrSIMD<>(const fltx4& a,
					const fltx4& b);  // 511
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 516
				{
					fltx4 fl4OldIndex; // 523
					fltx4 fl4NewIndex; // 524
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 519
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 520
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 525
					_mm_store_ps(float* __P,
							__m128 __A);  // 273
					StoreAlignedSIMD<>(float* pSIMD,
								const fltx4& a);  // 525
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 521
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 212
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 213
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 214
					FourVectors::MaskedAssign(
							FLTX4 fl4Writemask,
							const FourVectors& v4NewValues);  // 522
					{
						int i; // 531
					}
				}
				RayTracingResult_t::MergeInResult(
						const RayTracingResult_t& other);  // 628
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	CFilterTags::ShouldSkip(
			const RayTracingEnvironment* pRayTracingEnvironment);  // 565
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 1983, variables: 5, inline expansions: 18 (237 bytes) */

// <0630196E> raytrace/raytrace.cpp:557
// variables: 136
// function calls: 287
void TraceAgainstChildren<CFilterSkipFlags, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, CFilterSkipFlags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				FourVectors::FourVectors(); // 435
				RayTracingResult_t::RayTracingResult_t(); // 606
				RayTracingResult_t::SetInstanceEnv(
						const InstancedRayTracingEnvironmentReference_t* pInstance);  // 608
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				RayTracingResult_t::HasAnyIntersections(); // 623
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 515
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 514
				{
					fltx4 retVal; // 767
					_mm_andnot_ps(__m128 __A,
							__m128 __B);  // 768
				}
				AndNotSIMD<>(const fltx4& a,
						const fltx4& b);  // 513
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 512
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 512
				{
					fltx4 retVal; // 875
					_mm_or_ps(__m128 __A,
							__m128 __B);  // 876
				}
				OrSIMD<>(const fltx4& a,
					const fltx4& b);  // 511
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 516
				{
					fltx4 fl4OldIndex; // 523
					fltx4 fl4NewIndex; // 524
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 519
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 520
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 525
					_mm_store_ps(float* __P,
							__m128 __A);  // 273
					StoreAlignedSIMD<>(float* pSIMD,
								const fltx4& a);  // 525
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 521
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 212
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 213
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 214
					FourVectors::MaskedAssign(
							FLTX4 fl4Writemask,
							const FourVectors& v4NewValues);  // 522
					{
						int i; // 531
					}
				}
				RayTracingResult_t::MergeInResult(
						const RayTracingResult_t& other);  // 628
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	CFilterSkipFlags::ShouldSkip(
			const RayTracingEnvironment* pRayTracingEnvironment);  // 565
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 18 (0 bytes) */

// <062FD4D2> raytrace/raytrace.cpp:557
// variables: 106
// function calls: 292
void TraceAgainstChildren<CFilterSkipFlags, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterSkipFlags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					int i; // 694
					CUtlMemory<RayTracingResult_t, int>::Base(); // 112
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
							int num);  // 1198
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
						int i);  // 1201
					FourVectors::FourVectors(
							const FourVectors& src);  // 435
					RayTracingResult_t::RayTracingResult_t(
								const RayTracingResult_t  &);  // 1520
					CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
										const RayTracingResult_t& src);  // 1201
					CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
							const RayTracingResult_t& src);  // 696
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 694
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 595
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 696
				}
				RayTracingResultMulti_t::MergeInResult(
						const RayTracingResultMulti_t& other);  // 628
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CUtlMemory<RayTracingResult_t, int>::CUtlMemory(
						RayTracingResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, RayTracingResult_t>::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<8, RayTracingSingleResult_t>::AlignedByteArray_t(); // 228
				CUtlMemory<RayTracingSingleResult_t, int>::CUtlMemory(
						RayTracingSingleResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingSingleResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingSingleResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				RayTracingResultMulti_t::RayTracingResultMulti_t(); // 606
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 687
				RayTracingResultMulti_t::HasAnyIntersections(); // 623
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 1798
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 577
				CUtlMemory<RayTracingSingleResult_t, int>::ConvertToExternalMemory(
							RayTracingSingleResult_t* pMemory,
							int numElements,
							int nCopyElements,
							bool bSetGrowable,
							uint32 nGrowable_GrowSize);  // 207
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingSingleResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Base(); // 368
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Purge(); // 560
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingSingleResult_t>(void); // 508
				CUtlMemory<RayTracingSingleResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::~CUtlVectorFixedGrowable(); // 650
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::RemoveAll(); // 1798
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 237
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Purge(); // 560
				CUtlMemory<RayTracingResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingResult_t>(void); // 508
				CUtlMemory<RayTracingResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::~CUtlVectorFixedGrowable(); // 650
				RayTracingResultMulti_t::~RayTracingResultMulti_t(); // 599
				{
					int i; // 740
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 740
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 588
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 742
				}
				RayTracingResultMulti_t::TransformFromModelSpaceToWorldSpace(
									const FourRays& origRays,
									const FourRays& transformedRays,
									const matrix3x4a_t& matModelToWorld);  // 625
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	CFilterSkipFlags::ShouldSkip(
			const RayTracingEnvironment* pRayTracingEnvironment);  // 565
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 18 (0 bytes) */

// <062FD296> raytrace/raytrace.cpp:557
// variables: 16
void TraceAgainstChildren<CFilterNone, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, CFilterNone filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
			}
		}
	}
} /* size: 0, variables: 5 */

// <062FD05A> raytrace/raytrace.cpp:557
// variables: 16
void TraceAgainstChildren<CFilterNone, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterNone filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
			}
		}
	}
} /* size: 0, variables: 5 */

// <062F885B> raytrace/raytrace.cpp:557
// variables: 136
// function calls: 286
void TraceAgainstChildren<CFilterSkipID, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, CFilterSkipID filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				FourVectors::FourVectors(); // 435
				RayTracingResult_t::RayTracingResult_t(); // 606
				RayTracingResult_t::SetInstanceEnv(
						const InstancedRayTracingEnvironmentReference_t* pInstance);  // 608
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				RayTracingResult_t::HasAnyIntersections(); // 623
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 515
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 514
				{
					fltx4 retVal; // 767
					_mm_andnot_ps(__m128 __A,
							__m128 __B);  // 768
				}
				AndNotSIMD<>(const fltx4& a,
						const fltx4& b);  // 513
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 512
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 512
				{
					fltx4 retVal; // 875
					_mm_or_ps(__m128 __A,
							__m128 __B);  // 876
				}
				OrSIMD<>(const fltx4& a,
					const fltx4& b);  // 511
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 516
				{
					fltx4 fl4OldIndex; // 523
					fltx4 fl4NewIndex; // 524
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 519
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 520
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 525
					_mm_store_ps(float* __P,
							__m128 __A);  // 273
					StoreAlignedSIMD<>(float* pSIMD,
								const fltx4& a);  // 525
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 521
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 212
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 213
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 214
					FourVectors::MaskedAssign(
							FLTX4 fl4Writemask,
							const FourVectors& v4NewValues);  // 522
					{
						int i; // 531
					}
				}
				RayTracingResult_t::MergeInResult(
						const RayTracingResult_t& other);  // 628
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 17 (0 bytes) */

// <062F4401> raytrace/raytrace.cpp:557
// variables: 106
// function calls: 291
void TraceAgainstChildren<CFilterSkipID, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterSkipID filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					int i; // 694
					CUtlMemory<RayTracingResult_t, int>::Base(); // 112
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
							int num);  // 1198
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
						int i);  // 1201
					FourVectors::FourVectors(
							const FourVectors& src);  // 435
					RayTracingResult_t::RayTracingResult_t(
								const RayTracingResult_t  &);  // 1520
					CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
										const RayTracingResult_t& src);  // 1201
					CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
							const RayTracingResult_t& src);  // 696
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 694
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 595
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 696
				}
				RayTracingResultMulti_t::MergeInResult(
						const RayTracingResultMulti_t& other);  // 628
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CUtlMemory<RayTracingResult_t, int>::CUtlMemory(
						RayTracingResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, RayTracingResult_t>::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<8, RayTracingSingleResult_t>::AlignedByteArray_t(); // 228
				CUtlMemory<RayTracingSingleResult_t, int>::CUtlMemory(
						RayTracingSingleResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingSingleResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingSingleResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				RayTracingResultMulti_t::RayTracingResultMulti_t(); // 606
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 687
				RayTracingResultMulti_t::HasAnyIntersections(); // 623
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 1798
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 577
				CUtlMemory<RayTracingSingleResult_t, int>::ConvertToExternalMemory(
							RayTracingSingleResult_t* pMemory,
							int numElements,
							int nCopyElements,
							bool bSetGrowable,
							uint32 nGrowable_GrowSize);  // 207
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingSingleResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Base(); // 368
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Purge(); // 560
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingSingleResult_t>(void); // 508
				CUtlMemory<RayTracingSingleResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::~CUtlVectorFixedGrowable(); // 650
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::RemoveAll(); // 1798
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 237
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Purge(); // 560
				CUtlMemory<RayTracingResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingResult_t>(void); // 508
				CUtlMemory<RayTracingResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::~CUtlVectorFixedGrowable(); // 650
				RayTracingResultMulti_t::~RayTracingResultMulti_t(); // 599
				{
					int i; // 740
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 740
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 588
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 742
				}
				RayTracingResultMulti_t::TransformFromModelSpaceToWorldSpace(
									const FourRays& origRays,
									const FourRays& transformedRays,
									const matrix3x4a_t& matModelToWorld);  // 625
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 17 (0 bytes) */

// <062EFC02> raytrace/raytrace.cpp:557
// variables: 136
// function calls: 286
void TraceAgainstChildren<CFilterRequireFlags, RayTracingEnvironment::RayTracingResult_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResult_t* pResultOut, CFilterRequireFlags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResult_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				FourVectors::FourVectors(); // 435
				RayTracingResult_t::RayTracingResult_t(); // 606
				RayTracingResult_t::SetInstanceEnv(
						const InstancedRayTracingEnvironmentReference_t* pInstance);  // 608
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				RayTracingResult_t::HasAnyIntersections(); // 623
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 515
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 514
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 514
				{
					fltx4 retVal; // 767
					_mm_andnot_ps(__m128 __A,
							__m128 __B);  // 768
				}
				AndNotSIMD<>(const fltx4& a,
						const fltx4& b);  // 513
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 512
				{
					fltx4 retVal; // 1851
					_mm_cmpeq_ps(__m128 __A,
							__m128 __B);  // 1852
				}
				CmpEqSIMD<>(const fltx4& a,
						const fltx4& b);  // 512
				{
					fltx4 retVal; // 875
					_mm_or_ps(__m128 __A,
							__m128 __B);  // 876
				}
				OrSIMD<>(const fltx4& a,
					const fltx4& b);  // 511
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 516
				{
					fltx4 fl4OldIndex; // 523
					fltx4 fl4NewIndex; // 524
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 519
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 520
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 525
					_mm_store_ps(float* __P,
							__m128 __A);  // 273
					StoreAlignedSIMD<>(float* pSIMD,
								const fltx4& a);  // 525
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 521
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 212
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 213
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 214
					FourVectors::MaskedAssign(
							FLTX4 fl4Writemask,
							const FourVectors& v4NewValues);  // 522
					{
						int i; // 531
					}
				}
				RayTracingResult_t::MergeInResult(
						const RayTracingResult_t& other);  // 628
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 17 (0 bytes) */

// <062EB798> raytrace/raytrace.cpp:557
// variables: 106
// function calls: 291
void TraceAgainstChildren<CFilterRequireFlags, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterRequireFlags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 5128
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					int i; // 694
					CUtlMemory<RayTracingResult_t, int>::Base(); // 112
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
							int num);  // 1198
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
						int i);  // 1201
					FourVectors::FourVectors(
							const FourVectors& src);  // 435
					RayTracingResult_t::RayTracingResult_t(
								const RayTracingResult_t  &);  // 1520
					CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
										const RayTracingResult_t& src);  // 1201
					CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
							const RayTracingResult_t& src);  // 696
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 694
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 595
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 696
				}
				RayTracingResultMulti_t::MergeInResult(
						const RayTracingResultMulti_t& other);  // 628
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2409
				{
					fltx4 retVal; // 2369
					_mm_rsqrt_ps(__m128 __A); // 2370
				}
				ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2408
				ReciprocalSqrtSIMD<>(const fltx4& a); // 617
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CUtlMemory<RayTracingResult_t, int>::CUtlMemory(
						RayTracingResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, RayTracingResult_t>::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<8, RayTracingSingleResult_t>::AlignedByteArray_t(); // 228
				CUtlMemory<RayTracingSingleResult_t, int>::CUtlMemory(
						RayTracingSingleResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingSingleResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingSingleResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				RayTracingResultMulti_t::RayTracingResultMulti_t(); // 606
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 866
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 881
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 880
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 882
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 876
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 877
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 895
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 878
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 897
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 614
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 891
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 892
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 895
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 893
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 896
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 897
				FourVectors::TransformBy<matrix3x4a_t>(
								const matrix3x4a_t& matrix);  // 615
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 143
				FourVectors::ApplyBinaryUpdateFunction<SubSIMD<> >(
									const FourVectors& v4Arg);  // 143
				FourVectors::operator-=(
						const FourVectors& b);  // 616
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 167
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 166
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1684
				MaddSIMD<>(const fltx4& a,
						const fltx4& b,
						const fltx4& c);  // 168
				FourVectors::operator*(
						const FourVectors& b);  // 456
				FourVectors::length2(); // 617
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 153
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 155
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 154
				FourVectors::operator*=(
						const fltx4& scale);  // 618
				{
					fltx4 retVal; // 2418
					_mm_rcp_ps(__m128 __A); // 2419
				}
				ReciprocalEstSIMD<>(const fltx4& a); // 2462
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 2464
				ReciprocalSIMD<>(const fltx4& a); // 619
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 687
				RayTracingResultMulti_t::HasAnyIntersections(); // 623
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::RemoveAll(); // 1798
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 577
				CUtlMemory<RayTracingSingleResult_t, int>::ConvertToExternalMemory(
							RayTracingSingleResult_t* pMemory,
							int numElements,
							int nCopyElements,
							bool bSetGrowable,
							uint32 nGrowable_GrowSize);  // 207
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::Purge_FixedGrowable(
							RayTracingSingleResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingSingleResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Base(); // 368
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::Purge(); // 560
				CUtlMemory<RayTracingSingleResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingSingleResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingSingleResult_t>(void); // 508
				CUtlMemory<RayTracingSingleResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::~CUtlVectorFixedGrowable(); // 650
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::RemoveAll(); // 1798
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::Purge_FixedGrowable(
							RayTracingResult_t* pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 237
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::Purge(
					int numElements);  // 1799
				CUtlMemory<RayTracingResult_t, int>::Base(); // 112
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 1800
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Purge(); // 560
				CUtlMemory<RayTracingResult_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 903
				CUtlMemory<RayTracingResult_t, int>::Purge(); // 510
				ValidateAlignment<RayTracingResult_t>(void); // 508
				CUtlMemory<RayTracingResult_t, int>::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::~CUtlVectorFixedGrowable(); // 650
				RayTracingResultMulti_t::~RayTracingResultMulti_t(); // 599
				{
					int i; // 740
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 740
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 588
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 742
				}
				RayTracingResultMulti_t::TransformFromModelSpaceToWorldSpace(
									const FourRays& origRays,
									const FourRays& transformedRays,
									const matrix3x4a_t& matModelToWorld);  // 625
			}
		}
		IsValidIndex(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 583
		CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::operator[](
				int i);  // 595
		operator[](const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this,
				int i);  // 586
	}
	FourVectors::FourVectors(); // 568
	FourVectors::FourVectors(); // 568
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 179
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1851
		_mm_cmpeq_ps(__m128 __A,
				__m128 __B);  // 1852
	}
	CmpEqSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 175
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 176
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 180
	{
		fltx4 retVal; // 767
		_mm_andnot_ps(__m128 __A,
				__m128 __B);  // 768
	}
	AndNotSIMD<>(const fltx4& a,
			const fltx4& b);  // 177
	{
		fltx4 retVal; // 1662
		_mm_div_ps(__m128 __A,
				__m128 __B);  // 1663
	}
	DivSIMD<>(const fltx4& a,
			const fltx4& b);  // 181
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 183
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 184
	{
		fltx4 retVal; // 2039
		_mm_cmpge_ps(__m128 __A,
				__m128 __B);  // 2040
	}
	CmpGeSIMD<>(const fltx4& a,
			const fltx4& b);  // 185
	ComputeInvAndSignSelect(FourVectors* pDirSignSelect,
				FourVectors* pInvDir,
				const FourVectors& vRayDir);  // 569
	Count(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 135
	IsEmpty(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, i this); // 574
} /* size: 0, variables: 5, inline expansions: 17 (0 bytes) */

// <02F2F5A5> raytrace/raytrace.cpp:557
// variables: 106
// function calls: 293
void TraceAgainstChildren<CFilterTags, RayTracingEnvironment::RayTracingResultMulti_t>(const FourRays& rays, fltx4 TMin, fltx4 TMax, RayTracingResultMulti_t* pResultOut, CFilterTags filter, ITransparentTriangleCallback* pCallback, RTECullMode_t cullMode, const CRaytraceMaterialRemapTable* pMaterialRemap)
{
	const char   __FUNCTION__; // 11794
	FourVectors vInvDir; // 568
	FourVectors vSignSelect; // 568
	int pNodesToVisit; // 571
	int nNodesToVisit; // 572
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 563
	}
	{
		int nNodeIdx; // 581
		const InstancedRayTracingEnvironmentBVHNode_t& node; // 586
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 593
		}
		{
			int i; // 599
			{
				InstancedRayTracingEnvironmentReference_t* pChild; // 601
				RayTracingResultMulti_t instancedResults; // 606
				FourRays transformedRay; // 612
				fltx4 fl4InvLength; // 617
				fltx4 fl4TMinNew; // 619
				fltx4 fl4TMaxNew; // 620
				{
					int i; // 694
					CUtlMemory<RayTracingResult_t, int>::Base(); // 112
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Base(); // 368
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::GrowMemory(
							int num);  // 1198
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Element(
						int i);  // 1201
					FourVectors::FourVectors(
							const FourVectors& src);  // 435
					RayTracingResult_t::RayTracingResult_t(
								const RayTracingResult_t  &);  // 1520
					CopyConstruct<RayTracingResult_t>(RayTracingResult_t* pMemory,
										const RayTracingResult_t& src);  // 1201
					CUtlMemory<RayTracingResult_t, int>::NumAllocated(); // 1196
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::AddToTail(
							const RayTracingResult_t& src);  // 696
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::Count(); // 694
					CUtlMemory<RayTracingResult_t, int>::operator[](
							int i);  // 595
					CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::operator[](
							int i);  // 696
				}
				RayTracingResultMulti_t::MergeInResult(
						const RayTracingResultMulti_t& other);  // 628
				CUtlMemory<RayTracingResult_t, int>::CUtlMemory(
						RayTracingResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, RayTracingResult_t>::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, RayTracingResult_t, 16>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingResult_t, CUtlMemoryFixedGrowable<RayTracingResult_t, 32, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingResult_t, 32>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<8, RayTracingSingleResult_t>::AlignedByteArray_t(); // 228
				CUtlMemory<RayTracingSingleResult_t, int>::CUtlMemory(
						RayTracingSingleResult_t* pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<RayTracingSingleResult_t, int>::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<RayTracingSingleResult_t, int>::CUtlMemoryFixedGrowable_Base(
								RayTracingSingleResult_t* pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<8, RayTracingSingleResult_t, 8>::Base(); // 231
				CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int>::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::ResetDbgInfo(); // 530
				CUtlVectorBase<RayTracingSingleResult_t, CUtlMemoryFixedGrowable<RayTracingSingleResult_t, 8, int> >::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<RayTracingSingleResult_t, 8>::CUtlVectorFixedGrowable(
							int growSize);  // 650
				RayTracingResultMulti_t::RayTracingResultMulti_t(); // 606
				CUtlMemory<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 595
				CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::operator[](
						int i);  // 601
				CFilterTags::ShouldSkip(
						const InstancedRayTracingEnvironmentReference_t* instance);  // 603
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Count(); // 135
				CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::IsEmpty(); // 333
				CRaytraceMaterialRemapTable::IsEmpty(); // 610
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourVectors::FourVectors(
						const FourVectors& src);  // 24
				FourRays::FourRays(
					const FourRays  &);  // 612
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
									const FourVectors& v4Arg);  // 129
				FourVectors::operator+=(
						const FourVectors& b);  // 613
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 867
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 884
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 885
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 886
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 865
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 891
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
