
//
// kv3lib/kv3formats_animgraph.cpp
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   liblocalize.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//
//	functions: 24
//	class: 1
//

// <057A5653> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 61637
		const KV3ID_t* __for_begin; // 677
		const KV3ID_t* __for_end; // 677
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <02AE5D60> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 50887
		const KV3ID_t* __for_begin; // 55463
		const KV3ID_t* __for_end; // 55463
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <013EDD30> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 24149
		const KV3ID_t* __for_begin; // 28725
		const KV3ID_t* __for_end; // 28725
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <004694F5> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 10316
		const KV3ID_t* __for_begin; // 14892
		const KV3ID_t* __for_end; // 14892
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <007E99A2> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 16505
		const KV3ID_t* __for_begin; // 21081
		const KV3ID_t* __for_end; // 21081
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <00BC1629> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 22656
		const KV3ID_t* __for_begin; // 27232
		const KV3ID_t* __for_end; // 27232
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <002B2EFF> kv3lib/kv3formats_animgraph.cpp:20
// variables: 5
// function calls: 7
bool IsAnimGraphFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 22
	{
		const KV3ID_t& f; // 29
		const KV3ID_t& __for_range; // 34950
		const KV3ID_t* __for_begin; // 39526
		const KV3ID_t* __for_end; // 39526
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 31
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 27
} /* size: 284, variables: 1, inline expansions: 3 (87 bytes) */

// <0579BBBA> kv3lib/kv3formats_animgraph.cpp:40
// member functions: 2
// class size: 1
class CCheck_IsAnimGraphFormat {
	/* kv3lib/kv3formats_animgraph.cpp:43 */
	void CCheck_IsAnimGraphFormat(CCheck_IsAnimGraphFormat* );
	void CCheck_IsAnimGraphFormat(class CCheck_IsAnimGraphFormat *); /* linkage=_ZN24CCheck_IsAnimGraphFormatC4Ev */
};

// <057A5634> kv3lib/kv3formats_animgraph.cpp:43
void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	{
		{
		}
	}
} /* size: 0 */

// <057A55F2> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 58770
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <02AE5CFF> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 48020
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <013EDCCF> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 21282
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <00469494> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 7449
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <007E9941> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 13638
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <00BC15C8> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 19789
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <002B2E9E> kv3lib/kv3formats_animgraph.cpp:43
// variables: 2
inline void CCheck_IsAnimGraphFormat::CCheck_IsAnimGraphFormat()
{
	const char   __FUNCTION__; // 32083
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 45
	}
} /* size: 0, variables: 1 */

// <057A4891> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 60830
					iterator __for_begin; // 19462
					iterator __for_end; // 19462
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <02AE4F9E> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 50080
					iterator __for_begin; // 8712
					iterator __for_end; // 8712
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <013ECF6E> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 23342
					iterator __for_begin; // 47510
					iterator __for_end; // 47510
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <00468733> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 9509
					iterator __for_begin; // 33677
					iterator __for_end; // 33677
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <007E8BE0> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 15698
					iterator __for_begin; // 39866
					iterator __for_end; // 39866
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <00BC0867> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 21849
					iterator __for_begin; // 46017
					iterator __for_end; // 46017
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <002B213D> kv3lib/kv3formats_animgraph.cpp:50
// variables: 10
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_GENERIC_To_KV3_FORMAT_ANIMGRAPH0(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 52
		{
			KeyValues3* pNode; // 54
			{
				KeyValues3* pNewIkChainsArray; // 62
				KeyValues3* pOldIkChainsArray; // 63
				{
					KeyValues3* pChain; // 65
					CKV3ArrayIteratorView<false>& __for_range; // 34143
					iterator __for_begin; // 58311
					iterator __for_end; // 58311
					{
						CUtlString chainName; // 67
						KeyValues3* pNewAnimNodeChainData; // 71
						{
						}
						iterator::operator*(); // 65
						CUtlString::CUtlString(); // 67
						CUtlString::Get(); // 99
						CUtlString::String(); // 73
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 73
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 74
						CKV3MemberName::CKV3MemberName<22>(
									const char& str);  // 75
						CUtlString::~CUtlString(); // 76
					}
					{
						KeyValues3::Internal_Type(); // 90
						KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
						KeyValues3::GetType(); // 74
						KeyValues3::GetType(); // 74
					}
					{
					}
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 67
					CKV3ArrayIteratorView<false>::CKV3ArrayIteratorView(
								KV3Pointer_t pKV3);  // 921
					KeyValues3::IterateArray(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 396
					CKV3ArrayIteratorView<false>::begin(); // 65
					iterator::iterator(
						const KV3Pointer_t* pArrayElements,
						int nStartingIndex,
						int nArrayElementCount);  // 401
					CKV3ArrayIteratorView<false>::end(); // 65
					iterator::operator!=(
							const iterator& rhs);  // 65
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 63
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 63
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 79
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 82
	}
} /* size: 0 */

// <057A3E81> kv3lib/kv3formats_animgraph.cpp:138
// variables: 14
// function calls: 33
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_ANIMGRAPH0_To_KV3_FORMAT_ANIMGRAPH1(KV3FormatConversionContext_t& conversionCtx)
{
	unique_ptr<KeyValues3, std::default_delete<KeyValues3> > pNewMovementManager; // 140
	{
		CKeyValues3Iterator it; // 142
		{
			KeyValues3* pNode; // 144
			{
				KeyValues3* pMotorListContainer; // 156
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 155
				CKV3MemberName::CKV3MemberName<12>(
							const char& str);  // 156
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 158
				__uniq_ptr_impl<KeyValues3, std::default_delete<KeyValues3> >::reset(
					pointer __p);  // 511
				unique_ptr<KeyValues3, std::default_delete<KeyValues3> >::reset(
					pointer __p);  // 152
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 160
	}
	{
		KeyValues3* pMovementManager; // 164
		CKV3MemberName::CKV3MemberName<19>(
					const char& str);  // 164
	}
	{
		KeyValues3 *& __ptr; // 396
		__uniq_ptr_impl<KeyValues3, std::default_delete<KeyValues3> >::_M_ptr(); // 396
		unique_ptr<KeyValues3, std::default_delete<KeyValues3> >::get_deleter(); // 398
		default_delete<KeyValues3>::operator(
				KeyValues3* __ptr);  // 86
		default_delete<KeyValues3>::operator(
				KeyValues3* __ptr);  // 398
	}
	unique_ptr<KeyValues3, std::default_delete<KeyValues3> >::~unique_ptr(); // 169
} /* size: 593, variables: 1, inline expansions: 1 (21 bytes) */

// <0579D30B> kv3lib/kv3formats_animgraph.cpp:201
// variables: 183
// function calls: 287
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_ANIMGRAPH1_To_KV3_FORMAT_ANIMGRAPH2(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pNodeManager; // 203
	KeyValues3* pNodesContainer; // 205
	{
		KeyValues3* pNodes; // 207
		CKV3MemberName::CKV3MemberName(
				const CKV3MemberName& rhs);  // 96
		KeyValues3::FindMember(
				CKV3MemberName memberName,
				KeyValues3* pDefaultValue);  // 207
		CUtlStringToken::CUtlStringToken(
				const char& str);  // 13
		CKV3MemberName::CKV3MemberName<8>(
					const char& str);  // 207
	}
	{
		KeyValues3* pRootNodeID; // 213
		CKV3MemberName::CKV3MemberName<13>(
					const char& str);  // 213
		CKV3MemberName::CKV3MemberName(
				const CKV3MemberName& rhs);  // 96
		KeyValues3::FindMember(
				CKV3MemberName memberName,
				KeyValues3* pDefaultValue);  // 213
	}
	{
		CKeyValues3Iterator it; // 218
		{
			KeyValues3* pNode; // 220
			{
				KeyValues3* pNodeID; // 224
				{
					KeyValues3* pInputConnection; // 224
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 224
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 224
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 224
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 224
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					{
					}
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 224
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 224
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 224
			}
			{
				KeyValues3* pNodeID; // 228
				{
					KeyValues3* pInputConnection; // 228
					CKV3MemberName::CKV3MemberName<12>(
								const char& str);  // 228
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 228
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 228
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 228
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					{
					}
					KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 228
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 228
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 228
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 228
				}
				CKV3MemberName::CKV3MemberName<14>(
							const char& str);  // 228
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 228
			}
			{
				KeyValues3* pNodeID; // 229
				{
					KeyValues3* pInputConnection; // 229
					CKV3MemberName::CKV3MemberName<16>(
								const char& str);  // 229
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 229
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 229
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 229
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					{
					}
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 229
				}
				CKV3MemberName::CKV3MemberName<18>(
							const char& str);  // 229
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 229
			}
			{
				KeyValues3* pChildren; // 233
				{
					int i; // 233
					{
						KeyValues3* pChild; // 233
						{
							KeyValues3* pNodeID; // 233
							{
								KeyValues3* pInputConnection; // 233
								CKV3MemberName::CKV3MemberName<11>(
											const char& str);  // 233
								CKV3MemberName::CKV3MemberName<18>(
											const char& str);  // 233
								{
									const uint32  m; // 146
									uint32 h; // 147
									uint32 k; // 148
									const int  r; // 149
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<9>(
											const char& str);  // 233
								CKV3MemberName::CKV3MemberName(
										const CKV3MemberName& rhs);  // 96
								KeyValues3::FindMember(
										CKV3MemberName memberName,
										KeyValues3* pDefaultValue);  // 233
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 233
								KeyValues3::Internal_Type(); // 90
								KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
								KeyValues3::GetType(); // 696
								{
								}
								KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
								KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
								KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
								KeyValues3::GetValueUint64(); // 233
								{
									const uint32  m; // 61
									uint32 h; // 62
									uint32 k; // 63
									const int  r; // 64
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 233
								{
									const uint32  m; // 61
									uint32 h; // 62
									uint32 k; // 63
									const int  r; // 64
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 233
							}
							CUtlStringToken::CUtlStringToken(
									const char& str);  // 13
							CKV3MemberName::CKV3MemberName<9>(
										const char& str);  // 233
							CKV3MemberName::CKV3MemberName(
									const CKV3MemberName& rhs);  // 96
							KeyValues3::FindMember(
									CKV3MemberName memberName,
									KeyValues3* pDefaultValue);  // 233
						}
					}
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 233
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 233
			}
			{
				KeyValues3* pNodeID; // 237
				{
					KeyValues3* pInputConnection; // 237
					CKV3MemberName::CKV3MemberName<19>(
								const char& str);  // 237
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 237
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 237
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 237
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					{
					}
					KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 237
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 237
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 237
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 237
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 237
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 237
			}
			{
				KeyValues3* pNodeID; // 238
				{
					KeyValues3* pInputConnection; // 238
					{
					}
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 238
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 238
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 238
					CKV3MemberName::CKV3MemberName<19>(
								const char& str);  // 238
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 238
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 238
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 238
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 238
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 238
			}
			{
				KeyValues3* pNodeID; // 242
				{
					KeyValues3* pInputConnection; // 242
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 242
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 242
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 242
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 242
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					{
					}
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 242
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 242
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 242
			}
			{
				KeyValues3* pChildren; // 246
				{
					int i; // 246
					{
						KeyValues3* pChild; // 246
						{
							KeyValues3* pNodeID; // 246
							{
								KeyValues3* pInputConnection; // 246
								CKV3MemberName::CKV3MemberName<11>(
											const char& str);  // 246
								CKV3MemberName::CKV3MemberName<18>(
											const char& str);  // 246
								{
									const uint32  m; // 146
									uint32 h; // 147
									uint32 k; // 148
									const int  r; // 149
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<9>(
											const char& str);  // 246
								CKV3MemberName::CKV3MemberName(
										const CKV3MemberName& rhs);  // 96
								KeyValues3::FindMember(
										CKV3MemberName memberName,
										KeyValues3* pDefaultValue);  // 246
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 246
								KeyValues3::Internal_Type(); // 90
								KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
								KeyValues3::GetType(); // 696
								{
								}
								KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
								KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
								KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
								KeyValues3::GetValueUint64(); // 246
								{
									const uint32  m; // 61
									uint32 h; // 62
									uint32 k; // 63
									const int  r; // 64
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 246
								{
									const uint32  m; // 61
									uint32 h; // 62
									uint32 k; // 63
									const int  r; // 64
								}
								CUtlStringToken::CUtlStringToken(
										const char& str);  // 13
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 246
							}
							CUtlStringToken::CUtlStringToken(
									const char& str);  // 13
							CKV3MemberName::CKV3MemberName<9>(
										const char& str);  // 246
							CKV3MemberName::CKV3MemberName(
									const CKV3MemberName& rhs);  // 96
							KeyValues3::FindMember(
									CKV3MemberName memberName,
									KeyValues3* pDefaultValue);  // 246
						}
					}
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 246
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 246
			}
			{
				KeyValues3* pNodeID; // 250
				{
					KeyValues3* pInputConnection; // 250
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 250
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 250
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 250
					{
					}
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 250
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 250
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 250
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 250
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 250
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 250
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 250
			}
			{
				KeyValues3* pNodeID; // 254
				{
					KeyValues3* pInputConnection; // 254
					{
					}
					KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
					KeyValues3::Internal_Type(); // 90
					KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
					KeyValues3::GetType(); // 696
					KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
					KeyValues3::GetValueUint64(); // 254
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 254
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 254
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 254
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 254
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 254
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 254
			}
			{
				KeyValues3* pNodeID; // 258
				{
					KeyValues3* pInputConnection; // 258
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 258
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 258
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 258
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 258
					KeyValues3::GetValueUint64(); // 258
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 258
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 258
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 258
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 258
			}
			{
				KeyValues3* pNodeID; // 262
				{
					KeyValues3* pInputConnection; // 262
				}
			}
			{
				KeyValues3* pNodeID; // 266
				{
					KeyValues3* pInputConnection; // 266
				}
			}
			{
				KeyValues3* pNodeID; // 270
				{
					KeyValues3* pInputConnection; // 270
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 270
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 270
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 270
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 270
					KeyValues3::GetValueUint64(); // 270
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 270
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 96
				KeyValues3::FindMember(
						CKV3MemberName memberName,
						KeyValues3* pDefaultValue);  // 270
			}
			{
				KeyValues3* pNodeID; // 274
				{
					KeyValues3* pInputConnection; // 274
				}
			}
			{
				KeyValues3* pNodeID; // 278
				{
					KeyValues3* pInputConnection; // 278
				}
			}
			{
				KeyValues3* pNodeID; // 282
				{
					KeyValues3* pInputConnection; // 282
				}
			}
			{
				KeyValues3* pNodeID; // 286
				{
					KeyValues3* pInputConnection; // 286
				}
			}
			{
				KeyValues3* pNodeID; // 290
				{
					KeyValues3* pInputConnection; // 290
				}
			}
			{
				KeyValues3* pNodeID; // 294
				{
					KeyValues3* pInputConnection; // 294
				}
			}
			{
				KeyValues3* pNodeID; // 298
				{
					KeyValues3* pInputConnection; // 298
				}
			}
			{
				KeyValues3* pChildren; // 302
				{
					int i; // 304
					{
						KeyValues3* pChild; // 306
						{
							KeyValues3* pNodeID; // 308
							CKV3MemberName::CKV3MemberName<5>(
										const char& str);  // 308
							CKV3MemberName::CKV3MemberName<9>(
										const char& str);  // 310
							KeyValues3::GetValueUint64(); // 310
							CKV3MemberName::CKV3MemberName<5>(
										const char& str);  // 310
							CKV3MemberName::CKV3MemberName<11>(
										const char& str);  // 311
							CKV3MemberName::CKV3MemberName<5>(
										const char& str);  // 311
						}
					}
				}
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 302
			}
			{
				KeyValues3* pNodeID; // 320
				{
					KeyValues3* pInputConnection; // 320
				}
			}
			{
				KeyValues3* pNodeID; // 324
				{
					KeyValues3* pInputConnection; // 324
				}
			}
			{
				KeyValues3* pNodeID; // 328
				{
					KeyValues3* pInputConnection; // 328
				}
			}
			{
				KeyValues3* pNodeID; // 332
				{
					KeyValues3* pInputConnection; // 332
				}
			}
			{
				KeyValues3* pNodeID; // 336
				{
					KeyValues3* pInputConnection; // 336
				}
			}
			{
				KeyValues3* pNodeID; // 340
				{
					KeyValues3* pInputConnection; // 340
				}
			}
			{
				KeyValues3* pNodeID; // 344
				{
					KeyValues3* pInputConnection; // 344
					CKV3MemberName::CKV3MemberName<22>(
								const char& str);  // 344
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 344
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 344
					KeyValues3::GetValueUint64(); // 344
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 344
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 344
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 344
				}
				CKV3MemberName::CKV3MemberName<14>(
							const char& str);  // 344
			}
			{
				KeyValues3* pNodeID; // 345
				{
					KeyValues3* pInputConnection; // 345
					CKV3MemberName::CKV3MemberName<26>(
								const char& str);  // 345
				}
				CKV3MemberName::CKV3MemberName<18>(
							const char& str);  // 345
			}
			{
				KeyValues3* pNodeID; // 349
				{
					KeyValues3* pInputConnection; // 349
				}
			}
			{
				KeyValues3* pNodeID; // 353
				{
					KeyValues3* pInputConnection; // 353
					KeyValues3::GetValueUint64(); // 353
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 353
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 353
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 353
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 353
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 353
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 353
				}
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 353
			}
			{
				KeyValues3* pChildren; // 357
				{
					int i; // 357
					{
						KeyValues3* pChild; // 357
						{
							KeyValues3* pNodeID; // 357
							{
								KeyValues3* pInputConnection; // 357
								CKV3MemberName::CKV3MemberName<18>(
											const char& str);  // 357
								CKV3MemberName::CKV3MemberName<9>(
											const char& str);  // 357
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 357
								KeyValues3::GetValueUint64(); // 357
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 357
								CKV3MemberName::CKV3MemberName<11>(
											const char& str);  // 357
								CKV3MemberName::CKV3MemberName<5>(
											const char& str);  // 357
							}
							CKV3MemberName::CKV3MemberName<14>(
										const char& str);  // 357
						}
					}
				}
				CKV3MemberName::CKV3MemberName<9>(
							const char& str);  // 357
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 359
	}
	CKV3MemberName::CKV3MemberName<14>(
				const char& str);  // 203
	{
		const uint32  m; // 123
		uint32 h; // 124
		uint32 k; // 125
		const int  r; // 126
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<8>(
				const char& str);  // 205
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 204
} /* size: 0, variables: 2, inline expansions: 5 (101 bytes) */

