
//
// tier0_perproject/utlsoacontainer.cpp
//
//	referenced by: libengine2.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 244
//	classes: 4
//	structs: 2
//

// <044FEB8A> tier0_perproject/utlsoacontainer.cpp:39
void SetThreadPoolForCSOAOps(IThreadPool* pPool)
{
} /* size: 0 */

// <044FEAD3> tier0_perproject/utlsoacontainer.cpp:45
// variables: 3
void ElementSizeInBytes(EAttributeDataType nDataType)
{
	const char   __FUNCTION__; // 6718
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 47
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 48
	}
} /* size: 0, variables: 1 */

// <01B5A1E5> tier0_perproject/utlsoacontainer.cpp:45
// variables: 3
void ElementSizeInBytes(EAttributeDataType nDataType)
{
	const char   __FUNCTION__; // 47107
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 47
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 48
	}
} /* size: 0, variables: 1 */

// <009DFA48> tier0_perproject/utlsoacontainer.cpp:45
// variables: 3
void ElementSizeInBytes(EAttributeDataType nDataType)
{
	const char   __FUNCTION__; // 39827
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 47
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 48
	}
} /* size: 0, variables: 1 */

// <044FE8C1> tier0_perproject/utlsoacontainer.cpp:55
// variables: 6
// function calls: 5
void CSOAContainer::CSOAContainer(int nCols, int nRows, int nSlices, ...)
{
	{
		va_list args; // 60
		{
			int nFieldNumber; // 64
			EAttributeDataType nDataType; // 67
		}
	}
	{
		va_list args; // 60
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 901
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 900
		CSOAContainer::Init(); // 59
		{
			int nFieldNumber; // 64
			EAttributeDataType nDataType; // 67
		}
	}
} /* size: 0 */

// <044FE857> tier0_perproject/utlsoacontainer.cpp:55
// variables: 3
void CSOAContainer::CSOAContainer(int nCols, int nRows, int nSlices, ...)
{
	{
		va_list args; // 60
		{
			int nFieldNumber; // 64
			EAttributeDataType nDataType; // 67
		}
	}
} /* size: 0 */

// <044FE7DD> tier0_perproject/utlsoacontainer.cpp:73
// function call: 1
void CSOAContainer::~CSOAContainer()
{
	CSOAContainer::Purge(); // 75
} /* size: 9, inline expansions: 1 (5 bytes) */

// <044FE7C1> tier0_perproject/utlsoacontainer.cpp:73
void CSOAContainer::~CSOAContainer()
{
} /* size: 0 */

// <0450EFBF> tier0_perproject/utlsoacontainer.cpp:79
// function calls: 5
void CSOAContainer::Purge()
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 82
} /* size: 273, inline expansions: 5 (632 bytes) */

// <044FE7A5> tier0_perproject/utlsoacontainer.cpp:79
void CSOAContainer::Purge()
{
} /* size: 0 */

// <0450EE1E> tier0_perproject/utlsoacontainer.cpp:86
// variable: 1
// function call: 1
void CSOAContainer::AllocateAttributeIndex()
{
	{
		int i; // 88
		CSOAContainer::HasAllocatedMemory(
					int nAttrIdx);  // 90
	}
} /* size: 0 */

// <044FE77C> tier0_perproject/utlsoacontainer.cpp:86
// variable: 1
void CSOAContainer::AllocateAttributeIndex()
{
	{
		int i; // 88
	}
} /* size: 0 */

// <0450EE9C> tier0_perproject/utlsoacontainer.cpp:97
// variables: 2
// function calls: 2
void CSOAContainer::FirstAttr()
{
	CSOAAttributeIterator ret; // 99
	CSOAAttributeIterator::CSOAAttributeIterator(); // 99
	{
		int i; // 102
		CSOAContainer::HasAllocatedMemory(
					int nAttrIdx);  // 104
	}
} /* size: 78, variables: 1, inline expansions: 1 (0 bytes) */

// <044FE746> tier0_perproject/utlsoacontainer.cpp:97
// variables: 2
void CSOAContainer::FirstAttr()
{
	CSOAAttributeIterator ret; // 99
	{
		int i; // 102
	}
} /* size: 0, variables: 1 */

// <044FE53C> tier0_perproject/utlsoacontainer.cpp:117
// variables: 3
// function calls: 5
void CSOAContainer::AllocateData(int nNCols, int nNRows, int nSlices)
{
	uint8* pBasePtr; // 131
	uint8* pConstantDataPtr; // 132
	{
		int i; // 133
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 150
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 158
	}
	CSOAContainer::NumRows(); // 315
	CSOAContainer::NumCols(); // 315
	CSOAContainer::SetThreadMode(
			SOAThreadMode_t eThreadMode);  // 161
} /* size: 321, variables: 2, inline expansions: 3 (23 bytes) */

// <0450EF53> tier0_perproject/utlsoacontainer.cpp:165
// variables: 2
void CSOAContainer::SetAttributeDataTypesFrom(const CSOAContainer& other)
{
	{
		int i; // 167
		{
			bool bAllocate; // 171
		}
	}
} /* size: 0 */

// <044FE244> tier0_perproject/utlsoacontainer.cpp:177
// variables: 3
// function calls: 4
void CSOAContainer::SetAttributeType(int nAttrIdx, EAttributeDataType nDataType, bool bAllocateMemory)
{
	const char   __FUNCTION__; // 6676
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 179
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 198
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 219
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 224
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 224
} /* size: 0, variables: 1, inline expansions: 4 (174 bytes) */

// <01B59956> tier0_perproject/utlsoacontainer.cpp:177
// variables: 3
// function calls: 4
void CSOAContainer::SetAttributeType(int nAttrIdx, EAttributeDataType nDataType, bool bAllocateMemory)
{
	const char   __FUNCTION__; // 47065
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 179
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 198
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 219
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 224
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 224
} /* size: 0, variables: 1, inline expansions: 4 (174 bytes) */

// <009DF1B9> tier0_perproject/utlsoacontainer.cpp:177
// variables: 3
// function calls: 4
void CSOAContainer::SetAttributeType(int nAttrIdx, EAttributeDataType nDataType, bool bAllocateMemory)
{
	const char   __FUNCTION__; // 39785
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 179
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 198
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 219
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 224
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 224
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <044FE1BB> tier0_perproject/utlsoacontainer.cpp:229
// variable: 1
void CSOAContainer::PurgeData()
{
	{
		int i; // 243
	}
} /* size: 122 */

// <0450F136> tier0_perproject/utlsoacontainer.cpp:253
// variable: 1
void CSOAContainer::AttributeMemorySize(int nAttrIndex)
{
	EAttributeDataType nDataType; // 255
} /* size: 0, variables: 1 */

// <0450F174> tier0_perproject/utlsoacontainer.cpp:264
// variables: 2
// function call: 1
void CSOAContainer::DataMemorySize()
{
	size_t nDataMemorySize; // 266
	{
		int i; // 267
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 271
	}
} /* size: 0, variables: 1 */

// <044FE150> tier0_perproject/utlsoacontainer.cpp:264
// variables: 2
void CSOAContainer::DataMemorySize()
{
	size_t nDataMemorySize; // 266
	{
		int i; // 267
	}
} /* size: 0, variables: 1 */

// <044FE00F> tier0_perproject/utlsoacontainer.cpp:276
// variables: 4
// function calls: 2
void CSOAContainer::AllocateDataMemory()
{
	const char   __FUNCTION__; // 6718
	size_t nMemorySize; // 279
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 278
	}
	{
		int i; // 267
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 271
	}
	CSOAContainer::DataMemorySize(); // 279
} /* size: 0, variables: 2, inline expansions: 1 (84 bytes) */

// <01B59721> tier0_perproject/utlsoacontainer.cpp:276
// variables: 4
// function calls: 2
void CSOAContainer::AllocateDataMemory()
{
	const char   __FUNCTION__; // 47107
	size_t nMemorySize; // 279
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 278
	}
	{
		int i; // 267
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 271
	}
	CSOAContainer::DataMemorySize(); // 279
} /* size: 0, variables: 2, inline expansions: 1 (84 bytes) */

// <009DEF84> tier0_perproject/utlsoacontainer.cpp:276
// variables: 4
// function calls: 2
void CSOAContainer::AllocateDataMemory()
{
	const char   __FUNCTION__; // 39827
	size_t nMemorySize; // 279
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 278
	}
	{
		int i; // 267
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 271
	}
	CSOAContainer::DataMemorySize(); // 279
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <0450F201> tier0_perproject/utlsoacontainer.cpp:286
// variables: 2
// function call: 1
void CSOAContainer::ConstantMemorySize()
{
	size_t nConstantDataSize; // 288
	{
		int i; // 289
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 293
	}
} /* size: 0, variables: 1 */

// <044FDFD8> tier0_perproject/utlsoacontainer.cpp:286
// variables: 2
void CSOAContainer::ConstantMemorySize()
{
	size_t nConstantDataSize; // 288
	{
		int i; // 289
	}
} /* size: 0, variables: 1 */

// <044FDE08> tier0_perproject/utlsoacontainer.cpp:298
// variables: 4
// function calls: 4
void CSOAContainer::AllocateConstantMemory()
{
	const char   __FUNCTION__; // 6760
	size_t nConstantDataSize; // 301
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 300
	}
	{
		int i; // 289
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 293
	}
	CSOAContainer::ConstantMemorySize(); // 301
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 305
} /* size: 0, variables: 2, inline expansions: 3 (100 bytes) */

// <01B5951A> tier0_perproject/utlsoacontainer.cpp:298
// variables: 4
// function calls: 4
void CSOAContainer::AllocateConstantMemory()
{
	const char   __FUNCTION__; // 47149
	size_t nConstantDataSize; // 301
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 300
	}
	{
		int i; // 289
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 293
	}
	CSOAContainer::ConstantMemorySize(); // 301
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 305
} /* size: 0, variables: 2, inline expansions: 3 (100 bytes) */

// <009DED7D> tier0_perproject/utlsoacontainer.cpp:298
// variables: 4
// function calls: 4
void CSOAContainer::AllocateConstantMemory()
{
	const char   __FUNCTION__; // 39869
	size_t nConstantDataSize; // 301
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 300
	}
	{
		int i; // 289
		CSOAContainer::AttributeMemorySize(
					int nAttrIndex);  // 293
	}
	CSOAContainer::ConstantMemorySize(); // 301
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 305
} /* size: 0, variables: 2, inline expansions: 3 (0 bytes) */

// <0450F286> tier0_perproject/utlsoacontainer.cpp:310
// function calls: 2
void CSOAContainer::SetThreadMode(SOAThreadMode_t eThreadMode)
{
	CSOAContainer::NumRows(); // 315
	CSOAContainer::NumCols(); // 315
} /* size: 0, inline expansions: 2 (0 bytes) */

// <044FDDDE> tier0_perproject/utlsoacontainer.cpp:310
void CSOAContainer::SetThreadMode(SOAThreadMode_t eThreadMode)
{
} /* size: 0 */

// <044D9321> tier0_perproject/utlsoacontainer.cpp:336
void QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue& queue, CSOAContainer* instance, int nSlices, void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int) CSOAContainer::* method, int nY, int nStep)
{
} /* size: 0 */

// <044D9189> tier0_perproject/utlsoacontainer.cpp:336
void QueueCallWrapper<CSOAContainer, int, __vector(4) float>(CCallQueue& queue, CSOAContainer* instance, int nSlices, void ()(CSOAContainer *, int, int, int, int, int, float) CSOAContainer::* method, int nY, int nStep)
{
} /* size: 0 */

// <044D7670> tier0_perproject/utlsoacontainer.cpp:336
void QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue& queue, CSOAContainer* instance, int nSlices, void ()(CSOAContainer *, int, int, int, int, int, int, int, Vector, bool) CSOAContainer::* method, int nY, int nStep)
{
} /* size: 0 */

// <044D4DE0> tier0_perproject/utlsoacontainer.cpp:336
void QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue& queue, CSOAContainer* instance, int nSlices, void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int, int, int, const float *) CSOAC method, int nY, int nStep)
{
} /* size: 0 */

// <044D1A00> tier0_perproject/utlsoacontainer.cpp:336
void QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue& queue, CSOAContainer* instance, int nSlices, void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int) CSOAContainer::* method, int nY, int nStep)
{
} /* size: 0 */

// <044FDBDE> tier0_perproject/utlsoacontainer.cpp:398
// variables: 2
// function calls: 4
void CSOAContainer::CopyAttrFromPartial(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pOther, int nDestAttributeIndex, int nSrcAttributeIndex)
{
	{
		int z; // 401
		{
			size_t nCopySize; // 403
			CSOAContainer::ConstRowPtr(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 404
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 404
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 404
		}
	}
} /* size: 177 */

// <044FCF06> tier0_perproject/utlsoacontainer.cpp:410
// variables: 12
// function calls: 47
void CSOAContainer::CopyAttrFrom(const CSOAContainer& other, int nDestAttributeIndex, int nSrcAttributeIndex)
{
	const char   __FUNCTION__; // 6613
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 416
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 417
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 418
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 419
	}
	{
		CCallQueue workList; // 426
		int nY; // 426
		{
			int nStep; // 426
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue& queue,
											CSOAContainer* instance,
											int nSlices,
											void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int) CSOAContainer::* method,
											int nY,
											int nStep);  // 426
			CSOAContainer::NumSlices(); // 426
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 426
		CSOAContainer::NumRows(); // 426
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 426
	}
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 422
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 422
} /* size: 0, variables: 1, inline expansions: 9 (162 bytes) */

// <01B58618> tier0_perproject/utlsoacontainer.cpp:410
// variables: 12
// function calls: 47
void CSOAContainer::CopyAttrFrom(const CSOAContainer& other, int nDestAttributeIndex, int nSrcAttributeIndex)
{
	const char   __FUNCTION__; // 47002
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 416
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 417
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 418
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 419
	}
	{
		CCallQueue workList; // 426
		int nY; // 426
		{
			int nStep; // 426
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue& queue,
											CSOAContainer* instance,
											int nSlices,
											void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int) CSOAContainer::* method,
											int nY,
											int nStep);  // 426
			CSOAContainer::NumSlices(); // 426
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 426
		CSOAContainer::NumRows(); // 426
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 426
	}
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 422
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 422
} /* size: 0, variables: 1, inline expansions: 9 (162 bytes) */

// <009DDE7B> tier0_perproject/utlsoacontainer.cpp:410
// variables: 12
// function calls: 47
void CSOAContainer::CopyAttrFrom(const CSOAContainer& other, int nDestAttributeIndex, int nSrcAttributeIndex)
{
	const char   __FUNCTION__; // 39722
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 416
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 417
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 418
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 419
	}
	{
		CCallQueue workList; // 426
		int nY; // 426
		{
			int nStep; // 426
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int), int, int, const CSOAContainer*, int, int)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int>(CCallQueue& queue,
											CSOAContainer* instance,
											int nSlices,
											void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int) CSOAContainer::* method,
											int nY,
											int nStep);  // 426
			CSOAContainer::NumSlices(); // 426
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 426
		CSOAContainer::NumRows(); // 426
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 426
	}
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumRows(); // 416
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumCols(); // 417
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::NumSlices(); // 418
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 422
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 422
} /* size: 0, variables: 1, inline expansions: 9 (0 bytes) */

// <044FCD8C> tier0_perproject/utlsoacontainer.cpp:431
// variables: 2
// function calls: 3
void CSOAContainer::CopyAttrToAttr(int nSrcAttributeIndex, int nDestAttributeIndex)
{
	const char   __FUNCTION__; // 6634
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 433
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 434
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 434
} /* size: 0, variables: 1, inline expansions: 3 (0 bytes) */

// <01B5849E> tier0_perproject/utlsoacontainer.cpp:431
// variables: 2
// function calls: 3
void CSOAContainer::CopyAttrToAttr(int nSrcAttributeIndex, int nDestAttributeIndex)
{
	const char   __FUNCTION__; // 47023
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 433
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 434
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 434
} /* size: 0, variables: 1, inline expansions: 3 (0 bytes) */

// <009DDD01> tier0_perproject/utlsoacontainer.cpp:431
// variables: 2
// function calls: 3
void CSOAContainer::CopyAttrToAttr(int nSrcAttributeIndex, int nDestAttributeIndex)
{
	const char   __FUNCTION__; // 39743
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 433
	}
	CSOAContainer::AttributeMemorySize(
				int nAttrIndex);  // 434
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 434
} /* size: 0, variables: 1, inline expansions: 3 (0 bytes) */

// <044FCA5F> tier0_perproject/utlsoacontainer.cpp:437
// variables: 10
// function calls: 7
void CSOAContainer::PackScalarAttributesToVectorAttribute(CSOAContainer* pInput, int nVecAttributeOut, int nScalarAttributeX, int nScalarAttributeY, int nScalarAttributeZ)
{
	FourVectors* pOut; // 448
	fltx4* pInX; // 449
	fltx4* pInY; // 450
	fltx4* pInZ; // 451
	size_t nRowToRowStride; // 452
	size_t nRowToRowStrideX; // 453
	size_t nRowToRowStrideY; // 454
	size_t nRowToRowStrideZ; // 455
	int nRowCtr; // 456
	{
		int nColCtr; // 459
		CSOAContainer::NumQuadsPerRow(); // 459
	}
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 448
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 449
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 450
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 451
	CSOAContainer::NumRows(); // 456
	CSOAContainer::NumSlices(); // 456
} /* size: 0, variables: 9, inline expansions: 6 (0 bytes) */

// <044FC50F> tier0_perproject/utlsoacontainer.cpp:475
// variables: 14
// function calls: 13
void CSOAContainer::UnPackVectorAttributeToScalarAttributes(CSOAContainer* pInput, int nVecAttributeIn, int nScalarAttributeX, int nScalarAttributeY, int nScalarAttributeZ)
{
	const char   __FUNCTION__; // 6949
	FourVectors* pIn; // 489
	fltx4* pX; // 490
	fltx4* pY; // 491
	fltx4* pZ; // 492
	size_t nRowToRowStride; // 493
	size_t nRowToRowStrideX; // 494
	size_t nRowToRowStrideY; // 495
	size_t nRowToRowStrideZ; // 496
	int nRowCtr; // 497
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 485
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 486
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 487
	}
	{
		int nColCtr; // 500
		CSOAContainer::NumQuadsPerRow(); // 500
	}
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 489
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 490
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 491
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 492
	CSOAContainer::NumRows(); // 497
	CSOAContainer::NumSlices(); // 497
} /* size: 0, variables: 10, inline expansions: 12 (0 bytes) */

// <01B57C21> tier0_perproject/utlsoacontainer.cpp:475
// variables: 14
// function calls: 13
void CSOAContainer::UnPackVectorAttributeToScalarAttributes(CSOAContainer* pInput, int nVecAttributeIn, int nScalarAttributeX, int nScalarAttributeY, int nScalarAttributeZ)
{
	const char   __FUNCTION__; // 47338
	FourVectors* pIn; // 489
	fltx4* pX; // 490
	fltx4* pY; // 491
	fltx4* pZ; // 492
	size_t nRowToRowStride; // 493
	size_t nRowToRowStrideX; // 494
	size_t nRowToRowStrideY; // 495
	size_t nRowToRowStrideZ; // 496
	int nRowCtr; // 497
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 485
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 486
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 487
	}
	{
		int nColCtr; // 500
		CSOAContainer::NumQuadsPerRow(); // 500
	}
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 489
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 490
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 491
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 492
	CSOAContainer::NumRows(); // 497
	CSOAContainer::NumSlices(); // 497
} /* size: 0, variables: 10, inline expansions: 12 (0 bytes) */

// <009DD484> tier0_perproject/utlsoacontainer.cpp:475
// variables: 14
// function calls: 13
void CSOAContainer::UnPackVectorAttributeToScalarAttributes(CSOAContainer* pInput, int nVecAttributeIn, int nScalarAttributeX, int nScalarAttributeY, int nScalarAttributeZ)
{
	const char   __FUNCTION__; // 40058
	FourVectors* pIn; // 489
	fltx4* pX; // 490
	fltx4* pY; // 491
	fltx4* pZ; // 492
	size_t nRowToRowStride; // 493
	size_t nRowToRowStrideX; // 494
	size_t nRowToRowStrideY; // 495
	size_t nRowToRowStrideZ; // 496
	int nRowCtr; // 497
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 485
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 486
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 487
	}
	{
		int nColCtr; // 500
		CSOAContainer::NumQuadsPerRow(); // 500
	}
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumCols(); // 485
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumRows(); // 486
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::NumSlices(); // 487
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 489
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 490
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 491
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 492
	CSOAContainer::NumRows(); // 497
	CSOAContainer::NumSlices(); // 497
} /* size: 0, variables: 10, inline expansions: 12 (0 bytes) */

// <044FBD45> tier0_perproject/utlsoacontainer.cpp:517
// variables: 17
// function calls: 27
void CSOAContainer::MultiplyVectorAttribute(CSOAContainer* pInput, int nAttributeIn, const Vector& vecScalar, int nAttributeOut)
{
	const char   __FUNCTION__; // 6781
	FourVectors v4Scale; // 523
	size_t nRowToRowStride; // 527
	size_t nRowToRowStrideOut; // 528
	int nRowCtr; // 529
	const FourVectors* pIn; // 530
	FourVectors* pOut; // 531
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 521
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 522
	}
	{
		int nColCtr; // 534
		{
			FourVectors v4In; // 537
			FourVectors::FourVectors(
					const FourVectors& src);  // 537
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			FourVectors::ApplyBinaryUpdateFunction<MulSIMD<> >(
								const FourVectors& v4Arg);  // 148
			FourVectors::operator*=(
					const FourVectors& b);  // 539
			FourVectors::operator=(
					const FourVectors& src);  // 540
		}
		CSOAContainer::NumQuadsPerRow(); // 534
	}
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumRows(); // 522
	CSOAContainer::NumRows(); // 522
	FourVectors::FourVectors(); // 523
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 524
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 530
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 531
	CSOAContainer::NumRows(); // 529
	CSOAContainer::NumSlices(); // 529
} /* size: 0, variables: 7, inline expansions: 13 (0 bytes) */

// <01B57457> tier0_perproject/utlsoacontainer.cpp:517
// variables: 17
// function calls: 27
void CSOAContainer::MultiplyVectorAttribute(CSOAContainer* pInput, int nAttributeIn, const Vector& vecScalar, int nAttributeOut)
{
	const char   __FUNCTION__; // 47170
	FourVectors v4Scale; // 523
	size_t nRowToRowStride; // 527
	size_t nRowToRowStrideOut; // 528
	int nRowCtr; // 529
	const FourVectors* pIn; // 530
	FourVectors* pOut; // 531
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 521
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 522
	}
	{
		int nColCtr; // 534
		{
			FourVectors v4In; // 537
			FourVectors::FourVectors(
					const FourVectors& src);  // 537
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			FourVectors::ApplyBinaryUpdateFunction<MulSIMD<> >(
								const FourVectors& v4Arg);  // 148
			FourVectors::operator*=(
					const FourVectors& b);  // 539
			FourVectors::operator=(
					const FourVectors& src);  // 540
		}
		CSOAContainer::NumQuadsPerRow(); // 534
	}
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumRows(); // 522
	CSOAContainer::NumRows(); // 522
	FourVectors::FourVectors(); // 523
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 524
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 530
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 531
	CSOAContainer::NumRows(); // 529
	CSOAContainer::NumSlices(); // 529
} /* size: 0, variables: 7, inline expansions: 13 (0 bytes) */

// <009DCCBA> tier0_perproject/utlsoacontainer.cpp:517
// variables: 17
// function calls: 27
void CSOAContainer::MultiplyVectorAttribute(CSOAContainer* pInput, int nAttributeIn, const Vector& vecScalar, int nAttributeOut)
{
	const char   __FUNCTION__; // 39890
	FourVectors v4Scale; // 523
	size_t nRowToRowStride; // 527
	size_t nRowToRowStrideOut; // 528
	int nRowCtr; // 529
	const FourVectors* pIn; // 530
	FourVectors* pOut; // 531
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 521
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 522
	}
	{
		int nColCtr; // 534
		{
			FourVectors v4In; // 537
			FourVectors::FourVectors(
					const FourVectors& src);  // 537
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			FourVectors::ApplyBinaryUpdateFunction<MulSIMD<> >(
								const FourVectors& v4Arg);  // 148
			FourVectors::operator*=(
					const FourVectors& b);  // 539
			FourVectors::operator=(
					const FourVectors& src);  // 540
		}
		CSOAContainer::NumQuadsPerRow(); // 534
	}
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumCols(); // 521
	CSOAContainer::NumRows(); // 522
	CSOAContainer::NumRows(); // 522
	FourVectors::FourVectors(); // 523
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 524
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 530
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 531
	CSOAContainer::NumRows(); // 529
	CSOAContainer::NumSlices(); // 529
} /* size: 0, variables: 7, inline expansions: 13 (0 bytes) */

// <044FB934> tier0_perproject/utlsoacontainer.cpp:547
// variables: 11
// function calls: 12
void CSOAContainer::RandomizeAttribute(int nAttr, float flMin, float flMax)
{
	fltx4* pOut; // 550
	size_t nRowToRowStride; // 551
	int nContext; // 552
	int nRowCtr; // 553
	fltx4 fl4Min; // 554
	fltx4 fl4Domain; // 555
	{
		int nColCtr; // 558
		CSOAContainer::NumQuadsPerRow(); // 558
		{
			fltx4 retVal; // 1639
			_mm_mul_ps(__m128 __A,
					__m128 __B);  // 1640
		}
		MulSIMD<>(const fltx4& a,
				const fltx4& b);  // 561
		{
			fltx4 retVal; // 1593
			_mm_add_ps(__m128 __A,
					__m128 __B);  // 1594
		}
		AddSIMD<>(const fltx4& a,
				const fltx4& b);  // 561
	}
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 550
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 554
	CSOAContainer::NumRows(); // 553
	CSOAContainer::NumSlices(); // 553
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 555
} /* size: 0, variables: 6, inline expansions: 5 (0 bytes) */

// <044FB5A0> tier0_perproject/utlsoacontainer.cpp:570
// variables: 13
// function calls: 8
void CSOAContainer::FillAttrWithInterpolatedValues(int nAttr, float flValue00, float flValue10, float flValue01, float flValue11)
{
	float ooWidth; // 572
	float ooHeight; // 573
	float flYDelta0; // 574
	float flYDelta1; // 575
	int nRowCtr; // 576
	fltx4* pOut; // 577
	size_t nRowToRowStride; // 578
	{
		float flXDelta; // 581
		fltx4 fl4Value; // 582
		fltx4 fl4XDelta; // 587
		int nColCtr; // 588
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 587
		CSOAContainer::NumQuadsPerRow(); // 588
		{
			fltx4 retVal; // 1593
			_mm_add_ps(__m128 __A,
					__m128 __B);  // 1594
		}
		AddSIMD<>(const fltx4& a,
				const fltx4& b);  // 592
	}
	CSOAContainer::NumCols(); // 572
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 577
	CSOAContainer::NumRows(); // 573
} /* size: 0, variables: 7, inline expansions: 3 (0 bytes) */

// <044FA333> tier0_perproject/utlsoacontainer.cpp:601
// variables: 29
// function calls: 73
void CSOAContainer::FillAttrWithInterpolatedValues(int nAttr, Vector vecValue00, Vector vecValue10, const Vector& vecValue01, const Vector& vecValue11)
{
	float ooWidth; // 603
	float ooHeight; // 604
	Vector vecYDelta0; // 605
	Vector vecYDelta1; // 606
	int nRowCtr; // 607
	FourVectors* pOut; // 608
	size_t nRowToRowStride; // 609
	{
		Vector vecXDelta; // 612
		FourVectors v4Value; // 613
		FourVectors v4XDelta; // 616
		int nColCtr; // 618
		VectorSubtract(const Vector& a,
				const Vector& b,
				Vector& c);  // 1444
		Vector::Vector(); // 1443
		Vector::operator-(
				const Vector& v);  // 612
		VectorMultiply(const Vector& a,
				vec_t b,
				Vector& c);  // 1451
		Vector::Vector(); // 1450
		Vector::operator*(
				float fl);  // 1478
		operator*(float fl,
				const Vector& v);  // 612
		VectorAdd(const Vector& a,
				const Vector& b,
				Vector& c);  // 1437
		Vector::Vector(); // 1436
		Vector::operator+(
				const Vector& v);  // 615
		VectorAdd(const Vector& a,
				const Vector& b,
				Vector& c);  // 1437
		Vector::Vector(); // 1436
		Vector::operator+(
				const Vector& v);  // 615
		FourVectors::FourVectors(); // 613
		Vector::Vector(); // 1436
		VectorAdd(const Vector& a,
				const Vector& b,
				Vector& c);  // 1437
		Vector::operator+(
				const Vector& v);  // 615
		{
			fltx4 retVal; // 947
			_mm_loadu_ps(const float* __P); // 948
		}
		LoadUnalignedSIMD<>(const void* pSIMD); // 311
		{
			__v4sf __r0; // 2491
			__v4sf __r1; // 2491
			__v4sf __r2; // 2491
			__v4sf __r3; // 2491
			__v4sf __t0; // 2491
			__v4sf __t1; // 2491
			__v4sf __t2; // 2491
			__v4sf __t3; // 2491
		}
		TransposeSIMD<>(fltx4& x,
				fltx4& y,
				fltx4& z,
				fltx4& w);  // 318
		{
			fltx4 retVal; // 947
			_mm_loadu_ps(const float* __P); // 948
		}
		LoadUnalignedSIMD<>(const void* pSIMD); // 309
		{
			fltx4 retVal; // 947
			_mm_loadu_ps(const float* __P); // 948
		}
		LoadUnalignedSIMD<>(const void* pSIMD); // 310
		{
			fltx4 retVal; // 947
			_mm_loadu_ps(const float* __P); // 948
		}
		LoadUnalignedSIMD<>(const void* pSIMD); // 312
		FourVectors::LoadAndSwizzle(
				const Vector& a,
				const Vector& b,
				const Vector& c,
				const Vector& d);  // 614
		VectorMultiply(const Vector& a,
				vec_t b,
				Vector& c);  // 1451
		Vector::Vector(); // 1450
		Vector::operator*(
				float fl);  // 617
		Vector::Vector(); // 1436
		Vector::operator+(
				const Vector& v);  // 615
		Vector::Vector(); // 1436
		Vector::operator+(
				const Vector& v);  // 615
		Vector::Vector(); // 1436
		Vector::operator+(
				const Vector& v);  // 614
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 100
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 98
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 99
		FourVectors::DuplicateVector(
				const Vector& v);  // 617
		FourVectors::FourVectors(); // 616
		CSOAContainer::NumQuadsPerRow(); // 618
		FourVectors::operator=(
				const FourVectors& src);  // 621
		{
			fltx4 retVal; // 1593
			_mm_add_ps(__m128 __A,
					__m128 __B);  // 1594
		}
		AddSIMD<>(const fltx4& a,
				const fltx4& b);  // 129
		{
			fltx4 retVal; // 1593
			_mm_add_ps(__m128 __A,
					__m128 __B);  // 1594
		}
		AddSIMD<>(const fltx4& a,
				const fltx4& b);  // 129
		{
			fltx4 retVal; // 1593
			_mm_add_ps(__m128 __A,
					__m128 __B);  // 1594
		}
		AddSIMD<>(const fltx4& a,
				const fltx4& b);  // 129
		FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
							const FourVectors& v4Arg);  // 129
		FourVectors::operator+=(
				const FourVectors& b);  // 622
		Vector::operator+=(
				const Vector& v);  // 625
		Vector::operator+=(
				const Vector& v);  // 626
	}
	CSOAContainer::NumCols(); // 603
	VectorSubtract(const Vector& a,
			const Vector& b,
			Vector& c);  // 1444
	Vector::Vector(); // 1443
	Vector::operator-(
			const Vector& v);  // 605
	VectorSubtract(const Vector& a,
			const Vector& b,
			Vector& c);  // 1444
	Vector::Vector(); // 1443
	Vector::operator-(
			const Vector& v);  // 606
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 608
	VectorMultiply(const Vector& a,
			vec_t b,
			Vector& c);  // 1451
	Vector::Vector(); // 1450
	Vector::operator*(
			float fl);  // 1478
	operator*(float fl,
			const Vector& v);  // 606
	CSOAContainer::NumRows(); // 604
	VectorMultiply(const Vector& a,
			vec_t b,
			Vector& c);  // 1451
	Vector::Vector(); // 1450
	Vector::operator*(
			float fl);  // 1478
	operator*(float fl,
			const Vector& v);  // 605
} /* size: 0, variables: 7, inline expansions: 17 (0 bytes) */

// <044F9F7A> tier0_perproject/utlsoacontainer.cpp:631
// variables: 9
// function calls: 14
void CSOAContainer::FillAttr(int nAttr, const Vector& vecValue)
{
	FourVectors v4Fill; // 633
	FourVectors* pOut; // 643
	size_t nRowToRowStride; // 644
	int nRowCtr; // 645
	{
		FourVectors* pOut; // 637
		FourVectors::operator=(
				const FourVectors& src);  // 638
	}
	{
		int nColCtr; // 648
		CSOAContainer::NumQuadsPerRow(); // 648
		FourVectors::operator=(
				const FourVectors& src);  // 651
	}
	FourVectors::FourVectors(); // 633
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 634
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 635
	CSOAContainer::NumRows(); // 645
	CSOAContainer::NumSlices(); // 645
} /* size: 0, variables: 4, inline expansions: 8 (0 bytes) */

// <0450114F> tier0_perproject/utlsoacontainer.cpp:657
// variables: 5
// function calls: 2
void CSOAContainer::FillAttrPartial(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, int nAttr, fltx4 fl4Value)
{
	{
		int z; // 659
		{
			fltx4* pOut; // 661
			size_t nRowToRowStride; // 662
			int nRowCtr; // 663
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 661
			{
				int nColCtr; // 666
				CSOAContainer::NumQuadsPerRow(); // 666
			}
		}
	}
} /* size: 169 */

// <044F9ECA> tier0_perproject/utlsoacontainer.cpp:657
// variables: 5
void CSOAContainer::FillAttrPartial(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, int nAttr, fltx4 fl4Value)
{
	{
		int z; // 659
		{
			fltx4* pOut; // 661
			size_t nRowToRowStride; // 662
			int nRowCtr; // 663
			{
				int nColCtr; // 666
			}
		}
	}
} /* size: 0 */

// <044F92A3> tier0_perproject/utlsoacontainer.cpp:677
// variables: 16
// function calls: 49
void CSOAContainer::FillAttr(int nAttr, float flValue)
{
	{
		fltx4* pOut; // 681
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 682
	}
	{
		CCallQueue workList; // 687
		int nY; // 687
		{
			int nStep; // 687
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, int, __vector(4) float>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, __vector(4) float), int, int, int, __vector(4) float)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, int, __vector(4) float>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, __vector(4) float), int, int, int, __vector(4) float)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, int, __vector(4) float>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, __vector(4) float), int, int, int, __vector(4) float)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, int, __vector(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, int, __vector(4) float>(CCallQueue& queue,
										CSOAContainer* instance,
										int nSlices,
										void ()(CSOAContainer *, int, int, int, int, int, float) CSOAContainer::* method,
										int nY,
										int nStep); // 687
			CSOAContainer::NumSlices(); // 687
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 687
		CSOAContainer::NumRows(); // 687
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 687
	}
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 679
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 687
	CSOAContainer::NumSlices(); // 687
	CSOAContainer::NumRows(); // 687
	{
		int z; // 659
		{
			fltx4* pOut; // 661
			size_t nRowToRowStride; // 662
			int nRowCtr; // 663
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 661
			{
				int nColCtr; // 666
				CSOAContainer::NumQuadsPerRow(); // 666
			}
		}
	}
	CSOAContainer::FillAttrPartial(
			int nStartRow,
			int nNumRows,
			int nStartSlice,
			int nEndSlice,
			int nAttr,
			fltx4 fl4Value);  // 687
} /* size: 1138, inline expansions: 5 (167 bytes) */

// <044F905B> tier0_perproject/utlsoacontainer.cpp:690
// variables: 7
// function calls: 3
void CSOAContainer::SrgbGammaToLinearPartial(CSOAContainer* pSrcTable, int nSrcAttr, int nDestAttr, int nStartRow, int nNumRows, int nStartSlice, int nEndSlice)
{
	{
		int z; // 692
		{
			fltx4* pOut; // 694
			fltx4* pIn; // 695
			size_t nSrcRowToRowStride; // 696
			size_t nDestRowToRowStride; // 697
			int nRowCtr; // 698
			{
				int nColCtr; // 701
				CSOAContainer::NumQuadsPerRow(); // 701
			}
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 694
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 695
		}
	}
} /* size: 281 */

// <044F8A85> tier0_perproject/utlsoacontainer.cpp:712
// variables: 15
// function calls: 18
void CSOAContainer::CalculateStandardDeviationFromMoments(int nSrcMeanAttr, int nSrcMeanSquaredAttr, const CSOAContainer* pSrc, int nAttributeOut, float flScaleValue)
{
	fltx4 fl4Scale; // 714
	{
		int z; // 715
		{
			fltx4* pOut; // 717
			fltx4* pIn; // 718
			fltx4* pIn2; // 719
			size_t nSrcRowToRowStride; // 720
			size_t nDestRowToRowStride; // 721
			int nRowCtr; // 722
			{
				int nColCtr; // 725
				{
					fltx4 retVal; // 2228
					_mm_max_ps(__m128 __A,
							__m128 __B);  // 2229
				}
				MaxSIMD<>(const fltx4& a,
						const fltx4& b);  // 729
				CSOAContainer::NumQuadsPerRow(); // 725
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 729
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 729
				{
					fltx4 retVal; // 2350
					_mm_sqrt_ps(__m128 __A); // 2351
				}
				SqrtSIMD<>(const fltx4& a); // 729
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 729
			}
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 719
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 718
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 717
			CSOAContainer::NumRows(); // 722
		}
		CSOAContainer::NumSlices(); // 715
	}
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 714
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <044D7874> tier0_perproject/utlsoacontainer.cpp:739
// variables: 58
// function calls: 100
void CSOAContainer::Normalize3ComponentVectorInAttributesPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, int nXAttr, int nYAttr, int nZAttr, Vector vValueToUseForZeroVectors, bool bTreat000InputAsZeroVector)
{
	FourVectors v4ValueToUseForZeroVectors; // 742
	{
		int z; // 744
		{
			fltx4* pX; // 746
			fltx4* pY; // 747
			fltx4* pZ; // 748
			int nRowCtr; // 750
			{
				int nColCtr; // 753
				{
					fltx4 fl4X; // 756
					fltx4 fl4Y; // 757
					fltx4 fl4Z; // 758
					fltx4 fl4BadLength; // 760
					fltx4 fl4Mag2; // 778
					fltx4 fl4OOLen; // 780
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 773
					{
						fltx4 retVal; // 1616
						_mm_sub_ps(__m128 __A,
								__m128 __B);  // 1617
					}
					SubSIMD<>(const fltx4& a,
							const fltx4& b);  // 773
					{
						fltx4 retVal; // 2067
						_mm_cmplt_ps(__m128 __A,
								__m128 __B);  // 2068
					}
					CmpLtSIMD<>(const fltx4& a,
							const fltx4& b);  // 779
					{
						fltx4 retVal; // 1616
						_mm_sub_ps(__m128 __A,
								__m128 __B);  // 1617
					}
					SubSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2409
					{
						fltx4 retVal; // 2369
						_mm_rsqrt_ps(__m128 __A); // 2370
					}
					ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					ReciprocalSqrtSIMD<>(const fltx4& a); // 780
					{
						fltx4 retVal; // 1851
						_mm_cmpeq_ps(__m128 __A,
								__m128 __B);  // 1852
					}
					CmpEqSIMD<>(const fltx4& a,
							const fltx4& b);  // 764
					{
						fltx4 retVal; // 1851
						_mm_cmpeq_ps(__m128 __A,
								__m128 __B);  // 1852
					}
					CmpEqSIMD<>(const fltx4& a,
							const fltx4& b);  // 764
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 764
					{
						fltx4 retVal; // 1851
						_mm_cmpeq_ps(__m128 __A,
								__m128 __B);  // 1852
					}
					CmpEqSIMD<>(const fltx4& a,
							const fltx4& b);  // 764
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 764
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 774
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 775
					{
						fltx4 retVal; // 1616
						_mm_sub_ps(__m128 __A,
								__m128 __B);  // 1617
					}
					SubSIMD<>(const fltx4& a,
							const fltx4& b);  // 774
					{
						fltx4 retVal; // 1616
						_mm_sub_ps(__m128 __A,
								__m128 __B);  // 1617
					}
					SubSIMD<>(const fltx4& a,
							const fltx4& b);  // 775
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 875
						_mm_or_ps(__m128 __A,
								__m128 __B);  // 876
					}
					OrSIMD<>(const fltx4& a,
						const fltx4& b);  // 779
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 783
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 784
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 785
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 785
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 783
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 784
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 789
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 791
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 789
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 790
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 790
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 791
				}
				CSOAContainer::NumQuadsPerRow(); // 753
			}
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 746
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 747
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 748
		}
	}
	FourVectors::FourVectors(); // 742
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 743
} /* size: 0, variables: 1, inline expansions: 5 (0 bytes) */

// <044D644B> tier0_perproject/utlsoacontainer.cpp:739
// variables: 41
// function calls: 66
void CSOAContainer::Normalize3ComponentVectorInAttributesPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, int nXAttr, int nYAttr, int nZAttr, Vector vValueToUseForZeroVectors, bool bTreat000InputAsZeroVector)
{
	FourVectors v4ValueToUseForZeroVectors; // 742
	{
		int z; // 744
		{
			fltx4* pX; // 746
			fltx4* pY; // 747
			fltx4* pZ; // 748
			int nRowCtr; // 750
			{
				int nColCtr; // 753
				{
					fltx4 fl4X; // 756
					fltx4 fl4Y; // 757
					fltx4 fl4Z; // 758
					fltx4 fl4BadLength; // 760
					fltx4 fl4Mag2; // 778
					fltx4 fl4OOLen; // 780
					{
						fltx4 retVal; // 2067
						_mm_cmplt_ps(__m128 __A,
								__m128 __B);  // 2068
					}
					CmpLtSIMD<>(const fltx4& a,
							const fltx4& b);  // 779
					{
						fltx4 retVal; // 1616
						_mm_sub_ps(__m128 __A,
								__m128 __B);  // 1617
					}
					SubSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2409
					{
						fltx4 retVal; // 2369
						_mm_rsqrt_ps(__m128 __A); // 2370
					}
					ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 2408
					ReciprocalSqrtSIMD<>(const fltx4& a); // 780
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 778
					{
						fltx4 retVal; // 875
						_mm_or_ps(__m128 __A,
								__m128 __B);  // 876
					}
					OrSIMD<>(const fltx4& a,
						const fltx4& b);  // 779
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 783
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 783
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 784
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 785
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 785
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 718
						_mm_and_ps(__m128 __A,
								__m128 __B);  // 719
					}
					AndSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					{
						fltx4 retVal; // 826
						_mm_xor_ps(__m128 __A,
								__m128 __B);  // 827
					}
					XorSIMD<>(const fltx4& a,
							const fltx4& b);  // 1259
					MaskedAssign<>(const fltx4& ReplacementMask,
							const fltx4& a,
							const fltx4& b);  // 784
				}
				CSOAContainer::NumQuadsPerRow(); // 753
			}
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 746
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 747
			CSOAContainer::RowPtr<__vector(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 748
		}
	}
	FourVectors::FourVectors(); // 742
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 743
} /* size: 0, variables: 1, inline expansions: 5 (0 bytes) */

// <044F7689> tier0_perproject/utlsoacontainer.cpp:803
// variables: 14
// function calls: 79
void CSOAContainer::Normalize3ComponentVectorInAttributes(int nXAttr, int nYAttr, int nZAttr, Vector vValueToUseForZeroVectors, bool bTreatAsUnsigned, bool bTreat000InputAsZeroVector)
{
	{
		CCallQueue workList; // 807
		int nY; // 807
		{
			int nStep; // 807
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue& queue,
											CSOAContainer* instance,
											int nSlices,
											void ()(CSOAContainer *, int, int, int, int, int, int, int, Vector, bool) CSOAContainer::* method,
											int nY,
											int nStep);  // 807
			CSOAContainer::NumSlices(); // 807
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 807
		CSOAContainer::NumRows(); // 807
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 807
	}
	{
		CCallQueue workList; // 811
		int nY; // 811
		{
			int nStep; // 811
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, int, int, int, Vector, bool), int, int, int, int, int, Vector, bool)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, int, int, int, Vector, bool>(CCallQueue& queue,
											CSOAContainer* instance,
											int nSlices,
											void ()(CSOAContainer *, int, int, int, int, int, int, int, Vector, bool) CSOAContainer::* method,
											int nY,
											int nStep);  // 811
			CSOAContainer::NumSlices(); // 811
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 811
		CSOAContainer::NumRows(); // 811
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 811
	}
	CSOAContainer::NumSlices(); // 807
	CSOAContainer::NumRows(); // 807
	CSOAContainer::NumSlices(); // 811
	CSOAContainer::NumRows(); // 811
} /* size: 0, inline expansions: 4 (0 bytes) */

// <0450F323> tier0_perproject/utlsoacontainer.cpp:894
void CSOAContainer::SumAttributeValue(int nAttr)
{
} /* size: 0 */

// <044F56D4> tier0_perproject/utlsoacontainer.cpp:899
// function calls: 7
void CSOAContainer::AverageFloatAttributeValue(int nAttr)
{
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 901
	CSOAContainer::SumAttributeValue(
				int nAttr);  // 903
	CSOAContainer::NumCols(); // 903
	CSOAContainer::NumRows(); // 903
	CSOAContainer::NumSlices(); // 903
	CSOAContainer::RowPtr<float>(
			int nAttributeIdx,
			int nRowNumber,
			int nSliceNumber);  // 442
	CSOAContainer::FloatValue(
			int nAttrIdx,
			int nX,
			int nY,
			int nZ);  // 907
} /* size: 0, inline expansions: 7 (0 bytes) */

// <0450F37D> tier0_perproject/utlsoacontainer.cpp:911
void CSOAContainer::MaxAttributeValue(int nAttr)
{
} /* size: 0 */

// <0450F3D7> tier0_perproject/utlsoacontainer.cpp:916
void CSOAContainer::MinAttributeValue(int nAttr)
{
} /* size: 0 */

// <044F4C74> tier0_perproject/utlsoacontainer.cpp:921
// variables: 19
// function calls: 40
void CSOAContainer::NormalizeAttr(int nAttr)
{
	FourVectors* pOut; // 924
	size_t nRowToRowStride; // 925
	int nRowCtr; // 926
	{
		int nColCtr; // 929
		{
			FourVectors v4Data; // 932
			{
				fltx4 retVal; // 1616
				_mm_sub_ps(__m128 __A,
						__m128 __B);  // 1617
			}
			SubSIMD<>(const fltx4& a,
					const fltx4& b);  // 2408
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 2409
			{
				fltx4 retVal; // 2369
				_mm_rsqrt_ps(__m128 __A); // 2370
			}
			ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 2408
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 2408
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 2408
			ReciprocalSqrtSIMD<>(const fltx4& a); // 491
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 166
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 167
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 168
			FourVectors::operator*(
					const FourVectors& b);  // 490
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 153
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 154
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 155
			FourVectors::operator*=(
					const fltx4& scale);  // 491
			FourVectors::VectorNormalize(); // 933
			FourVectors::FourVectors(
					const FourVectors& src);  // 932
			FourVectors::operator=(
					const FourVectors& src);  // 934
		}
		CSOAContainer::NumQuadsPerRow(); // 929
	}
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 924
	CSOAContainer::NumRows(); // 926
	CSOAContainer::NumSlices(); // 926
} /* size: 0, variables: 3, inline expansions: 3 (0 bytes) */

// <044F41B8> tier0_perproject/utlsoacontainer.cpp:940
// variables: 28
// function calls: 40
void CSOAContainer::ScaleAndBiasAttributeToBeBetweenZeroAndOne(int nAttr)
{
	float flLow; // 942
	float flHigh; // 943
	CSOAContainer::MinAttributeValue(
				int nAttr);  // 942
	CSOAContainer::MaxAttributeValue(
				int nAttr);  // 943
	{
		FourVectors* pOut; // 1237
		size_t nRowToRowStride; // 1238
		int nRowCtr; // 1239
		CSOAContainer::RowPtr<FourVectors>(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 1237
		CSOAContainer::NumRows(); // 1239
		CSOAContainer::NumSlices(); // 1239
		{
			int nColCtr; // 1242
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 657
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 657
			CSOAContainer::NumQuadsPerRow(); // 1242
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 657
		}
	}
	CSOAContainer::ApplyBinaryFunctionToAttr<AddSIMD<> >(
						int nDestAttr,
						const fltx4& fl4FnArg1);  // 1233
	{
		fltx4* pOut; // 1255
		size_t nRowToRowStride; // 1256
		int nRowCtr; // 1257
		{
			int nColCtr; // 1260
			CSOAContainer::NumQuadsPerRow(); // 1260
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 657
		}
	}
	CSOAContainer::ApplyBinaryFunctionToAttr<AddSIMD<> >(
						int nDestAttr,
						const fltx4& fl4FnArg1);  // 657
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 657
	CSOAContainer::AddToAttr(
			int nDestAttr,
			float flAddend);  // 1028
	CSOAAttributeReference::operator-=(
			float flAddend);  // 944
	{
		FourVectors* pOut; // 1237
		size_t nRowToRowStride; // 1238
		int nRowCtr; // 1239
		CSOAContainer::RowPtr<FourVectors>(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 1237
		{
			int nColCtr; // 1242
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 651
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 651
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 651
			CSOAContainer::NumQuadsPerRow(); // 1242
		}
		CSOAContainer::NumRows(); // 1239
		CSOAContainer::NumSlices(); // 1239
	}
	CSOAContainer::ApplyBinaryFunctionToAttr<MulSIMD<> >(
						int nDestAttr,
						const fltx4& fl4FnArg1);  // 1233
	{
		fltx4* pOut; // 1255
		size_t nRowToRowStride; // 1256
		int nRowCtr; // 1257
		{
			int nColCtr; // 1260
			CSOAContainer::NumQuadsPerRow(); // 1260
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 651
		}
	}
	CSOAContainer::ApplyBinaryFunctionToAttr<MulSIMD<> >(
						int nDestAttr,
						const fltx4& fl4FnArg1);  // 651
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 651
	CSOAContainer::MulAttr(
		int nDestAttr,
		float flScale);  // 1020
	CSOAAttributeReference::operator*=(
			float flScale);  // 947
} /* size: 0, variables: 2, inline expansions: 12 (0 bytes) */

// <044F3CD4> tier0_perproject/utlsoacontainer.cpp:951
// variables: 10
// function calls: 15
void CSOAContainer::MulAttr(const CSOAContainer& src, int nSrcAttr, int nDestAttr)
{
	FourVectors* pOut; // 955
	FourVectors* pIn; // 956
	size_t nSrcRowToRowStride; // 957
	size_t nRowToRowStride; // 958
	int nRowCtr; // 959
	{
		int nColCtr; // 962
		{
			FourVectors rslt; // 965
			FourVectors::FourVectors(
					const FourVectors& src);  // 965
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 148
			FourVectors::ApplyBinaryUpdateFunction<MulSIMD<> >(
								const FourVectors& v4Arg);  // 148
			FourVectors::operator*=(
					const FourVectors& b);  // 967
			FourVectors::operator=(
					const FourVectors& src);  // 968
		}
		CSOAContainer::NumQuadsPerRow(); // 962
	}
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 955
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 956
	CSOAContainer::NumRows(); // 959
	CSOAContainer::NumSlices(); // 959
} /* size: 0, variables: 5, inline expansions: 4 (0 bytes) */

// <044F2439> tier0_perproject/utlsoacontainer.cpp:975
// variables: 61
// function calls: 94
void CSOAContainer::FindIndicesOfClosestPoint(int nAttr, const Vector& vPoint, int* nx, int* ny, int* nz)
{
	int nClosestCol; // 980
	int nClosestRow; // 981
	int nClosestSlice; // 982
	FourVectors v4ClosestPoint; // 984
	float flClosestDistance; // 985
	const FourVectors* pPnt; // 987
	size_t nRowToRowStride; // 988
	fltx4 fl4IndexStep; // 989
	FourVectors v4QueryPoint; // 990
	int nSlice; // 993
	{
		int nRow; // 996
		{
			int nColCtr; // 999
			fltx4 fl4ColNumber; // 1000
			fltx4 fl4ClosestColumn; // 1001
			fltx4 fl4ClosestColumnDistance; // 1002
			fltx4 fl4DistShifted; // 1017
			fltx4 fl4IndexShifted; // 1018
			fltx4 fl4ReduceMask0; // 1019
			float flTrial; // 1029
			{
				fltx4 fl4TrialDistanceSQ; // 1005
				fltx4 fl4ReplaceMask; // 1006
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 60
				{
					fltx4 retVal; // 718
					_mm_and_ps(__m128 __A,
							__m128 __B);  // 719
				}
				AndSIMD<>(const fltx4& a,
						const fltx4& b);  // 60
				ZeroOutTrailingFloats(const fltx4& a,
							int nCount);  // 1009
				{
					fltx4 retVal; // 826
					_mm_xor_ps(__m128 __A,
							__m128 __B);  // 827
				}
				XorSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				{
					fltx4 retVal; // 718
					_mm_and_ps(__m128 __A,
							__m128 __B);  // 719
				}
				AndSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				{
					fltx4 retVal; // 826
					_mm_xor_ps(__m128 __A,
							__m128 __B);  // 827
				}
				XorSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				MaskedAssign<>(const fltx4& ReplacementMask,
						const fltx4& a,
						const fltx4& b);  // 1011
				{
					fltx4 retVal; // 718
					_mm_and_ps(__m128 __A,
							__m128 __B);  // 719
				}
				AndSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				{
					fltx4 retVal; // 826
					_mm_xor_ps(__m128 __A,
							__m128 __B);  // 827
				}
				XorSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				{
					fltx4 retVal; // 826
					_mm_xor_ps(__m128 __A,
							__m128 __B);  // 827
				}
				XorSIMD<>(const fltx4& a,
						const fltx4& b);  // 1259
				MaskedAssign<>(const fltx4& ReplacementMask,
						const fltx4& a,
						const fltx4& b);  // 1012
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 496
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 497
				{
					fltx4 retVal; // 1616
					_mm_sub_ps(__m128 __A,
							__m128 __B);  // 1617
				}
				SubSIMD<>(const fltx4& a,
						const fltx4& b);  // 498
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 499
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 499
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 499
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 499
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 499
				FourVectors::DistToSqr(
						const FourVectors& pnt);  // 1005
				{
					fltx4 retVal; // 2067
					_mm_cmplt_ps(__m128 __A,
							__m128 __B);  // 2068
				}
				CmpLtSIMD<>(const fltx4& a,
						const fltx4& b);  // 1006
				CSOAContainer::NumCols(); // 1009
			}
			{
				int nCol; // 1032
			}
			CSOAContainer::NumQuadsPerRow(); // 999
			{
				fltx4 retVal; // 1134
				_mm_set1_ps(float __F); // 1135
			}
			ReplicateX4<>(float flValue); // 1002
			{
				fltx4 retVal; // 341
				_mm_shuffle_ps(__m128 __A,
						__m128 __B,
						const int  __mask);  // 342
			}
			RotateLeft<>(const fltx4& a); // 1017
			{
				fltx4 retVal; // 341
				_mm_shuffle_ps(__m128 __A,
						__m128 __B,
						const int  __mask);  // 342
			}
			RotateLeft<>(const fltx4& a); // 1018
			{
				fltx4 retVal; // 2067
				_mm_cmplt_ps(__m128 __A,
						__m128 __B);  // 2068
			}
			CmpLtSIMD<>(const fltx4& a,
					const fltx4& b);  // 1019
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 718
				_mm_and_ps(__m128 __A,
						__m128 __B);  // 719
			}
			AndSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			MaskedAssign<>(const fltx4& ReplacementMask,
					const fltx4& a,
					const fltx4& b);  // 1020
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 718
				_mm_and_ps(__m128 __A,
						__m128 __B);  // 719
			}
			AndSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			MaskedAssign<>(const fltx4& ReplacementMask,
					const fltx4& a,
					const fltx4& b);  // 1021
			{
				fltx4 retVal; // 373
				_mm_shuffle_ps(__m128 __A,
						__m128 __B,
						const int  __mask);  // 374
			}
			RotateLeft2<>(const fltx4& a); // 1023
			{
				fltx4 retVal; // 373
				_mm_shuffle_ps(__m128 __A,
						__m128 __B,
						const int  __mask);  // 374
			}
			RotateLeft2<>(const fltx4& a); // 1024
			{
				fltx4 retVal; // 2067
				_mm_cmplt_ps(__m128 __A,
						__m128 __B);  // 2068
			}
			CmpLtSIMD<>(const fltx4& a,
					const fltx4& b);  // 1025
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 718
				_mm_and_ps(__m128 __A,
						__m128 __B);  // 719
			}
			AndSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			MaskedAssign<>(const fltx4& ReplacementMask,
					const fltx4& a,
					const fltx4& b);  // 1026
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 718
				_mm_and_ps(__m128 __A,
						__m128 __B);  // 719
			}
			AndSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			{
				fltx4 retVal; // 826
				_mm_xor_ps(__m128 __A,
						__m128 __B);  // 827
			}
			XorSIMD<>(const fltx4& a,
					const fltx4& b);  // 1259
			MaskedAssign<>(const fltx4& ReplacementMask,
					const fltx4& a,
					const fltx4& b);  // 1027
		}
		CSOAContainer::NumRows(); // 1042
	}
	FourVectors::FourVectors(); // 984
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 987
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 991
	FourVectors::FourVectors(); // 990
	CSOAContainer::NumSlices(); // 1043
} /* size: 0, variables: 10, inline expansions: 8 (0 bytes) */

// <044F1A5E> tier0_perproject/utlsoacontainer.cpp:1057
// variables: 22
// function calls: 38
void CSOAContainer::AddGaussianSRBF(float flWeight, Vector vecDir, int nDirectionAttribute, int nScalarTargetAttribute)
{
	fltx4 fl4Weight; // 1061
	FourVectors v4Dir; // 1062
	FourVectors* pDirIn; // 1065
	size_t nRowToRowStride; // 1066
	fltx4* pTarget; // 1067
	size_t nRowToRowStrideTarget; // 1068
	int nRowCtr; // 1069
	{
		int nColCtr; // 1072
		{
			FourVectors v4InDir; // 1075
			fltx4 fl4ExpDot; // 1077
			fltx4 fl4Addend; // 1078
			FourVectors::FourVectors(
					const FourVectors& src);  // 1075
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 166
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 167
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 168
			FourVectors::operator*(
					const FourVectors& b);  // 1077
			SubFloat<>(const fltx4& a,
					int idx);  // 546
			SubFloat<>(const fltx4& a,
					int idx);  // 547
			SubFloat<>(const fltx4& a,
					int idx);  // 548
			SubFloat<>(const fltx4& a,
					int idx);  // 549
			NatExpSIMD(const fltx4& val); // 1077
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1078
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1079
		}
		CSOAContainer::NumQuadsPerRow(); // 1072
	}
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 1061
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 1065
	CSOAContainer::RowPtr<__vector(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 1067
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	FourVectors::DuplicateVector(
			const Vector& v);  // 1063
	FourVectors::FourVectors(); // 1062
	CSOAContainer::NumRows(); // 1069
	CSOAContainer::NumSlices(); // 1069
} /* size: 0, variables: 7, inline expansions: 10 (0 bytes) */

// <044F0C7F> tier0_perproject/utlsoacontainer.cpp:1087
// variables: 26
// function calls: 55
void CSOAContainer::AddGaussianSRBF(Vector vecWeight, Vector vecDir, int nDirectionAttribute, int nVectorTargetAttribute)
{
	FourVectors v4Weight; // 1092
	FourVectors v4Dir; // 1094
	FourVectors* pDirIn; // 1097
	size_t nRowToRowStride; // 1098
	FourVectors* pTarget; // 1099
	int nRowCtr; // 1100
	{
		int nColCtr; // 1103
		{
			fltx4 fl4ExpDot; // 1106
			FourVectors v4Addend; // 1107
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 166
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 167
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 1684
			MaddSIMD<>(const fltx4& a,
					const fltx4& b,
					const fltx4& c);  // 168
			FourVectors::operator*(
					const FourVectors& b);  // 1106
			SubFloat<>(const fltx4& a,
					int idx);  // 546
			SubFloat<>(const fltx4& a,
					int idx);  // 547
			SubFloat<>(const fltx4& a,
					int idx);  // 548
			SubFloat<>(const fltx4& a,
					int idx);  // 549
			NatExpSIMD(const fltx4& val); // 1106
			FourVectors::FourVectors(
					const FourVectors& src);  // 1107
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 153
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 154
			{
				fltx4 retVal; // 1639
				_mm_mul_ps(__m128 __A,
						__m128 __B);  // 1640
			}
			MulSIMD<>(const fltx4& a,
					const fltx4& b);  // 155
			FourVectors::operator*=(
					const fltx4& scale);  // 1108
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 129
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 129
			{
				fltx4 retVal; // 1593
				_mm_add_ps(__m128 __A,
						__m128 __B);  // 1594
			}
			AddSIMD<>(const fltx4& a,
					const fltx4& b);  // 129
			FourVectors::ApplyBinaryUpdateFunction<AddSIMD<> >(
								const FourVectors& v4Arg);  // 129
			FourVectors::operator+=(
					const FourVectors& b);  // 1109
		}
		CSOAContainer::NumQuadsPerRow(); // 1103
	}
	FourVectors::FourVectors(); // 1092
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	FourVectors::DuplicateVector(
			const Vector& v);  // 1093
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 1099
	CSOAContainer::RowPtr<FourVectors>(
				int nAttributeIdx,
				int nRowNumber,
				int nSliceNumber);  // 1097
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 98
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 99
	{
		fltx4 retVal; // 1134
		_mm_set1_ps(float __F); // 1135
	}
	ReplicateX4<>(float flValue); // 100
	FourVectors::DuplicateVector(
			const Vector& v);  // 1095
	FourVectors::FourVectors(); // 1094
	CSOAContainer::NumRows(); // 1100
	CSOAContainer::NumSlices(); // 1100
} /* size: 0, variables: 6, inline expansions: 14 (0 bytes) */

// <044C2B08> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 12
void ResampleAttributeInternal<(EResampleHorzMode)2, __vector(4) float>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					float* pSrc; // 1133
					float* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
				}
			}
		}
	}
} /* size: 0 */

// <044C243A> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 18
// function calls: 21
void ResampleAttributeInternal<(EResampleHorzMode)0, __vector(4) float>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					float* pSrc; // 1133
					float* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					{
						fltx4 aacc; // 2890
						fltx4 bbdd; // 2892
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2891
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2893
						{
							fltx4 retVal; // 602
							_mm_load_ps(const float* __P); // 603
						}
						LoadAlignedSIMD<>(const void* pSIMD); // 2894
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 2894
					}
					Compress4SIMD<>(const fltx4  a,
							const fltx4& b,
							const fltx4& c,
							const fltx4& d);  // 1140
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044C202A> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 13
// function calls: 11
void ResampleAttributeInternal<(EResampleHorzMode)1, __vector(4) float>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					float* pSrc; // 1133
					float* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					{
						fltx4 retVal; // 2769
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2770
					}
					CompressSIMD<>(const fltx4& a,
							const fltx4& b);  // 1148
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044C1C49> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 12
// function calls: 11
void ResampleAttributeInternal<(EResampleHorzMode)3, __vector(4) float>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					float* pSrc; // 1133
					float* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
							CSOAContainer::NumCols(); // 1163
						}
						CSOAContainer::NumCols(); // 1159
						CSOAContainer::NumCols(); // 1159
					}
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1134
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044C1B52> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 12
void ResampleAttributeInternal<(EResampleHorzMode)2, FourVectors>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					FourVectors* pSrc; // 1133
					FourVectors* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
				}
			}
		}
	}
} /* size: 0 */

// <044C0E9C> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 28
// function calls: 44
void ResampleAttributeInternal<(EResampleHorzMode)0, FourVectors>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					FourVectors* pSrc; // 1133
					FourVectors* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					FourVectors::FourVectors(); // 1677
					{
						fltx4 aacc; // 2890
						fltx4 bbdd; // 2892
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2891
						{
							fltx4 retVal; // 602
							_mm_load_ps(const float* __P); // 603
						}
						LoadAlignedSIMD<>(const void* pSIMD); // 2894
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2893
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 2894
					}
					Compress4SIMD<>(const fltx4  a,
							const fltx4& b,
							const fltx4& c,
							const fltx4& d);  // 1678
					{
						fltx4 aacc; // 2890
						fltx4 bbdd; // 2892
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2893
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2891
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 2894
					}
					Compress4SIMD<>(const fltx4  a,
							const fltx4& b,
							const fltx4& c,
							const fltx4& d);  // 1679
					{
						fltx4 aacc; // 2890
						fltx4 bbdd; // 2892
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2891
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2893
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 2894
					}
					Compress4SIMD<>(const fltx4  a,
							const fltx4& b,
							const fltx4& c,
							const fltx4& d);  // 1680
					Compress4SIMD(const FourVectors& a,
							const FourVectors& b,
							const FourVectors& c,
							const FourVectors& d);  // 1140
					FourVectors::operator=(
							const FourVectors& src);  // 1140
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044C08F0> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 15
// function calls: 18
void ResampleAttributeInternal<(EResampleHorzMode)1, FourVectors>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					FourVectors* pSrc; // 1133
					FourVectors* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
						}
					}
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					FourVectors::FourVectors(); // 1667
					{
						fltx4 retVal; // 2769
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2770
					}
					CompressSIMD<>(const fltx4& a,
							const fltx4& b);  // 1668
					{
						fltx4 retVal; // 2769
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2770
					}
					CompressSIMD<>(const fltx4& a,
							const fltx4& b);  // 1669
					{
						fltx4 retVal; // 2769
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 2770
					}
					CompressSIMD<>(const fltx4& a,
							const fltx4& b);  // 1670
					CompressSIMD(const FourVectors& a,
							const FourVectors& b);  // 1148
					FourVectors::operator=(
							const FourVectors& src);  // 1148
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044C050F> tier0_perproject/utlsoacontainer.cpp:1124
// variables: 12
// function calls: 11
void ResampleAttributeInternal<(EResampleHorzMode)3, FourVectors>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	{
		int s; // 1127
		{
			int srcs; // 1129
			{
				int r; // 1130
				{
					int srcr; // 1132
					FourVectors* pSrc; // 1133
					FourVectors* pDest; // 1134
					int n; // 1135
					{
						float flDU; // 1159
						float flU; // 1160
						float* pDestValue; // 1161
						const float* pSrcValue; // 1162
						{
							int i; // 1163
							CSOAContainer::NumCols(); // 1163
						}
						CSOAContainer::NumCols(); // 1159
						CSOAContainer::NumCols(); // 1159
					}
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1133
					CSOAContainer::NumRows(); // 1132
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1134
				}
				CSOAContainer::NumRows(); // 1130
			}
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			CSOAContainer::NumSlices(); // 1129
		}
		CSOAContainer::NumSlices(); // 1127
	}
} /* size: 0 */

// <044D5CFE> tier0_perproject/utlsoacontainer.cpp:1173
// variables: 10
// function calls: 14
void ResampleAttributeInternalDType<__vector(4) float>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	int nSrcW; // 1175
	int nDstW; // 1176
	CSOAContainer::NumCols(); // 1175
	CSOAContainer::NumCols(); // 1176
	{
		int s; // 1127
		CSOAContainer::NumSlices(); // 1127
		{
			int srcs; // 1129
			CSOAContainer::NumSlices(); // 1129
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			{
				int r; // 1130
				CSOAContainer::NumRows(); // 1130
				{
					int srcr; // 1132
					float* pSrc; // 1133
					float* pDest; // 1134
					int n; // 1135
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1133
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					memcpy(void* __dest,
						const void* __src,
						size_t __len);  // 91
					V_memcpy(void* dest,
						const void* src,
						size_t count);  // 1154
					CSOAContainer::NumRows(); // 1132
				}
			}
		}
	}
	ResampleAttributeInternal<(EResampleHorzMode)2, __vector(4) float>(CSOAContainer& src,
										CSOAContainer& dst,
										int nSrcAttr,
										int nDestAttr); // 1179
} /* size: 0, variables: 2, inline expansions: 3 (0 bytes) */

// <044D5862> tier0_perproject/utlsoacontainer.cpp:1173
// variables: 10
// function calls: 14
void ResampleAttributeInternalDType<FourVectors>(CSOAContainer& src, CSOAContainer& dst, int nSrcAttr, int nDestAttr)
{
	int nSrcW; // 1175
	int nDstW; // 1176
	CSOAContainer::NumCols(); // 1175
	CSOAContainer::NumCols(); // 1176
	{
		int s; // 1127
		CSOAContainer::NumSlices(); // 1127
		{
			int srcs; // 1129
			CSOAContainer::NumSlices(); // 1129
			RemapVal(float val,
				float A,
				float B,
				float C,
				float D);  // 1129
			{
				int r; // 1130
				CSOAContainer::NumRows(); // 1130
				{
					int srcr; // 1132
					FourVectors* pSrc; // 1133
					FourVectors* pDest; // 1134
					int n; // 1135
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1133
					RemapVal(float val,
						float A,
						float B,
						float C,
						float D);  // 1132
					CSOAContainer::RowPtr<FourVectors>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1134
					CSOAContainer::NumQuadsPerRow(); // 1135
					memcpy(void* __dest,
						const void* __src,
						size_t __len);  // 91
					V_memcpy(void* dest,
						const void* src,
						size_t count);  // 1154
					CSOAContainer::NumRows(); // 1132
				}
			}
		}
	}
	ResampleAttributeInternal<(EResampleHorzMode)2, FourVectors>(CSOAContainer& src,
									CSOAContainer& dst,
									int nSrcAttr,
									int nDestAttr); // 1179
} /* size: 0, variables: 2, inline expansions: 3 (0 bytes) */

// <044F0B48> tier0_perproject/utlsoacontainer.cpp:1201
// variables: 2
void CSOAContainer::ResampleAttribute(CSOAContainer& src, int nSrcAttr, int nDestAttr)
{
	const char   __FUNCTION__; // 6697
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1207
	}
} /* size: 0, variables: 1 */

// <01B4C25A> tier0_perproject/utlsoacontainer.cpp:1201
// variables: 2
void CSOAContainer::ResampleAttribute(CSOAContainer& src, int nSrcAttr, int nDestAttr)
{
	const char   __FUNCTION__; // 47086
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1207
	}
} /* size: 0, variables: 1 */

// <009D1ABD> tier0_perproject/utlsoacontainer.cpp:1201
// variables: 2
void CSOAContainer::ResampleAttribute(CSOAContainer& src, int nSrcAttr, int nDestAttr)
{
	const char   __FUNCTION__; // 39806
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1207
	}
} /* size: 0, variables: 1 */

// <044817D2> tier0_perproject/utlsoacontainer.cpp:1227
// member function: 1
// member variables: 9
// struct size: 56
struct KMeansQuantizationWorkUnit {
	CSOAContainer * m_pContainer; /* 0 8 */
	int m_nRowIndex; /* 8 4 */
	int m_nNumResultsDesired; /* 12 4 */
	IKMeansErrorMetric * m_pErrorCalculator; /* 16 8 */
	const int * m_pFieldIndices; /* 24 8 */
	int m_nNumFields; /* 32 4 */
	int m_nFieldToStoreIndexInto; /* 36 4 */
	KMeansQuantizedValue * m_pOutValues; /* 40 8 */
	int m_nErrorChannel; /* 48 4 */
	/* tier0_perproject/utlsoacontainer.cpp:1238 */
	void Process(KMeansQuantizationWorkUnit* );
};

// <044F0AFA> tier0_perproject/utlsoacontainer.cpp:1243
void DoKMeansWork(KMeansQuantizationWorkUnit& jobDesc)
{
} /* size: 0 */

// <044F0133> tier0_perproject/utlsoacontainer.cpp:1248
// variables: 31
// function calls: 32
void KMeansQuantizationWorkUnit::Process()
{
	FourVectors v4SamplePositions; // 1250
	const char   __FUNCTION__; // 6550
	{
		int nZ; // 1251
		{
			int nY; // 1254
			{
				KMeansSampleDescriptor samples; // 1257
				fltx4* pIndexOut; // 1262
				fltx4* pErrOut; // 1263
				int nXSize; // 1271
				{
					int c; // 1258
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1260
				}
				{
					fltx4 fl4SampleIdx; // 1274
					fltx4 fl4ClosestError; // 1275
					fltx4 fl4BestSampleIdx; // 1276
					{
						int n; // 1277
						{
							fltx4 fl4TrialError; // 1279
							fltx4 fl4BetterMask; // 1282
							{
								fltx4 retVal; // 1593
								_mm_add_ps(__m128 __A,
										__m128 __B);  // 1594
							}
							AddSIMD<>(const fltx4& a,
									const fltx4& b);  // 1285
							{
								fltx4 retVal; // 2095
								_mm_cmple_ps(__m128 __A,
										__m128 __B);  // 2096
							}
							CmpLeSIMD<>(const fltx4& a,
									const fltx4& b);  // 1282
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1283
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1284
						}
					}
					{
						const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1294
					}
					{
						int s; // 1296
						{
							int nIdx; // 1298
							{
								int c; // 1299
								SubFloat<>(fltx4& a,
										int idx);  // 1301
							}
						}
					}
					{
						int c; // 1306
					}
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 1311
				}
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 1256
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1262
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1266
				CSOAContainer::NumQuadsPerRow(); // 1271
			}
			CSOAContainer::NumRows(); // 1254
		}
		CSOAContainer::NumSlices(); // 1251
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 1253
	}
	FourVectors::FourVectors(); // 1250
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <01B4B845> tier0_perproject/utlsoacontainer.cpp:1248
// variables: 31
// function calls: 32
void KMeansQuantizationWorkUnit::Process()
{
	FourVectors v4SamplePositions; // 1250
	const char   __FUNCTION__; // 46939
	{
		int nZ; // 1251
		{
			int nY; // 1254
			{
				KMeansSampleDescriptor samples; // 1257
				fltx4* pIndexOut; // 1262
				fltx4* pErrOut; // 1263
				int nXSize; // 1271
				{
					int c; // 1258
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1260
				}
				{
					fltx4 fl4SampleIdx; // 1274
					fltx4 fl4ClosestError; // 1275
					fltx4 fl4BestSampleIdx; // 1276
					{
						int n; // 1277
						{
							fltx4 fl4TrialError; // 1279
							fltx4 fl4BetterMask; // 1282
							{
								fltx4 retVal; // 1593
								_mm_add_ps(__m128 __A,
										__m128 __B);  // 1594
							}
							AddSIMD<>(const fltx4& a,
									const fltx4& b);  // 1285
							{
								fltx4 retVal; // 2095
								_mm_cmple_ps(__m128 __A,
										__m128 __B);  // 2096
							}
							CmpLeSIMD<>(const fltx4& a,
									const fltx4& b);  // 1282
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1283
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1284
						}
					}
					{
						const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1294
					}
					{
						int s; // 1296
						{
							int nIdx; // 1298
							{
								int c; // 1299
								SubFloat<>(fltx4& a,
										int idx);  // 1301
							}
						}
					}
					{
						int c; // 1306
					}
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 1311
				}
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 1256
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1262
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1266
				CSOAContainer::NumQuadsPerRow(); // 1271
			}
			CSOAContainer::NumRows(); // 1254
		}
		CSOAContainer::NumSlices(); // 1251
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 1253
	}
	FourVectors::FourVectors(); // 1250
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <009D10A8> tier0_perproject/utlsoacontainer.cpp:1248
// variables: 31
// function calls: 32
void KMeansQuantizationWorkUnit::Process()
{
	FourVectors v4SamplePositions; // 1250
	const char   __FUNCTION__; // 39659
	{
		int nZ; // 1251
		{
			int nY; // 1254
			{
				KMeansSampleDescriptor samples; // 1257
				fltx4* pIndexOut; // 1262
				fltx4* pErrOut; // 1263
				int nXSize; // 1271
				{
					int c; // 1258
					CSOAContainer::RowPtr<__vector(
									int nAttributeIdx,
									int nRowNumber,
									int nSliceNumber);  // 1260
				}
				{
					fltx4 fl4SampleIdx; // 1274
					fltx4 fl4ClosestError; // 1275
					fltx4 fl4BestSampleIdx; // 1276
					{
						int n; // 1277
						{
							fltx4 fl4TrialError; // 1279
							fltx4 fl4BetterMask; // 1282
							{
								fltx4 retVal; // 1593
								_mm_add_ps(__m128 __A,
										__m128 __B);  // 1594
							}
							AddSIMD<>(const fltx4& a,
									const fltx4& b);  // 1285
							{
								fltx4 retVal; // 2095
								_mm_cmple_ps(__m128 __A,
										__m128 __B);  // 2096
							}
							CmpLeSIMD<>(const fltx4& a,
									const fltx4& b);  // 1282
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1283
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 718
								_mm_and_ps(__m128 __A,
										__m128 __B);  // 719
							}
							AndSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							{
								fltx4 retVal; // 826
								_mm_xor_ps(__m128 __A,
										__m128 __B);  // 827
							}
							XorSIMD<>(const fltx4& a,
									const fltx4& b);  // 1259
							MaskedAssign<>(const fltx4& ReplacementMask,
									const fltx4& a,
									const fltx4& b);  // 1284
						}
					}
					{
						const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1294
					}
					{
						int s; // 1296
						{
							int nIdx; // 1298
							{
								int c; // 1299
								SubFloat<>(fltx4& a,
										int idx);  // 1301
							}
						}
					}
					{
						int c; // 1306
					}
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 1311
				}
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 1256
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1262
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1266
				CSOAContainer::NumQuadsPerRow(); // 1271
			}
			CSOAContainer::NumRows(); // 1254
		}
		CSOAContainer::NumSlices(); // 1251
		{
			fltx4 retVal; // 1134
			_mm_set1_ps(float __F); // 1135
		}
		ReplicateX4<>(float flValue); // 1253
	}
	FourVectors::FourVectors(); // 1250
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <044EF442> tier0_perproject/utlsoacontainer.cpp:1319
// variables: 21
// function calls: 39
void CSOAContainer::KMeansQuantization(const int* pFieldIndices, int nNumFields, KMeansQuantizedValue* pOutValues, int nNumResultsDesired, IKMeansErrorMetric* pErrorCalculator, int nFieldToStoreIndexInto, int nNumIterations, int nChannelToReceiveErrorSignal)
{
	HaltonSequenceGenerator_t xSequence; // 1326
	HaltonSequenceGenerator_t ySequence; // 1327
	HaltonSequenceGenerator_t zSequence; // 1328
	{
		int i; // 1329
		{
			int nX; // 1331
			int nY; // 1332
			int nZ; // 1333
			{
				int c; // 1335
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1337
				{
					fltx4 retVal; // 1134
					_mm_set1_ps(float __F); // 1135
				}
				ReplicateX4<>(float flValue); // 1337
			}
			CSOAContainer::NumCols(); // 1331
			HaltonSequenceGenerator_t::NextValue(); // 1331
			HaltonSequenceGenerator_t::NextValue(); // 1332
			CSOAContainer::NumRows(); // 1332
			HaltonSequenceGenerator_t::NextValue(); // 1333
			CSOAContainer::NumSlices(); // 1333
			{
				fltx4 retVal; // 1134
				_mm_set1_ps(float __F); // 1135
			}
			ReplicateX4<>(float flValue); // 99
			{
				fltx4 retVal; // 1134
				_mm_set1_ps(float __F); // 1135
			}
			ReplicateX4<>(float flValue); // 98
			{
				fltx4 retVal; // 1134
				_mm_set1_ps(float __F); // 1135
			}
			ReplicateX4<>(float flValue); // 100
			FourVectors::DuplicateVector(
					const Vector& v);  // 1334
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 1334
		}
	}
	{
		KMeansQuantizationWorkUnit jobs; // 1350
		{
			int i; // 1344
			memset(void* __dest,
				int __ch,
				size_t __len);  // 67
			V_memset(void* dest,
				int fill,
				size_t count);  // 1346
			memset(void* __dest,
				int __ch,
				size_t __len);  // 67
			V_memset(void* dest,
				int fill,
				size_t count);  // 1347
		}
		{
			int i; // 1351
		}
		{
			int n; // 1366
			{
				float flOOWeight; // 1378
				{
					int j; // 1369
					{
						int c; // 1372
					}
				}
				{
					int c; // 1379
					{
						fltx4 retVal; // 1134
						_mm_set1_ps(float __F); // 1135
					}
					ReplicateX4<>(float flValue); // 1381
				}
			}
		}
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 415
		ThreadInterlockedExchangePointer(volatile void** p,
						void* value);  // 800
		CInterlockedPtr<KMeansQuantizationWorkUnit>::operator=(
				KMeansQuantizationWorkUnit* newValue);  // 819
		CParallelProcessorAbstract_Base::CParallelProcessorAbstract_Base(
						IThreadPool* pThreadPool);  // 564
		IMultipleWorkerJob::IMultipleWorkerJob(); // 564
		CParallelProcessorAbstract(const CParallelProcessorAbstract<CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationW this,
						CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationWorkUnit>, 1>* pController,
						IThreadPool* pThreadPool);  // 825
		IMultipleWorkerJob::~IMultipleWorkerJob(); // 559
		~CParallelProcessorAbstract(const CParallelProcessorAbstract<CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationW this); // 827
		CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationWorkUnit>, 1>::Run(
			KMeansQuantizationWorkUnit* pItems,
			unsigned int nItems,
			int nChunkSize,
			int nMaxParallel,
			IThreadPool* pThreadPool);  // 814
		CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationWorkUnit>, 1>::Run(
			KMeansQuantizationWorkUnit* pItems,
			unsigned int nItems,
			int nChunkSize,
			int nMaxParallel,
			IThreadPool* pThreadPool);  // 957
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 811
		CInterlockedPtr<KMeansQuantizationWorkUnit>::CInterlockedPtr(); // 811
		CParallelProcessor<KMeansQuantizationWorkUnit, CFuncJobItemProcessor<KMeansQuantizationWorkUnit>, 1>::CParallelProcessor(
					const char* pszDescription);  // 955
		CFuncJobItemProcessor<KMeansQuantizationWorkUnit>::Init(
			void (*pfnProcess)(KMeansQuantizationWorkUnit &),
			void (*pfnBegin)(void),
			void (*pfnEnd)(void));  // 956
		ParallelProcess<KMeansQuantizationWorkUnit>(const char* pszDescription,
								KMeansQuantizationWorkUnit* pItems,
								unsigned int nItems,
								void (*pfnProcess)(KMeansQuantizationWorkUnit &),
								void (*pfnBegin)(void),
								void (*pfnEnd)(void),
								int nMaxParallel);  // 1363
	}
} /* size: 0, variables: 3 */

// <044EE739> tier0_perproject/utlsoacontainer.cpp:1392
// variables: 41
// function calls: 44
void CSOAContainer::UpdateDistanceRow(int nSearchRadius, int nMinX, int nMaxX, int nY, int nZ, int nSrcField, int nDestField)
{
	const float* pDataIn; // 1395
	float* pDataOut; // 1396
	int nStartY; // 1398
	int nEndY; // 1399
	int nStartZ; // 1401
	int nEndZ; // 1402
	fltx4 fl4Thresh; // 1404
	{
		int x; // 1405
		{
			float flReferenceValue; // 1407
			fltx4 fl4ReferenceValue; // 1409
			fltx4 fl4ClosestDistance; // 1410
			int nStartX; // 1412
			int nEndX; // 1413
			int nCount; // 1417
			float flClosestDistance; // 1439
			{
				int z1; // 1418
				{
					int y1; // 1420
					{
						fltx4 fl4YZDist; // 1422
						fltx4 fl4SrcXDiff; // 1423
						fltx4* pfl4SrcData; // 1424
						{
							int x1; // 1425
							{
								fltx4 fl4SrcData; // 1428
								fltx4 fl4Distance; // 1430
								{
									fltx4 retVal; // 1593
									_mm_add_ps(__m128 __A,
											__m128 __B);  // 1594
								}
								AddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1434
								{
									fltx4 retVal; // 1639
									_mm_mul_ps(__m128 __A,
											__m128 __B);  // 1640
								}
								MulSIMD<>(const fltx4& a,
										const fltx4& b);  // 1430
								{
									fltx4 retVal; // 1981
									_mm_cmpgt_ps(__m128 __A,
											__m128 __B);  // 1982
								}
								CmpGtSIMD<>(const fltx4& a,
										const fltx4& b);  // 1429
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 718
									_mm_and_ps(__m128 __A,
											__m128 __B);  // 719
								}
								AndSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								MaskedAssign<>(const fltx4& ReplacementMask,
										const fltx4& a,
										const fltx4& b);  // 1429
								{
									fltx4 retVal; // 1593
									_mm_add_ps(__m128 __A,
											__m128 __B);  // 1594
								}
								AddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1430
								{
									fltx4 retVal; // 2350
									_mm_sqrt_ps(__m128 __A); // 2351
								}
								SqrtSIMD<>(const fltx4& a); // 1430
								{
									fltx4 retVal; // 1851
									_mm_cmpeq_ps(__m128 __A,
											__m128 __B);  // 1852
								}
								CmpEqSIMD<>(const fltx4& a,
										const fltx4& b);  // 1432
								{
									fltx4 retVal; // 2067
									_mm_cmplt_ps(__m128 __A,
											__m128 __B);  // 2068
								}
								CmpLtSIMD<>(const fltx4& a,
										const fltx4& b);  // 1432
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 718
									_mm_and_ps(__m128 __A,
											__m128 __B);  // 719
								}
								AndSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								MaskedAssign<>(const fltx4& ReplacementMask,
										const fltx4& a,
										const fltx4& b);  // 1431
								{
									fltx4 retVal; // 767
									_mm_andnot_ps(__m128 __A,
											__m128 __B);  // 768
								}
								AndNotSIMD<>(const fltx4& a,
										const fltx4& b);  // 1432
							}
						}
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1423
						{
							fltx4 retVal; // 1134
							_mm_set1_ps(float __F); // 1135
						}
						ReplicateX4<>(float flValue); // 1422
						{
							fltx4 retVal; // 1134
							_mm_set1_ps(float __F); // 1135
						}
						ReplicateX4<>(float flValue); // 1423
						CSOAContainer::RowPtr<__vector(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 1424
					}
				}
			}
			{
				fltx4 retVal; // 1134
				_mm_set1_ps(float __F); // 1135
			}
			ReplicateX4<>(float flValue); // 1410
			CSOAContainer::NumCols(); // 1413
		}
	}
	CSOAContainer::RowPtr<float>(
			int nAttributeIdx,
			int nRowNumber,
			int nSliceNumber);  // 1395
	CSOAContainer::RowPtr<float>(
			int nAttributeIdx,
			int nRowNumber,
			int nSliceNumber);  // 1396
	CSOAContainer::NumRows(); // 1399
	CSOAContainer::NumSlices(); // 1402
} /* size: 874, variables: 7, inline expansions: 4 (59 bytes) */

// <044EDC5B> tier0_perproject/utlsoacontainer.cpp:1452
// variables: 13
// function calls: 38
void CSOAContainer::GenerateDistanceField(int nSrcField, int nDestField, int nMaxDistance, Rect3D_t* pRect)
{
	int nMinX; // 1456
	int nMaxX; // 1456
	int nMinY; // 1456
	int nMaxY; // 1456
	int nMinZ; // 1456
	int nMaxZ; // 1456
	CCallQueue workList; // 1498
	{
		int z; // 1499
		{
			int y; // 1501
			{
				CCallQueue::ResumeProcessing(); // 115
				_Function_base::_Function_base(); // 407
				function<void()>::operator bool()>* this); // 409
				function<void()>::function(
					function<void()>& __x); // 102
				CCallQueue::QueueCall(
						function<void()>& fnCall);  // 96
				function<void()>::operator()(const function<void()>* this); // 110
				CCallQueue::QueueCall(
						function<void()>& fnCall);  // 1503
				_Function_base::~_Function_base(); // 336
				function<void()>::~function()>* this); // 1503
				{
					_M_create<CSOAContainer::GenerateDistanceField(int, int, int, Rect3D_t*)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
					_M_init_functor<CSOAContainer::GenerateDistanceField(int, int, int, Rect3D_t*)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
					_M_not_empty_function<CSOAContainer::GenerateDistanceField(int, int, int, Rect3D_t*)::<lambda()> >(const &); // 449
				}
				_Function_base::_Function_base(); // 439
				function<void()>::function<CSOAContainer::GenerateDistanceField(
															class& __f); // 1503
			}
		}
	}
	CSOAContainer::NumRows(); // 1471
	CSOAContainer::NumSlices(); // 1472
	CSOAContainer::NumCols(); // 1470
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 862
	CTSListBase::CTSListBase(); // 846
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
	Node_t::Node_t(); // 864
	CTSQueue<std::function<void()>::End()>*, false>* this); // 865
	CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
	CCallQueue::CCallQueue(); // 1498
	ThreadPause(void); // 173
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 168
	CTSListBase::Push(
		TSLNodeBase_t* pNode);  // 1080
	CTSQueue<std::function<void()>::FreeNode(
		Node_t* pNode); // 1103
	CTSQueue<std::function<void()>::PopItem(
		function<void()>** pResult); // 75
	_Function_base::~_Function_base(); // 336
	function<void()>::~function()>* this); // 77
	CCallQueue::ResumeProcessing(); // 80
	CCallQueue::Flush(); // 17
	CCallQueue::~CCallQueue(); // 1509
} /* size: 0, variables: 7, inline expansions: 22 (0 bytes) */

// <044ED7C5> tier0_perproject/utlsoacontainer.cpp:1511
// variables: 9
// function calls: 10
void CSOAContainer::CopyRegionFrom(const CSOAContainer& src, int nSrcAttr, int nDestAttr, int nSrcMinX, int nSrcMaxX, int nSrcMinY, int nSrcMaxY, int nSrcMinZ, int nSrcMaxZ, int nDestX, int nDestY, int nDestZ)
{
	const char   __FUNCTION__; // 6634
	size_t nRowSize; // 1518
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1515
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1516
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1517
	}
	{
		int z; // 1519
		{
			int y; // 1521
			{
				const uint8* pSrc; // 1523
				uint8* pDest; // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1523
				CSOAContainer::ItemByteStride(
						int nAttributeIdx);  // 1523
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1525
			}
		}
	}
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1515
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1516
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1518
} /* size: 0, variables: 2, inline expansions: 5 (0 bytes) */

// <01B48ED7> tier0_perproject/utlsoacontainer.cpp:1511
// variables: 9
// function calls: 10
void CSOAContainer::CopyRegionFrom(const CSOAContainer& src, int nSrcAttr, int nDestAttr, int nSrcMinX, int nSrcMaxX, int nSrcMinY, int nSrcMaxY, int nSrcMinZ, int nSrcMaxZ, int nDestX, int nDestY, int nDestZ)
{
	const char   __FUNCTION__; // 47023
	size_t nRowSize; // 1518
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1515
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1516
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1517
	}
	{
		int z; // 1519
		{
			int y; // 1521
			{
				const uint8* pSrc; // 1523
				uint8* pDest; // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1523
				CSOAContainer::ItemByteStride(
						int nAttributeIdx);  // 1523
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1525
			}
		}
	}
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1515
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1516
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1518
} /* size: 0, variables: 2, inline expansions: 5 (0 bytes) */

// <009CE73A> tier0_perproject/utlsoacontainer.cpp:1511
// variables: 9
// function calls: 10
void CSOAContainer::CopyRegionFrom(const CSOAContainer& src, int nSrcAttr, int nDestAttr, int nSrcMinX, int nSrcMaxX, int nSrcMinY, int nSrcMaxY, int nSrcMinZ, int nSrcMaxZ, int nDestX, int nDestY, int nDestZ)
{
	const char   __FUNCTION__; // 39743
	size_t nRowSize; // 1518
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1515
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1516
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1517
	}
	{
		int z; // 1519
		{
			int y; // 1521
			{
				const uint8* pSrc; // 1523
				uint8* pDest; // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1524
				CSOAContainer::RowPtr<unsigned char>(
							int nAttributeIdx,
							int nRowNumber,
							int nSliceNumber);  // 1523
				CSOAContainer::ItemByteStride(
						int nAttributeIdx);  // 1523
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1525
			}
		}
	}
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1515
	CSOAContainer::HasAllocatedMemory(
				int nAttrIdx);  // 1516
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1517
	CSOAContainer::ItemByteStride(
			int nAttributeIdx);  // 1518
} /* size: 0, variables: 2, inline expansions: 5 (0 bytes) */

// <044ED4FD> tier0_perproject/utlsoacontainer.cpp:1530
// variables: 3
// function calls: 6
void CSOAContainer::CopyRegionFrom(const CSOAContainer& src, int nSrcMinX, int nSrcMaxX, int nSrcMinY, int nSrcMaxY, int nSrcMinZ, int nSrcMaxZ, int nDestX, int nDestY, int nDestZ)
{
	{
		CSOAAttributeIterator i; // 1534
		CSOAAttributeIterator::CSOAAttributeIterator(); // 99
		{
			int i; // 102
			CSOAContainer::HasAllocatedMemory(
						int nAttrIdx);  // 104
		}
		CSOAContainer::FirstAttr(); // 1534
		{
			int i; // 1647
			CSOAContainer::HasAllocatedMemory(
						int nAttrIdx);  // 1649
		}
		CSOAAttributeIterator::Next(); // 231
		CSOAAttributeIterator::operator++(
				int);  // 1534
	}
} /* size: 0 */

// <044ECD2A> tier0_perproject/utlsoacontainer.cpp:1543
// variables: 8
// function calls: 25
void CSOAContainer::Crop(int x1, int y1, int z1, int nWidth, int nHeight, int nDepth)
{
	int x2; // 1551
	int y2; // 1552
	int z2; // 1553
	const char   __FUNCTION__; // 6508
	CSOAContainer oldPixels; // 1562
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1557
	}
	CSOAContainer::NumCols(); // 1546
	CSOAContainer::NumSlices(); // 1555
	CSOAContainer::NumRows(); // 1546
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1482
	CSOAContainer::CSOAContainer(); // 1562
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 82
	CSOAContainer::Purge(); // 1614
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1617
	CSOAContainer::MoveDataFrom(
			CSOAContainer& other);  // 1563
	{
		int i; // 167
		{
			bool bAllocate; // 171
		}
	}
	CSOAContainer::SetAttributeDataTypesFrom(
					const CSOAContainer& other);  // 1566
	CSOAContainer::Purge(); // 75
	CSOAContainer::~CSOAContainer(); // 1570
	CSOAContainer::NumSlices(); // 1546
} /* size: 0, variables: 5, inline expansions: 25 (0 bytes) */

// <01B4843C> tier0_perproject/utlsoacontainer.cpp:1543
// variables: 8
// function calls: 25
void CSOAContainer::Crop(int x1, int y1, int z1, int nWidth, int nHeight, int nDepth)
{
	int x2; // 1551
	int y2; // 1552
	int z2; // 1553
	const char   __FUNCTION__; // 46897
	CSOAContainer oldPixels; // 1562
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1557
	}
	CSOAContainer::NumCols(); // 1546
	CSOAContainer::NumSlices(); // 1555
	CSOAContainer::NumRows(); // 1546
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1482
	CSOAContainer::CSOAContainer(); // 1562
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 82
	CSOAContainer::Purge(); // 1614
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1617
	CSOAContainer::MoveDataFrom(
			CSOAContainer& other);  // 1563
	{
		int i; // 167
		{
			bool bAllocate; // 171
		}
	}
	CSOAContainer::SetAttributeDataTypesFrom(
					const CSOAContainer& other);  // 1566
	CSOAContainer::Purge(); // 75
	CSOAContainer::~CSOAContainer(); // 1570
	CSOAContainer::NumSlices(); // 1546
} /* size: 0, variables: 5, inline expansions: 25 (0 bytes) */

// <009CDC9F> tier0_perproject/utlsoacontainer.cpp:1543
// variables: 8
// function calls: 25
void CSOAContainer::Crop(int x1, int y1, int z1, int nWidth, int nHeight, int nDepth)
{
	int x2; // 1551
	int y2; // 1552
	int z2; // 1553
	const char   __FUNCTION__; // 39617
	CSOAContainer oldPixels; // 1562
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1557
	}
	CSOAContainer::NumCols(); // 1546
	CSOAContainer::NumSlices(); // 1555
	CSOAContainer::NumRows(); // 1546
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1482
	CSOAContainer::CSOAContainer(); // 1562
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 82
	CSOAContainer::Purge(); // 1614
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 900
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 901
	CSOAContainer::Init(); // 1617
	CSOAContainer::MoveDataFrom(
			CSOAContainer& other);  // 1563
	{
		int i; // 167
		{
			bool bAllocate; // 171
		}
	}
	CSOAContainer::SetAttributeDataTypesFrom(
					const CSOAContainer& other);  // 1566
	CSOAContainer::Purge(); // 75
	CSOAContainer::~CSOAContainer(); // 1570
	CSOAContainer::NumSlices(); // 1546
} /* size: 0, variables: 5, inline expansions: 25 (0 bytes) */

// <044BFF6E> tier0_perproject/utlsoacontainer.cpp:1573
inline int WrapOrClamp<true>(int nC, int nLimit)
{
} /* size: 0 */

// <044BFECD> tier0_perproject/utlsoacontainer.cpp:1573
inline int WrapOrClamp<false>(int nC, int nLimit)
{
} /* size: 0 */

// <044ECCEC> tier0_perproject/utlsoacontainer.cpp:1585
inline int WrapOrClamp(int nC, int nLimit, bool bClamp)
{
} /* size: 0 */

// <044D502C> tier0_perproject/utlsoacontainer.cpp:1597
// variables: 17
// function calls: 22
void CSOAContainer::FilterFromPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr, int nFilterDimX, int nFilterDimY, int nFilterDimZ, const float* pFilterCoefficients)
{
	int nSrcXScale; // 1600
	int nSrcYScale; // 1601
	int nSrcZScale; // 1602
	{
		int z; // 1603
		{
			int y; // 1605
			{
				float* pOut; // 1607
				{
					int x; // 1608
					{
						float flSum; // 1610
						int nBaseX; // 1611
						int nBaseY; // 1612
						int nBaseZ; // 1613
						{
							int iz; // 1614
							{
								int nSrcZ; // 1616
								{
									int iy; // 1617
									{
										int nSrcY; // 1619
										{
											int ix; // 1621
											{
												int nSrcX; // 1623
												Wrap(int x,
													int nLimit);  // 1098
												Wrap(int x,
													int nLimit);  // 1577
												WrapOrClamp<true>(int nC,
															int nLimit);  // 1623
												CSOAContainer::RowPtr<float>(
														int nAttributeIdx,
														int nRowNumber,
														int nSliceNumber);  // 442
												CSOAContainer::FloatValue(
														int nAttrIdx,
														int nX,
														int nY,
														int nZ);  // 1624
												CSOAContainer::NumCols(); // 1623
											}
										}
										CSOAContainer::NumRows(); // 1619
										Wrap(int x,
											int nLimit);  // 1098
										Wrap(int x,
											int nLimit);  // 1577
										WrapOrClamp<true>(int nC,
													int nLimit);  // 1619
									}
								}
								CSOAContainer::NumSlices(); // 1616
								Wrap(int x,
									int nLimit);  // 1098
								Wrap(int x,
									int nLimit);  // 1577
								WrapOrClamp<true>(int nC,
											int nLimit);  // 1616
							}
						}
					}
					CSOAContainer::NumCols(); // 1608
				}
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1607
			}
		}
	}
	CSOAContainer::NumCols(); // 1600
	CSOAContainer::NumCols(); // 1600
	CSOAContainer::NumRows(); // 1601
	CSOAContainer::NumRows(); // 1601
	CSOAContainer::NumSlices(); // 1602
	CSOAContainer::NumSlices(); // 1602
} /* size: 0, variables: 3, inline expansions: 6 (0 bytes) */

// <044D47BC> tier0_perproject/utlsoacontainer.cpp:1597
// variables: 17
// function calls: 19
void CSOAContainer::FilterFromPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr, int nFilterDimX, int nFilterDimY, int nFilterDimZ, const float* pFilterCoefficients)
{
	int nSrcXScale; // 1600
	int nSrcYScale; // 1601
	int nSrcZScale; // 1602
	{
		int z; // 1603
		{
			int y; // 1605
			{
				float* pOut; // 1607
				{
					int x; // 1608
					{
						float flSum; // 1610
						int nBaseX; // 1611
						int nBaseY; // 1612
						int nBaseZ; // 1613
						{
							int iz; // 1614
							{
								int nSrcZ; // 1616
								{
									int iy; // 1617
									{
										int nSrcY; // 1619
										{
											int ix; // 1621
											{
												int nSrcX; // 1623
												Clamp<int>(const int& val,
														const int& minVal,
														const int& maxVal);  // 1581
												WrapOrClamp<false>(int nC,
															int nLimit);  // 1623
												CSOAContainer::RowPtr<float>(
														int nAttributeIdx,
														int nRowNumber,
														int nSliceNumber);  // 442
												CSOAContainer::FloatValue(
														int nAttrIdx,
														int nX,
														int nY,
														int nZ);  // 1624
												CSOAContainer::NumCols(); // 1623
											}
										}
										Clamp<int>(const int& val,
												const int& minVal,
												const int& maxVal);  // 1581
										WrapOrClamp<false>(int nC,
													int nLimit);  // 1619
										CSOAContainer::NumRows(); // 1619
									}
								}
								Clamp<int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 1581
								WrapOrClamp<false>(int nC,
											int nLimit);  // 1616
								CSOAContainer::NumSlices(); // 1616
							}
						}
					}
					CSOAContainer::NumCols(); // 1608
				}
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1607
			}
		}
	}
	CSOAContainer::NumCols(); // 1600
	CSOAContainer::NumCols(); // 1600
	CSOAContainer::NumRows(); // 1601
	CSOAContainer::NumRows(); // 1601
	CSOAContainer::NumSlices(); // 1602
	CSOAContainer::NumSlices(); // 1602
} /* size: 0, variables: 3, inline expansions: 6 (0 bytes) */

// <044EB895> tier0_perproject/utlsoacontainer.cpp:1634
// variables: 14
// function calls: 79
void CSOAContainer::FilterFrom(const CSOAContainer& src, int nSrcAttr, int nDestAttr, int nFilterDimX, int nFilterDimY, int nFilterDimZ, const float* pFilterCoefficients, bool bWrap)
{
	{
		CCallQueue workList; // 1638
		int nY; // 1638
		{
			int nStep; // 1638
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue& queue,
															CSOAContainer* instance,
															int nSlices,
															void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int, int, int, const float *) CSOAC method,
															int nY,
															int nStep);  // 1638
			CSOAContainer::NumSlices(); // 1638
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1638
		CSOAContainer::NumRows(); // 1638
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1638
	}
	{
		CCallQueue workList; // 1642
		int nY; // 1642
		{
			int nStep; // 1642
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int, int, int, float const*), int, int, const CSOAContainer*, int, int, int, int, int, float const*)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int, int, int, float const*>(CCallQueue& queue,
															CSOAContainer* instance,
															int nSlices,
															void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int, int, int, const float *) CSOAC method,
															int nY,
															int nStep);  // 1642
			CSOAContainer::NumSlices(); // 1642
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1642
		CSOAContainer::NumRows(); // 1642
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1642
	}
	CSOAContainer::NumSlices(); // 1638
	CSOAContainer::NumRows(); // 1638
	CSOAContainer::NumSlices(); // 1642
	CSOAContainer::NumRows(); // 1642
} /* size: 0, inline expansions: 4 (0 bytes) */

// <044D1BE6> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 180
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 6907
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						SplatWSIMD<>(const fltx4& a); // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
						SplatWSIMD<>(const fltx4& a); // 1680
						SplatWSIMD<>(const fltx4& a); // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <044CF0BD> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 169
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 6907
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <01B2D2F8> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 180
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 47296
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						SplatWSIMD<>(const fltx4& a); // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
						SplatWSIMD<>(const fltx4& a); // 1680
						SplatWSIMD<>(const fltx4& a); // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <01B2A7CF> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 169
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 47296
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <009B2B5B> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 180
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 40016
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						SplatWSIMD<>(const fltx4& a); // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
						SplatWSIMD<>(const fltx4& a); // 1680
						SplatWSIMD<>(const fltx4& a); // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1720
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Wrap(int x,
							int nLimit);  // 1098
						Wrap(int x,
							int nLimit);  // 1577
						WrapOrClamp<true>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1659
				Wrap(int x,
					int nLimit);  // 1098
				Wrap(int x,
					int nLimit);  // 1577
				WrapOrClamp<true>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <009B0032> tier0_perproject/utlsoacontainer.cpp:1646
// variables: 92
// function calls: 169
void CSOAContainer::Normalized3x3SobelEdgeFilterPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr)
{
	const char   __FUNCTION__; // 40016
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1648
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1649
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1650
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1651
	}
	{
		int z; // 1652
		{
			int y; // 1654
			{
				fltx4* pOutX; // 1656
				fltx4* pOutY; // 1657
				fltx4* pIn; // 1658
				int nYUp; // 1659
				int nYDown; // 1660
				int nRowStride; // 1661
				int nXLimit; // 1665
				{
					int x; // 1666
					{
						fltx4 fl4RightNeighborUp; // 1670
						fltx4 fl4RightNeighborDown; // 1671
						fltx4 fl4RightNeighbor; // 1672
						fltx4 fl4LeftNeighborDown; // 1674
						fltx4 fl4LeftNeighborUp; // 1674
						fltx4 fl4LeftNeighbor; // 1674
						fltx4 fl4SobelX; // 1691
						fltx4 fl4SobelY; // 1698
						fltx4 fl4LenSQ; // 1703
						fltx4 fl4BadLenMask; // 1704
						fltx4 fl4OOLen; // 1705
						fltx4 fl4ResultX; // 1707
						fltx4 fl4ResultY; // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 2095
							_mm_cmple_ps(__m128 __A,
									__m128 __B);  // 2096
						}
						CmpLeSIMD<>(const fltx4& a,
								const fltx4& b);  // 1704
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2409
						{
							fltx4 retVal; // 2369
							_mm_rsqrt_ps(__m128 __A); // 2370
						}
						ReciprocalSqrtEstSIMD<>(const fltx4& a); // 2406
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 2408
						ReciprocalSqrtSIMD<>(const fltx4& a); // 1705
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						SplatWSIMD<>(const fltx4& a); // 122
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1685
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1686
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						SplatWSIMD<>(const fltx4& a); // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1687
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1691
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1692
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1695
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1696
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1698
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1699
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1700
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1703
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1707
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1708
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 718
							_mm_and_ps(__m128 __A,
									__m128 __B);  // 719
						}
						AndSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						{
							fltx4 retVal; // 826
							_mm_xor_ps(__m128 __A,
									__m128 __B);  // 827
						}
						XorSIMD<>(const fltx4& a,
								const fltx4& b);  // 1259
						MaskedAssign<>(const fltx4& ReplacementMask,
								const fltx4& a,
								const fltx4& b);  // 1708
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1670
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1671
						{
							fltx4 retVal; // 341
						}
						RotateLeft<>(const fltx4& a); // 116
						SplatXSIMD<>(const fltx4& a); // 116
						{
							fltx4 zzww; // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<250>(const fltx4& a,
									const fltx4& b);  // 1414
							{
								fltx4 retVal; // 1276
								_mm_shuffle_ps(__m128 __A,
										__m128 __B,
										const int  __mask);  // 1277
							}
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 665
							ShuffleSIMD<148>(const fltx4& a,
									const fltx4& b);  // 1415
						}
						SetWSIMD<(ESIMDLevel)20>(const fltx4& a,
									const fltx4& w); // 116
						ShiftLeftAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1672
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1679
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1680
						{
							fltx4 retVal; // 1371
							_mm_move_ss(__m128 __A,
									__m128 __B);  // 1372
						}
						SetXSIMD<>(const fltx4& a,
								const fltx4& x);  // 122
						ShiftRightAndMergeSIMD<>(FLTX4 fl4a,
									FLTX4 fl4b);  // 1681
					}
				}
				{
					int x; // 1715
					{
						int w; // 1717
						int h; // 1718
						float flSobelX; // 1719
						float flSobelY; // 1719
						float flLength; // 1734
						float flX; // 1736
						float flY; // 1737
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1720
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1738
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1739
						CSOAContainer::NumRows(); // 1718
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1720
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1721
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1721
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1722
						CSOAContainer::RowPtr<float>(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 442
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1722
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1723
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1723
						Clamp<int>(const int& val,
								const int& minVal,
								const int& maxVal);  // 1581
						WrapOrClamp<false>(int nC,
									int nLimit);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1724
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1725
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1728
						CSOAContainer::FloatValue(
								int nAttrIdx,
								int nX,
								int nY,
								int nZ);  // 1731
					}
					CSOAContainer::NumCols(); // 1715
				}
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1656
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1657
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1658
				CSOAContainer::NumRows(); // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1659
				Clamp<int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 1581
				WrapOrClamp<false>(int nC,
							int nLimit);  // 1660
				CSOAContainer::NumQuadsPerRow(); // 1661
			}
		}
	}
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumCols(); // 1648
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumRows(); // 1649
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1650
	CSOAContainer::NumSlices(); // 1651
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <044EA4D2> tier0_perproject/utlsoacontainer.cpp:1748
// variables: 14
// function calls: 79
void CSOAContainer::Normalized3x3SobelEdgeFilterFrom(const CSOAContainer& src, int nSrcAttr, int nGradientXOutAttr, int nGradientYOutAttr, bool bWrap)
{
	{
		CCallQueue workList; // 1752
		int nY; // 1752
		{
			int nStep; // 1752
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue& queue,
												CSOAContainer* instance,
												int nSlices,
												void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int) CSOAContainer::* method,
												int nY,
												int nStep);  // 1752
			CSOAContainer::NumSlices(); // 1752
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1752
		CSOAContainer::NumRows(); // 1752
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1752
	}
	{
		CCallQueue workList; // 1756
		int nY; // 1756
		{
			int nStep; // 1756
			CCallQueue::ResumeProcessing(); // 115
			_Function_base::_Function_base(); // 407
			function<void()>::operator bool()>* this); // 409
			function<void()>::function(
				function<void()>& __x); // 102
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 96
			function<void()>::operator()(const function<void()>* this); // 110
			CCallQueue::QueueCall(
					function<void()>& fnCall);  // 338
			_Function_base::~_Function_base(); // 336
			function<void()>::~function()>* this); // 338
			{
				_M_create<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
				_M_init_functor<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
				_M_not_empty_function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue&, CSOAContainer*, int, void (CSOAContainer::*)(int, int, int, int, const CSOAContainer*, int, int, int), int, int, const CSOAContainer*, int, int, int)::<lambda()> >(const &); // 449
			}
			_Function_base::_Function_base(); // 439
			function<void()>::function<QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(
																class& __f); // 338
			QueueCallWrapper<CSOAContainer, const CSOAContainer*, int, int, int>(CCallQueue& queue,
												CSOAContainer* instance,
												int nSlices,
												void ()(CSOAContainer *, int, int, int, int, const CSOAContainer *, int, int, int) CSOAContainer::* method,
												int nY,
												int nStep);  // 1756
			CSOAContainer::NumSlices(); // 1756
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1756
		CSOAContainer::NumRows(); // 1756
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::ResumeProcessing(); // 80
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1756
	}
	CSOAContainer::NumSlices(); // 1752
	CSOAContainer::NumRows(); // 1752
	CSOAContainer::NumSlices(); // 1756
	CSOAContainer::NumRows(); // 1756
} /* size: 0, inline expansions: 4 (0 bytes) */

// <044BEE8B> tier0_perproject/utlsoacontainer.cpp:1763
// variables: 26
// function calls: 59
void QuarterSizeAttrWithBoxFilterPartial<true, CSOAContainer::true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	int nNumHorizontalIterations; // 1767
	fltx4 fl4FilterScaleFactor; // 1768
	{
		int z; // 1769
		{
			int y; // 1771
			{
				fltx4* pOut; // 1773
				const fltx4* pIn; // 1774
				const fltx4* pIn1; // 1775
				int nRowToRowStep; // 1780
				{
					int x; // 1789
					{
						fltx4 fl4Result; // 1794
						{
							int nWordIndex; // 1795
							{
								int nX; // 1804
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::NumSlices(); // 452
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::NumRows(); // 452
								CSOAContainer::NumCols(); // 452
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1808
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1809
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1810
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1811
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1812
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1813
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1814
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1815
							}
							SubFloat<>(fltx4& a,
									int idx);  // 1800
							CSOAContainer::NumCols(); // 1797
						}
					}
					{
						fltx4 fl4Pixels0; // 1832
						fltx4 fl4Pixels1; // 1833
						fltx4 fl4Filtered; // 1840
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1841
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1832
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1833
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1836
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1836
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1837
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1837
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1787
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1787
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1788
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1788
						PairwiseHorizontalAddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1840
					}
				}
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1778
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1773
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1774
				CSOAContainer::NumRows(); // 1781
				CSOAContainer::NumRows(); // 1781
			}
		}
	}
	CSOAContainer::NumQuadsPerRow(); // 1767
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <044BE5E6> tier0_perproject/utlsoacontainer.cpp:1763
// variables: 26
// function calls: 29
void QuarterSizeAttrWithBoxFilterPartial<true, CSOAContainer::false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	int nNumHorizontalIterations; // 1767
	fltx4 fl4FilterScaleFactor; // 1768
	{
		int z; // 1769
		{
			int y; // 1771
			{
				fltx4* pOut; // 1773
				const fltx4* pIn; // 1774
				const fltx4* pIn1; // 1775
				int nRowToRowStep; // 1780
				{
					int x; // 1789
					{
						fltx4 fl4Result; // 1794
						{
							int nWordIndex; // 1795
							{
								int nX; // 1804
							}
						}
					}
					{
						fltx4 fl4Pixels0; // 1832
						fltx4 fl4Pixels1; // 1833
						fltx4 fl4Filtered; // 1840
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1832
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1833
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1836
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1836
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1837
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1837
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1787
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1787
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1788
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1788
						PairwiseHorizontalAddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1840
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1841
					}
				}
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1778
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1773
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1774
				CSOAContainer::NumRows(); // 1781
				CSOAContainer::NumRows(); // 1781
			}
		}
	}
	CSOAContainer::NumQuadsPerRow(); // 1767
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <044BD9D8> tier0_perproject/utlsoacontainer.cpp:1763
// variables: 22
// function calls: 41
void QuarterSizeAttrWithBoxFilterPartial<false, CSOAContainer::true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	int nNumHorizontalIterations; // 1767
	fltx4 fl4FilterScaleFactor; // 1768
	{
		int z; // 1769
		{
			int y; // 1771
			{
				fltx4* pOut; // 1773
				const fltx4* pIn; // 1774
				const fltx4* pIn1; // 1775
				int nRowToRowStep; // 1780
				{
					int x; // 1789
					{
						fltx4 fl4Result; // 1794
						{
							int nWordIndex; // 1795
							{
								int nX; // 1804
								CSOAContainer::NumSlices(); // 452
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::NumRows(); // 452
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::NumCols(); // 452
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1821
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::RowPtr<float>(
										int nAttributeIdx,
										int nRowNumber,
										int nSliceNumber);  // 442
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1822
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1823
								clamp<int, int>(const int& val,
										const int& minVal,
										const int& maxVal);  // 452
								CSOAContainer::FloatValue(
										int nAttrIdx,
										int nX,
										int nY,
										int nZ);  // 452
								CSOAContainer::FloatValueClamped(
											int nAttrIdx,
											int nX,
											int nY,
											int nZ);  // 1824
							}
							SubFloat<>(fltx4& a,
									int idx);  // 1800
							CSOAContainer::NumCols(); // 1797
						}
					}
					{
						fltx4 fl4Pixels0; // 1832
						fltx4 fl4Pixels1; // 1833
						fltx4 fl4Filtered; // 1840
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1841
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1832
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1833
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1787
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1787
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1788
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1788
						PairwiseHorizontalAddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1840
					}
				}
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1774
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1773
				CSOAContainer::NumRows(); // 1781
				CSOAContainer::NumRows(); // 1781
			}
		}
	}
	CSOAContainer::NumQuadsPerRow(); // 1767
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <044BD880> tier0_perproject/utlsoacontainer.cpp:1763
// variables: 15
void QuarterSizeAttrWithBoxFilterPartial<false, CSOAContainer::false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	int nNumHorizontalIterations; // 1767
	fltx4 fl4FilterScaleFactor; // 1768
	{
		int z; // 1769
		{
			int y; // 1771
			{
				fltx4* pOut; // 1773
				const fltx4* pIn; // 1774
				const fltx4* pIn1; // 1775
				int nRowToRowStep; // 1780
				{
					int x; // 1789
					{
						fltx4 fl4Result; // 1794
						{
							int nWordIndex; // 1795
							{
								int nX; // 1804
							}
						}
					}
					{
						fltx4 fl4Pixels0; // 1832
						fltx4 fl4Pixels1; // 1833
						fltx4 fl4Filtered; // 1840
					}
				}
			}
		}
	}
} /* size: 0, variables: 2 */

// <0450FC69> tier0_perproject/utlsoacontainer.cpp:1849
// function call: 1
void CSOAContainer::QuarterSizeAttrWithBoxFilterPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	CSOAContainer::NumCols(); // 1852
} /* size: 0, inline expansions: 1 (0 bytes) */

// <044CF03F> tier0_perproject/utlsoacontainer.cpp:1849
void CSOAContainer::QuarterSizeAttrWithBoxFilterPartial<true>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
} /* size: 0 */

// <044CE936> tier0_perproject/utlsoacontainer.cpp:1849
// variables: 17
// function calls: 22
void CSOAContainer::QuarterSizeAttrWithBoxFilterPartial<false>(int nStartRow, int nNumRows, int nStartSlice, int nEndSlice, const CSOAContainer* pSrc, int nSrcAttr, int nDestAttr)
{
	CSOAContainer::NumCols(); // 1852
	CSOAContainer::NumQuadsPerRow(); // 1767
	{
		int z; // 1769
		{
			int y; // 1771
			{
				fltx4* pOut; // 1773
				const fltx4* pIn; // 1774
				const fltx4* pIn1; // 1775
				int nRowToRowStep; // 1780
				CSOAContainer::ConstRowPtr(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 1774
				CSOAContainer::RowPtr<__vector(
								int nAttributeIdx,
								int nRowNumber,
								int nSliceNumber);  // 1773
				CSOAContainer::NumRows(); // 1781
				{
					int x; // 1789
					{
						fltx4 fl4Pixels0; // 1832
						fltx4 fl4Pixels1; // 1833
						fltx4 fl4Filtered; // 1840
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1832
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1833
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1787
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1787
						{
							fltx4 retVal; // 341
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 342
						}
						RotateLeft<>(const fltx4& a); // 1788
						{
							fltx4 retVal; // 1593
							_mm_add_ps(__m128 __A,
									__m128 __B);  // 1594
						}
						AddSIMD<>(const fltx4& a,
								const fltx4& b);  // 1788
						PairwiseHorizontalAddSIMD<>(const fltx4& a,
										const fltx4& b);  // 1840
						{
							fltx4 retVal; // 1639
							_mm_mul_ps(__m128 __A,
									__m128 __B);  // 1640
						}
						MulSIMD<>(const fltx4& a,
								const fltx4& b);  // 1841
					}
				}
				CSOAContainer::NumRows(); // 1781
			}
		}
	}
	CSOAContainer::QuarterSizeAttrWithBoxFilterPartial<false, false>(
								int nStartRow,
								int nNumRows,
								int nStartSlice,
								int nEndSlice,
								const CSOAContainer* pSrc,
								int nSrcAttr,
								int nDestAttr);  // 1858
} /* size: 0, inline expansions: 3 (0 bytes) */

// <044E87C7> tier0_perproject/utlsoacontainer.cpp:1864
// variables: 15
// function calls: 106
void CSOAContainer::QuarterSizeAttrWithBoxFilter(const CSOAContainer& src, int nSrcAttr, int nDestAttr, CCallQueue* pQueue)
{
	const char   __FUNCTION__; // 6823
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1866
	}
	{
		int y; // 1871
		{
			int x; // 1873
			{
				int z; // 1878
				CSOAContainer::NumSlices(); // 1878
				CSOAContainer::NumSlices(); // 452
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::NumRows(); // 452
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::NumCols(); // 452
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1881
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1882
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1883
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1880
				CSOAContainer::RowPtr<float>(
						int nAttributeIdx,
						int nRowNumber,
						int nSliceNumber);  // 442
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1884
				clamp<int, int>(const int& val,
						const int& minVal,
						const int& maxVal);  // 452
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1885
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1886
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1887
				CSOAContainer::FloatValue(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 452
				CSOAContainer::FloatValueClamped(
							int nAttrIdx,
							int nX,
							int nY,
							int nZ);  // 1888
			}
			CSOAContainer::RowPtr<float>(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 442
			CSOAContainer::FloatValue(
					int nAttrIdx,
					int nX,
					int nY,
					int nZ);  // 1894
			CSOAContainer::NumRows(); // 452
			CSOAContainer::RowPtr<float>(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 442
			CSOAContainer::FloatValue(
					int nAttrIdx,
					int nX,
					int nY,
					int nZ);  // 452
			clamp<int, int>(const int& val,
					const int& minVal,
					const int& maxVal);  // 452
			CSOAContainer::NumCols(); // 452
			clamp<int, int>(const int& val,
					const int& minVal,
					const int& maxVal);  // 452
			CSOAContainer::FloatValueClamped(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1895
			clamp<int, int>(const int& val,
					const int& minVal,
					const int& maxVal);  // 452
			CSOAContainer::RowPtr<float>(
					int nAttributeIdx,
					int nRowNumber,
					int nSliceNumber);  // 442
			CSOAContainer::FloatValue(
					int nAttrIdx,
					int nX,
					int nY,
					int nZ);  // 452
			CSOAContainer::FloatValueClamped(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1896
			clamp<int, int>(const int& val,
					const int& minVal,
					const int& maxVal);  // 452
			CSOAContainer::FloatValue(
					int nAttrIdx,
					int nX,
					int nY,
					int nZ);  // 452
			CSOAContainer::FloatValueClamped(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1897
			CSOAContainer::FloatValue(
					int nAttrIdx,
					int nX,
					int nY,
					int nZ);  // 452
			CSOAContainer::FloatValueClamped(
						int nAttrIdx,
						int nX,
						int nY,
						int nZ);  // 1898
			CSOAContainer::NumSlices(); // 1875
			CSOAContainer::NumCols(); // 1873
		}
		CSOAContainer::NumRows(); // 1871
	}
	{
		CCallQueue workList; // 1908
		bool bExecuteQueue; // 1908
		int nY; // 1908
		{
			int nStep; // 1908
			CSOAContainer::NumSlices(); // 1908
		}
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1908
		CSOAContainer::NumRows(); // 1908
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1908
	}
	{
		CCallQueue workList; // 1912
		bool bExecuteQueue; // 1912
		int nY; // 1912
		{
			int nStep; // 1912
			CSOAContainer::NumSlices(); // 1912
		}
		CCallQueue::ResumeProcessing(); // 80
		ThreadPause(void); // 173
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 168
		CTSListBase::Push(
			TSLNodeBase_t* pNode);  // 1080
		CTSQueue<std::function<void()>::FreeNode(
			Node_t* pNode); // 1103
		CTSQueue<std::function<void()>::PopItem(
			function<void()>** pResult); // 75
		_Function_base::~_Function_base(); // 336
		function<void()>::~function()>* this); // 77
		CCallQueue::Flush(); // 17
		CCallQueue::~CCallQueue(); // 1912
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 862
		CTSListBase::CTSListBase(); // 846
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
		Node_t::Node_t(); // 864
		CTSQueue<std::function<void()>::End()>*, false>* this); // 865
		CTSQueue<std::function<void()>::CTSQueue()>*, false>* this); // 13
		CCallQueue::CCallQueue(); // 1912
		CSOAContainer::NumRows(); // 1912
	}
	CSOAContainer::NumSlices(); // 1866
	CSOAContainer::NumSlices(); // 1866
	CSOAContainer::NumCols(); // 1869
	CSOAContainer::NumSlices(); // 1912
	CSOAContainer::NumRows(); // 1912
	CSOAContainer::NumSlices(); // 1905
	CSOAContainer::NumSlices(); // 1908
