
//
// rendersystem/rendercontextbase.h
//
//	referenced by: librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 56
//	classes: 2
//

// <00102AF9> rendersystem/rendercontextbase.h:70
inline RenderChangeFlags_t CHANGE_FLAG_SAMPLERSTATES(RenderShaderType_t nType)
{
} /* size: 0 */

// <000E1751> rendersystem/rendercontextbase.h:78
// member functions: 204
// member variables: 35
// vtable entries: 85
// class size: 5,680
class CRenderContextBase : public IRenderContext, public IStreamBuilderCallback<CCommandStream> {
	/* rendersystem/rendercontextbase.h:282 */
	struct BoundCB_t {
		ConstantBufferHandle_t m_hConstantBuffer; /* 0 8 */
		uint32 m_nView; /* 8 4 */
	};
public:
	/* class IRenderContext <ancestor>; */ /* 0 1232 */
	/* class IStreamBuilderCallback<CCommandStream> <ancestor>; */ /* 1232 8 */
	void CRenderContextBase(CRenderContextBase* , const CRenderContextBase& );
	/* rendersystem/rendercontextbase.cpp:167 */
	virtual IRenderDevice* GetDevice(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:582 */
	virtual void DependsOn(CRenderContextBase* , CDependencyDescriptor* );
	/* rendersystem/rendercontextbase.cpp:588 */
	virtual void Satisfies(CRenderContextBase* , CDependencyDescriptor* );
	/* rendersystem/rendercontextbase.cpp:241 */
	virtual void SetViewports(CRenderContextBase* , int, const RenderViewport_t* );
	/* rendersystem/rendercontextbase.cpp:248 */
	virtual void GetViewport(CRenderContextBase* , RenderViewport_t* , int);
	/* rendersystem/rendercontextbase.cpp:639 */
	virtual bool Present(CRenderContextBase* , SwapChainHandle_t, int);
	/* rendersystem/rendercontextbase.h:88 */
	virtual void ForceDeviceLost(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:299 */
	virtual void SetStatesToDefault(CRenderContextBase* , uint32, uint32);
	/* rendersystem/rendercontextbase.h:92 */
	virtual void PrepareTextureForUse(CRenderContextBase* , HRenderTexture, RenderColorSpace_t, int, int);
	/* rendersystem/rendercontextbase.cpp:409 */
	virtual void SetSamplerStatePS(CRenderContextBase* , int, RsFilter_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsComparison_t);
	/* rendersystem/rendercontextbase.cpp:357 */
	virtual void SetSamplerStateVS(CRenderContextBase* , int, RsFilter_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsComparison_t);
	/* rendersystem/rendercontextbase.cpp:461 */
	virtual void SetSamplerState(CRenderContextBase* , int32, const CSamplerStateDesc* , RenderShaderType_t);
	/* rendersystem/rendercontextbase.h:101 */
	virtual void BindDescriptorSets(CRenderContextBase* , int32, int32, const RenderDescriptorSetHandle_t* , const int32* , const uint32** );
	/* rendersystem/rendercontextbase.h:102 */
	virtual void FillAndBindDynamicDescriptorSet(CRenderContextBase* , RenderDescriptorSetHandle_t, int32, int32, const RenderDescriptorBinding_t* , bool, const int32* , const uint32** );
	/* rendersystem/rendercontextbase.h:103 */
	virtual RenderDescriptorSetHandle_t FillDynamicDescriptorSet(CRenderContextBase* , RenderDescriptorSetHandle_t, int32, const RenderDescriptorBinding_t* , bool);
	/* rendersystem/rendercontextbase.h:105 */
	virtual void BeginRenderPass(CRenderContextBase* , RenderPassHandle_t, int32, const union RenderPassClearValue_t* , const Rect_t& );
	/* rendersystem/rendercontextbase.h:106 */
	virtual void NextSubPass(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:107 */
	virtual void EndRenderPass(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:948 */
	virtual unique_ptr<IBarrierHelper, std::default_delete<IBarrierHelper> > GetBarrierHelper(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:109 */
	virtual void TextureBarrier(CRenderContextBase* , int32, const HRenderTexture* , const RenderImageLayout_t* , bool);
	/* rendersystem/rendercontextbase.h:110 */
	virtual void UAVBarrier(CRenderContextBase* , int32, const RenderUAVBarrier_t* );
	/* rendersystem/rendercontextbase.h:111 */
	virtual void BufferBarrier(CRenderContextBase* , int32, const RenderBufferBarrier_t* );
	/* rendersystem/rendercontextbase.h:113 */
	virtual void PushConstants(CRenderContextBase* , const void* , uint32);
	/* rendersystem/rendercontextbase.cpp:598 */
	virtual void BindRenderTargets(CRenderContextBase* , const RenderTargetDesc_t& );
	/* rendersystem/rendercontextbase.cpp:783 */
	virtual RsRasterizerStateHandle_t FindOrCreateRasterizerState(CRenderContextBase* , const RsRasterizerStateDesc_t* );
	/* rendersystem/rendercontextbase.cpp:789 */
	virtual void SetRasterizerState(CRenderContextBase* , RsRasterizerStateHandle_t);
	/* rendersystem/rendercontextbase.cpp:799 */
	virtual void SetCullMode(CRenderContextBase* , RenderCullMode_t);
	/* rendersystem/rendercontextbase.cpp:826 */
	virtual void SetOverrideRasterizerState(CRenderContextBase* , RsRasterizerStateHandle_t);
	/* rendersystem/rendercontextbase.cpp:836 */
	virtual RsDepthStencilStateHandle_t FindOrCreateDepthStencilState(CRenderContextBase* , const RsDepthStencilStateDesc_t* );
	/* rendersystem/rendercontextbase.cpp:843 */
	virtual void SetDepthStencilState(CRenderContextBase* , RsDepthStencilStateHandle_t, uint32);
	/* rendersystem/rendercontextbase.cpp:852 */
	virtual void SetOverrideDepthStencilState(CRenderContextBase* , RsDepthStencilStateHandle_t, uint32);
	/* rendersystem/rendercontextbase.cpp:859 */
	virtual void SetZBufferMode(CRenderContextBase* , RenderZBufferMode_t);
	/* rendersystem/rendercontextbase.cpp:866 */
	virtual RsBlendStateHandle_t FindOrCreateBlendState(CRenderContextBase* , const RsBlendStateDesc_t* );
	/* rendersystem/rendercontextbase.cpp:873 */
	virtual void SetBlendState(CRenderContextBase* , RsBlendStateHandle_t, const float* , uint32);
	/* rendersystem/rendercontextbase.cpp:880 */
	virtual void SetBlendMode(CRenderContextBase* , RenderBlendMode_t, const float* );
	/* rendersystem/rendercontextbase.cpp:887 */
	virtual void SetTessellationState(CRenderContextBase* , bool, uint32);
	/* rendersystem/rendercontextbase.h:129 */
	virtual void BeginPixEvent(CRenderContextBase* , Color, const char* );
	/* rendersystem/rendercontextbase.h:463 */
	virtual void BeginPixEvent(CRenderContextBase* , const char* );
	/* rendersystem/rendercontextbase.h:131 */
	virtual void EndPixEvent(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:132 */
	virtual void PixSetMarker(CRenderContextBase* , Color, const char* );
	/* rendersystem/rendercontextbase.h:470 */
	virtual void PixSetMarker(CRenderContextBase* , const char* );
	/* rendersystem/rendercontextbase.cpp:506 */
	virtual ConstantBufferHandle_t LockDynamicConstantBuffer(CRenderContextBase* , uint32, DynamicLockDesc_t* );
	/* rendersystem/rendercontextbase.cpp:528 */
	virtual void UnlockDynamicConstantBuffer(CRenderContextBase* , ConstantBufferHandle_t, uint32);
	/* rendersystem/rendercontextbase.cpp:553 */
	virtual void GetMaxToRender(CRenderContextBase* , int, int, int* , int* );
	/* rendersystem/rendercontextbase.h:378 */
	virtual CRenderAttributes& GetAttributesForModify(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:604 */
	virtual void Submit(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:617 */
	virtual void SubmitSecondaryDisplayList(CRenderContextBase* , CDisplayList* , bool);
	/* rendersystem/rendercontextbase.cpp:256 */
	virtual void SetDebugFlag(CRenderContextBase* , RenderDebugFlag_t, bool);
	/* rendersystem/rendercontextbase.cpp:268 */
	virtual void SetDebugString(CRenderContextBase* , const char* , ...);
	/* rendersystem/rendercontextbase.cpp:278 */
	virtual void VaSetDebugString(CRenderContextBase* , const char* , typedef __va_list_tag __va_list_tag* );
	/* rendersystem/rendercontextbase.cpp:290 */
	virtual const char* GetDebugString(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:814 */
	virtual void FlipHandedness(CRenderContextBase* , bool);
	/* rendersystem/rendercontextbase.cpp:479 */
	virtual void SetSamplerStates(CRenderContextBase* , int, int, const CSamplerStateDesc* , RenderShaderType_t);
	/* rendersystem/rendercontextbase.h:156 */
	virtual void SetAlphaTestState(CRenderContextBase* , bool, float, RsComparison_t);
	/* rendersystem/rendercontextbase.cpp:919 */
	virtual RenderSemaphoreHandle_t SemaphoreSignalAtEnd(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:942 */
	virtual void SemaphoreWaitAtBegin(CRenderContextBase* , RenderSemaphoreHandle_t);
	/* rendersystem/rendercontextbase.h:162 */
	virtual void SetSteamVrCompositorTexture(CRenderContextBase* , HRenderTexture, HRenderTexture);
	/* rendersystem/rendercontextbase.h:164 */
	virtual void CopyFromVolumeTexture(CRenderContextBase* , HRenderTexture, HRenderTexture, Rect3D_t* , int, int, int, uint, uint, uint, uint, CopyTextureFlags_t);
	/* rendersystem/rendercontextbase.cpp:894 */
	virtual void MarkTexturesUsedThisFrame(CRenderContextBase* , int, const texture_use_info_t* );
	/* rendersystem/rendercontextbase.h:170 */
	virtual void DiscardRenderTarget(CRenderContextBase* , RenderClearFlags_t, uint);
	/* rendersystem/rendercontextbase.h:172 */
	virtual void SetTilingModeHint(CRenderContextBase* , RenderTilingModeHint_t);
	/* rendersystem/rendercontextbase.h:174 */
	virtual void BuildBLAS(CRenderContextBase* , RenderBLASHandle_t, BLASTriangleData_t* , int);
	/* rendersystem/rendercontextbase.h:175 */
	virtual void CompactBLAS(CRenderContextBase* , RenderBLASHandle_t, RenderBLASHandle_t);
	/* rendersystem/rendercontextbase.h:176 */
	virtual void BuildTLAS(CRenderContextBase* , RenderTLASHandle_t, TLASInstance_t* , int);
	/* rendersystem/rendercontextbase.h:177 */
	virtual void UpdateRayTraceShaderBindingTable(CRenderContextBase* , IRaytraceShaderBindingTable* );
	/* rendersystem/rendercontextbase.h:178 */
	virtual void BindRayTracingPipeline(CRenderContextBase* , RenderRayTracePipelineHandle_t);
	/* rendersystem/rendercontextbase.h:179 */
	virtual void TraceRays(CRenderContextBase* , IRaytraceShaderBindingTable* , uint32, uint32, uint32);
	/* rendersystem/rendercontextbase.h:180 */
	virtual void TraceRaysIndirect(CRenderContextBase* , IRaytraceShaderBindingTable* , RenderBufferHandle_t, uint32);
	/* rendersystem/rendercontextbase.cpp:184 */
	virtual void SetIsSecondaryContext(CRenderContextBase* , RenderContextCreationInfo_t* , bool);
	/* rendersystem/rendercontextbase.h:187 */
	virtual void* GetScratchBuffer(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:904 */
	virtual void OnReleaseRenderContext(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:176 */
	virtual void OnNewStreamStarted(CRenderContextBase* , CCommandStream* );
	/* rendersystem/rendercontextbase.h:193 */
	virtual void BeginQuery(CRenderContextBase* , RenderQueryHandle_t);
	/* rendersystem/rendercontextbase.h:194 */
	virtual void EndQuery(CRenderContextBase* , RenderQueryHandle_t);
	/* rendersystem/rendercontextbase.h:197 */
	virtual void SetDepthBoundsTestEnabled(CRenderContextBase* , bool);
	/* rendersystem/rendercontextbase.h:198 */
	virtual void SetDepthBounds(CRenderContextBase* , float, float);
	/* rendersystem/rendercontextbase.h:201 */
	virtual void ForceFlushGPU(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:203 */
	virtual void CopyBuffer(CRenderContextBase* , IndexBufferHandle_t, IndexBufferHandle_t);
	/* rendersystem/rendercontextbase.cpp:112 */
	void CRenderContextBase(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:158 */
	virtual void ~CRenderContextBase(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:664 */
	virtual void QueuePresent(CRenderContextBase* , SwapChainHandle_t, int);
	/* rendersystem/rendercontextbase.cpp:194 */
	virtual void SetDefaultState(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:332 */
	CCommandStreamBuilder* GetStreamBuilder(CRenderContextBase* );
	/* rendersystem/rendercontextbase.cpp:679 */
	virtual void Flush(CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:223 */
	void AssertThreadOwnershipDbg(const CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:225 */
	virtual bool IsOwnedByCurrentThread(const CRenderContextBase* );
	/* rendersystem/rendercontextbase.h:227 */
	void SetContextFrameCount(CRenderContextBase* , int);
	/* rendersystem/rendercontextbase.h:228 */
	void SetContextId(CRenderContextBase* , int);
	/* rendersystem/rendercontextbase.h:229 */
	void SetReleaseTextureReadLock(CRenderContextBase* , bool);
	/* rendersystem/rendercontextbase.cpp:698 */
	int SubrectPixelDifference(int, int, int, int, int, int, int);
	/* rendersystem/rendercontextbase.cpp:739 */
	int SubrectPixelDifference(HRenderTexture, int, int, int, int, int);
	/* rendersystem/rendercontextbase.cpp:745 */
	int SubrectPixelDifference(const RenderTargetDesc_t& , int, const RenderClearInfo_t& , int, int, int, int, int);
	/* rendersystem/rendercontextbase.h:440 */
	void SetBoundConstantBuffer(CRenderContextBase* , RenderShaderType_t, ConstantBufferHandle_t, uint32, int32);
	/* rendersystem/rendercontextbase.h:448 */
	void RebindConstantBufferIfBound(CRenderContextBase* , ConstantBufferHandle_t);
	/* rendersystem/rendercontextbase.cpp:926 */
	virtual void StartRenderDocCapture(CRenderContextBase* , PlatWindow_t);
	/* rendersystem/rendercontextbase.cpp:934 */
	virtual void EndRenderDocCapture(CRenderContextBase* , PlatWindow_t);
protected:
	uint m_nChangeFlags; /* 1240 4 */
	uint m_nDebugFlags; /* 1244 4 */
	RenderCullMode_t m_eCullMode; /* 1248 4 */
	RenderBlendMode_t m_eBlendMode; /* 1252 4 */
	RenderZBufferMode_t m_eZBufferMode; /* 1256 4 */
	CCommandStreamBuilder m_StreamBuilder; /* 1264 32 */
	uint8 m_nViewportCount; /* 1296 1 */
	uint8 m_nHandedness; /* 1297 1 */
	RenderViewport_t m_pViewports[16]; /* 1300 448 */
	int32 m_nHighestResourceBound[4]; /* 1748 16 */
	int32 m_nHighestSamplerSet[4]; /* 1764 16 */
	int32 m_nHighestUAVBound[4]; /* 1780 16 */
	CSamplerStateDesc m_SamplerStates[4][32]; /* 1796 2560 */
	uint32 m_nDirtySamplerState[4]; /* 4356 16 */
	BoundCB_t m_boundConstantBuffers[4][14]; /* 4376 896 */
	int32_t m_nHighestConstantBufferIndexBound[4]; /* 5272 16 */
	void * m_pCurrRasterizerState; /* 5288 8 */
	void * m_pCurrDepthStencilState; /* 5296 8 */
	uint32 m_nCurrDepthStencilRef; /* 5304 4 */
	void * m_pCurrBlendState; /* 5312 8 */
	float m_flCurrBlendFactor[4]; /* 5320 16 */
	uint32 m_nCurrMultisampleMask; /* 5336 4 */
	bool m_bTessellationEnabled; /* 5340 1 */
	uint32 m_nInputPatchSize; /* 5344 4 */
	RsRasterizerStateHandle_t m_hOverrideRasterizerState; /* 5352 8 */
	RsDepthStencilStateHandle_t m_hOverrideDepthStencilState; /* 5360 8 */
	uint32 m_nOverrideStencilRef; /* 5368 4 */
	bool m_bLockAttributes:1; /* 5372: 0 1 */
	bool m_bReleaseTextureReadLock:1; /* 5372: 1 1 */
	int m_nContextFrame; /* 5376 4 */
	int m_nContextId; /* 5380 4 */
	char m_szDebugString[256]; /* 5384 256 */
	/* rendersystem/rendercontextbase.h:385 */
	void SetRasterizerStateInternal(CRenderContextBase* , void* );
	/* rendersystem/rendercontextbase.h:395 */
	void SetDepthStencilStateInternal(CRenderContextBase* , void* , uint32);
	/* rendersystem/rendercontextbase.h:406 */
	void SetBlendStateInternal(CRenderContextBase* , void* , const float* , uint32);
	/* rendersystem/rendercontextbase.cpp:967 */
	virtual IRenderContext* GetSubContext(CRenderContextBase* , const ISceneLayer* );
	CUtlVector<IRenderContext*, CUtlMemory<IRenderContext*, int> > m_SubContexts; /* 5640 32 */
	/* rendersystem/rendercontextbase.cpp:1016 */
	void SubmitSubContexts(CRenderContextBase* );
	void CRenderContextBase(class CRenderContextBase *, const class CRenderContextBase  &); /* linkage=_ZN18CRenderContextBaseC4ERKS_ */
	/* <1052e3> rendersystem/rendercontextbase.cpp:167 */
	virtual class IRenderDevice * GetDevice(class CRenderContextBase *); /* linkage=_ZN18CRenderContextBase9GetDeviceEv */
	virtual void DependsOn(class CRenderContextBase *, class CDependencyDescriptor *); /* linkage=_ZN18CRenderContextBase9DependsOnEP21CDependencyDescriptor */
	virtual void Satisfies(class CRenderContextBase *, class CDependencyDescriptor *); /* linkage=_ZN18CRenderContextBase9SatisfiesEP21CDependencyDescriptor */
	virtual void SetViewports(class CRenderContextBase *, int, const class RenderViewport_t  *); /* linkage=_ZN18CRenderContextBase12SetViewportsEiPK16RenderViewport_t */
