
//
// meshutils/modelmeshutils.cpp
//
//	referenced by: libengine2.so
//
//	functions: 113
//	class: 1
//	structs: 2
//

// <060E0D5F> meshutils/modelmeshutils.cpp:17
// function calls: 3
void GetAllStreamsOfType(CModelMesh* pMesh, ModelStreamType_t nStreamType, CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreamAccessors)
{
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 19
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 20
	CModelMeshStreamSetAccessor<CModelMesh::Face_t, CModelMesh::FaceStreamIndex_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 21
} /* size: 0, inline expansions: 3 (0 bytes) */

// <060E087B> meshutils/modelmeshutils.cpp:27
// variables: 3
// function calls: 15
void GetAllDeltaStreamsOfType(CModelMesh* pMesh, ModelStreamType_t nStreamType, CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreamAccessors)
{
	{
		int d; // 343
		CUtlVectorBase<CModelMeshDelta<CModelMesh::Vertex_t>::Count(); // 343
		CUtlMemory<CModelMeshDelta<CModelMesh::Vertex_t>::operator[](
				int i);  // 588
		CUtlVectorBase<CModelMeshDelta<CModelMesh::Vertex_t>::operator[](
				int i);  // 344
		CModelMeshDelta<CModelMesh::Vertex_t>::GetStreamsOfType(
				ModelStreamType_t nStreamType,
				CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 344
	}
	CModelMeshDeltaSet<CModelMesh::Vertex_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 29
	{
		int d; // 343
		CUtlVectorBase<CModelMeshDelta<CModelMesh::FaceVertex_t>::Count(); // 343
		CUtlMemory<CModelMeshDelta<CModelMesh::FaceVertex_t>::operator[](
				int i);  // 588
		CUtlVectorBase<CModelMeshDelta<CModelMesh::FaceVertex_t>::operator[](
				int i);  // 344
		CModelMeshDelta<CModelMesh::FaceVertex_t>::GetStreamsOfType(
				ModelStreamType_t nStreamType,
				CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 344
	}
	CModelMeshDeltaSet<CModelMesh::FaceVertex_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 30
	{
		int d; // 343
		CUtlVectorBase<CModelMeshDelta<CModelMesh::Face_t>::Count(); // 343
		CUtlMemory<CModelMeshDelta<CModelMesh::Face_t>::operator[](
				int i);  // 588
		CUtlVectorBase<CModelMeshDelta<CModelMesh::Face_t>::operator[](
				int i);  // 344
		CModelMeshDelta<CModelMesh::Face_t>::GetStreamsOfType(
				ModelStreamType_t nStreamType,
				CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 344
	}
	CModelMeshDeltaSet<CModelMesh::Face_t>::GetStreamsOfType(
			ModelStreamType_t nStreamType,
			CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >* pOutStreams);  // 31
} /* size: 0, inline expansions: 3 (0 bytes) */

// <060E04F0> meshutils/modelmeshutils.cpp:37
// variables: 6
// function calls: 11
void ApplyTransformToPositionStreams(const matrix3x4_t& mTransform, CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >& streams)
{
	const int  nNumStreams; // 39
	{
		int iStream; // 43
		{
			CModelStreamAccessor& stream; // 45
			const int  nNumValues; // 46
			Vector* pVectorArray; // 47
			{
				int iValue; // 49
				Vector::Vector(); // 1306
				VectorTransform(const Vector& in1,
						const matrix3x4_t& in2,
						Vector& out);  // 1307
				VectorTransform(const Vector& in1,
						const matrix3x4_t& in2);  // 51
				Vector::operator=(
						const Vector& vOther);  // 51
			}
			CUtlMemory<CModelStreamAccessor, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::operator[](
					int i);  // 45
			CModelStreamReader::Count(); // 46
			CModelStreamReader::GetStreamType(); // 618
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 618
			CModelStreamAccessor::GetValuesBase<Vector>(); // 47
		}
	}
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Count(); // 39
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <060DFB5E> meshutils/modelmeshutils.cpp:59
// variables: 12
// function calls: 31
void ApplyTransformToNormalStreams(const matrix3x4_t& mTransform, CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >& streams, bool bUseInverseTranspose, bool bNormalize)
{
	const int  nNumStreams; // 61
	matrix3x4_t mNormalTransform; // 68
	{
		int iStream; // 78
		{
			CModelStreamAccessor& stream; // 80
			const int  nNumValues; // 81
			ModelStreamDataType_t nDataType; // 82
			{
				Vector* pNormalArray; // 86
				{
					int iValue; // 89
					Vector::Vector(); // 1314
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2,
							Vector& out);  // 1315
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2);  // 91
					Vector::operator=(
							const Vector& vOther);  // 91
					Vector::NormalizeInPlace(); // 92
				}
				{
					int iValue; // 97
					Vector::Vector(); // 1314
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2,
							Vector& out);  // 1315
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2);  // 99
					Vector::operator=(
							const Vector& vOther);  // 99
				}
				CModelStreamReader::GetStreamType(); // 618
				GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 618
				CModelStreamAccessor::GetValuesBase<Vector>(); // 86
			}
			{
				Vector4D* pNormalArray; // 106
				{
					int iValue; // 109
					Vector::Vector(); // 1314
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2,
							Vector& out);  // 1315
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2);  // 111
					Vector::operator=(
							const Vector& vOther);  // 111
					Vector::NormalizeInPlace(); // 112
				}
				{
					int iValue; // 117
					Vector::Vector(); // 1314
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2,
							Vector& out);  // 1315
					VectorRotate(const Vector& in1,
							const matrix3x4_t& in2);  // 119
					Vector::operator=(
							const Vector& vOther);  // 119
				}
				CModelStreamReader::GetStreamType(); // 618
				GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 618
				{
				}
				CModelStreamAccessor::GetValuesBase<Vector4D>(); // 615
				CModelStreamAccessor::GetValuesBase<Vector4D>(); // 106
			}
			CUtlMemory<CModelStreamAccessor, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::operator[](
					int i);  // 80
			CModelStreamReader::Count(); // 81
			CModelStreamReader::GetStreamDataType(); // 82
		}
	}
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Count(); // 61
	matrix3x4_t::matrix3x4_t(); // 68
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <060DE6FC> meshutils/modelmeshutils.cpp:129
// variables: 6
// function calls: 90
void ApplyTransform(CModelMesh* pMesh, const matrix3x4_t& mTransform)
{
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > positionStreams; // 132
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > normalStreams; // 137
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > tangentStreams; // 142
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > localVectorStreams; // 147
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > positionDeltaStreams; // 152
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > normalDeltaStreams; // 156
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 132
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 137
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 142
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 147
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 152
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 156
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 160
} /* size: 0, variables: 6, inline expansions: 90 (0 bytes) */

// <060DD589> meshutils/modelmeshutils.cpp:165
// variables: 7
// function calls: 76
void ApplyScale(CModelMesh* pMesh, const Vector vScale)
{
	matrix3x4_t mScale; // 167
	int nSignCount; // 170
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > positionStreams; // 181
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > normalStreams; // 186
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > tangentStreams; // 191
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > localVectorStreams; // 196
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> > positionDeltaStreams; // 201
	SetScaleMatrix(const Vector& scale,
			matrix3x4_t& dst);  // 168
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 181
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 186
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 191
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 196
	CUtlMemory<CModelStreamAccessor, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelStreamAccessor, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::CUtlVector(); // 201
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 204
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 204
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 204
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 204
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::RemoveAll(); // 1798
	CUtlMemory<CModelStreamAccessor, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 903
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 1799
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::Purge(); // 560
	ValidateAlignment<CModelStreamAccessor>(void); // 508
	CUtlMemory<CModelStreamAccessor, int>::Purge(); // 510
	CUtlMemory<CModelStreamAccessor, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelStreamAccessor, CUtlMemory<CModelStreamAccessor, int> >::~CUtlVector(); // 204
} /* size: 0, variables: 7, inline expansions: 76 (0 bytes) */

// <060DCD59> meshutils/modelmeshutils.cpp:209
// variables: 4
// function calls: 32
void GetVertexPositions(const CModelMesh* pMesh, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutVector)
{
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> > positionStreams; // 211
	const char   __FUNCTION__; // 12094
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 216
	}
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::CUtlVector(); // 211
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 220
	CModelStreamReader::GetStreamType(); // 516
	GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 516
	CUtlMemory<Vector, int>::NumAllocated(); // 782
	CUtlMemory<Vector, int>::Base(); // 112
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 368
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
			int num);  // 784
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowVector(
			int num);  // 1484
	{
		int i; // 1500
		CUtlMemory<Vector, int>::operator[](
				int i);  // 602
		CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
			int i);  // 1502
		CopyConstruct<Vector>(Vector* pMemory,
					const Vector& src);  // 1502
	}
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::InsertMultipleBefore(
				int elem,
				int num,
				const Vector* pToInsert);  // 1476
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::InsertMultipleBefore(
				int elem,
				int num,
				const Vector* pToInsert);  // 1303
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddMultipleToTail(
				int num,
				const Vector* pToCopy);  // 522
	CModelStreamReader::GetAllValues<Vector>(
				CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutValues);  // 513
	CModelStreamReader::GetAllValues<Vector>(
				CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutValues);  // 220
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 903
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 1799
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::Purge(); // 560
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVector(); // 221
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 903
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 1799
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::Purge(); // 560
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVector(); // 221
} /* size: 0, variables: 2, inline expansions: 29 (0 bytes) */

// <060DC20F> meshutils/modelmeshutils.cpp:226
// variables: 10
// function calls: 42
void GetPositionsAndNormals(const CModelMesh* pMesh, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutPositions, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutNormals)
{
	const int  nNumFaceVertices; // 228
	VertexStreamIndex_t nPositionStream; // 231
	FaceVertexStreamIndex_t nNormalStream; // 237
	{
		int iFaceVertex; // 255
		{
			FaceVertexHandle_t hFaceVertex; // 257
			CFaceVertex faceVertex; // 258
			VertexHandle_t hVertex; // 260
			CVertex vertex; // 261
			const int  nFaceVertexDataIndex; // 263
			const int  nVertexDataIndex; // 264
			CVertex::GetValue<Vector>(
					VertexStreamIndex_t nStream);  // 268
			CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator!=(
					const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 266
			CUtlMemory<Vector, int>::NumAllocated(); // 1247
			CUtlMemory<Vector, int>::operator[](
					int i);  // 602
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
				int i);  // 1252
			Construct<Vector, Vector>(Vector* pMemory); // 1252
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 368
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
					int num);  // 1249
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddToTail(
					Vector& src);  // 268
			CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
					const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 271
			CFaceVertex::GetValue<Vector>(
					FaceVertexStreamIndex_t nStream);  // 273
			CUtlMemory<Vector, int>::NumAllocated(); // 1247
			CUtlMemory<Vector, int>::operator[](
					int i);  // 602
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
				int i);  // 1252
			Construct<Vector, Vector>(Vector* pMemory); // 1252
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 368
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
					int num);  // 1249
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddToTail(
					Vector& src);  // 273
		}
	}
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 234
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 240
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator!=(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 244
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Count(); // 246
	CUtlMemory<Vector, int>::IsGrowable(); // 881
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 888
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::EnsureCapacity(
			int num);  // 246
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 249
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Count(); // 251
	CUtlMemory<Vector, int>::IsGrowable(); // 881
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 888
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::EnsureCapacity(
			int num);  // 251
} /* size: 0, variables: 3, inline expansions: 20 (0 bytes) */

// <060DBD89> meshutils/modelmeshutils.cpp:281
// variables: 4
// function calls: 14
void ComputeBounds(const CModelMesh* pMesh, AABB_t* pOutBounds)
{
	VertexStreamIndex_t nPositionStream; // 285
	const int  nNumValues; // 289
	const Vector* pPositions; // 290
	{
		int i; // 294
		AABB_t::AddPointToBounds(
				const Vector& vPoint);  // 296
	}
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 138
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 139
	AABB_t::MakeInvalid(); // 283
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 285
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 286
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 289
	CModelStreamReader::Count(); // 289
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 290
	CModelStreamReader::GetStreamType(); // 499
	GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 499
	CModelStreamReader::GetValuesBase<Vector>(); // 290
} /* size: 0, variables: 3, inline expansions: 13 (0 bytes) */

// <060DB912> meshutils/modelmeshutils.cpp:303
// variable: 1
// function calls: 18
void GetTriangles(const CModelMesh* pMesh, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutTrianglePositions, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* pOutTriangleIndices)
{
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > allFaces; // 305
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 305
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 307
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
	Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 307
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 308
} /* size: 0, variables: 1, inline expansions: 18 (0 bytes) */

// <060DB545> meshutils/modelmeshutils.cpp:313
// variables: 3
// function calls: 13
void GetTrianglesForFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutTrianglePositions, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* pOutTriangleIndices)
{
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> > positionStreams; // 315
	const char   __FUNCTION__; // 12143
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 320
	}
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::CUtlVector(); // 315
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 903
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 1799
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::Purge(); // 560
	ValidateAlignment<CModelMesh::VertexStreamIndex_t>(void); // 508
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::Purge(); // 510
	CUtlMemory<CModelMesh::VertexStreamIndex_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CModelMesh::VertexStreamIndex_t, CUtlMemory<CModelMesh::VertexStreamIndex_t, int> >::~CUtlVector(); // 325
} /* size: 0, variables: 2, inline expansions: 13 (0 bytes) */

// <060DAAB1> meshutils/modelmeshutils.cpp:330
// variables: 11
// function calls: 38
void GetTrianglesForFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, VertexStreamIndex_t nPositionStream, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutTrianglePositions, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* pOutTriangleIndices)
{
	const Vector* pVertexPositions; // 337
	const char   __FUNCTION__; // 12143
	const int  nInitialOutputPositionCount; // 345
	const int  nInitialOutputIndexCount; // 346
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > triangleVertices; // 349
	const int  nNumVertices; // 354
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 338
	}
	{
		int iVertex; // 356
		{
			int nDataIndex; // 358
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 368
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
					int num);  // 1198
			CUtlMemory<Vector, int>::operator[](
					int i);  // 602
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
				int i);  // 1201
			CopyConstruct<Vector>(Vector* pMemory,
						const Vector& src);  // 1201
			CUtlMemory<Vector, int>::NumAllocated(); // 1196
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddToTail(
					const Vector& src);  // 359
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
					int i);  // 358
		}
	}
	{
		const int  nNumIndices; // 365
		{
			int iIndex; // 366
			CUtlMemory<unsigned int, int>::operator[](
					int i);  // 602
			CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Element(
				int i);  // 368
		}
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 365
	}
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 337
	CModelStreamReader::GetStreamType(); // 499
	GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 499
	CModelStreamReader::GetValuesBase<Vector>(); // 337
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Count(); // 345
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 346
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 530
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 349
	CUtlMemory<Vector, int>::IsGrowable(); // 881
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 888
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::EnsureCapacity(
			int num);  // 355
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 373
} /* size: 0, variables: 6, inline expansions: 24 (0 bytes) */

// <060DA99B> meshutils/modelmeshutils.cpp:378
// variables: 5
void CountTrianglesForFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, int* pOutTotalNumTriangles, int* pOutMaxVerticesPerFace, int* pOutMaxUniqueVertices)
{
	int nTotalNumTriangles; // 380
	int nMaxVerticesPerFace; // 381
	int nMaxUniqueVertices; // 382
	{
		int iFace; // 384
		{
			int nNumVerticesInFace; // 386
		}
	}
} /* size: 0, variables: 3 */

// <060D4F22> meshutils/modelmeshutils.cpp:408
// variables: 37
// function calls: 383
void GetTrianglesForFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, VertexStreamIndex_t nPositionStream, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutVertices, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* pOutTriangleVertexIndices, CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon pOutFaceVertices, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* pOutTriangleFaceVertexIndices, CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> >* pOutFaceTriangleCounts)
{
	const char   __FUNCTION__; // 12143
	const Vector* pVertexPositions; // 435
	int nTotalNumTriangles; // 442
	int nMaxVerticesPerFace; // 442
	int nMaxUniqueVertices; // 442
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesForFace; // 465
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVerticesForFace; // 469
	CUtlVectorFixedGrowable<Vector, 16> vertexPositionsForFace; // 473
	CUtlVectorFixedGrowable<unsigned int, 16> outputVertexIndicesForFace; // 477
	CUtlVectorFixedGrowable<unsigned int, 16> outputFaceVertexIndicesForFace; // 481
	const int  nMaxTriangleIndcesPerFace; // 485
	CUtlVectorFixedGrowable<int, 64> triangleIndicesForFace; // 486
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueVertices; // 495
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueFaceVertices; // 498
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 419
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 424
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 429
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 436
	}
	{
		int iFace; // 501
		{
			const int  nNumVerticesInFace; // 514
			int nNumTriangleIndicesForFace; // 515
			{
				int iVertex; // 546
				{
					VertexHandle_t hVertex; // 550
					int nVertexIndex; // 551
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
							int i);  // 550
					ComponentHandleWithListPointer_t::AsInt(); // 869
					Mix32HashFunctor::operator(
							uint32 n);  // 869
					DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>::operator(
							const VertexHandle_t& handle);  // 218
					Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
						KeyArg_t k);  // 302
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this,
							int i);  // 294
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::GetValue(); // 294
					Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
						handle_t idx);  // 302
					Get(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
						KeyArg_t k,
						const Element_t& defaultValue);  // 551
					CUtlMemory<unsigned int, int>::operator[](
							int i);  // 588
					CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::operator[](
							int i);  // 557
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 602
					Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						int i);  // 1201
					CopyConstruct<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 368
					ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 824
					GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
							int num);  // 1198
					AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
							const ComponentHandleWithListPointer_t& src);  // 554
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
							int i);  // 720
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>(
																const ComponentHandleWithListPointer_t& k,
																const int& v);  // 1514
					Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&, int&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 720
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 714
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 249
					Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
						KeyArg_t k,
						ValueArg_t v,
						bool* pDidInsert);  // 555
				}
				{
					FaceVertexHandle_t hFaceVertex; // 562
					int nFaceVertexIndex; // 563
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
							int i);  // 562
					ComponentHandleWithListPointer_t::AsInt(); // 878
					Mix32HashFunctor::operator(
							uint32 n);  // 878
					DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>::operator(
							const FaceVertexHandle_t& handle);  // 218
					Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, Defaul this,
						KeyArg_t k);  // 302
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointe this,
							int i);  // 294
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::GetValue(); // 294
					Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, Defaul this,
						handle_t idx);  // 302
					Get(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, Defaul this,
						KeyArg_t k,
						const Element_t& defaultValue);  // 563
					CUtlMemory<unsigned int, int>::operator[](
							int i);  // 588
					CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::operator[](
							int i);  // 569
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 602
					Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
						int i);  // 1201
					CopyConstruct<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 368
					ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 824
					GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
							int num);  // 1198
					AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
							const ComponentHandleWithListPointer_t& src);  // 566
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this,
							int i);  // 720
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>(
																const ComponentHandleWithListPointer_t& k,
																const int& v);  // 1514
					Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t&, int&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 720
					DoInsert<const CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 714
					DoInsert<const CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 249
					Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
						KeyArg_t k,
						ValueArg_t v,
						bool* pDidInsert);  // 567
				}
			}
			{
				int iTriangleIndex; // 576
				{
					const int  nVertexInFace; // 578
					{
						const int  nOutputVertexIndex; // 582
						CUtlMemory<unsigned int, int>::operator[](
								int i);  // 588
						CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::operator[](
								int i);  // 582
						CUtlMemory<unsigned int, int>::NumAllocated(); // 1247
						CUtlMemory<unsigned int, int>::operator[](
								int i);  // 602
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Element(
							int i);  // 1252
						Construct<unsigned int, unsigned int>(unsigned int* pMemory); // 1252
						CUtlMemory<unsigned int, int>::Base(); // 112
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 368
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 824
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::GrowMemory(
								int num);  // 1249
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::AddToTail(
								unsigned int& src);  // 583
					}
					{
						const int  nOutputFaceVertexIndex; // 588
						CUtlMemory<unsigned int, int>::Base(); // 112
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 368
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 824
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::GrowMemory(
								int num);  // 1249
						CUtlMemory<unsigned int, int>::NumAllocated(); // 1247
						CUtlMemory<unsigned int, int>::operator[](
								int i);  // 602
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Element(
							int i);  // 1252
						Construct<unsigned int, unsigned int>(unsigned int* pMemory); // 1252
						CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::AddToTail(
								unsigned int& src);  // 589
						CUtlMemory<unsigned int, int>::operator[](
								int i);  // 588
						CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::operator[](
								int i);  // 588
					}
					CUtlMemory<int, int>::operator[](
							int i);  // 588
					CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::operator[](
							int i);  // 578
				}
			}
			CUtlMemory<short unsigned int, int>::operator[](
					int i);  // 602
			CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::Element(
				int i);  // 538
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 504
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 509
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 514
			Max<int>(const int& val1,
				const int& val2);  // 516
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::RemoveMultipleFromTail(
						int num);  // 1323
			CUtlMemory<Vector, int>::NumAllocated(); // 782
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::Base(); // 368
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::GrowMemory(
					int num);  // 784
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::GrowVector(
					int num);  // 1445
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::InsertMultipleBefore(
						int elem,
						int num);  // 1437
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::InsertMultipleBefore(
						int elem,
						int num);  // 1294
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::AddMultipleToTail(
						int num);  // 1319
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::SetCount(
				int count);  // 521
			CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
			CUtlMemory<int, int>::ValidateGrowSize(); // 475
			CUtlMemory<int, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 333
			{
				int i; // 562
				Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCompon this); // 541
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentReference_t, int>::operator[](
						int i);  // 595
				operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCompon this,
						int i);  // 546
				ComponentHandleWithListPointer_t::operator!=(
						const ComponentHandleWithListPointer_t& src);  // 547
				CHalfEdgeComponentList<CModelMesh::Vertex_t>::GetComponentIndex(
							ComponentHandle_t handle);  // 564
			}
			CHalfEdgeComponentList<CModelMesh::Vertex_t>::GetComponentIndices(
						const int  nCount,
						const ComponentHandle_t* pComponents,
						ComponentIndex_t* pOutIndices);  // 335
			CModelStreamReader::GetStreamType(); // 567
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 567
			CModelStreamReader::GetValues<Vector>(
						int nNumValues,
						const int* pValueIndices,
						Vector* pOutValues);  // 337
			CUtlMemory<int, int>::Purge(); // 903
			CUtlMemory<int, int>::Purge(); // 1799
			CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
			ValidateAlignment<int>(void); // 508
			CUtlMemory<int, int>::Purge(); // 510
			CUtlMemory<int, int>::~CUtlMemory(); // 562
			CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
			CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 338
			CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetComponentDataValues<Vector>(
							VertexStreamIndex_t nStream,
							int nNumComponents,
							const ComponentHandle_t* pComponentHandles,
							Vector* pOutValues);  // 522
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::Base(); // 522
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 522
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::Count(); // 523
			CUtlMemory<int, int>::Base(); // 112
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::Base(); // 523
			CUtlMemory<Vector, int>::Base(); // 112
			CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::Base(); // 523
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::operator[](
					int i);  // 530
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::operator[](
					int i);  // 531
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::operator[](
					int i);  // 532
		}
	}
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 435
	CModelStreamReader::GetStreamType(); // 499
	GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 499
	CModelStreamReader::GetValuesBase<Vector>(); // 435
	{
		int iFace; // 384
		{
			int nNumVerticesInFace; // 386
			Max<int>(const int& val1,
				const int& val2);  // 390
		}
	}
	CountTrianglesForFaces(const CModelMesh* pMesh,
				const FaceHandle_t* pFaces,
				int nNumFaces,
				int* pOutTotalNumTriangles,
				int* pOutMaxVerticesPerFace,
				int* pOutMaxUniqueVertices);  // 443
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 449
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int num);  // 449
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 450
	CUtlMemory<unsigned int, int>::IsGrowable(); // 881
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 888
	CUtlMemory<unsigned int, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::EnsureCapacity(
			int num);  // 450
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 455
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int num);  // 455
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 456
	CUtlMemory<unsigned int, int>::IsGrowable(); // 881
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 888
	CUtlMemory<unsigned int, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::EnsureCapacity(
			int num);  // 456
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 465
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int num);  // 466
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int num);  // 470
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 469
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 888
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::EnsureCapacity(
			int num);  // 474
	CUtlMemory<Vector, int>::CUtlMemory(
			Vector* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<Vector, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<Vector, int>::CUtlMemoryFixedGrowable_Base(
					Vector* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, Vector, 4>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, Vector>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<16, Vector, 4>::Base(); // 231
	CUtlMemoryFixedGrowable<Vector, 16, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<Vector, 16>::CUtlVectorFixedGrowable(
				int growSize);  // 473
	CUtlMemory<unsigned int, int>::CUtlMemory(
			unsigned int* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<unsigned int, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::CUtlMemoryFixedGrowable_Base(
					unsigned int* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, unsigned int>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::Base(); // 231
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<unsigned int, 16>::CUtlVectorFixedGrowable(
				int growSize);  // 477
	CUtlMemory<int, int>::CUtlMemory(
			int* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<int, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<int, int>::CUtlMemoryFixedGrowable_Base(
					int* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<64, int, 4>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<64, int>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<64, int, 4>::Base(); // 231
	CUtlMemoryFixedGrowable<int, 64, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<int, 64>::CUtlVectorFixedGrowable(
				int growSize);  // 486
	CUtlMemory<unsigned int, int>::CUtlMemory(
			unsigned int* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<unsigned int, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::CUtlMemoryFixedGrowable_Base(
					unsigned int* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, unsigned int>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::Base(); // 231
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<unsigned int, 16>::CUtlVectorFixedGrowable(
				int growSize);  // 481
	CUtlMemory<int, int>::IsExternallyAllocated(); // 888
	CUtlMemory<int, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::EnsureCapacity(
			int num);  // 487
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
			int minimumSize);  // 495
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 496
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
			int minimumSize);  // 498
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
		int expected);  // 499
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 932
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(
		int numElements);  // 918
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(
		int numElements);  // 1837
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1855
	Compact(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 597
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 368
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1855
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Compact(); // 598
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 932
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(
		int numElements);  // 918
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(
		int numElements);  // 1837
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1855
	Compact(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 603
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 368
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1855
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Compact(); // 604
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointe this); // 897
			IsValid(const CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> this); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointe this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, i this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 608
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 608
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::RemoveAll(); // 1798
	AlignedByteArrayExplicit_t<64, int, 4>::Base(); // 237
	CUtlMemory<int, int>::IsExternallyAllocated(); // 577
	CUtlMemory<int, int>::ConvertToExternalMemory(
				int* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<int, int>::Purge_FixedGrowable(
				int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<int, int>::Purge_FixedGrowable(
				int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<int, 64, int>::Purge(
		int numElements);  // 1799
	CUtlMemory<int, int>::Base(); // 112
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::Base(); // 368
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::Purge(); // 560
	ValidateAlignment<int>(void); // 508
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 510
	CUtlMemory<int, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<int, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<int, 64, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 64, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<int, 64>::~CUtlVectorFixedGrowable(); // 608
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::RemoveAll(); // 1798
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::Base(); // 237
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 577
	CUtlMemory<unsigned int, int>::ConvertToExternalMemory(
				unsigned int* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::Purge(
		int numElements);  // 1799
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::Base(); // 368
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<unsigned int, 16>::~CUtlVectorFixedGrowable(); // 608
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::RemoveAll(); // 1798
	AlignedByteArrayExplicit_t<16, unsigned int, 4>::Base(); // 237
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 577
	CUtlMemory<unsigned int, int>::ConvertToExternalMemory(
				unsigned int* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::Purge(
		int numElements);  // 1799
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::Base(); // 368
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<unsigned int, 16, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 16, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<unsigned int, 16>::~CUtlVectorFixedGrowable(); // 608
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::RemoveAll(); // 1798
	AlignedByteArrayExplicit_t<16, Vector, 4>::Base(); // 237
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 577
	CUtlMemory<Vector, int>::ConvertToExternalMemory(
				Vector* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<Vector, int>::Purge_FixedGrowable(
				Vector* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<Vector, int>::Purge_FixedGrowable(
				Vector* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<Vector, 16, int>::Purge(
		int numElements);  // 1799
	CUtlMemory<Vector, int>::Base(); // 112
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::Base(); // 368
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<Vector, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<Vector, 16, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<Vector, CUtlMemoryFixedGrowable<Vector, 16, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<Vector, 16>::~CUtlVectorFixedGrowable(); // 608
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 608
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 608
} /* size: 0, variables: 14, inline expansions: 239 (0 bytes) */

// <060D3F04> meshutils/modelmeshutils.cpp:613
// variables: 17
// function calls: 43
bool ComputeTangentSpaceForFaceVertices(const CModelMesh* pMesh, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutFaceVerticesAxisU, CUtlVector<Vector, CUtlMemory<Vector, int> >* pOutFaceVerticesAxisV)
{
	const float  flTolerance; // 615
	VertexStreamIndex_t nPositionStream; // 617
	FaceVertexStreamIndex_t nNormalStream; // 618
	FaceVertexStreamIndex_t nTexcoordStream; // 619
	const int  nNumFaceVertices; // 627
	{
		int iFaceVertex; // 631
		{
			const FaceVertexHandle_t  hTargetFaceVertex; // 633
			Vector& vAxisU; // 635
			Vector& vAxisV; // 636
			FaceHandle_t hFace; // 641
			{
				Vector vPositions; // 650
				Vector2D vTexCoords; // 651
				FaceVertexHandle_t hPrevFaceVertex; // 658
				Vector vPrevToTarget; // 666
				FaceVertexHandle_t hCurrentFaceVertex; // 668
				{
					Vector vTargetToCurrent; // 677
					CFaceVertex::GetValue<Vector>(
							VertexStreamIndex_t nVertexStream);  // 672
					Vector::operator=(
							const Vector& vOther);  // 672
					CFaceVertex::GetValue<Vector2D>(
								FaceVertexStreamIndex_t nStream);  // 673
					Vector2D::operator=(
							const Vector2D& vOther);  // 673
					VectorSubtract(const Vector& a,
							const Vector& b,
							Vector& c);  // 1444
					Vector::Vector(); // 1443
					Vector::operator-(
							const Vector& v);  // 677
					Vector::Normalized(); // 677
					DotProduct(const Vector& a,
							const Vector& b);  // 1167
					Vector::Dot(
						const Vector& vOther);  // 678
				}
				CFaceVertex::GetValue<Vector>(
						VertexStreamIndex_t nVertexStream);  // 654
				Vector::operator=(
						const Vector& vOther);  // 654
				CFaceVertex::GetValue<Vector2D>(
							FaceVertexStreamIndex_t nStream);  // 655
				Vector2D::operator=(
						const Vector2D& vOther);  // 655
				CFaceVertex::GetValue<Vector>(
						VertexStreamIndex_t nVertexStream);  // 659
				Vector::operator=(
						const Vector& vOther);  // 659
				CFaceVertex::GetValue<Vector2D>(
							FaceVertexStreamIndex_t nStream);  // 660
				Vector2D::operator=(
						const Vector2D& vOther);  // 660
				VectorSubtract(const Vector& a,
						const Vector& b,
						Vector& c);  // 1444
				Vector::Vector(); // 1443
				Vector::operator-(
						const Vector& v);  // 666
				Vector::Normalized(); // 666
				ComponentHandleWithListPointer_t::operator!=(
						const ComponentHandleWithListPointer_t& src);  // 685
			}
			{
				const Vector& vNormal; // 692
				CFaceVertex::GetValue<Vector>(
						FaceVertexStreamIndex_t nStream);  // 692
			}
			CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
					const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 647
			Vector::operator=(
					const Vector& vOther);  // 637
			CUtlMemory<Vector, int>::operator[](
					int i);  // 602
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
				int i);  // 635
			CUtlMemory<Vector, int>::operator[](
					int i);  // 602
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
				int i);  // 636
			Vector::operator=(
					const Vector& vOther);  // 638
			ComponentHandleWithListPointer_t::operator==(
					InvalidMeshComponent_t);  // 642
		}
	}
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 617
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 618
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 619
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 623
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 624
} /* size: 0, variables: 5, inline expansions: 11 (0 bytes) */

// <060D2C6B> meshutils/modelmeshutils.cpp:705
// variables: 26
// function calls: 60
bool ComputeAveragedFaceVertexTangents(CModelMesh* pMesh, FaceVertexStreamIndex_t nTangentStream, const Vector* pFaceVerticesTextureAxisU, const Vector* pFaceVerticesTextureAxisV)
{
	FaceVertexStreamIndex_t nNormalStream; // 710
	FaceVertexStreamIndex_t nTexCoordStream; // 711
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVerticesConnectedToTargetVertex; // 718
	const int  nNumFaceVertices; // 720
	{
		int iFaceVertex; // 721
		{
			const FaceVertexHandle_t  hTargetFaceVertex; // 723
			CFaceVertex targetFaceVertex; // 724
			const VertexHandle_t  hTargetVertex; // 727
			const Vector  vTargetNormal; // 732
			Vector2D vTargetTexcoord; // 733
			const int  nTargetFaceVertexIndex; // 741
			Vector vSumAxisU; // 742
			Vector vSumAxisV; // 743
			const bool  bTargetLeftHanded; // 744
			const int  nNumFacesConnectedToVertex; // 751
			Vector4D vTangent; // 788
			{
				int iConnectedVertex; // 752
				{
					FaceVertexHandle_t hConnectedFaceVertex; // 754
					const CFaceVertex  connectedFaceVertex; // 755
					const Vector  vConnectedNormal; // 770
					float flDot; // 771
					const int  nConnectedFaceVertexIndex; // 776
					Vector vAxisU; // 777
					Vector vAxisV; // 778
					bool bLeftHanded; // 779
					{
						const Vector2D  vConnectedTexcoord; // 764
						CFaceVertex::GetValue<Vector2D>(
									FaceVertexStreamIndex_t nStream);  // 764
					}
					ComponentHandleWithListPointer_t::operator==(
							const ComponentHandleWithListPointer_t& src);  // 758
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
							int i);  // 754
					CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
							const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 762
					CFaceVertex::GetValue<Vector>(
							FaceVertexStreamIndex_t nStream);  // 770
					DotProduct(const Vector& a,
							const Vector& b);  // 1167
					Vector::Dot(
						const Vector& vOther);  // 771
					Vector::Vector(
						vec_t X,
						vec_t Y,
						vec_t Z);  // 1508
					CrossProduct(const Vector& a,
							const Vector& b);  // 779
					DotProduct(const Vector& a,
							const Vector& b);  // 779
					Vector::operator+=(
							const Vector& v);  // 782
					Vector::operator+=(
							const Vector& v);  // 783
				}
			}
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 653
			CModelStreamReader::GetStreamType(); // 653
			CModelStreamAccessor::SetValues<Vector4D>(
						int nNumValues,
						const int* pValueIndices,
						const Vector4D* pValues);  // 353
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCo this); // 541
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, int>::operator[](
					int i);  // 595
			operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCo this,
					int i);  // 546
			ComponentHandleWithListPointer_t::operator!=(
					const ComponentHandleWithListPointer_t& src);  // 547
			CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::GetComponentIndex(
						ComponentHandle_t handle);  // 307
			CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetComponentDataIndex(
						const ComponentHandle_t  hComponent);  // 348
			{
			}
			CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::SetComponentDataValue<Vector4D>(
							FaceVertexStreamIndex_t nStream,
							ComponentHandle_t hComponent,
							const Vector4D& value);  // 1100
			CFaceVertex::SetValue<Vector4D>(
						FaceVertexStreamIndex_t nStream,
						const Vector4D& value);  // 792
			CFaceVertex::GetValue<Vector>(
					FaceVertexStreamIndex_t nStream);  // 732
			ComponentHandleWithListPointer_t::operator==(
					const ComponentHandleWithListPointer_t& src);  // 728
			Vector2D::Vector2D(
				const Vector2D& vOther);  // 733
			CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
					const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 734
			CFaceVertex::GetValue<Vector2D>(
						FaceVertexStreamIndex_t nStream);  // 736
			Vector2D::operator=(
					const Vector2D& vOther);  // 736
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 747
			DotProduct(const Vector& a,
					const Vector& b);  // 744
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 1508
			CrossProduct(const Vector& a,
					const Vector& b);  // 744
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 751
			Vector4D::Vector4D(); // 788
		}
	}
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 710
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 711
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 714
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 715
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 472
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 419
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 718
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 796
} /* size: 0, variables: 4, inline expansions: 24 (0 bytes) */

// <060D2352> meshutils/modelmeshutils.cpp:801
// variables: 6
// function calls: 34
void ComputeTangents(CModelMesh* pMesh)
{
	CUtlVector<Vector, CUtlMemory<Vector, int> > faceVerticesAxisU; // 804
	CUtlVector<Vector, CUtlMemory<Vector, int> > faceVerticesAxisV; // 805
	const char   __FUNCTION__; // 12023
	FaceVertexStreamIndex_t nTangentStream; // 813
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 809
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 810
	}
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 804
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 805
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 827
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 827
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 813
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 814
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 196
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::AddStream(
			const char* pStreamName,
			ModelStreamType_t nStreamType);  // 816
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 819
} /* size: 0, variables: 4, inline expansions: 34 (0 bytes) */

// <060D178F> meshutils/modelmeshutils.cpp:832
// variables: 4
// function calls: 52
void ComputeTangentsMikkTSpace(CModelMesh* pMesh)
{
	VertexStreamIndex_t nPositionStream; // 834
	FaceVertexStreamIndex_t nNormalStream; // 835
	FaceVertexStreamIndex_t nTexCoordStream; // 836
	{
		CModelMeshComputeTangents_MikkTSpace tangentComputationHelper; // 852
		CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned int, int>::Purge(); // 903
		CUtlMemory<unsigned int, int>::Purge(); // 1799
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
		ValidateAlignment<unsigned int>(void); // 508
		CUtlMemory<unsigned int, int>::Purge(); // 510
		CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 16
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
		CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned int, int>::Purge(); // 903
		CUtlMemory<unsigned int, int>::Purge(); // 1799
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
		ValidateAlignment<unsigned int>(void); // 508
		CUtlMemory<unsigned int, int>::Purge(); // 510
		CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 16
		RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
		Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
		ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
		~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 16
		RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1798
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
		Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
		ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
		~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 16
		CModelMeshComputeTangents_MikkTSpace::~CModelMeshComputeTangents_MikkTSpace(); // 854
	}
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 834
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 835
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 836
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 839
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 840
} /* size: 0, variables: 3, inline expansions: 11 (0 bytes) */

// <060CFFAD> meshutils/modelmeshutils.cpp:860
// variables: 16
// function calls: 100
void ComputeFacetedNormals(CModelMesh* pMesh)
{
	VertexStreamIndex_t positionStream; // 862
	FaceVertexStreamIndex_t nNormalStream; // 866
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > allFaces; // 875
	{
		FaceHandle_t hFace; // 878
		CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 11105
		iterator __for_begin; // 16588
		iterator __for_end; // 16588
		{
			CFace face; // 880
			CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verts; // 882
			CUtlVector<Vector, CUtlMemory<Vector, int> > vertPositions; // 885
			Vector vNormal; // 892
			float flPlaneDist; // 893
			CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVerts; // 896
			{
				int iVert; // 887
				Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 887
				CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 824
				CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::GrowMemory(
						int num);  // 1249
				CUtlMemory<Vector, int>::operator[](
						int i);  // 602
				CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Element(
					int i);  // 1252
				Construct<Vector, Vector>(Vector* pMemory); // 1252
				CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::AddToTail(
						Vector& src);  // 889
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 588
				operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						int i);  // 889
				CVertex::GetValue<Vector>(
						VertexStreamIndex_t nStream);  // 889
			}
			{
				int iFaceVert; // 899
				{
					CFaceVertex faceVert; // 901
					GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 653
					CModelStreamReader::GetStreamType(); // 653
					CModelStreamAccessor::SetValues<Vector>(
								int nNumValues,
								const int* pValueIndices,
								const Vector* pValues);  // 353
					ComponentHandleWithListPointer_t::operator!=(
							const ComponentHandleWithListPointer_t& src);  // 547
					Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCo this); // 541
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, int>::operator[](
							int i);  // 595
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentReference_t, CUtlMemory<CHalfEdgeCo this,
							int i);  // 546
					CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::GetComponentIndex(
								ComponentHandle_t handle);  // 307
					CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetComponentDataIndex(
								const ComponentHandle_t  hComponent);  // 348
					{
					}
					CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::SetComponentDataValue<Vector>(
									FaceVertexStreamIndex_t nStream,
									ComponentHandle_t hComponent,
									const Vector& value);  // 1100
					CFaceVertex::SetValue<Vector>(
							FaceVertexStreamIndex_t nStream,
							const Vector& value);  // 902
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
							int i);  // 901
				}
				Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 899
			}
			CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
			CUtlMemory<Vector, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 885
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 530
			CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
					int growSize,
					int initCapacity);  // 418
			CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 882
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
			Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
			ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
			~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
			~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 904
			CUtlMemory<Vector, int>::Purge(); // 903
			CUtlMemory<Vector, int>::Purge(); // 1799
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
			ValidateAlignment<Vector>(void); // 508
			CUtlMemory<Vector, int>::Purge(); // 510
			CUtlMemory<Vector, int>::~CUtlMemory(); // 562
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
			CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 904
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1798
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
			Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
			ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
			~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
			~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 904
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 892
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
			CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
					int growSize,
					int initCapacity);  // 418
			CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 896
		}
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 102
		begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 878
		Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 104
		end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 878
	}
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 862
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 863
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 866
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 867
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 875
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 196
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::AddStream(
			const char* pStreamName,
			ModelStreamType_t nStreamType);  // 869
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 872
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 907
} /* size: 0, variables: 3, inline expansions: 27 (0 bytes) */

// <060CFE47> meshutils/modelmeshutils.cpp:912
// function call: 1
void AppendMesh(CModelMesh* pMesh, const CModelMesh& srcMesh)
{
	AppendFacesToMesh_Impl(CModelMesh* pMesh,
				const CModelMesh& srcMesh,
				const FaceHandle_t* pSrcFaces,
				const int  nNumSrcFaces);  // 920
} /* size: 0, inline expansions: 1 (0 bytes) */

// <060CFCDC> meshutils/modelmeshutils.cpp:925
// function call: 1
void AppendFacesFromMesh(CModelMesh* pMesh, const CModelMesh& srcMesh, const FaceHandle_t* pFaces, int nNumFaces)
{
	AppendFacesToMesh_Impl(CModelMesh* pMesh,
				const CModelMesh& srcMesh,
				const FaceHandle_t* pSrcFaces,
				const int  nNumSrcFaces);  // 927
} /* size: 0, inline expansions: 1 (0 bytes) */

// <060CF6FE> meshutils/modelmeshutils.cpp:933
// variables: 64
bool AppendFacesToMesh_Impl(CModelMesh* pMesh, const CModelMesh& srcMesh, const FaceHandle_t* pSrcFaces, const int nNumSrcFaces)
{
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesToAppend; // 941
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVerticesToAppend; // 945
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> > edgesToAppend; // 949
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > newVertices; // 960
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > newFaceVertices; // 961
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> > newEdges; // 962
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > newFaces; // 963
	CHandleTranslator vertexHandleTranslator; // 964
	CHandleTranslator faceVertexHandleTranslator; // 965
	CHandleTranslator edgeHandleTranslator; // 966
	CHandleTranslator faceHandleTranslator; // 967
	CUtlVector<int, CUtlMemory<int, int> > faceGroupRemapTable; // 978
	CUtlVector<int, CUtlMemory<int, int> > boneRemapTable; // 1001
	const int  nNumNewFaceVertices; // 1032
	const char   __FUNCTION__; // 12197
	const int  nNumNewEdges; // 1060
	const int  nNumNewFaces; // 1077
	CUtlVectorFixedGrowable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, 32> faceVerticesConnectedToSrcVertex; // 1102
	CUtlVectorFixedGrowable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, 32> faceVerticesConnectedToDstVertex; // 1103
	const int  nNumNewVertices; // 1105
	{
		CUtlVector<int, CUtlMemory<int, int> > srcFaceGroups; // 983
	}
	{
		CUtlVector<int, CUtlMemory<int, int> > srcBones; // 1006
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1033
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1034
	}
	{
		int iFaceVertex; // 1036
		{
			FaceVertexHandle_t hSrcFaceVertex; // 1038
			const FaceVertex_t* pSrcFaceVertex; // 1039
			FaceVertexHandle_t hNewFaceVertex; // 1041
			FaceVertex_t* pNewFaceVertex; // 1042
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1050
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1051
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1052
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1053
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1054
			}
		}
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1061
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1062
	}
	{
		int iEdge; // 1064
		{
			EdgeHandle_t hSrcEdge; // 1066
			const Edge_t* pSrcEdge; // 1067
			EdgeHandle_t hNewEdge; // 1069
			Edge_t* pNewEdge; // 1070
		}
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1078
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1079
	}
	{
		int iFace; // 1081
		{
			FaceHandle_t hSrcFace; // 1083
			const Face_t* pSrcFace; // 1084
			FaceHandle_t hNewFace; // 1086
			Face_t* pNewFace; // 1087
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1092
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1093
			}
		}
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1106
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1107
	}
	{
		int iVertex; // 1109
		{
			VertexHandle_t hSrcVertex; // 1111
			VertexHandle_t hNewVertex; // 1112
			Vertex_t* pNewVertex; // 1113
			const int  nNumFaceVerticesConnectedToSrcVertex; // 1125
			const int  nNumFaceVerticesConnectedToDstVertex; // 1140
			{
				int iSrcFaceVertex; // 1126
				{
					FaceVertexHandle_t hSrcFaceVertex; // 1128
					FaceVertexHandle_t hDstFaceVertex; // 1129
				}
			}
			{
				int iDstFaceVertex; // 1145
				{
					FaceVertexHandle_t hDstFaceVertex; // 1147
					FaceVertex_t* pFaceVertex; // 1148
				}
			}
		}
	}
} /* size: 0, variables: 20 */

// <060CE43D> meshutils/modelmeshutils.cpp:1168
// variables: 11
// function calls: 80
void FindFacesConnectedToVertices(const CModelMesh* pMesh, const VertexHandle_t* pVertices, int nNumVertices, CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pOutFaceList)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueFaces; // 1170
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > facesConnectedToVertex; // 1173
	{
		int iVertex; // 1177
		{
			VertexHandle_t hVertex; // 1179
			const int  nNumFaces; // 1182
			{
				int iFace; // 1183
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 588
				operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int i);  // 1185
				Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 650
				IdealIndex(uint32_if32BitStorage h,
						uint32 m);  // 653
				Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 651
				CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IdealIndex(
						uint32 slotmask);  // 656
				ComponentHandleWithListPointer_t::operator==(
						const ComponentHandleWithListPointer_t& src);  // 154
				DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>::operator(
						Arg_t a,
						Arg_t b);  // 670
				CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IdealIndex(
						uint32 slotmask);  // 667
				DoLookup<const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
																const ComponentHandleWithListPointer_t& x,
																unsigned int h,
																handle_t* pPreviousInChain);  // 697
				operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this,
						int i);  // 706
				CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(
																const ComponentHandleWithListPointer_t& k);  // 1514
				Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 706
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 695
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 240
				ComponentHandleWithListPointer_t::AsInt(); // 896
				Mix32HashFunctor::operator(
						uint32 n);  // 896
				DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>::operator(
						const FaceHandle_t& handle);  // 240
				Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
					KeyArg_t k);  // 1185
			}
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1182
		}
	}
	{
		UtlHashHandle_t hEntry; // 1191
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 1191
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
		GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				int num);  // 1198
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int i);  // 1201
		CopyConstruct<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
														const ComponentHandleWithListPointer_t& src);  // 1201
		AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				const ComponentHandleWithListPointer_t& src);  // 1193
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this,
				int i);  // 293
		Key(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
			handle_t idx);  // 1193
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 1191
	}
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
			int minimumSize);  // 1170
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
		int expected);  // 1171
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1173
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1190
	Count(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 1190
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int num);  // 1190
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1195
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, i this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>, i this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 1195
} /* size: 0, variables: 2, inline expansions: 35 (0 bytes) */

// <060CD6D8> meshutils/modelmeshutils.cpp:1201
// variables: 9
// function calls: 54
void FindVerticesConnectedToFaceVertices(const CModelMesh* pMesh, const FaceVertexHandle_t* pFaceVertices, int nNumFaceVertices, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutVertices)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueVertices; // 1204
	{
		int iFaceVertex; // 1207
		{
			FaceVertexHandle_t hFaceVertex; // 1209
			VertexHandle_t hVertex; // 1210
			operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
					int i);  // 706
			CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(
															const ComponentHandleWithListPointer_t& k);  // 1514
			Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 706
			DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
															const ComponentHandleWithListPointer_t& k,
															unsigned int h,
															bool* pDidInsert);  // 695
			DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
															const ComponentHandleWithListPointer_t& k,
															unsigned int h,
															bool* pDidInsert);  // 240
			Mix32HashFunctor::operator(
					uint32 n);  // 869
			ComponentHandleWithListPointer_t::AsInt(); // 869
			DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>::operator(
					const VertexHandle_t& handle);  // 240
			Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
				KeyArg_t k);  // 1211
		}
	}
	{
		UtlHashHandle_t hEntry; // 1216
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this); // 1216
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this,
				int i);  // 293
		Key(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
			handle_t idx);  // 1218
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int i);  // 1201
		CopyConstruct<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
														const ComponentHandleWithListPointer_t& src);  // 1201
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 368
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 824
		GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
				int num);  // 1198
		AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
				const ComponentHandleWithListPointer_t& src);  // 1218
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 1216
	}
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
			int minimumSize);  // 1204
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 1205
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 1215
	Count(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this); // 1215
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int num);  // 1215
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 1220
} /* size: 0, variables: 1, inline expansions: 20 (0 bytes) */

// <060E81DC> meshutils/modelmeshutils.cpp:1225
// variables: 3
void FindVerticesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutVertexList, CUtlVector<int, CUtlMemory<int, int> >* pOutVertexFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueVertices; // 1234
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesConnectedToFace; // 1237
	int nNumUniqueVertices; // 1270
} /* size: 0, variables: 3 */

// <060E69AE> meshutils/modelmeshutils.cpp:1225
// variables: 17
// function calls: 104
void FindVerticesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutVertexList, CUtlVector<int, CUtlMemory<int, int> >* pOutVertexFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueVertices; // 1234
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesConnectedToFace; // 1237
	int nNumUniqueVertices; // 1270
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
			int minimumSize);  // 1234
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
		int expected);  // 1235
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 1237
	{
		int iFace; // 1239
		{
			FaceHandle_t hFace; // 1241
			const int  nNumVertices; // 1248
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1244
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 1248
			{
				int iVertex; // 1249
				{
					VertexHandle_t hVertex; // 1251
					UtlHashHandle_t tableEntry; // 1252
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
							int i);  // 295
					Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
						handle_t idx);  // 1264
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
							int i);  // 1251
					ComponentHandleWithListPointer_t::AsInt(); // 869
					Mix32HashFunctor::operator(
							uint32 n);  // 869
					DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>::operator(
							const VertexHandle_t& handle);  // 218
					Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
						KeyArg_t k);  // 1252
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
							int i);  // 720
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>(
																const ComponentHandleWithListPointer_t& k,
																const int& v);  // 1514
					Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&, int&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 720
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 714
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 249
					Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
						KeyArg_t k,
						ValueArg_t v,
						bool* pDidInsert);  // 1257
				}
			}
		}
	}
	Count(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this); // 1270
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1273
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int num);  // 1274
	{
		UtlHashHandle_t hEntry; // 1276
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this); // 1276
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 368
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 824
		GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
				int num);  // 1198
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int i);  // 1201
		CopyConstruct<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
														const ComponentHandleWithListPointer_t& src);  // 1201
		AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
				const ComponentHandleWithListPointer_t& src);  // 1278
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this,
				int i);  // 293
		Key(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
			handle_t idx);  // 1278
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 1276
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1285
	CUtlMemory<int, int>::IsGrowable(); // 881
	CUtlMemory<int, int>::IsExternallyAllocated(); // 888
	CUtlMemory<int, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<int, CUtlMemory<int, int> >::EnsureCapacity(
			int num);  // 1286
	{
		UtlHashHandle_t hEntry; // 1287
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this); // 1287
		CUtlMemory<int, int>::Base(); // 112
		CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 368
		CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 824
		CUtlVectorBase<int, CUtlMemory<int, int> >::GrowMemory(
				int num);  // 1198
		CUtlMemory<int, int>::NumAllocated(); // 1196
		CUtlMemory<int, int>::operator[](
				int i);  // 602
		CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
			int i);  // 1201
		CopyConstruct<int>(int* pMemory,
					const int& src);  // 1201
		CUtlVectorBase<int, CUtlMemory<int, int> >::AddToTail(
				const int& src);  // 1289
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this,
				int i);  // 295
		Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this,
			handle_t idx);  // 1289
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHas this,
				handle_t start);  // 1287
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 1292
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 1292
	{
	}
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 1294
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunct this); // 1294
} /* size: 0, variables: 3, inline expansions: 43 (0 bytes) */

// <060CD5BC> meshutils/modelmeshutils.cpp:1225
// variables: 13
void FindVerticesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutVertexList, CUtlVector<int, CUtlMemory<int, int> >* pOutVertexFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueVertices; // 1234
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesConnectedToFace; // 1237
	int nNumUniqueVertices; // 1270
	const char   __FUNCTION__; // 12359
	{
		int iFace; // 1239
		{
			FaceHandle_t hFace; // 1241
			const int  nNumVertices; // 1248
			{
				int iVertex; // 1249
				{
					VertexHandle_t hVertex; // 1251
					UtlHashHandle_t tableEntry; // 1252
				}
			}
		}
	}
	{
		UtlHashHandle_t hEntry; // 1276
	}
	{
		UtlHashHandle_t hEntry; // 1287
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1292
	}
} /* size: 0, variables: 4 */

// <060E9AAF> meshutils/modelmeshutils.cpp:1299
// variables: 3
void FindEdgesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pOutEdgeList, CUtlVector<int, CUtlMemory<int, int> >* pOutEdgeFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueEdges; // 1308
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> > edgesConnectedToFace; // 1311
	int nNumUniqueEdges; // 1344
} /* size: 0, variables: 3 */

// <060E8281> meshutils/modelmeshutils.cpp:1299
// variables: 17
// function calls: 104
void FindEdgesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pOutEdgeList, CUtlVector<int, CUtlMemory<int, int> >* pOutEdgeFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueEdges; // 1308
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> > edgesConnectedToFace; // 1311
	int nNumUniqueEdges; // 1344
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
			int minimumSize);  // 1308
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
		int expected);  // 1309
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1311
	{
		int iFace; // 1313
		{
			FaceHandle_t hFace; // 1315
			const int  nNumVertices; // 1322
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1318
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1322
			{
				int iVertex; // 1323
				{
					EdgeHandle_t hEdge; // 1325
					UtlHashHandle_t tableEntry; // 1326
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this,
							int i);  // 295
					Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
						handle_t idx);  // 1338
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
							int i);  // 1325
					ComponentHandleWithListPointer_t::AsInt(); // 887
					Mix32HashFunctor::operator(
							uint32 n);  // 887
					DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>::operator(
							const EdgeHandle_t& handle);  // 218
					Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
						KeyArg_t k);  // 1326
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this,
							int i);  // 720
					CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>(
																const ComponentHandleWithListPointer_t& k,
																const int& v);  // 1514
					Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, const CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t&, int&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 720
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 714
					DoInsert<const CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
																const ComponentHandleWithListPointer_t& k,
																Arg_t v,
																unsigned int h,
																bool* pDidInsert);  // 249
					Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
						KeyArg_t k,
						ValueArg_t v,
						bool* pDidInsert);  // 1331
				}
			}
		}
	}
	Count(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 1344
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1347
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int num);  // 1348
	{
		UtlHashHandle_t hEntry; // 1350
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 1350
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
		GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				int num);  // 1198
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int i);  // 1201
		CopyConstruct<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
														const ComponentHandleWithListPointer_t& src);  // 1201
		AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				const ComponentHandleWithListPointer_t& src);  // 1352
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this,
				int i);  // 293
		Key(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
			handle_t idx);  // 1352
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 1350
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1359
	CUtlMemory<int, int>::IsGrowable(); // 881
	CUtlMemory<int, int>::IsExternallyAllocated(); // 888
	CUtlMemory<int, int>::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 1024
	CUtlVectorBase<int, CUtlMemory<int, int> >::EnsureCapacity(
			int num);  // 1360
	{
		UtlHashHandle_t hEntry; // 1361
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this); // 1361
		CUtlMemory<int, int>::Base(); // 112
		CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 368
		CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 824
		CUtlVectorBase<int, CUtlMemory<int, int> >::GrowMemory(
				int num);  // 1198
		CUtlMemory<int, int>::NumAllocated(); // 1196
		CUtlMemory<int, int>::operator[](
				int i);  // 602
		CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
			int i);  // 1201
		CopyConstruct<int>(int* pMemory,
					const int& src);  // 1201
		CUtlVectorBase<int, CUtlMemory<int, int> >::AddToTail(
				const int& src);  // 1363
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this,
				int i);  // 295
		Element(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this,
			handle_t idx);  // 1363
		{
			int i; // 915
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 917
		}
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 914
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashF this,
				handle_t start);  // 1361
	}
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 1366
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1366
	{
	}
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1369
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, i this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, i this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor this); // 1369
} /* size: 0, variables: 3, inline expansions: 43 (0 bytes) */

// <060CD4A0> meshutils/modelmeshutils.cpp:1299
// variables: 13
void FindEdgesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pOutEdgeList, CUtlVector<int, CUtlMemory<int, int> >* pOutEdgeFaceCounts)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>, int> > uniqueEdges; // 1308
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> > edgesConnectedToFace; // 1311
	int nNumUniqueEdges; // 1344
	const char   __FUNCTION__; // 12278
	{
		int iFace; // 1313
		{
			FaceHandle_t hFace; // 1315
			const int  nNumVertices; // 1322
			{
				int iVertex; // 1323
				{
					EdgeHandle_t hEdge; // 1325
					UtlHashHandle_t tableEntry; // 1326
				}
			}
		}
	}
	{
		UtlHashHandle_t hEntry; // 1350
	}
	{
		UtlHashHandle_t hEntry; // 1361
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1366
	}
} /* size: 0, variables: 4 */

// <060E582B> meshutils/modelmeshutils.cpp:1374
// variable: 1
// function call: 1
void FindFaceVerticesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon pOutFaceVertexList)
{
	{
		int iFace; // 1379
	}
	FindFaceVerticesConnectedToFaces(const CModelMesh* pMesh,
					const FaceHandle_t* pFaces,
					int nNumFaces,
					CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon pOutFaceVertexList);  // 1374
} /* size: 0, inline expansions: 1 (0 bytes) */

// <060CD44D> meshutils/modelmeshutils.cpp:1374
// variable: 1
void FindFaceVerticesConnectedToFaces(const CModelMesh* pMesh, const FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon pOutFaceVertexList)
{
	{
		int iFace; // 1379
	}
} /* size: 0 */

// <060CD025> meshutils/modelmeshutils.cpp:1388
// variable: 1
// function calls: 18
void FindFaceIslands(const CModelMesh* pMesh, CUtlVector<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeC pOutFaceList)
{
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > allFaces; // 1391
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1391
	Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1395
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
	Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1395
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1396
} /* size: 0, variables: 1, inline expansions: 18 (0 bytes) */

// <060CB4CA> meshutils/modelmeshutils.cpp:1401
// variables: 17
// function calls: 116
void FindFaceIslands(const CModelMesh* pMesh, FaceHandle_t* pFaces, int nNumFaces, CUtlVector<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeC pOutFaceList)
{
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> > verticesConnectedToFace; // 1404
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > facesConnectedToFace; // 1405
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>, int> > faceSearchSet; // 1408
	{
		int iFace; // 1410
		ComponentHandleWithListPointer_t::AsInt(); // 896
		Mix32HashFunctor::operator(
				uint32 n);  // 896
		DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>::operator(
				const FaceHandle_t& handle);  // 240
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this,
				int i);  // 706
		CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(
														const ComponentHandleWithListPointer_t& k);  // 1514
		Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>, const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>* pMemory); // 706
		DoInsert<const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
														const ComponentHandleWithListPointer_t& k,
														unsigned int h,
														bool* pDidInsert);  // 695
		DoInsert<const CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
														const ComponentHandleWithListPointer_t& k,
														unsigned int h,
														bool* pDidInsert);  // 240
		Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
			KeyArg_t k);  // 1412
	}
	{
		UtlHashHandle_t hStartFaceEntry; // 1420
		FaceHandle_t hStartFace; // 1421
		CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& islandFaceList; // 1429
		int nIslandFaceIndex; // 1438
		{
			FaceHandle_t hCurrentFace; // 1442
			const int  nNumConnectedFaces; // 1453
			{
				int iConnectedFace; // 1454
				{
					FaceHandle_t hConnectedFace; // 1456
					UtlHashHandle_t hConnectFaceEntry; // 1462
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
					ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
					GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
							int num);  // 1198
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
							int i);  // 602
					Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int i);  // 1201
					CopyConstruct<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
					AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
							const ComponentHandleWithListPointer_t& src);  // 1465
					ComponentHandleWithListPointer_t::operator==(
							const ComponentHandleWithListPointer_t& src);  // 1457
					ComponentHandleWithListPointer_t::AsInt(); // 896
					Mix32HashFunctor::operator(
							uint32 n);  // 896
					DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>::operator(
							const FaceHandle_t& handle);  // 218
					Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this,
						KeyArg_t k);  // 1462
					operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this,
							int i);  // 875
					RemoveByHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
							UtlHashHandle_t idx);  // 1466
				}
			}
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
					int i);  // 1442
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1445
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHa this); // 1451
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1451
		}
		{
			int i; // 915
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>::IsValid(); // 917
		}
		NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this,
				handle_t start);  // 208
		FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this); // 1420
		RemoveByHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
				UtlHashHandle_t idx);  // 1422
		operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, e this,
				int i);  // 293
		Key(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this,
			handle_t idx);  // 1421
		NumAllocated(const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemor this); // 1143
		operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
				int i);  // 602
		Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
			int i);  // 1148
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
		CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				int growSize,
				int initCapacity);  // 418
		CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1479
		Construct<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > >(CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pMemory); // 1148
		Base(const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this); // 112
		Base(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 368
		ResetDbgInfo(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 824
		GrowMemory(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
				int num);  // 1145
		AddToTail(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 1429
		operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
				int i);  // 602
		Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
			int i);  // 1429
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
				int num);  // 1006
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1024
		EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				int num);  // 1430
		CopyConstruct<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
														const ComponentHandleWithListPointer_t& src);  // 1201
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int i);  // 1201
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
		ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
		GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				int num);  // 1198
		AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
				const ComponentHandleWithListPointer_t& src);  // 1431
		Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1440
	}
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
			int minimumSize);  // 1408
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 1404
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
		int expected);  // 287
	Reserve(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this,
		int expected);  // 1409
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1405
	Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, e this); // 914
	{
		int i; // 915
		Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, e this); // 915
		CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>::IsValid(); // 917
	}
	NextHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this,
			handle_t start);  // 208
	FirstHandle(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this); // 1417
	{
		entry_t* table; // 896
		{
			int i; // 897
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, e this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFun this); // 1474
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1474
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComp this); // 1474
} /* size: 0, variables: 3, inline expansions: 44 (0 bytes) */

// <060C9C3E> meshutils/modelmeshutils.cpp:1479
// variables: 20
// function calls: 97
void FindNeigboringVertices(const CModelMesh* pMesh, const VertexHandle_t hVertex, CUtlVector<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentL pOutEdgeConnectedVertexList)
{
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>, int> > edgeConnectedVertexSet; // 1483
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t>, int> > faceVertexSet; // 1485
	CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, DefaultEqualFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>, undefined_t, CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>, int> > vertexSet; // 1486
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVertexList; // 1488
	const char   __FUNCTION__; // 12197
	{
		FaceVertexHandle_t hFaceVertex; // 1491
		CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 57219
		iterator __for_begin; // 56302
		iterator __for_end; // 56302
		{
			const CFaceVertex  faceVertex; // 1493
			{
				const FaceVertexHandle_t  hFaceVertexPrev; // 1496
				const CFaceVertex  faceVertexPrev; // 1497
				const VertexHandle_t  hVertexPrev; // 1499
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1500
				}
				ComponentHandleWithListPointer_t::operator!=(
						const ComponentHandleWithListPointer_t& src);  // 1500
				ComponentHandleWithListPointer_t::AsInt(); // 869
				Mix32HashFunctor::operator(
						uint32 n);  // 869
				DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>::operator(
						const VertexHandle_t& handle);  // 218
				Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, Defaul this,
					KeyArg_t k);  // 235
				HasElement(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, Defaul this,
						KeyArg_t k);  // 1501
				operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this,
						int i);  // 706
				CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(
																const ComponentHandleWithListPointer_t& k);  // 1514
				Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>, const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>* pMemory); // 706
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 695
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 240
				Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
					KeyArg_t k);  // 1503
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
					int i);  // 1201
				CopyConstruct<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
				Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 368
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 824
				GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						int num);  // 1198
				AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						const ComponentHandleWithListPointer_t& src);  // 1504
			}
			{
				const FaceVertexHandle_t  hFaceVertexNext; // 1509
				const CFaceVertex  faceVertexNext; // 1510
				const VertexHandle_t  hVertexNext; // 1512
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1514
				}
				ComponentHandleWithListPointer_t::operator!=(
						const ComponentHandleWithListPointer_t& src);  // 1514
				ComponentHandleWithListPointer_t::AsInt(); // 869
				Mix32HashFunctor::operator(
						uint32 n);  // 869
				DefaultHashFunctor<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>::operator(
						const VertexHandle_t& handle);  // 218
				Find(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, Defaul this,
					KeyArg_t k);  // 235
				HasElement(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, Defaul this,
						KeyArg_t k);  // 1515
				operator[](const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this,
						int i);  // 706
				CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>::CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(
																const ComponentHandleWithListPointer_t& k);  // 1514
				Construct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>, const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>* pMemory); // 706
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 695
				DoInsert<const CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t&>(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
																const ComponentHandleWithListPointer_t& k,
																unsigned int h,
																bool* pDidInsert);  // 240
				Insert(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
					KeyArg_t k);  // 1517
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
					int i);  // 1201
				CopyConstruct<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
				Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 368
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 824
				GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						int num);  // 1198
				AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
						const ComponentHandleWithListPointer_t& src);  // 1518
			}
		}
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 102
		begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1491
		Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 104
		end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1491
	}
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
			int minimumSize);  // 1483
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1481
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, e this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, e this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this,
			int minimumSize);  // 1485
	ValidateGrowSize(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 475
	CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this,
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 178
	CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this,
			int minimumSize);  // 1486
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1488
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1522
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> >(void); // 508
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 1522
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t> >(void); // 508
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, e this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, e this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultH this); // 1522
	{
		entry_t* table; // 896
		Base(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 896
		{
			int i; // 897
			Count(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 897
			IsValid(const CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> this); // 899
			CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> >(CUtlKeyValuePair<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 188
	ValidateAlignment<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> >(void); // 508
	IsExternallyAllocated(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, this); // 905
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 903
	Purge(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 510
	~CUtlMemory(const CUtlMemory<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty this); // 188
	~CUtlHashtable(const CUtlHashtable<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t, DefaultHashF this); // 1522
} /* size: 0, variables: 5, inline expansions: 45 (0 bytes) */

// <060C803A> meshutils/modelmeshutils.cpp:1529
// variables: 21
// function calls: 123
void FindCopositionalTexCoordVertexIslands(const CModelMesh* pMesh, CUtlVector<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeC pOutFaceList, const char* szChannelName, int nTexCoordAxis, int nQuantizeSteps)
{
	FaceVertexStreamIndex_t nStreamIndex; // 1533
	const char   __FUNCTION__; // 12572
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > allFaces; // 1544
	CUtlVector<float, CUtlMemory<float, int> > valueToIslandIndex; // 1548
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > verticesForFace; // 1551
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1537
	}
	{
		FaceHandle_t hFace; // 1552
		CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 11105
		iterator __for_begin; // 16588
		iterator __for_end; // 16588
		{
			int nExistingIslandIndex; // 1561
			float flFaceDataValue; // 1562
			{
				FaceVertexHandle_t hVert; // 1564
				CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 57219
				iterator __for_begin; // 56302
				iterator __for_end; // 56302
				{
					Vector2D vTexcoordValue; // 1567
					Vector2D::operator[](
							int i);  // 1576
					CFaceVertex::GetValue<Vector2D>(
								FaceVertexStreamIndex_t nStream);  // 1567
					{
						int i; // 1531
					}
					CUtlVectorBase<float, CUtlMemory<float, int> >::Find(
						const float& src);  // 1580
				}
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
				Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 102
				begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1564
				Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 104
				end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1564
			}
			{
				CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& islandFaceList; // 1591
				operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
						int i);  // 602
				Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
					int i);  // 1591
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::NumAllocated(); // 1196
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
					int i);  // 1201
				CopyConstruct<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
				Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
				GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int num);  // 1198
				AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						const ComponentHandleWithListPointer_t& src);  // 1592
			}
			{
				CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& islandFaceList; // 1600
				CopyConstruct<float>(float* pMemory,
							const float& src);  // 1201
				CUtlMemory<float, int>::operator[](
						int i);  // 602
				CUtlVectorBase<float, CUtlMemory<float, int> >::Element(
					int i);  // 1201
				CUtlVectorBase<float, CUtlMemory<float, int> >::ResetDbgInfo(); // 824
				CUtlVectorBase<float, CUtlMemory<float, int> >::GrowMemory(
						int num);  // 1198
				CUtlVectorBase<float, CUtlMemory<float, int> >::AddToTail(
						const float& src);  // 1597
				NumAllocated(const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemor this); // 1143
				operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
						int i);  // 602
				Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
					int i);  // 1148
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
						int nGrowSize,
						int nInitAllocationCount);  // 527
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
				CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int growSize,
						int initCapacity);  // 418
				CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1479
				Construct<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > >(CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pMemory); // 1148
				Base(const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this); // 112
				Base(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 368
				ResetDbgInfo(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 824
				GrowMemory(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
						int num);  // 1145
				AddToTail(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 1600
				operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
						int i);  // 602
				Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
					int i);  // 1600
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsGrowable(); // 881
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
						int num);  // 1006
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1024
				EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int num);  // 1601
				CopyConstruct<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
					int i);  // 1201
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
				Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 368
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 824
				GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int num);  // 1198
				AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						const ComponentHandleWithListPointer_t& src);  // 1602
			}
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1555
		}
		Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 104
		end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1552
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 102
		begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1552
	}
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 177
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::FindStream(
			const char* pStreamName);  // 1533
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator==(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 1534
	clamp<int, int>(const int& val,
			const int& minVal,
			const int& maxVal);  // 1538
	{
		int i; // 1721
		operator[](const CUtlMemory<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHal this,
				int i);  // 602
		Element(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this,
			int i);  // 1723
		RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
		Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
		ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
		CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
		~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1526
		Destruct<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > >(CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentLis pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory< this); // 1541
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1544
	CUtlMemory<float, int>::ValidateGrowSize(); // 475
	CUtlMemory<float, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<float, CUtlMemory<float, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<float, CUtlMemory<float, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<float, CUtlMemory<float, int> >::CUtlVector(); // 1548
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 472
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 419
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this,
			int growSize,
			int initCapacity);  // 1551
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1606
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 1606
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1606
} /* size: 0, variables: 5, inline expansions: 50 (0 bytes) */

// <060C479B> meshutils/modelmeshutils.cpp:1611
// variables: 16
// function calls: 119
void CreateRaytraceEnvironmentForMesh(const CModelMesh* pMesh, RayTracingEnvironment* pRte)
{
	CUtlVector<Vector, CUtlMemory<Vector, int> > trianglePositions; // 1613
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > triangleIndicies; // 1614
	CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > faces; // 1615
	int nFaceGroupCount; // 1616
	const char   __FUNCTION__; // 12457
	{
		int nFaceGroup; // 1617
		{
			uint16 nFlags; // 1623
			Vector vColor; // 1624
			int nNumTriangles; // 1627
			int iTriangleVertexIndex; // 1629
			RayTracingEnvironment rte; // 1631
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1626
			}
			{
				int iTriangle; // 1632
				{
					const Vector& vVertex0; // 1634
					const Vector& vVertex1; // 1635
					const Vector& vVertex2; // 1636
					CUtlMemory<Vector, int>::operator[](
							int i);  // 588
					CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
							int i);  // 1634
					CUtlMemory<Vector, int>::operator[](
							int i);  // 588
					CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
							int i);  // 1635
					CUtlMemory<Vector, int>::operator[](
							int i);  // 588
					CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
							int i);  // 1636
				}
			}
			Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1620
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1620
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 1624
			Vector::Vector(); // 831
			Vector::Vector(); // 831
			FourVectors::FourVectors(); // 831
			CUtlMemory<CacheOptimizedKDNode_t, int>::ValidateGrowSize(); // 475
			CUtlMemory<CacheOptimizedKDNode_t, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVector(); // 831
			CUtlBlockMemory<CacheOptimizedTriangle_t, int>::CUtlBlockMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 14
			CUtlBlockVector<CacheOptimizedTriangle_t, int>::CUtlBlockVector(
					int growSize,
					int initCapacity);  // 831
			CUtlBlockMemory<Vector2D, int>::CUtlBlockMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 14
			CUtlBlockVector<Vector2D, int>::CUtlBlockVector(
					int growSize,
					int initCapacity);  // 831
			CUtlMemory<int, int>::ValidateGrowSize(); // 475
			CUtlMemory<int, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
			CUtlMemory<LightDesc_t, int>::ValidateGrowSize(); // 475
			CUtlMemory<LightDesc_t, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVector(); // 831
			CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
			CUtlMemory<Vector, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 831
			CUtlMemory<long long unsigned int, int>::ValidateGrowSize(); // 475
			CUtlMemory<long long unsigned int, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVector(); // 831
			Vector::Init(
				vec_t ix,
				vec_t iy,
				vec_t iz);  // 838
			Vector::Init(
				vec_t ix,
				vec_t iy,
				vec_t iz);  // 837
			FourVectors::DuplicateVector(
					const Vector& v);  // 833
			CUtlMemory<TraceVertex_t::ValidateGrowSize(); // 475
			CUtlMemory<TraceVertex_t::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 530
			CUtlVectorBase<TraceVertex_t::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<TraceVertex_t::CUtlVector(); // 831
			CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::ValidateGrowSize(); // 475
			CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			ResetDbgInfo(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> > this); // 530
			CUtlVectorBase(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >  this,
					int growSize,
					int initCapacity);  // 418
			CUtlVector<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >::CUtlVector(); // 831
			CUtlMemory<InstancedRayTracingEnvironmentReference_t::ValidateGrowSize(); // 475
			CUtlMemory<InstancedRayTracingEnvironmentReference_t::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::ResetDbgInfo(); // 530
			CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<InstancedRayTracingEnvironmentReference_t::CUtlVector(); // 1895
			CUtlVectorAutoPurge<InstancedRayTracingEnvironmentReference_t::CUtlVectorAutoPurge(); // 831
			CUtlMemory<RayTracingEnvironment::ValidateGrowSize(); // 475
			CUtlMemory<RayTracingEnvironment::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<RayTracingEnvironment::ResetDbgInfo(); // 530
			CUtlVectorBase<RayTracingEnvironment::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<RayTracingEnvironment::CUtlVector(); // 831
			CUtlMemory<int, int>::ValidateGrowSize(); // 475
			CUtlMemory<int, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
			CThreadFastMutex::CThreadFastMutex(
					const char* pLockName);  // 831
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 833
			RayTracingEnvironment::RayTracingEnvironment(); // 1631
			RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1640
			CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1642
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::RemoveAll(); // 1641
		}
	}
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 1613
	CUtlMemory<unsigned int, int>::ValidateGrowSize(); // 475
	CUtlMemory<unsigned int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVector(); // 1614
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1615
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1645
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 1645
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 1645
} /* size: 0, variables: 5, inline expansions: 38 (0 bytes) */

// <060C476D> meshutils/modelmeshutils.cpp:1656
// variable: 1
bool MaterialUsesBentNormalData(const char* pMaterialName)
{
	HMaterialStrong hMaterial; // 1658
} /* size: 0, variables: 1 */

// <060C019E> meshutils/modelmeshutils.cpp:1668
// variables: 42
// function calls: 294
void CalculateBentNormalsForMesh(const CModelMesh* pReferenceMesh, CModelMesh* pDestMesh)
{
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > refFaceVertexList; // 1676
	CUtlVector<int, CUtlMemory<int, int> > refComponentIndexList; // 1677
	CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> > faceVerticesForFace; // 1679
	int nNumFaceGroups; // 1682
	VertexStreamIndex_t nPositionStream; // 1714
	FaceVertexStreamIndex_t nNormalStream; // 1715
	const char   __FUNCTION__; // 12332
	RayTracingEnvironment rte; // 1719
	const int  nNumFaceVertices; // 1722
	CUtlVector<int, CUtlMemory<int, int> > faceVertexGroupAssignments; // 1725
	int nNumGroups; // 1726
	CUtlVector<Vector, CUtlMemory<Vector, int> > groupPositions; // 1730
	CUtlVector<Vector, CUtlMemory<Vector, int> > groupNormals; // 1731
	CUtlVector<Vector, CUtlMemory<Vector, int> > bentNormals; // 1744
	VertexStreamIndex_t nDestPositionStream; // 1751
	VertexStreamIndex_t nDestBentNormalStream; // 1752
	VertexStreamIndex_t nDestComponentStream; // 1753
	CModelStreamAccessor destPositionStream; // 1754
	CModelStreamAccessor destBentNormalStream; // 1755
	CModelStreamAccessor destComponentIndex; // 1756
	{
		int iFaceGroup; // 1683
		{
			const char* pMaterialName; // 1685
			{
				CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> > faceGroupFaces; // 1688
				{
					FaceHandle_t hFace; // 1691
					CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 11105
					iterator __for_begin; // 16588
					iterator __for_end; // 16588
					{
						CFace face; // 1693
						{
							FaceVertexHandle_t hFaceVertex; // 1697
							CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> >& __for_range; // 57219
							iterator __for_begin; // 56302
							iterator __for_end; // 56302
							{
								int nIndex; // 1699
								ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 824
								GrowMemory(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
										int num);  // 1198
								CopyConstruct<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(ComponentHandleWithListPointer_t* pMemory,
																const ComponentHandleWithListPointer_t& src);  // 1201
								CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
										int i);  // 602
								Element(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
									int i);  // 1201
								AddToTail(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
										const ComponentHandleWithListPointer_t& src);  // 1700
								CUtlMemory<int, int>::operator[](
										int i);  // 602
								CUtlVectorBase<int, CUtlMemory<int, int> >::Element(
									int i);  // 1201
								CopyConstruct<int>(int* pMemory,
											const int& src);  // 1201
								CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 824
								CUtlVectorBase<int, CUtlMemory<int, int> >::GrowMemory(
										int num);  // 1198
								CUtlVectorBase<int, CUtlMemory<int, int> >::AddToTail(
										const int& src);  // 1701
							}
							CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
							Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 102
							begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1697
							Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory this); // 104
							end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1697
						}
						RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1694
					}
					CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 102
					begin(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1691
					Count(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 104
					end(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1691
				}
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
						int nGrowSize,
						int nInitAllocationCount);  // 527
				ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 530
				CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this,
						int growSize,
						int initCapacity);  // 418
				CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1688
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
				RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 1798
				Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 560
				ValidateAlignment<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t>(void); // 508
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
				CUtlMemory<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
				~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCo this); // 410
				~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdgeCompon this); // 1704
			}
			CStrongHandle<InfoForResourceTypeIMaterial2>::~CStrongHandle(); // 1663
			IMaterial2::GetBoolAttributeOrDefault(
							CUtlStringToken name,
							bool bDefault);  // 1662
			CWeakHandle<InfoForResourceTypeIMaterial2>::CWeakHandle(); // 226
			FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
			StaticInvalidHandle(void); // 736
			CWeakHandle<InfoForResourceTypeIMaterial2>::CWeakHandle(); // 226
			FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 738
			IResourceSystem::BlockingLoadResourceByName<1952542070>(
								const CResourceName& resourceName,
								const char* pDebugName);  // 1658
			CWeakHandle<InfoForResourceTypeIMaterial2>::GetBinding(); // 476
			ThreadInterlockedIncrement(volatile int32* p); // 576
			CInterlockedIntT<int, 4>::operator++(); // 570
			CStrongHandle<InfoForResourceTypeIMaterial2>::Init(
				ResourceHandleTyped_t hResource);  // 476
			CStrongHandle<InfoForResourceTypeIMaterial2>::CStrongHandle(
					const CWeakHandle<InfoForResourceTypeIMaterial2>& src);  // 1658
			CBufferString::~CBufferString(); // 587
			CBufferStringN<200>::~CBufferStringN(); // 318
			CResourceName::~CResourceName(); // 1658
			CWeakHandle<InfoForResourceTypeIMaterial2>::CWeakHandle(); // 226
			FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
			StaticInvalidHandle(void); // 1659
			CStrongHandle<InfoForResourceTypeIMaterial2>::operator==(
					const CWeakHandle<InfoForResourceTypeIMaterial2>& hResource);  // 1659
			CStrongHandle<InfoForResourceTypeIMaterial2>::operator->(); // 1662
			MaterialUsesBentNormalData(const char* pMaterialName); // 1686
		}
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1716
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1717
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1727
	}
	{
		int iFaceVertex; // 1734
		{
			int nGroupIndex; // 1736
			CFaceVertex faceVertexRef; // 1737
			CVertex vertexRef; // 1738
			CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
					int i);  // 1737
			CUtlMemory<Vector, int>::operator[](
					int i);  // 588
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
					int i);  // 1739
			CVertex::GetValue<Vector>(
					VertexStreamIndex_t nStream);  // 1739
			Vector::operator=(
					const Vector& vOther);  // 1739
			CFaceVertex::GetValue<Vector>(
					FaceVertexStreamIndex_t nStream);  // 1740
			CUtlMemory<Vector, int>::operator[](
					int i);  // 588
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
					int i);  // 1740
			Vector::operator=(
					const Vector& vOther);  // 1740
		}
	}
	{
		int iFaceVertex; // 1760
		{
			const int  nGroupIndex; // 1762
			CUtlMemory<Vector, int>::operator[](
					int i);  // 588
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
					int i);  // 1763
			CModelStreamReader::GetStreamType(); // 635
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 635
			CModelStreamAccessor::SetValue<Vector>(
					int nIndex,
					const Vector& value);  // 1763
			CUtlMemory<Vector, int>::operator[](
					int i);  // 588
			CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator[](
					int i);  // 1764
			CModelStreamReader::GetStreamType(); // 635
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 635
			CModelStreamAccessor::SetValue<Vector>(
					int nIndex,
					const Vector& value);  // 1764
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 1765
			CModelStreamReader::GetStreamType(); // 635
			GetModelStreamDataTypeForStreamType(ModelStreamType_t nStreamType); // 635
			{
			}
			CModelStreamAccessor::SetValue<int>(
					int nIndex,
					const int& value);  // 632
			CModelStreamAccessor::SetValue<int>(
					int nIndex,
					const int& value);  // 1765
		}
	}
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1676
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 888
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::EnsureCapacity(
			int num);  // 1006
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1024
	EnsureCapacity(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int num);  // 1680
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 1677
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 530
	CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1679
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 1714
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 160
	FaceVertexStreamIndex_t::FaceVertexStreamIndex_t(
				int);  // 186
	CModelMeshStreamSetAccessor<CModelMesh::FaceVertex_t, CModelMesh::FaceVertexStreamIndex_t>::GetFirstStreamOfType(
				ModelStreamType_t nStreamType);  // 1715
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::operator!=(
			const CModelMeshStreamIndex<CModelMesh::Vertex_t>& other);  // 1716
	CModelMeshStreamIndex<CModelMesh::FaceVertex_t>::operator!=(
			const CModelMeshStreamIndex<CModelMesh::FaceVertex_t>& other);  // 1717
	Vector::Vector(); // 831
	Vector::Vector(); // 831
	FourVectors::FourVectors(); // 831
	CUtlMemory<CacheOptimizedKDNode_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CacheOptimizedKDNode_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVector(); // 831
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::CUtlBlockMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 14
	CUtlBlockVector<CacheOptimizedTriangle_t, int>::CUtlBlockVector(
			int growSize,
			int initCapacity);  // 831
	CUtlBlockMemory<Vector2D, int>::CUtlBlockMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 14
	CUtlBlockVector<Vector2D, int>::CUtlBlockVector(
			int growSize,
			int initCapacity);  // 831
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
	CUtlMemory<LightDesc_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<LightDesc_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVector(); // 831
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 831
	CUtlMemory<long long unsigned int, int>::ValidateGrowSize(); // 475
	CUtlMemory<long long unsigned int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVector(); // 831
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 838
	CUtlMemory<TraceVertex_t::ValidateGrowSize(); // 475
	CUtlMemory<TraceVertex_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 530
	CUtlVectorBase<TraceVertex_t::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<TraceVertex_t::CUtlVector(); // 831
	CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> > this); // 530
	CUtlVectorBase(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >  this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >::CUtlVector(); // 831
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::ValidateGrowSize(); // 475
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::ResetDbgInfo(); // 530
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<InstancedRayTracingEnvironmentReference_t::CUtlVector(); // 1895
	CUtlVectorAutoPurge<InstancedRayTracingEnvironmentReference_t::CUtlVectorAutoPurge(); // 831
	CUtlMemory<RayTracingEnvironment::ValidateGrowSize(); // 475
	CUtlMemory<RayTracingEnvironment::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<RayTracingEnvironment::ResetDbgInfo(); // 530
	CUtlVectorBase<RayTracingEnvironment::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<RayTracingEnvironment::CUtlVector(); // 831
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 831
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 833
	FourVectors::DuplicateVector(
			const Vector& v);  // 833
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 837
	RayTracingEnvironment::RayTracingEnvironment(); // 1719
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 1725
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 1730
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 1731
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 1744
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 196
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::AddStream(
			const char* pStreamName,
			ModelStreamType_t nStreamType);  // 1751
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 196
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::AddStream(
			const char* pStreamName,
			ModelStreamType_t nStreamType);  // 1752
	CModelMeshStreamIndex<CModelMesh::Vertex_t>::CModelMeshStreamIndex(
				int nIndex);  // 159
	VertexStreamIndex_t::VertexStreamIndex_t(
				int);  // 196
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::AddStream(
			const char* pStreamName,
			ModelStreamType_t nStreamType);  // 1753
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 1754
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 1755
	CModelMeshStreamSetAccessor<CModelMesh::Vertex_t, CModelMesh::VertexStreamIndex_t>::GetStream(
			VertexStreamIndex_t nStream);  // 1756
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 1770
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 1770
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 1770
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 1799
	CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
	ValidateAlignment<int>(void); // 508
	CUtlMemory<int, int>::Purge(); // 510
	CUtlMemory<int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 1770
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1770
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 1799
	CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
	ValidateAlignment<int>(void); // 508
	CUtlMemory<int, int>::Purge(); // 510
	CUtlMemory<int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 1770
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1770
	RemoveAll(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 1798
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	ValidateAlignment<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t>(void); // 508
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 510
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1770
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 1799
	CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
	ValidateAlignment<int>(void); // 508
	CUtlMemory<int, int>::Purge(); // 510
	CUtlMemory<int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 1770
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 903
	CUtlMemory<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 560
	~CUtlVectorBase(const CUtlVectorBase<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalf this); // 410
	~CUtlVector(const CUtlVector<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, CUtlMemory<CHalfEdge this); // 1770
} /* size: 0, variables: 20, inline expansions: 208 (0 bytes) */

// <060BF766> meshutils/modelmeshutils.cpp:1775
// variables: 13
// function calls: 28
void CopyBentNormalsToMesh(const CModelMesh* pSrcMesh, CModelMesh* pDestMesh)
{
	VertexStreamIndex_t nSrcBentNormalStream; // 1780
	VertexStreamIndex_t nSrcIndexStream; // 1781
	CModelStreamReader srcBentNormalStream; // 1788
	CModelStreamReader srcIndexStream; // 1789
	FaceVertexStreamIndex_t nDestBentNormalStream; // 1794
	CModelStreamAccessor destBentNormalStream; // 1799
	int nDestBentNormalCount; // 1800
	int nNumSrc; // 1810
	{
		int iNormal; // 1801
		{
			const Vector  DEFAULT_BENT_NORMAL_VALUE; // 1803
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 1803
			CModelStreamReader::GetStreamType(); // 635
