
//
// public/resourcefile/resourcetype.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//				   libvfx_vulkan.so
//
//	functions: 48
//	classes: 10
//	structs: 22
//

// <067143AC> ../public/resourcefile/resourcetype.h:35
void ResourceId_t::ResourceId_t()
{
} /* size: 0 */

// <06714393> ../public/resourcefile/resourcetype.h:35
inline void ResourceId_t::ResourceId_t()
{
} /* size: 0 */

// <0671437A> ../public/resourcefile/resourcetype.h:35
inline void ResourceId_t::GetRaw()
{
} /* size: 0 */

// <066D2802> ../public/resourcefile/resourcetype.h:35
void ResourceId_t::ResourceId_t(uint64 value)
{
} /* size: 0 */

// <066D27DD> ../public/resourcefile/resourcetype.h:35
inline void ResourceId_t::ResourceId_t(uint64 value)
{
} /* size: 0 */

// <02383962> ../public/resourcefile/resourcetype.h:35
inline void ResourceId_t::operator==(const ResourceId_t& other)
{
} /* size: 0 */

// <0003CCCE> ../public/resourcefile/resourcetype.h:35
// member functions: 30
// member variable: 1
// static member variables: 2
// class size: 8
class ResourceId_t {
	static const enum TypeSafeIntCheckFlag_t CheckValue; /* 0 0 */
	static const bool IS_TYPESAFE_INTEGER = 1; /* 0 0 */
	/* ../public/resourcefile/resourcetype.h:35 */
	const char* GetTypeName(void);
	/* ../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* , uint64);
	/* ../public/resourcefile/resourcetype.h:35 */
	void SetRaw(ResourceId_t* , uint64);
	/* ../public/resourcefile/resourcetype.h:35 */
	uint64 GetRaw(const ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	uint64& GetRawRef(ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	const uint64& GetRawRef(const ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	uint64* GetRawPtrForWrite(ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	bool operator==(const ResourceId_t* , const ResourceId_t& );
	/* ../public/resourcefile/resourcetype.h:35 */
	strong_ordering operator<=>(const ResourceId_t* , const ResourceId_t& );
	/* ../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator++(ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator++(ResourceId_t* , int);
	/* ../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator--(ResourceId_t* );
	/* ../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator--(ResourceId_t* , int);
private:
	uint64 m_Value; /* 0 8 */
	/* ../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator=(ResourceId_t* , uint64);
	const char  * GetTypeName(void); /* linkage=_ZN12ResourceId_t11GetTypeNameEv */
	void ResourceId_t(class ResourceId_t *); /* linkage=_ZN12ResourceId_tC4Ev */
	void ResourceId_t(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_tC4Ey */
	void SetRaw(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_t6SetRawEy */
	uint64 GetRaw(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t6GetRawEv */
	uint64 & GetRawRef(class ResourceId_t *); /* linkage=_ZN12ResourceId_t9GetRawRefEv */
	const uint64  & GetRawRef(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t9GetRawRefEv */
	uint64 * GetRawPtrForWrite(class ResourceId_t *); /* linkage=_ZN12ResourceId_t17GetRawPtrForWriteEv */
	bool operator==(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_teqERKS_ */
	class strong_ordering operator<=>(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_tssERKS_ */
	class ResourceId_t & operator++(class ResourceId_t *); /* linkage=_ZN12ResourceId_tppEv */
	class ResourceId_t operator++(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tppEi */
	class ResourceId_t & operator--(class ResourceId_t *); /* linkage=_ZN12ResourceId_tmmEv */
	class ResourceId_t operator--(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tmmEi */
	class ResourceId_t & operator=(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_taSEy */
};

// <0583A775> ../../public/resourcefile/resourcetype.h:35
// member functions: 30
// member variable: 1
// static member variables: 2
// class size: 8
class ResourceId_t {
	static const enum TypeSafeIntCheckFlag_t CheckValue; /* 0 0 */
	static const bool IS_TYPESAFE_INTEGER = 1; /* 0 0 */
	/* ../../public/resourcefile/resourcetype.h:35 */
	const char* GetTypeName(void);
	/* ../../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* , uint64);
	/* ../../public/resourcefile/resourcetype.h:35 */
	void SetRaw(ResourceId_t* , uint64);
	/* ../../public/resourcefile/resourcetype.h:35 */
	uint64 GetRaw(const ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	uint64& GetRawRef(ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	const uint64& GetRawRef(const ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	uint64* GetRawPtrForWrite(ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	bool operator==(const ResourceId_t* , const ResourceId_t& );
	/* ../../public/resourcefile/resourcetype.h:35 */
	strong_ordering operator<=>(const ResourceId_t* , const ResourceId_t& );
	/* ../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator++(ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator++(ResourceId_t* , int);
	/* ../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator--(ResourceId_t* );
	/* ../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator--(ResourceId_t* , int);
private:
	uint64 m_Value; /* 0 8 */
	/* ../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator=(ResourceId_t* , uint64);
	const char  * GetTypeName(void); /* linkage=_ZN12ResourceId_t11GetTypeNameEv */
	void ResourceId_t(class ResourceId_t *); /* linkage=_ZN12ResourceId_tC4Ev */
	void ResourceId_t(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_tC4Ey */
	void SetRaw(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_t6SetRawEy */
	uint64 GetRaw(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t6GetRawEv */
	uint64 & GetRawRef(class ResourceId_t *); /* linkage=_ZN12ResourceId_t9GetRawRefEv */
	const uint64  & GetRawRef(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t9GetRawRefEv */
	uint64 * GetRawPtrForWrite(class ResourceId_t *); /* linkage=_ZN12ResourceId_t17GetRawPtrForWriteEv */
	bool operator==(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_teqERKS_ */
	class strong_ordering operator<=>(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_tssERKS_ */
	class ResourceId_t & operator++(class ResourceId_t *); /* linkage=_ZN12ResourceId_tppEv */
	class ResourceId_t operator++(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tppEi */
	class ResourceId_t & operator--(class ResourceId_t *); /* linkage=_ZN12ResourceId_tmmEv */
	class ResourceId_t operator--(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tmmEi */
	class ResourceId_t & operator=(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_taSEy */
};

// <067A92D8> ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35
// member functions: 30
// member variable: 1
// static member variables: 2
// class size: 8
class ResourceId_t {
	static const enum TypeSafeIntCheckFlag_t CheckValue; /* 0 0 */
	static const bool IS_TYPESAFE_INTEGER = 1; /* 0 0 */
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	const char* GetTypeName(void);
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	void ResourceId_t(ResourceId_t* , uint64);
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	void SetRaw(ResourceId_t* , uint64);
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	uint64 GetRaw(const ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	uint64& GetRawRef(ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	const uint64& GetRawRef(const ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	uint64* GetRawPtrForWrite(ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	bool operator==(const ResourceId_t* , const ResourceId_t& );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	strong_ordering operator<=>(const ResourceId_t* , const ResourceId_t& );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator++(ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator++(ResourceId_t* , int);
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator--(ResourceId_t* );
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t operator--(ResourceId_t* , int);
private:
	uint64 m_Value; /* 0 8 */
	/* ../_generated_code/resourcefile/linuxsteamrt64/release/../../../../public/resourcefile/resourcetype.h:35 */
	ResourceId_t& operator=(ResourceId_t* , uint64);
	const char  * GetTypeName(void); /* linkage=_ZN12ResourceId_t11GetTypeNameEv */
	void ResourceId_t(class ResourceId_t *); /* linkage=_ZN12ResourceId_tC4Ev */
	void ResourceId_t(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_tC4Ey */
	void SetRaw(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_t6SetRawEy */
	uint64 GetRaw(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t6GetRawEv */
	uint64 & GetRawRef(class ResourceId_t *); /* linkage=_ZN12ResourceId_t9GetRawRefEv */
	const uint64  & GetRawRef(const class ResourceId_t  *); /* linkage=_ZNK12ResourceId_t9GetRawRefEv */
	uint64 * GetRawPtrForWrite(class ResourceId_t *); /* linkage=_ZN12ResourceId_t17GetRawPtrForWriteEv */
	bool operator==(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_teqERKS_ */
	class strong_ordering operator<=>(const class ResourceId_t  *, const class ResourceId_t  &); /* linkage=_ZNK12ResourceId_tssERKS_ */
	class ResourceId_t & operator++(class ResourceId_t *); /* linkage=_ZN12ResourceId_tppEv */
	class ResourceId_t operator++(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tppEi */
	class ResourceId_t & operator--(class ResourceId_t *); /* linkage=_ZN12ResourceId_tmmEv */
	class ResourceId_t operator--(class ResourceId_t *, int); /* linkage=_ZN12ResourceId_tmmEi */
	class ResourceId_t & operator=(class ResourceId_t *, uint64); /* linkage=_ZN12ResourceId_taSEy */
};

// <021B8FA9> ../public/resourcefile/resourcetype.h:46
// member function: 1
// struct size: 1
struct DefaultHashFunctor<ResourceId_t> {
	/* ../public/resourcefile/resourcetype.h:48 */
	unsigned int operator()(const DefaultHashFunctor<ResourceId_t>* , ResourceId_t);
};

// <04AE3C59> ../public/resourcefile/resourcetype.h:48
inline void DefaultHashFunctor<ResourceId_t>::operator(ResourceId_t s)
{
} /* size: 0 */

// <0238390B> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 58640
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <03123E17> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 3599
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <014BAD6E> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 38180
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <0073C64D> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 1888
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <019898D3> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 42555
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <00900DFC> ../public/resourcefile/resourcetype.h:78
// variables: 2
inline void ResourceTypeToExt(char* pOutChars, size_t nBufferSize, ResourceType_t nType)
{
	const char   __FUNCTION__; // 32991
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 80
	}
} /* size: 0, variables: 1 */

// <02358989> ../public/resourcefile/resourcetype.h:86
inline void ResourceTypeToExt<9>(char& pDest, ResourceType_t nType)
{
} /* size: 0 */

// <023F95BB> ../public/resourcefile/resourcetype.h:93
// variables: 2
inline void CharsToResourceType(ResourceType_t* pOutType, const char* pChars)
{
	int nShift; // 97
	{
		int i; // 98
	}
} /* size: 0, variables: 1 */

// <023F9526> ../public/resourcefile/resourcetype.h:116
// variables: 5
inline ResourceType_t DeduceResourceTypeFromResourceName(const char* pResourceName)
{
	const char* pExt; // 122
	CBufferStringN<30> extWithNoTrailing; // 128
	int nExtLen; // 130
	ResourceType_t nResult; // 141
	{
		int i; // 131
	}
} /* size: 0, variables: 4 */

// <03123961> ../public/resourcefile/resourcetype.h:116
// variables: 6
// function calls: 15
ResourceType_t DeduceResourceTypeFromResourceName(const char* pResourceName)
{
	const char* pExt; // 122
	CBufferStringN<30> extWithNoTrailing; // 128
	int nExtLen; // 130
	ResourceType_t nResult; // 141
	{
		int i; // 131
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 788
		CBufferString::operator[](
				int i);  // 133
		CBufferString::RemoveTail(
				int nChars);  // 135
	}
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 596
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 601
	CBufferStringN<30>::CBufferStringN(
			const char* pString,
			int nChars,
			bool bExact,
			bool bGrowable);  // 128
	CBufferString::Length(); // 130
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 781
	CBufferString::operator char const*(); // 142
	{
		int i; // 98
	}
	CharsToResourceType(ResourceType_t* pOutType,
				const char* pChars);  // 142
	CBufferString::~CBufferString(); // 587
	CBufferStringN<30>::~CBufferStringN(); // 144
} /* size: 462, variables: 4, inline expansions: 11 (353 bytes) */

// <0003CF41> ../public/resourcefile/resourcetype.h:168
// member variable: 1
// struct size: 8
struct ResourceNameInfo_t {
	CUtlSymbolLarge m_ResourceNameSymbol; /* 0 8 */
};

// <023541BA> ../public/resourcefile/resourcetype.h:198
void ResourceBindingBase_t::ResourceBindingBase_t()
{
} /* size: 0 */

// <0235419E> ../public/resourcefile/resourcetype.h:198
inline void ResourceBindingBase_t::ResourceBindingBase_t()
{
} /* size: 0 */

// <0003D4A2> ../public/resourcefile/resourcetype.h:198
// member variables: 9
// struct size: 40
struct ResourceBindingBase_t {
	void * m_pData; /* 0 8 */
	ResourceNameHandle_t m_Name; /* 8 8 */
	uint16 m_nFlags; /* 16 2 */
	StreamingResourceDataIndex_t m_nStreamingResource; /* 18 2 */
