
//
// rendersystem/poolallocator.cpp
//
//	referenced by: librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 18
//	struct: 1
//

// <00089149> rendersystem/poolallocator.cpp:10
void RBNode_t::RBNode_t()
{
} /* size: 0 */

// <0008912D> rendersystem/poolallocator.cpp:10
inline void RBNode_t::RBNode_t()
{
} /* size: 0 */

// <000805B3> rendersystem/poolallocator.cpp:10
// member function: 1
// member variable: 1
// struct size: 8
struct RBNode_t {
	Handle_t m_handle; /* 0 8 */
	void RBNode_t(RBNode_t* );
};

// <00089E0B> rendersystem/poolallocator.cpp:18
bool LessByAddress(const NodePtr_t& lhs, const NodePtr_t& rhs)
{
} /* size: 18 */

// <00089DCA> rendersystem/poolallocator.cpp:23
bool LessBySizeThenAddress(const NodePtr_t& lhs, const NodePtr_t& rhs)
{
} /* size: 26 */

// <0008993D> rendersystem/poolallocator.cpp:46
// function calls: 24
void AllocatorImpl_t::AllocatorImpl_t()
{
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 496
	InvalidIndex(void); // 498
	InvalidIndex(void); // 500
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::InvalidIterator(); // 501
	CUtlRBTree<RBNode_t::ResetDbgInfo()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 503
	CUtlRBTree<RBNode_t::CUtlRBTree(
			const LessFunc_t& lessfunc);  // 47
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 496
	InvalidIndex(void); // 498
	InvalidIndex(void); // 500
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::InvalidIterator(); // 501
	CUtlRBTree<RBNode_t::ResetDbgInfo()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 503
	CUtlRBTree<RBNode_t::CUtlRBTree(
			const LessFunc_t& lessfunc);  // 48
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 496
	InvalidIndex(void); // 498
	InvalidIndex(void); // 500
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::InvalidIterator(); // 501
	CUtlRBTree<RBNode_t::ResetDbgInfo()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 503
	CUtlRBTree<RBNode_t::CUtlRBTree(
			const LessFunc_t& lessfunc);  // 49
} /* size: 125, inline expansions: 24 (195 bytes) */

// <00089922> rendersystem/poolallocator.cpp:46
void AllocatorImpl_t::AllocatorImpl_t()
{
} /* size: 0 */

// <00087D8D> rendersystem/poolallocator.cpp:56
// variables: 2
// function calls: 20
void DeleteTreeNodes<CUtlRBTree<RBNode_t*, int, bool (*)(RBNode_t* const&, RBNode_t* const&)> >(CUtlRBTree<RBNode_t*, int, bool (*)(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int>, int> tree)
{
	{
		int idx; // 58
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
				int i);  // 611
		CUtlRBTree<RBNode_t::LeftChild(
				int i);  // 1329
		CUtlRBTree<RBNode_t::FirstInorder()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t* this); // 58
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
				int i);  // 539
		CUtlRBTree<RBNode_t::Element(
			int i);  // 60
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::IsIdxValid(
				int i);  // 661
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::IsIdxAfter(
				int i,
				const Iterator_t& it);  // 664
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
				int i);  // 611
		CUtlRBTree<RBNode_t::LeftChild(
				int i);  // 667
		CUtlRBTree<RBNode_t::IsValidIndex(
				int i);  // 659
		CUtlRBTree<RBNode_t::IsValidIndex(
				int i);  // 1339
		CUtlRBTree<RBNode_t::RightChild(
				int i);  // 1343
		{
			int left; // 1346
			CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
					int i);  // 611
			CUtlRBTree<RBNode_t::LeftChild(
					int i);  // 1347
		}
		CUtlRBTree<RBNode_t::Parent(
			int i);  // 1352
		CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
				int i);  // 617
		CUtlRBTree<RBNode_t::RightChild(
				int i);  // 633
		CUtlRBTree<RBNode_t::IsRightChild(
				int i);  // 1353
		CUtlRBTree<RBNode_t::Parent(
			int i);  // 1357
		CUtlRBTree<RBNode_t::NextInorder(
				int i);  // 58
	}
} /* size: 306 */

// <000893A6> rendersystem/poolallocator.cpp:66
// function calls: 25
void AllocatorImpl_t::~AllocatorImpl_t()
{
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 1287
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::InvalidIterator(); // 1288
	CUtlRBTree<RBNode_t::Purge()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 509
	ValidateAlignment<UtlRBTreeNode_t<RBNode_t*, int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 510
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::~CUtlMemory(); // 510
	CUtlRBTree<RBNode_t::~CUtlRBTree()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 71
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 1287
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::InvalidIterator(); // 1288
	CUtlRBTree<RBNode_t::Purge()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 509
	ValidateAlignment<UtlRBTreeNode_t<RBNode_t*, int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 510
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::~CUtlMemory(); // 510
	CUtlRBTree<RBNode_t::~CUtlRBTree()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 71
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::Purge(); // 1287
	CUtlRBTree<RBNode_t::Purge()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 509
	CUtlRBTree<RBNode_t::~CUtlRBTree()(RBNode_t* const&, RBNode_t* const&), CUtlMemory<UtlRBTreeNode_t<RBNode_t*, int> this); // 71
} /* size: 187, inline expansions: 25 (353 bytes) */

// <0008938B> rendersystem/poolallocator.cpp:66
void AllocatorImpl_t::~AllocatorImpl_t()
{
} /* size: 0 */

// <00089298> rendersystem/poolallocator.cpp:73
// variables: 2
void CPoolAllocator::CPoolAllocator(uint nPoolSize)
{
	{
		RBNode_t* pRootNode; // 79
	}
	{
		RBNode_t* pRootNode; // 79
	}
} /* size: 164 */

// <00089262> rendersystem/poolallocator.cpp:73
// variable: 1
void CPoolAllocator::CPoolAllocator(uint nPoolSize)
{
	{
		RBNode_t* pRootNode; // 79
	}
} /* size: 0 */

// <000891B4> rendersystem/poolallocator.cpp:84
void CPoolAllocator::~CPoolAllocator()
{
	{
		{
		}
	}
	{
		{
		}
	}
} /* size: 0 */

// <00089160> rendersystem/poolallocator.cpp:84
// variables: 2
void CPoolAllocator::~CPoolAllocator()
{
	const char   __FUNCTION__; // 4222
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 87
	}
} /* size: 0, variables: 1 */

// <00089160> rendersystem/poolallocator.cpp:84
// variables: 2
void CPoolAllocator::~CPoolAllocator()
{
	const char   __FUNCTION__; // 39851
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 87
	}
} /* size: 0, variables: 1 */

// <00088A61> rendersystem/poolallocator.cpp:92
// variables: 15
// function calls: 13
void CPoolAllocator::Allocate(uint nSize, uint nAlignment)
{
	const char   __FUNCTION__; // 56272
	const uint  nAllocSize; // 98
	RBNode_t searchHandle; // 101
	int sizeIndex; // 102
	RBNode_t* pNode; // 109
	const uint32  nAlignedOffset; // 114
	const uint  nSizeLeft; // 115
	RBNode_t* pTailNode; // 117
	RBNode_t* pUsed; // 162
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 94
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 110
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 111
	}
	{
		int addressIndex; // 135
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 131
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 136
		}
	}
	IsPowerOfTwo(uint32 value); // 94
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 96
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 545
	CUtlRBTree<RBNode_t::Element(
		int i);  // 1848
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 611
	CUtlRBTree<RBNode_t::LeftChild(
			int i);  // 1853
	CUtlRBTree<RBNode_t::Element(
		int i);  // 1855
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 617
	CUtlRBTree<RBNode_t::RightChild(
			int i);  // 1860
	CUtlRBTree<RBNode_t::FindClosest(
			RBNode_t* const& search,
			CompareOperands_t eFindCriteria);  // 102
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 539
	CUtlRBTree<RBNode_t::Element(
		int i);  // 109
	RBNode_t::RBNode_t(); // 149
} /* size: 0, variables: 9, inline expansions: 13 (209 bytes) */

// <00088419> rendersystem/poolallocator.cpp:171
// variables: 17
// function calls: 8
void CPoolAllocator::Free(Handle_t handle)
{
	RBNode_t searchNode; // 179
	int usedIndex; // 180
	RBNode_t* pNode; // 186
	RBNode_t searchAdjacent; // 196
	int subsequentIndex; // 197
	RBNode_t* pSubsequent; // 198
	const char   __FUNCTION__; // 2326
	int nodeIndex; // 226
	{
		_DebuggerBreakInlineExpressionWrapper(void); // 187
	}
	{
		int sizeIndex; // 205
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 201
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 206
		}
	}
	{
		int priorIndex; // 229
		{
			RBNode_t* pPrior; // 232
			{
				int priorSizeIndex; // 236
				int nodeSizeIndex; // 244
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 237
				}
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 245
				}
			}
			CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
					int i);  // 539
			CUtlRBTree<RBNode_t::Element(
				int i);  // 232
		}
	}
	CPoolAllocator::IsValidHandle(
			Handle_t handle);  // 173
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 539
	CUtlRBTree<RBNode_t::Element(
		int i);  // 186
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 539
	CUtlRBTree<RBNode_t::Element(
		int i);  // 198
} /* size: 0, variables: 8, inline expansions: 5 (52 bytes) */

// <00088419> rendersystem/poolallocator.cpp:171
// variables: 17
// function calls: 8
void CPoolAllocator::Free(Handle_t handle)
{
	RBNode_t searchNode; // 179
	int usedIndex; // 180
	RBNode_t* pNode; // 186
	RBNode_t searchAdjacent; // 196
	int subsequentIndex; // 197
	RBNode_t* pSubsequent; // 198
	const char   __FUNCTION__; // 37955
	int nodeIndex; // 226
	{
		_DebuggerBreakInlineExpressionWrapper(void); // 187
	}
	{
		int sizeIndex; // 205
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 201
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 206
		}
	}
	{
		int priorIndex; // 229
		{
			RBNode_t* pPrior; // 232
			{
				int priorSizeIndex; // 236
				int nodeSizeIndex; // 244
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 237
				}
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 245
				}
			}
			CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
					int i);  // 539
			CUtlRBTree<RBNode_t::Element(
				int i);  // 232
		}
	}
	CPoolAllocator::IsValidHandle(
			Handle_t handle);  // 173
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 539
	CUtlRBTree<RBNode_t::Element(
		int i);  // 186
	CUtlMemory<UtlRBTreeNode_t<RBNode_t::operator[](
			int i);  // 539
	CUtlRBTree<RBNode_t::Element(
		int i);  // 198
} /* size: 0, variables: 8, inline expansions: 5 (52 bytes) */

// <00088339> rendersystem/poolallocator.cpp:262
// variables: 2
void CPoolAllocator::GrowPool(uint nNewSize)
{
	{
		const uint  nPoolSizeDelta; // 266
		RBNode_t* pTail; // 269
	}
} /* size: 167 */

