
//
// public/animationsystem/sequenceresource.h
//
//	referenced by: libanimationsystem.so
//
//	functions: 90
//	structs: 42
//

// <009DF05D> ../public/animationsystem/sequenceresource.h:33
void CSeqAutoLayerFlag::CSeqAutoLayerFlag()
{
} /* size: 0 */

// <009DF041> ../public/animationsystem/sequenceresource.h:33
inline void CSeqAutoLayerFlag::CSeqAutoLayerFlag()
{
} /* size: 0 */

// <0020EF16> ../public/animationsystem/sequenceresource.h:33
// member functions: 14
// member variables: 8
// static member variable: 1
// struct size: 8
struct CSeqAutoLayerFlag {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	CSeqAutoLayerFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	CSeqAutoLayerFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave_CSeqAutoLayerFlag(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad_CSeqAutoLayerFlag(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	bool m_bPost; /* 0 1 */
	bool m_bSpline; /* 1 1 */
	bool m_bXFade; /* 2 1 */
	bool m_bNoBlend; /* 3 1 */
	bool m_bLocal; /* 4 1 */
	bool m_bPose; /* 5 1 */
	bool m_bFetchFrame; /* 6 1 */
	bool m_bSubtract; /* 7 1 */
	void CSeqAutoLayerFlag(CSeqAutoLayerFlag* );
};

// <00905ACB> ../public/animationsystem/sequenceresource.h:33
// member functions: 14
// member variables: 8
// static member variable: 1
// struct size: 8
struct CSeqAutoLayerFlag {
	/* ../public/animationsystem/sequenceresource.h:36 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	CSeqAutoLayerFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	CSeqAutoLayerFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave_CSeqAutoLayerFlag(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad_CSeqAutoLayerFlag(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	bool m_bPost; /* 0 1 */
	bool m_bSpline; /* 1 1 */
	bool m_bXFade; /* 2 1 */
	bool m_bNoBlend; /* 3 1 */
	bool m_bLocal; /* 4 1 */
	bool m_bPose; /* 5 1 */
	bool m_bFetchFrame; /* 6 1 */
	bool m_bSubtract; /* 7 1 */
	void CSeqAutoLayerFlag(CSeqAutoLayerFlag* );
};

// <00B4A2D0> ../public/animationsystem/sequenceresource.h:33
// member functions: 13
// member variables: 8
// static member variable: 1
// struct size: 8
struct CSeqAutoLayerFlag {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	CSeqAutoLayerFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:35 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayerFlag* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	CSeqAutoLayerFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferSave_CSeqAutoLayerFlag(const CSeqAutoLayerFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:36 */
	void KV3TransferLoad_CSeqAutoLayerFlag(CSeqAutoLayerFlag* , CKV3TransferLoadContext* );
	bool m_bPost; /* 0 1 */
	bool m_bSpline; /* 1 1 */
	bool m_bXFade; /* 2 1 */
	bool m_bNoBlend; /* 3 1 */
	bool m_bLocal; /* 4 1 */
	bool m_bPose; /* 5 1 */
	bool m_bFetchFrame; /* 6 1 */
	bool m_bSubtract; /* 7 1 */
};

// <00A49639> ../public/animationsystem/sequenceresource.h:35
inline void CSeqAutoLayerFlag::Schema_DynamicBinding()
{
} /* size: 0 */

// <009DD344> ../public/animationsystem/sequenceresource.h:51
void CSeqAutoLayer::CSeqAutoLayer()
{
} /* size: 0 */

// <009DD328> ../public/animationsystem/sequenceresource.h:51
inline void CSeqAutoLayer::CSeqAutoLayer()
{
} /* size: 0 */

// <0020F137> ../public/animationsystem/sequenceresource.h:51
// member functions: 14
// member variables: 7
// static member variable: 1
// struct size: 28
struct CSeqAutoLayer {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	CSeqAutoLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	CSeqAutoLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad(CSeqAutoLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave_CSeqAutoLayer(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad_CSeqAutoLayer(CSeqAutoLayer* , CKV3TransferLoadContext* );
	int16 m_nLocalReference; /* 0 2 */
	int16 m_nLocalPose; /* 2 2 */
	CSeqAutoLayerFlag m_flags; /* 4 8 */
	float32 m_start; /* 12 4 */
	float32 m_peak; /* 16 4 */
	float32 m_tail; /* 20 4 */
	float32 m_end; /* 24 4 */
	void CSeqAutoLayer(CSeqAutoLayer* );
};

// <00905D08> ../public/animationsystem/sequenceresource.h:51
// member functions: 14
// member variables: 7
// static member variable: 1
// struct size: 28
struct CSeqAutoLayer {
	/* ../public/animationsystem/sequenceresource.h:54 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	CSeqAutoLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	CSeqAutoLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad(CSeqAutoLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave_CSeqAutoLayer(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad_CSeqAutoLayer(CSeqAutoLayer* , CKV3TransferLoadContext* );
	int16 m_nLocalReference; /* 0 2 */
	int16 m_nLocalPose; /* 2 2 */
	CSeqAutoLayerFlag m_flags; /* 4 8 */
	float32 m_start; /* 12 4 */
	float32 m_peak; /* 16 4 */
	float32 m_tail; /* 20 4 */
	float32 m_end; /* 24 4 */
	void CSeqAutoLayer(CSeqAutoLayer* );
};

// <00B4A4D8> ../public/animationsystem/sequenceresource.h:51
// member functions: 13
// member variables: 7
// static member variable: 1
// struct size: 28
struct CSeqAutoLayer {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	CSeqAutoLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	void Schema_CompileTimeVerificationFunction(CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:53 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqAutoLayer* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	CSeqAutoLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad(CSeqAutoLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferSave_CSeqAutoLayer(const CSeqAutoLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:54 */
	void KV3TransferLoad_CSeqAutoLayer(CSeqAutoLayer* , CKV3TransferLoadContext* );
	int16 m_nLocalReference; /* 0 2 */
	int16 m_nLocalPose; /* 2 2 */
	CSeqAutoLayerFlag m_flags; /* 4 8 */
	float32 m_start; /* 12 4 */
	float32 m_peak; /* 16 4 */
	float32 m_tail; /* 20 4 */
	float32 m_end; /* 24 4 */
};

// <00A49614> ../public/animationsystem/sequenceresource.h:53
inline void CSeqAutoLayer::Schema_DynamicBinding()
{
} /* size: 0 */

// <00C41094> ../public/animationsystem/sequenceresource.h:71
void CSeqIKLock::CSeqIKLock()
{
} /* size: 0 */

// <00C41078> ../public/animationsystem/sequenceresource.h:71
inline void CSeqIKLock::CSeqIKLock()
{
} /* size: 0 */

// <0020F349> ../public/animationsystem/sequenceresource.h:71
// member functions: 14
// member variables: 4
// static member variable: 1
// struct size: 12
struct CSeqIKLock {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	CSeqIKLock* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:73 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	void Schema_CompileTimeVerificationFunction(CSeqIKLock* );
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqIKLock* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	CSeqIKLock* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferSave(const CSeqIKLock* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferLoad(CSeqIKLock* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferSave_CSeqIKLock(const CSeqIKLock* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferLoad_CSeqIKLock(CSeqIKLock* , CKV3TransferLoadContext* );
	float32 m_flPosWeight; /* 0 4 */
	float32 m_flAngleWeight; /* 4 4 */
	int16 m_nLocalBone; /* 8 2 */
	bool m_bBonesOrientedAlongPositiveX; /* 10 1 */
	void CSeqIKLock(CSeqIKLock* );
};

// <00905F36> ../public/animationsystem/sequenceresource.h:71
// member functions: 14
// member variables: 4
// static member variable: 1
// struct size: 12
struct CSeqIKLock {
	/* ../public/animationsystem/sequenceresource.h:74 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	CSeqIKLock* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:73 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	void Schema_CompileTimeVerificationFunction(CSeqIKLock* );
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:73 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqIKLock* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	CSeqIKLock* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferSave(const CSeqIKLock* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferLoad(CSeqIKLock* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferSave_CSeqIKLock(const CSeqIKLock* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:74 */
	void KV3TransferLoad_CSeqIKLock(CSeqIKLock* , CKV3TransferLoadContext* );
	float32 m_flPosWeight; /* 0 4 */
	float32 m_flAngleWeight; /* 4 4 */
	int16 m_nLocalBone; /* 8 2 */
	bool m_bBonesOrientedAlongPositiveX; /* 10 1 */
	void CSeqIKLock(CSeqIKLock* );
};

// <00A495EF> ../public/animationsystem/sequenceresource.h:73
inline void CSeqIKLock::Schema_DynamicBinding()
{
} /* size: 0 */

// <00C300B2> ../public/animationsystem/sequenceresource.h:84
void CSeqBoneMaskList::~CSeqBoneMaskList()
{
} /* size: 0 */

// <00C30096> ../public/animationsystem/sequenceresource.h:84
inline void CSeqBoneMaskList::~CSeqBoneMaskList()
{
} /* size: 0 */

// <009D92E8> ../public/animationsystem/sequenceresource.h:84
inline void CSeqBoneMaskList::operator=(const CSeqBoneMaskList &)
{
} /* size: 0 */

// <009D9269> ../public/animationsystem/sequenceresource.h:84
void CSeqBoneMaskList::CSeqBoneMaskList()
{
} /* size: 0 */

// <009D924D> ../public/animationsystem/sequenceresource.h:84
inline void CSeqBoneMaskList::CSeqBoneMaskList()
{
} /* size: 0 */

// <0020F52E> ../public/animationsystem/sequenceresource.h:84
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 120
struct CSeqBoneMaskList {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	CSeqBoneMaskList* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_CompileTimeVerificationFunction(CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	CSeqBoneMaskList* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave_CSeqBoneMaskList(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad_CSeqBoneMaskList(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nLocalBoneArray; /* 16 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_flBoneWeightArray; /* 48 32 */
	float m_flDefaultMorphCtrlWeight; /* 80 4 */
	CUtlVector<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> > m_morphCtrlWeightArray; /* 88 32 */
	CSeqBoneMaskList& operator=(CSeqBoneMaskList* , const CSeqBoneMaskList& );
	void ~CSeqBoneMaskList(CSeqBoneMaskList* );
	void CSeqBoneMaskList(CSeqBoneMaskList* );
};

// <00906137> ../public/animationsystem/sequenceresource.h:84
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 120
struct CSeqBoneMaskList {
	/* ../public/animationsystem/sequenceresource.h:87 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	CSeqBoneMaskList* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_CompileTimeVerificationFunction(CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	CSeqBoneMaskList* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave_CSeqBoneMaskList(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad_CSeqBoneMaskList(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nLocalBoneArray; /* 16 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_flBoneWeightArray; /* 48 32 */
	float m_flDefaultMorphCtrlWeight; /* 80 4 */
	CUtlVector<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> > m_morphCtrlWeightArray; /* 88 32 */
	void ~CSeqBoneMaskList(CSeqBoneMaskList* );
	void CSeqBoneMaskList(CSeqBoneMaskList* );
	CSeqBoneMaskList& operator=(CSeqBoneMaskList* , const CSeqBoneMaskList& );
};

// <00B4A8B9> ../public/animationsystem/sequenceresource.h:84
// member functions: 14
// member variables: 5
// static member variable: 1
// struct size: 120
struct CSeqBoneMaskList {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	CSeqBoneMaskList* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	void Schema_CompileTimeVerificationFunction(CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:86 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqBoneMaskList* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	CSeqBoneMaskList* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferSave_CSeqBoneMaskList(const CSeqBoneMaskList* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:87 */
	void KV3TransferLoad_CSeqBoneMaskList(CSeqBoneMaskList* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nLocalBoneArray; /* 16 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_flBoneWeightArray; /* 48 32 */
	float m_flDefaultMorphCtrlWeight; /* 80 4 */
	CUtlVector<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> > m_morphCtrlWeightArray; /* 88 32 */
	void ~CSeqBoneMaskList(CSeqBoneMaskList* );
};

// <00A495CA> ../public/animationsystem/sequenceresource.h:86
inline void CSeqBoneMaskList::Schema_DynamicBinding()
{
} /* size: 0 */

// <009D4A29> ../public/animationsystem/sequenceresource.h:101
void CSeqMultiFetchFlag::CSeqMultiFetchFlag()
{
} /* size: 0 */

// <009D4A0D> ../public/animationsystem/sequenceresource.h:101
inline void CSeqMultiFetchFlag::CSeqMultiFetchFlag()
{
} /* size: 0 */

// <00210E89> ../public/animationsystem/sequenceresource.h:101
// member functions: 14
// member variables: 6
// static member variable: 1
// struct size: 6
struct CSeqMultiFetchFlag {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	CSeqMultiFetchFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	CSeqMultiFetchFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave_CSeqMultiFetchFlag(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad_CSeqMultiFetchFlag(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	bool m_bRealtime; /* 0 1 */
	bool m_bCylepose; /* 1 1 */
	bool m_b0D; /* 2 1 */
	bool m_b1D; /* 3 1 */
	bool m_b2D; /* 4 1 */
	bool m_b2D_TRI; /* 5 1 */
	void CSeqMultiFetchFlag(CSeqMultiFetchFlag* );
};

// <00907AAD> ../public/animationsystem/sequenceresource.h:101
// member functions: 14
// member variables: 6
// static member variable: 1
// struct size: 6
struct CSeqMultiFetchFlag {
	/* ../public/animationsystem/sequenceresource.h:104 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	CSeqMultiFetchFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	CSeqMultiFetchFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave_CSeqMultiFetchFlag(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad_CSeqMultiFetchFlag(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	bool m_bRealtime; /* 0 1 */
	bool m_bCylepose; /* 1 1 */
	bool m_b0D; /* 2 1 */
	bool m_b1D; /* 3 1 */
	bool m_b2D; /* 4 1 */
	bool m_b2D_TRI; /* 5 1 */
	void CSeqMultiFetchFlag(CSeqMultiFetchFlag* );
};

// <00B4C1D8> ../public/animationsystem/sequenceresource.h:101
// member functions: 13
// member variables: 6
// static member variable: 1
// struct size: 6
struct CSeqMultiFetchFlag {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	CSeqMultiFetchFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:103 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetchFlag* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	CSeqMultiFetchFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferSave_CSeqMultiFetchFlag(const CSeqMultiFetchFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:104 */
	void KV3TransferLoad_CSeqMultiFetchFlag(CSeqMultiFetchFlag* , CKV3TransferLoadContext* );
	bool m_bRealtime; /* 0 1 */
	bool m_bCylepose; /* 1 1 */
	bool m_b0D; /* 2 1 */
	bool m_b1D; /* 3 1 */
	bool m_b2D; /* 4 1 */
	bool m_b2D_TRI; /* 5 1 */
};

// <00A495A5> ../public/animationsystem/sequenceresource.h:103
inline void CSeqMultiFetchFlag::Schema_DynamicBinding()
{
} /* size: 0 */

// <00C30483> ../public/animationsystem/sequenceresource.h:117
void CSeqMultiFetch::~CSeqMultiFetch()
{
} /* size: 0 */

// <00C30467> ../public/animationsystem/sequenceresource.h:117
inline void CSeqMultiFetch::~CSeqMultiFetch()
{
} /* size: 0 */

// <00A665B4> ../public/animationsystem/sequenceresource.h:117
// function calls: 45
void CSeqMultiFetch::operator=(const CSeqMultiFetch &)
{
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 573
	CUtlMemory<short int, int>::Base(); // 112
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 102
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::begin(); // 574
	CUtlMemory<short int, int>::Base(); // 113
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 574
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 565
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 452
	CUtlVector<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVector<short int, CUtlMemory<short int, int> >& src);  // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
	CUtlMemory<float, int>::Base(); // 112
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 102
	CUtlVectorBase<float, CUtlMemory<float, int> >::begin(); // 574
	CUtlMemory<float, int>::Base(); // 113
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 574
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
	CUtlVector<float, CUtlMemory<float, int> >::operator=(
			const CUtlVector<float, CUtlMemory<float, int> >& src);  // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
	CUtlMemory<float, int>::Base(); // 112
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 102
	CUtlVectorBase<float, CUtlMemory<float, int> >::begin(); // 574
	CUtlMemory<float, int>::Base(); // 113
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 574
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
	CUtlVector<float, CUtlMemory<float, int> >::operator=(
			const CUtlVector<float, CUtlMemory<float, int> >& src);  // 117
} /* size: 331, inline expansions: 45 (1161 bytes) */

// <009D2AC4> ../public/animationsystem/sequenceresource.h:117
inline void CSeqMultiFetch::operator=(const CSeqMultiFetch &)
{
} /* size: 0 */

// <009D2AAD> ../public/animationsystem/sequenceresource.h:117
void CSeqMultiFetch::CSeqMultiFetch()
{
} /* size: 0 */

// <009D2A91> ../public/animationsystem/sequenceresource.h:117
inline void CSeqMultiFetch::CSeqMultiFetch()
{
} /* size: 0 */

// <0021108C> ../public/animationsystem/sequenceresource.h:117
// member functions: 22
// member variables: 8
// static member variable: 1
// struct size: 128
struct CSeqMultiFetch {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	CSeqMultiFetch* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	CSeqMultiFetch* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad(CSeqMultiFetch* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave_CSeqMultiFetch(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad_CSeqMultiFetch(CSeqMultiFetch* , CKV3TransferLoadContext* );
	CSeqMultiFetchFlag m_flags; /* 0 6 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_localReferenceArray; /* 8 32 */
	/* ../public/animationsystem/sequenceresource.h:127 */
	int nElement(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:133 */
	int nLocalReference(const CSeqMultiFetch* , int, int);
	int32 m_nGroupSize[2]; /* 40 8 */
	int32 m_nLocalPose[2]; /* 48 8 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray0; /* 56 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray1; /* 88 32 */
	/* ../public/animationsystem/sequenceresource.h:145 */
	const float* pPoseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:146 */
	const float* pPoseKey1(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:147 */
	float poseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:148 */
	float poseKey1(const CSeqMultiFetch* , int, int);
	int32 m_nLocalCyclePoseParameter; /* 120 4 */
	bool m_bCalculatePoseParameters; /* 124 1 */
	CSeqMultiFetch& operator=(CSeqMultiFetch* , const CSeqMultiFetch& );
	void ~CSeqMultiFetch(CSeqMultiFetch* );
	void CSeqMultiFetch(CSeqMultiFetch* );
};

// <00907CCC> ../public/animationsystem/sequenceresource.h:117
// member functions: 22
// member variables: 8
// static member variable: 1
// struct size: 128
struct CSeqMultiFetch {
	/* ../public/animationsystem/sequenceresource.h:120 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	CSeqMultiFetch* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	CSeqMultiFetch* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad(CSeqMultiFetch* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave_CSeqMultiFetch(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad_CSeqMultiFetch(CSeqMultiFetch* , CKV3TransferLoadContext* );
	CSeqMultiFetchFlag m_flags; /* 0 6 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_localReferenceArray; /* 8 32 */
	/* ../public/animationsystem/sequenceresource.h:127 */
	int nElement(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:133 */
	int nLocalReference(const CSeqMultiFetch* , int, int);
	int32 m_nGroupSize[2]; /* 40 8 */
	int32 m_nLocalPose[2]; /* 48 8 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray0; /* 56 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray1; /* 88 32 */
	/* ../public/animationsystem/sequenceresource.h:145 */
	const float* pPoseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:146 */
	const float* pPoseKey1(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:147 */
	float poseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:148 */
	float poseKey1(const CSeqMultiFetch* , int, int);
	int32 m_nLocalCyclePoseParameter; /* 120 4 */
	bool m_bCalculatePoseParameters; /* 124 1 */
	void ~CSeqMultiFetch(CSeqMultiFetch* );
	void CSeqMultiFetch(CSeqMultiFetch* );
	CSeqMultiFetch& operator=(CSeqMultiFetch* , const CSeqMultiFetch& );
};

// <00B4C3C2> ../public/animationsystem/sequenceresource.h:117
// member functions: 20
// member variables: 8
// static member variable: 1
// struct size: 128
struct CSeqMultiFetch {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	CSeqMultiFetch* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	void Schema_CompileTimeVerificationFunction(CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:119 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqMultiFetch* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	CSeqMultiFetch* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad(CSeqMultiFetch* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferSave_CSeqMultiFetch(const CSeqMultiFetch* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:120 */
	void KV3TransferLoad_CSeqMultiFetch(CSeqMultiFetch* , CKV3TransferLoadContext* );
	CSeqMultiFetchFlag m_flags; /* 0 6 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_localReferenceArray; /* 8 32 */
	/* ../public/animationsystem/sequenceresource.h:127 */
	int nElement(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:133 */
	int nLocalReference(const CSeqMultiFetch* , int, int);
	int32 m_nGroupSize[2]; /* 40 8 */
	int32 m_nLocalPose[2]; /* 48 8 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray0; /* 56 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_poseKeyArray1; /* 88 32 */
	/* ../public/animationsystem/sequenceresource.h:145 */
	const float* pPoseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:146 */
	const float* pPoseKey1(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:147 */
	float poseKey0(const CSeqMultiFetch* , int, int);
	/* ../public/animationsystem/sequenceresource.h:148 */
	float poseKey1(const CSeqMultiFetch* , int, int);
	int32 m_nLocalCyclePoseParameter; /* 120 4 */
	bool m_bCalculatePoseParameters; /* 124 1 */
	void ~CSeqMultiFetch(CSeqMultiFetch* );
};

// <00A49580> ../public/animationsystem/sequenceresource.h:119
inline void CSeqMultiFetch::Schema_DynamicBinding()
{
} /* size: 0 */

// <00D20639> ../public/animationsystem/sequenceresource.h:127
inline void CSeqMultiFetch::nElement(int index0, int index1)
{
} /* size: 0 */

// <00D20608> ../public/animationsystem/sequenceresource.h:133
inline void CSeqMultiFetch::nLocalReference(int index0, int index1)
{
} /* size: 0 */

// <00CB5723> ../public/animationsystem/sequenceresource.h:159
void CSeqSeqDescFlag::CSeqSeqDescFlag()
{
} /* size: 0 */

// <00CB5707> ../public/animationsystem/sequenceresource.h:159
inline void CSeqSeqDescFlag::CSeqSeqDescFlag()
{
} /* size: 0 */

// <002113EE> ../public/animationsystem/sequenceresource.h:159
// member functions: 14
// member variables: 11
// static member variable: 1
// struct size: 11
struct CSeqSeqDescFlag {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	CSeqSeqDescFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:161 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	void Schema_CompileTimeVerificationFunction(CSeqSeqDescFlag* );
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqSeqDescFlag* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	CSeqSeqDescFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferSave(const CSeqSeqDescFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferLoad(CSeqSeqDescFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferSave_CSeqSeqDescFlag(const CSeqSeqDescFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferLoad_CSeqSeqDescFlag(CSeqSeqDescFlag* , CKV3TransferLoadContext* );
	bool m_bLooping; /* 0 1 */
	bool m_bSnap; /* 1 1 */
	bool m_bAutoplay; /* 2 1 */
	bool m_bPost; /* 3 1 */
	bool m_bHidden; /* 4 1 */
	bool m_bMulti; /* 5 1 */
	bool m_bLegacyDelta; /* 6 1 */
	bool m_bLegacyWorldspace; /* 7 1 */
	bool m_bLegacyCyclepose; /* 8 1 */
	bool m_bLegacyRealtime; /* 9 1 */
	bool m_bModelDoc; /* 10 1 */
	void CSeqSeqDescFlag(CSeqSeqDescFlag* );
};

// <00908049> ../public/animationsystem/sequenceresource.h:159
// member functions: 14
// member variables: 11
// static member variable: 1
// struct size: 11
struct CSeqSeqDescFlag {
	/* ../public/animationsystem/sequenceresource.h:162 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	CSeqSeqDescFlag* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:161 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	void Schema_CompileTimeVerificationFunction(CSeqSeqDescFlag* );
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:161 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqSeqDescFlag* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	CSeqSeqDescFlag* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferSave(const CSeqSeqDescFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferLoad(CSeqSeqDescFlag* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferSave_CSeqSeqDescFlag(const CSeqSeqDescFlag* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:162 */
	void KV3TransferLoad_CSeqSeqDescFlag(CSeqSeqDescFlag* , CKV3TransferLoadContext* );
	bool m_bLooping; /* 0 1 */
	bool m_bSnap; /* 1 1 */
	bool m_bAutoplay; /* 2 1 */
	bool m_bPost; /* 3 1 */
	bool m_bHidden; /* 4 1 */
	bool m_bMulti; /* 5 1 */
	bool m_bLegacyDelta; /* 6 1 */
	bool m_bLegacyWorldspace; /* 7 1 */
	bool m_bLegacyCyclepose; /* 8 1 */
	bool m_bLegacyRealtime; /* 9 1 */
	bool m_bModelDoc; /* 10 1 */
	void CSeqSeqDescFlag(CSeqSeqDescFlag* );
};

// <00A4955B> ../public/animationsystem/sequenceresource.h:161
inline void CSeqSeqDescFlag::Schema_DynamicBinding()
{
} /* size: 0 */

// <009CC6B3> ../public/animationsystem/sequenceresource.h:183
void CSeqTransition::CSeqTransition()
{
} /* size: 0 */

// <009CC697> ../public/animationsystem/sequenceresource.h:183
inline void CSeqTransition::CSeqTransition()
{
} /* size: 0 */

// <0021163C> ../public/animationsystem/sequenceresource.h:183
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 8
struct CSeqTransition {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	CSeqTransition* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_CompileTimeVerificationFunction(CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	CSeqTransition* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad(CSeqTransition* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave_CSeqTransition(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad_CSeqTransition(CSeqTransition* , CKV3TransferLoadContext* );
	float32 m_flFadeInTime; /* 0 4 */
	float32 m_flFadeOutTime; /* 4 4 */
	void CSeqTransition(CSeqTransition* );
};

// <009082B3> ../public/animationsystem/sequenceresource.h:183
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 8
struct CSeqTransition {
	/* ../public/animationsystem/sequenceresource.h:186 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	CSeqTransition* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_CompileTimeVerificationFunction(CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	CSeqTransition* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad(CSeqTransition* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave_CSeqTransition(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad_CSeqTransition(CSeqTransition* , CKV3TransferLoadContext* );
	float32 m_flFadeInTime; /* 0 4 */
	float32 m_flFadeOutTime; /* 4 4 */
	void CSeqTransition(CSeqTransition* );
};

// <00B4C93E> ../public/animationsystem/sequenceresource.h:183
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 8
struct CSeqTransition {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	CSeqTransition* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	void Schema_CompileTimeVerificationFunction(CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:185 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqTransition* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	CSeqTransition* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad(CSeqTransition* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferSave_CSeqTransition(const CSeqTransition* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:186 */
	void KV3TransferLoad_CSeqTransition(CSeqTransition* , CKV3TransferLoadContext* );
	float32 m_flFadeInTime; /* 0 4 */
	float32 m_flFadeOutTime; /* 4 4 */
};

// <00A49536> ../public/animationsystem/sequenceresource.h:185
inline void CSeqTransition::Schema_DynamicBinding()
{
} /* size: 0 */

// <00C303E8> ../public/animationsystem/sequenceresource.h:195
void CSeqS1SeqDesc::~CSeqS1SeqDesc()
{
} /* size: 0 */

// <00C303CC> ../public/animationsystem/sequenceresource.h:195
inline void CSeqS1SeqDesc::~CSeqS1SeqDesc()
{
} /* size: 0 */

// <00A71E24> ../public/animationsystem/sequenceresource.h:195
// variables: 3
// function calls: 168
void CSeqS1SeqDesc::operator=(const CSeqS1SeqDesc &)
{
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Count(); // 573
	CUtlMemory<CSeqAutoLayer, int>::Base(); // 112
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Base(); // 102
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::begin(); // 574
	CUtlMemory<CSeqAutoLayer, int>::Base(); // 113
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Base(); // 105
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Count(); // 105
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<CSeqAutoLayer>(const CSeqAutoLayer* pFrom,
						const CSeqAutoLayer* pFromEnd,
						CSeqAutoLayer* pTo);  // 574
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& other);  // 565
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& other);  // 452
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& src);  // 195
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Count(); // 573
	CUtlMemory<CSeqIKLock, int>::Base(); // 112
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Base(); // 102
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::begin(); // 574
	CUtlMemory<CSeqIKLock, int>::Base(); // 113
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Base(); // 105
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Count(); // 105
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<CSeqIKLock>(const CSeqIKLock* pFrom,
					const CSeqIKLock* pFromEnd,
					CSeqIKLock* pTo);  // 574
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& other);  // 565
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& other);  // 452
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& src);  // 195
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 573
	CUtlMemory<CAnimActivity, int>::Base(); // 112
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 102
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::begin(); // 574
	CUtlMemory<CAnimActivity, int>::Base(); // 113
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 402
	CAnimActivity::operator=(
			const CAnimActivity  &);  // 209
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 200
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 574
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 565
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 452
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >& src);  // 195
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Count(); // 573
	CUtlMemory<CFootMotion, int>::Base(); // 112
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Base(); // 102
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::begin(); // 574
	CUtlMemory<CFootMotion, int>::Base(); // 113
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Base(); // 105
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Count(); // 105
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::end(); // 574
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Count(); // 573
	CUtlMemory<CFootStride, int>::NumAllocated(); // 782
	CUtlMemory<CFootStride, int>::IsGrowable(); // 823
	CUtlMemory<CFootStride, int>::IsExternallyAllocated(); // 859
	CUtlMemory<CFootStride, int>::IsExternallyAllocated(); // 861
	CUtlMemory<CFootStride, int>::Grow(
		int num);  // 806
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::GrowMemory(
			int num);  // 784
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::GrowVector(
			int num);  // 1445
	{
		int i; // 1451
		CUtlMemory<CFootStride, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Element(
			int i);  // 1453
		CCycleBase::CCycleBase(); // 126
		CFootCycle::CFootCycle(); // 141
		CCycleBase::CCycleBase(); // 125
		CAnimCycle::CAnimCycle(); // 141
		CCycleBase::CCycleBase(); // 126
		CFootCycle::CFootCycle(); // 141
		CCycleBase::CCycleBase(); // 126
		CFootCycle::CFootCycle(); // 141
		CCycleBase::CCycleBase(); // 126
		CFootCycle::CFootCycle(); // 141
		CFootCycleDefinition::CFootCycleDefinition(); // 271
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::ResetDbgInfo(); // 530
		CUtlMemory<CFootTrajectory, int>::ValidateGrowSize(); // 475
		CUtlMemory<CFootTrajectory, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::CUtlVector(); // 257
		CFootTrajectories::CFootTrajectories(); // 271
		CFootStride::CFootStride(); // 1479
		Construct<CFootStride>(CFootStride* pMemory); // 1453
	}
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1437
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::AddMultipleToTail(
				int num);  // 1319
	{
		int i; // 1696
		CUtlMemory<CFootStride, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Element(
			int i);  // 1697
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::RemoveAll(); // 1798
		CUtlMemory<CFootTrajectory, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CFootTrajectory, int>::Purge(); // 903
		CUtlMemory<CFootTrajectory, int>::Purge(); // 1799
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Purge(); // 560
		ValidateAlignment<CFootTrajectory>(void); // 508
		CUtlMemory<CFootTrajectory, int>::Purge(); // 510
		CUtlMemory<CFootTrajectory, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::~CUtlVector(); // 250
		CFootTrajectories::~CFootTrajectories(); // 271
		CFootStride::~CFootStride(); // 1526
		Destruct<CFootStride>(CFootStride* pMemory); // 1697
	}
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::RemoveMultipleFromTail(
				int num);  // 1323
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::SetCount(
		int count);  // 573
	CUtlMemory<CFootStride, int>::Base(); // 112
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Base(); // 102
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::begin(); // 574
	CUtlMemory<CFootStride, int>::Base(); // 113
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Base(); // 105
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Count(); // 105
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::end(); // 574
	Vector::operator=(
			const Vector& vOther);  // 134
	Vector::operator=(
			const Vector& vOther);  // 134
	Vector::operator=(
			const Vector& vOther);  // 134
	CFootCycleDefinition::operator=(
			const CFootCycleDefinition  &);  // 271
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Count(); // 573
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::RemoveMultipleFromTail(
				int num);  // 1323
	CUtlMemory<CFootTrajectory, int>::NumAllocated(); // 782
	CUtlMemory<CFootTrajectory, int>::IsGrowable(); // 823
	CUtlMemory<CFootTrajectory, int>::IsExternallyAllocated(); // 859
	CUtlMemory<CFootTrajectory, int>::IsExternallyAllocated(); // 861
	CUtlMemory<CFootTrajectory, int>::Grow(
		int num);  // 806
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::GrowMemory(
			int num);  // 784
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::GrowVector(
			int num);  // 1445
	{
		int i; // 1451
		CUtlMemory<CFootTrajectory, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Element(
			int i);  // 1453
		Construct<CFootTrajectory>(CFootTrajectory* pMemory); // 1453
	}
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1437
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::AddMultipleToTail(
				int num);  // 1319
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::SetCount(
		int count);  // 573
	CUtlMemory<CFootTrajectory, int>::Base(); // 112
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Base(); // 102
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::begin(); // 574
	CUtlMemory<CFootTrajectory, int>::Base(); // 113
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Base(); // 105
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Count(); // 105
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::end(); // 574
	Vector::operator=(
			const Vector& vOther);  // 188
	CFootTrajectory::operator=(
			const CFootTrajectory  &);  // 209
	UtlTraitsCopyRange<CFootTrajectory>(const CFootTrajectory* pFrom,
						const CFootTrajectory* pFromEnd,
						CFootTrajectory* pTo);  // 200
	UtlTraitsCopyRange<CFootTrajectory>(const CFootTrajectory* pFrom,
						const CFootTrajectory* pFromEnd,
						CFootTrajectory* pTo);  // 574
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::operator=(
			const CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >& other);  // 565
	CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::operator=(
			const CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >& other);  // 452
	CUtlVector<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::operator=(
			const CUtlVector<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >& src);  // 250
	CFootTrajectories::operator=(
			const CFootTrajectories  &);  // 271
	CFootStride::operator=(
			const CFootStride  &);  // 209
	UtlTraitsCopyRange<CFootStride>(const CFootStride* pFrom,
					const CFootStride* pFromEnd,
					CFootStride* pTo);  // 200
	UtlTraitsCopyRange<CFootStride>(const CFootStride* pFrom,
					const CFootStride* pFromEnd,
					CFootStride* pTo);  // 574
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::operator=(
			const CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >& other);  // 565
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::operator=(
			const CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >& other);  // 452
	CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >::operator=(
			const CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >& src);  // 286
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 286
	CFootMotion::operator=(
			const CFootMotion  &);  // 209
	UtlTraitsCopyRange<CFootMotion>(const CFootMotion* pFrom,
					const CFootMotion* pFromEnd,
					CFootMotion* pTo);  // 200
	UtlTraitsCopyRange<CFootMotion>(const CFootMotion* pFrom,
					const CFootMotion* pFromEnd,
					CFootMotion* pTo);  // 574
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >& other);  // 565
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >& other);  // 452
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >& src);  // 195
} /* size: 1955, inline expansions: 129 (22586 bytes) */

// <009CC3D5> ../public/animationsystem/sequenceresource.h:195
inline void CSeqS1SeqDesc::operator=(const CSeqS1SeqDesc &)
{
} /* size: 0 */

// <009CB11F> ../public/animationsystem/sequenceresource.h:195
// variables: 2
// function calls: 92
void CSeqS1SeqDesc::~CSeqS1SeqDesc()
{
	{
		int i; // 1721
		CUtlMemory<CFootMotion, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 286
		CUtlMemory<CFootStride, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CFootStride, int>::Purge(); // 903
		CUtlMemory<CFootStride, int>::Purge(); // 1799
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Purge(); // 560
		ValidateAlignment<CFootStride>(void); // 508
		CUtlMemory<CFootStride, int>::Purge(); // 510
		CUtlMemory<CFootStride, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >::~CUtlVector(); // 286
		CFootMotion::~CFootMotion(); // 1526
		Destruct<CFootMotion>(CFootMotion* pMemory); // 1723
	}
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::RemoveAll(); // 1798
	CUtlMemory<CFootMotion, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CFootMotion, int>::Purge(); // 903
	CUtlMemory<CFootMotion, int>::Purge(); // 1799
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Purge(); // 560
	ValidateAlignment<CFootMotion>(void); // 508
	CUtlMemory<CFootMotion, int>::Purge(); // 510
	CUtlMemory<CFootMotion, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CAnimActivity, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 402
		CAnimActivity::~CAnimActivity(); // 1526
		Destruct<CAnimActivity>(CAnimActivity* pMemory); // 1723
	}
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimActivity, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimActivity, int>::Purge(); // 903
	CUtlMemory<CAnimActivity, int>::Purge(); // 1799
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Purge(); // 560
	ValidateAlignment<CAnimActivity>(void); // 508
	CUtlMemory<CAnimActivity, int>::Purge(); // 510
	CUtlMemory<CAnimActivity, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVector(); // 195
	CBufferString::~CBufferString(); // 195
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqIKLock, int>::Purge(); // 903
	CUtlMemory<CSeqIKLock, int>::Purge(); // 1799
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Purge(); // 560
	ValidateAlignment<CSeqIKLock>(void); // 508
	CUtlMemory<CSeqIKLock, int>::Purge(); // 510
	CUtlMemory<CSeqIKLock, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVector(); // 195
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqAutoLayer, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 903
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 1799
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Purge(); // 560
	ValidateAlignment<CSeqAutoLayer>(void); // 508
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 510
	CUtlMemory<CSeqAutoLayer, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::~CUtlVector(); // 195
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 117
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 117
	CSeqMultiFetch::~CSeqMultiFetch(); // 195
	CBufferString::~CBufferString(); // 195
} /* size: 0, inline expansions: 73 (0 bytes) */

// <0035A08F> ../public/animationsystem/sequenceresource.h:195
// variable: 1
// function calls: 148
void CSeqS1SeqDesc::operator=(const CSeqS1SeqDesc &)
{
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 195
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 573
	CUtlMemory<short int, int>::Base(); // 112
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 102
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::begin(); // 574
	CUtlMemory<short int, int>::Base(); // 113
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 574
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 565
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 452
	CUtlVector<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVector<short int, CUtlMemory<short int, int> >& src);  // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
	CUtlMemory<float, int>::Base(); // 112
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 102
	CUtlVectorBase<float, CUtlMemory<float, int> >::begin(); // 574
	CUtlMemory<float, int>::Base(); // 113
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 574
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
	CUtlVector<float, CUtlMemory<float, int> >::operator=(
			const CUtlVector<float, CUtlMemory<float, int> >& src);  // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
	CUtlMemory<float, int>::Base(); // 112
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 102
	CUtlVectorBase<float, CUtlMemory<float, int> >::begin(); // 574
	CUtlMemory<float, int>::Base(); // 113
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 574
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
	CUtlVector<float, CUtlMemory<float, int> >::operator=(
			const CUtlVector<float, CUtlMemory<float, int> >& src);  // 117
	CSeqMultiFetch::operator=(
			const CSeqMultiFetch  &);  // 195
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Count(); // 573
	CUtlMemory<CSeqAutoLayer, int>::Base(); // 112
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Base(); // 102
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::begin(); // 574
	CUtlMemory<CSeqAutoLayer, int>::Base(); // 113
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Base(); // 105
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Count(); // 105
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<CSeqAutoLayer>(const CSeqAutoLayer* pFrom,
						const CSeqAutoLayer* pFromEnd,
						CSeqAutoLayer* pTo);  // 574
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& other);  // 565
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& other);  // 452
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::operator=(
			const CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >& src);  // 195
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Count(); // 573
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::RemoveMultipleFromTail(
				int num);  // 1323
	CUtlMemory<CSeqIKLock, int>::NumAllocated(); // 782
	CUtlMemory<CSeqIKLock, int>::IsGrowable(); // 823
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 859
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 861
	CUtlMemory<CSeqIKLock, int>::Grow(
		int num);  // 806
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::GrowMemory(
			int num);  // 784
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::GrowVector(
			int num);  // 1445
	{
		int i; // 1451
		CUtlMemory<CSeqIKLock, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Element(
			int i);  // 1453
		CSeqIKLock::CSeqIKLock(); // 1479
		Construct<CSeqIKLock>(CSeqIKLock* pMemory); // 1453
	}
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1437
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::AddMultipleToTail(
				int num);  // 1319
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::SetCount(
		int count);  // 573
	CUtlMemory<CSeqIKLock, int>::Base(); // 112
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Base(); // 102
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::begin(); // 574
	CUtlMemory<CSeqIKLock, int>::Base(); // 113
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Base(); // 105
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Count(); // 105
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<CSeqIKLock>(const CSeqIKLock* pFrom,
					const CSeqIKLock* pFromEnd,
					CSeqIKLock* pTo);  // 574
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& other);  // 565
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& other);  // 452
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::operator=(
			const CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >& src);  // 195
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 195
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 573
	CUtlMemory<CAnimActivity, int>::Base(); // 112
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 102
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::begin(); // 574
	CUtlMemory<CAnimActivity, int>::Base(); // 113
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 402
	CAnimActivity::operator=(
			const CAnimActivity  &);  // 209
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 200
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 574
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 565
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 452
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >& src);  // 195
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Count(); // 573
	CUtlMemory<CFootMotion, int>::Base(); // 112
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Base(); // 102
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::begin(); // 574
	CUtlMemory<CFootMotion, int>::Base(); // 113
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Base(); // 105
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Count(); // 105
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::end(); // 574
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 286
	CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::operator=(
			const CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >& other);  // 452
	CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >::operator=(
			const CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >& src);  // 286
	CFootMotion::operator=(
			const CFootMotion  &);  // 209
	UtlTraitsCopyRange<CFootMotion>(const CFootMotion* pFrom,
					const CFootMotion* pFromEnd,
					CFootMotion* pTo);  // 200
	UtlTraitsCopyRange<CFootMotion>(const CFootMotion* pFrom,
					const CFootMotion* pFromEnd,
					CFootMotion* pTo);  // 574
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >& other);  // 565
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >& other);  // 452
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >::operator=(
			const CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >& src);  // 195
} /* size: 1691, inline expansions: 144 (9079 bytes) */

// <002E1F91> ../public/animationsystem/sequenceresource.h:195
// variables: 3
// function calls: 108
void CSeqS1SeqDesc::~CSeqS1SeqDesc()
{
	{
		int i; // 1721
		CUtlMemory<CFootMotion, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 286
		{
			int i; // 1721
			CUtlMemory<CFootStride, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Element(
				int i);  // 1723
			CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::RemoveAll(); // 1798
			CUtlMemory<CFootTrajectory, int>::IsExternallyAllocated(); // 905
			CUtlMemory<CFootTrajectory, int>::Purge(); // 903
			CUtlMemory<CFootTrajectory, int>::Purge(); // 1799
			CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::Purge(); // 560
			ValidateAlignment<CFootTrajectory>(void); // 508
			CUtlMemory<CFootTrajectory, int>::Purge(); // 510
			CUtlMemory<CFootTrajectory, int>::~CUtlMemory(); // 562
			CUtlVectorBase<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::~CUtlVectorBase(); // 410
			CUtlVector<CFootTrajectory, CUtlMemory<CFootTrajectory, int> >::~CUtlVector(); // 250
			CFootTrajectories::~CFootTrajectories(); // 271
			CFootStride::~CFootStride(); // 1526
			Destruct<CFootStride>(CFootStride* pMemory); // 1723
		}
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::RemoveAll(); // 1798
		CUtlMemory<CFootStride, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CFootStride, int>::Purge(); // 903
		CUtlMemory<CFootStride, int>::Purge(); // 1799
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::Purge(); // 560
		ValidateAlignment<CFootStride>(void); // 508
		CUtlMemory<CFootStride, int>::Purge(); // 510
		CUtlMemory<CFootStride, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CFootStride, CUtlMemory<CFootStride, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CFootStride, CUtlMemory<CFootStride, int> >::~CUtlVector(); // 286
		CFootMotion::~CFootMotion(); // 1526
		Destruct<CFootMotion>(CFootMotion* pMemory); // 1723
	}
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::RemoveAll(); // 1798
	CUtlMemory<CFootMotion, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CFootMotion, int>::Purge(); // 903
	CUtlMemory<CFootMotion, int>::Purge(); // 1799
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::Purge(); // 560
	ValidateAlignment<CFootMotion>(void); // 508
	CUtlMemory<CFootMotion, int>::Purge(); // 510
	CUtlMemory<CFootMotion, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CFootMotion, CUtlMemory<CFootMotion, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CAnimActivity, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 402
		CAnimActivity::~CAnimActivity(); // 1526
		Destruct<CAnimActivity>(CAnimActivity* pMemory); // 1723
	}
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimActivity, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimActivity, int>::Purge(); // 903
	CUtlMemory<CAnimActivity, int>::Purge(); // 1799
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Purge(); // 560
	ValidateAlignment<CAnimActivity>(void); // 508
	CUtlMemory<CAnimActivity, int>::Purge(); // 510
	CUtlMemory<CAnimActivity, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVector(); // 195
	CBufferString::~CBufferString(); // 195
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqIKLock, int>::Purge(); // 903
	CUtlMemory<CSeqIKLock, int>::Purge(); // 1799
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Purge(); // 560
	ValidateAlignment<CSeqIKLock>(void); // 508
	CUtlMemory<CSeqIKLock, int>::Purge(); // 510
	CUtlMemory<CSeqIKLock, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVector(); // 195
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqAutoLayer, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 903
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 1799
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::Purge(); // 560
	ValidateAlignment<CSeqAutoLayer>(void); // 508
	CUtlMemory<CSeqAutoLayer, int>::Purge(); // 510
	CUtlMemory<CSeqAutoLayer, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> >::~CUtlVector(); // 195
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 117
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 117
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 117
	CSeqMultiFetch::~CSeqMultiFetch(); // 195
	CBufferString::~CBufferString(); // 195
} /* size: 647, inline expansions: 73 (2547 bytes) */

// <00211803> ../public/animationsystem/sequenceresource.h:195
// member functions: 18
// member variables: 11
// static member variable: 1
// struct size: 336
struct CSeqS1SeqDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	CSeqS1SeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_CompileTimeVerificationFunction(CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	CSeqS1SeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave_CSeqS1SeqDesc(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad_CSeqS1SeqDesc(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:200 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:203 */
	const char* GetName(const CSeqS1SeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqMultiFetch m_fetch; /* 32 128 */
	int32 m_nLocalWeightlist; /* 160 4 */
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> > m_autoLayerArray; /* 168 32 */
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> > m_IKLockArray; /* 200 32 */
	CSeqTransition m_transition; /* 232 8 */
	KeyValues3 m_SequenceKeys; /* 240 16 */
	AnimString_t m_LegacyKeyValueText; /* 256 16 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 272 32 */
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> > m_footMotion; /* 304 32 */
	/* ../public/animationsystem/sequenceresource.h:228 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* , const CSeqS1SeqDesc& );
	CSeqS1SeqDesc& operator=(CSeqS1SeqDesc* , const CSeqS1SeqDesc& );
	void ~CSeqS1SeqDesc(CSeqS1SeqDesc* );
};

// <00908496> ../public/animationsystem/sequenceresource.h:195
// member functions: 18
// member variables: 11
// static member variable: 1
// struct size: 336
struct CSeqS1SeqDesc {
	/* ../public/animationsystem/sequenceresource.h:198 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	CSeqS1SeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_CompileTimeVerificationFunction(CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	CSeqS1SeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave_CSeqS1SeqDesc(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad_CSeqS1SeqDesc(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:200 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:203 */
	const char* GetName(const CSeqS1SeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqMultiFetch m_fetch; /* 32 128 */
	int32 m_nLocalWeightlist; /* 160 4 */
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> > m_autoLayerArray; /* 168 32 */
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> > m_IKLockArray; /* 200 32 */
	CSeqTransition m_transition; /* 232 8 */
	KeyValues3 m_SequenceKeys; /* 240 16 */
	AnimString_t m_LegacyKeyValueText; /* 256 16 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 272 32 */
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> > m_footMotion; /* 304 32 */
	/* ../public/animationsystem/sequenceresource.h:228 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* , const CSeqS1SeqDesc& );
	void ~CSeqS1SeqDesc(CSeqS1SeqDesc* );
	CSeqS1SeqDesc& operator=(CSeqS1SeqDesc* , const CSeqS1SeqDesc& );
};

// <00B4CAEC> ../public/animationsystem/sequenceresource.h:195
// member functions: 17
// member variables: 11
// static member variable: 1
// struct size: 336
struct CSeqS1SeqDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	CSeqS1SeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	void Schema_CompileTimeVerificationFunction(CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqS1SeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	CSeqS1SeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferSave_CSeqS1SeqDesc(const CSeqS1SeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:198 */
	void KV3TransferLoad_CSeqS1SeqDesc(CSeqS1SeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:200 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:203 */
	const char* GetName(const CSeqS1SeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqMultiFetch m_fetch; /* 32 128 */
	int32 m_nLocalWeightlist; /* 160 4 */
	CUtlVector<CSeqAutoLayer, CUtlMemory<CSeqAutoLayer, int> > m_autoLayerArray; /* 168 32 */
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> > m_IKLockArray; /* 200 32 */
	CSeqTransition m_transition; /* 232 8 */
	KeyValues3 m_SequenceKeys; /* 240 16 */
	AnimString_t m_LegacyKeyValueText; /* 256 16 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 272 32 */
	CUtlVector<CFootMotion, CUtlMemory<CFootMotion, int> > m_footMotion; /* 304 32 */
	/* ../public/animationsystem/sequenceresource.h:228 */
	void CSeqS1SeqDesc(CSeqS1SeqDesc* , const CSeqS1SeqDesc& );
	void ~CSeqS1SeqDesc(CSeqS1SeqDesc* );
};

// <00A49511> ../public/animationsystem/sequenceresource.h:197
inline void CSeqS1SeqDesc::Schema_DynamicBinding()
{
} /* size: 0 */

// <009CC322> ../public/animationsystem/sequenceresource.h:200
void CSeqS1SeqDesc::CSeqS1SeqDesc()
{
} /* size: 0 */

// <009CC309> ../public/animationsystem/sequenceresource.h:200
inline void CSeqS1SeqDesc::CSeqS1SeqDesc()
{
} /* size: 0 */

// <00D205EF> ../public/animationsystem/sequenceresource.h:203
inline void CSeqS1SeqDesc::GetName()
{
} /* size: 0 */

// <00C302F9> ../public/animationsystem/sequenceresource.h:234
void CSeqSynthAnimDesc::~CSeqSynthAnimDesc()
{
} /* size: 0 */

// <00C302DD> ../public/animationsystem/sequenceresource.h:234
inline void CSeqSynthAnimDesc::~CSeqSynthAnimDesc()
{
} /* size: 0 */

// <009C4F35> ../public/animationsystem/sequenceresource.h:234
inline void CSeqSynthAnimDesc::operator=(const CSeqSynthAnimDesc &)
{
} /* size: 0 */

// <0021602F> ../public/animationsystem/sequenceresource.h:234
// member functions: 18
// member variables: 6
// static member variable: 1
// struct size: 72
struct CSeqSynthAnimDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	CSeqSynthAnimDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_CompileTimeVerificationFunction(CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	CSeqSynthAnimDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave_CSeqSynthAnimDesc(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad_CSeqSynthAnimDesc(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:239 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:242 */
	const char* GetName(const CSeqSynthAnimDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nLocalBaseReference; /* 36 2 */
	int16 m_nLocalBoneMask; /* 38 2 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 40 32 */
	/* ../public/animationsystem/sequenceresource.h:256 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* , const CSeqSynthAnimDesc& );
	CSeqSynthAnimDesc& operator=(CSeqSynthAnimDesc* , const CSeqSynthAnimDesc& );
	void ~CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
};

// <0090CCDD> ../public/animationsystem/sequenceresource.h:234
// member functions: 18
// member variables: 6
// static member variable: 1
// struct size: 72
struct CSeqSynthAnimDesc {
	/* ../public/animationsystem/sequenceresource.h:237 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	CSeqSynthAnimDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_CompileTimeVerificationFunction(CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	CSeqSynthAnimDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave_CSeqSynthAnimDesc(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad_CSeqSynthAnimDesc(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:239 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:242 */
	const char* GetName(const CSeqSynthAnimDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nLocalBaseReference; /* 36 2 */
	int16 m_nLocalBoneMask; /* 38 2 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 40 32 */
	/* ../public/animationsystem/sequenceresource.h:256 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* , const CSeqSynthAnimDesc& );
	void ~CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
	CSeqSynthAnimDesc& operator=(CSeqSynthAnimDesc* , const CSeqSynthAnimDesc& );
};

// <00B512FC> ../public/animationsystem/sequenceresource.h:234
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 72
struct CSeqSynthAnimDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	CSeqSynthAnimDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	void Schema_CompileTimeVerificationFunction(CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:236 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqSynthAnimDesc* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	CSeqSynthAnimDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferSave_CSeqSynthAnimDesc(const CSeqSynthAnimDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:237 */
	void KV3TransferLoad_CSeqSynthAnimDesc(CSeqSynthAnimDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:239 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:242 */
	const char* GetName(const CSeqSynthAnimDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nLocalBaseReference; /* 36 2 */
	int16 m_nLocalBoneMask; /* 38 2 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 40 32 */
	/* ../public/animationsystem/sequenceresource.h:256 */
	void CSeqSynthAnimDesc(CSeqSynthAnimDesc* , const CSeqSynthAnimDesc& );
	void ~CSeqSynthAnimDesc(CSeqSynthAnimDesc* );
};

// <00A494EC> ../public/animationsystem/sequenceresource.h:236
inline void CSeqSynthAnimDesc::Schema_DynamicBinding()
{
} /* size: 0 */

// <009C4F1E> ../public/animationsystem/sequenceresource.h:239
void CSeqSynthAnimDesc::CSeqSynthAnimDesc()
{
} /* size: 0 */

// <009C4F05> ../public/animationsystem/sequenceresource.h:239
inline void CSeqSynthAnimDesc::CSeqSynthAnimDesc()
{
} /* size: 0 */

// <009C13F4> ../public/animationsystem/sequenceresource.h:289
void CSeqCmdLayer::CSeqCmdLayer()
{
} /* size: 0 */

// <009C13D7> ../public/animationsystem/sequenceresource.h:289
inline void CSeqCmdLayer::CSeqCmdLayer()
{
} /* size: 0 */

// <002162C2> ../public/animationsystem/sequenceresource.h:289
// member functions: 14
// member variables: 9
// static member variable: 1
// struct size: 24
struct CSeqCmdLayer {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	CSeqCmdLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	CSeqCmdLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad(CSeqCmdLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave_CSeqCmdLayer(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad_CSeqCmdLayer(CSeqCmdLayer* , CKV3TransferLoadContext* );
	int16 m_cmd; /* 0 2 */
	int16 m_nLocalReference; /* 2 2 */
	int16 m_nLocalBonemask; /* 4 2 */
	int16 m_nDstResult; /* 6 2 */
	int16 m_nSrcResult; /* 8 2 */
	bool m_bSpline; /* 10 1 */
	float m_flVar1; /* 12 4 */
	float m_flVar2; /* 16 4 */
	int16 m_nLineNumber; /* 20 2 */
	void CSeqCmdLayer(CSeqCmdLayer* );
};

// <0090D006> ../public/animationsystem/sequenceresource.h:289
// member functions: 14
// member variables: 9
// static member variable: 1
// struct size: 24
struct CSeqCmdLayer {
	/* ../public/animationsystem/sequenceresource.h:292 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	CSeqCmdLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	CSeqCmdLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad(CSeqCmdLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave_CSeqCmdLayer(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad_CSeqCmdLayer(CSeqCmdLayer* , CKV3TransferLoadContext* );
	int16 m_cmd; /* 0 2 */
	int16 m_nLocalReference; /* 2 2 */
	int16 m_nLocalBonemask; /* 4 2 */
	int16 m_nDstResult; /* 6 2 */
	int16 m_nSrcResult; /* 8 2 */
	bool m_bSpline; /* 10 1 */
	float m_flVar1; /* 12 4 */
	float m_flVar2; /* 16 4 */
	int16 m_nLineNumber; /* 20 2 */
	void CSeqCmdLayer(CSeqCmdLayer* );
};

// <00B515E9> ../public/animationsystem/sequenceresource.h:289
// member functions: 13
// member variables: 9
// static member variable: 1
// struct size: 24
struct CSeqCmdLayer {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	CSeqCmdLayer* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:291 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdLayer* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	CSeqCmdLayer* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad(CSeqCmdLayer* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferSave_CSeqCmdLayer(const CSeqCmdLayer* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:292 */
	void KV3TransferLoad_CSeqCmdLayer(CSeqCmdLayer* , CKV3TransferLoadContext* );
	int16 m_cmd; /* 0 2 */
	int16 m_nLocalReference; /* 2 2 */
	int16 m_nLocalBonemask; /* 4 2 */
	int16 m_nDstResult; /* 6 2 */
	int16 m_nSrcResult; /* 8 2 */
	bool m_bSpline; /* 10 1 */
	float m_flVar1; /* 12 4 */
	float m_flVar2; /* 16 4 */
	int16 m_nLineNumber; /* 20 2 */
};

// <00A494C7> ../public/animationsystem/sequenceresource.h:291
inline void CSeqCmdLayer::Schema_DynamicBinding()
{
} /* size: 0 */

// <00C34DC0> ../public/animationsystem/sequenceresource.h:325
void CSeqPoseSetting::~CSeqPoseSetting()
{
} /* size: 0 */

// <00C34DA3> ../public/animationsystem/sequenceresource.h:325
inline void CSeqPoseSetting::~CSeqPoseSetting()
{
} /* size: 0 */

// <009BEBAC> ../public/animationsystem/sequenceresource.h:325
inline void CSeqPoseSetting::operator=(const CSeqPoseSetting &)
{
} /* size: 0 */

// <0021650E> ../public/animationsystem/sequenceresource.h:325
// member functions: 17
// member variables: 8
// static member variable: 1
// struct size: 64
struct CSeqPoseSetting {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	CSeqPoseSetting* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	CSeqPoseSetting* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave_CSeqPoseSetting(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad_CSeqPoseSetting(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:330 */
	void CSeqPoseSetting(CSeqPoseSetting* );
	AnimString_t m_sPoseParameter; /* 0 16 */
	AnimString_t m_sAttachment; /* 16 16 */
	AnimString_t m_sReferenceSequence; /* 32 16 */
	float32 m_flValue; /* 48 4 */
	bool m_bX; /* 52 1 */
	bool m_bY; /* 53 1 */
	bool m_bZ; /* 54 1 */
	int32 m_eType; /* 56 4 */
	/* ../public/animationsystem/sequenceresource.h:345 */
	void CSeqPoseSetting(CSeqPoseSetting* , const CSeqPoseSetting& );
	CSeqPoseSetting& operator=(CSeqPoseSetting* , const CSeqPoseSetting& );
	void ~CSeqPoseSetting(CSeqPoseSetting* );
};

// <0090D29B> ../public/animationsystem/sequenceresource.h:325
// member functions: 17
// member variables: 8
// static member variable: 1
// struct size: 64
struct CSeqPoseSetting {
	/* ../public/animationsystem/sequenceresource.h:328 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	CSeqPoseSetting* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	CSeqPoseSetting* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave_CSeqPoseSetting(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad_CSeqPoseSetting(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:330 */
	void CSeqPoseSetting(CSeqPoseSetting* );
	AnimString_t m_sPoseParameter; /* 0 16 */
	AnimString_t m_sAttachment; /* 16 16 */
	AnimString_t m_sReferenceSequence; /* 32 16 */
	float32 m_flValue; /* 48 4 */
	bool m_bX; /* 52 1 */
	bool m_bY; /* 53 1 */
	bool m_bZ; /* 54 1 */
	int32 m_eType; /* 56 4 */
	/* ../public/animationsystem/sequenceresource.h:345 */
	void CSeqPoseSetting(CSeqPoseSetting* , const CSeqPoseSetting& );
	void ~CSeqPoseSetting(CSeqPoseSetting* );
	CSeqPoseSetting& operator=(CSeqPoseSetting* , const CSeqPoseSetting& );
};

// <00B51845> ../public/animationsystem/sequenceresource.h:325
// member functions: 16
// member variables: 8
// static member variable: 1
// struct size: 64
struct CSeqPoseSetting {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	CSeqPoseSetting* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:327 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseSetting* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	CSeqPoseSetting* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferSave_CSeqPoseSetting(const CSeqPoseSetting* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:328 */
	void KV3TransferLoad_CSeqPoseSetting(CSeqPoseSetting* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:330 */
	void CSeqPoseSetting(CSeqPoseSetting* );
	AnimString_t m_sPoseParameter; /* 0 16 */
	AnimString_t m_sAttachment; /* 16 16 */
	AnimString_t m_sReferenceSequence; /* 32 16 */
	float32 m_flValue; /* 48 4 */
	bool m_bX; /* 52 1 */
	bool m_bY; /* 53 1 */
	bool m_bZ; /* 54 1 */
	int32 m_eType; /* 56 4 */
	/* ../public/animationsystem/sequenceresource.h:345 */
	void CSeqPoseSetting(CSeqPoseSetting* , const CSeqPoseSetting& );
	void ~CSeqPoseSetting(CSeqPoseSetting* );
};

// <00A494A2> ../public/animationsystem/sequenceresource.h:327
inline void CSeqPoseSetting::Schema_DynamicBinding()
{
} /* size: 0 */

// <009BEB95> ../public/animationsystem/sequenceresource.h:330
void CSeqPoseSetting::CSeqPoseSetting()
{
} /* size: 0 */

// <009BEB7C> ../public/animationsystem/sequenceresource.h:330
inline void CSeqPoseSetting::CSeqPoseSetting()
{
} /* size: 0 */

// <00C301D6> ../public/animationsystem/sequenceresource.h:350
void CSeqCmdSeqDesc::~CSeqCmdSeqDesc()
{
} /* size: 0 */

// <00C301B9> ../public/animationsystem/sequenceresource.h:350
inline void CSeqCmdSeqDesc::~CSeqCmdSeqDesc()
{
} /* size: 0 */

// <00A693C4> ../public/animationsystem/sequenceresource.h:350
// function calls: 99
void CSeqCmdSeqDesc::operator=(const CSeqCmdSeqDesc &)
{
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Count(); // 573
	CUtlMemory<CSeqCmdLayer, int>::Base(); // 112
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Base(); // 102
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::begin(); // 574
	CUtlMemory<CSeqCmdLayer, int>::Base(); // 113
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Base(); // 105
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Count(); // 105
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<CSeqCmdLayer>(const CSeqCmdLayer* pFrom,
					const CSeqCmdLayer* pFromEnd,
					CSeqCmdLayer* pTo);  // 574
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& other);  // 565
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& other);  // 452
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& src);  // 350
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Count(); // 573
	CUtlMemory<CAnimAnimEvent, int>::Base(); // 112
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Base(); // 102
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::begin(); // 574
	CUtlMemory<CAnimAnimEvent, int>::Base(); // 113
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Base(); // 105
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Count(); // 105
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 116
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 116
	CAnimAnimEvent::operator=(
			const CAnimAnimEvent  &);  // 209
	UtlTraitsCopyRange<CAnimAnimEvent>(const CAnimAnimEvent* pFrom,
						const CAnimAnimEvent* pFromEnd,
						CAnimAnimEvent* pTo);  // 200
	UtlTraitsCopyRange<CAnimAnimEvent>(const CAnimAnimEvent* pFrom,
						const CAnimAnimEvent* pFromEnd,
						CAnimAnimEvent* pTo);  // 574
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& other);  // 565
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& other);  // 452
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& src);  // 350
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 573
	CUtlMemory<CAnimActivity, int>::Base(); // 112
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 102
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::begin(); // 574
	CUtlMemory<CAnimActivity, int>::Base(); // 113
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 402
	CAnimActivity::operator=(
			const CAnimActivity  &);  // 209
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 200
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 574
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 565
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 452
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >& src);  // 350
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Count(); // 573
	CUtlMemory<CSeqPoseSetting, int>::Base(); // 112
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Base(); // 102
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::begin(); // 574
	CUtlMemory<CSeqPoseSetting, int>::Base(); // 113
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Base(); // 105
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Count(); // 105
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CSeqPoseSetting::operator=(
			const CSeqPoseSetting  &);  // 209
	UtlTraitsCopyRange<CSeqPoseSetting>(const CSeqPoseSetting* pFrom,
						const CSeqPoseSetting* pFromEnd,
						CSeqPoseSetting* pTo);  // 200
	UtlTraitsCopyRange<CSeqPoseSetting>(const CSeqPoseSetting* pFrom,
						const CSeqPoseSetting* pFromEnd,
						CSeqPoseSetting* pTo);  // 574
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& other);  // 565
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& other);  // 452
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& src);  // 350
} /* size: 1067, inline expansions: 99 (6431 bytes) */

// <009BC4E8> ../public/animationsystem/sequenceresource.h:350
inline void CSeqCmdSeqDesc::operator=(const CSeqCmdSeqDesc &)
{
} /* size: 0 */

// <009BB88C> ../public/animationsystem/sequenceresource.h:350
// variables: 3
// function calls: 59
void CSeqCmdSeqDesc::~CSeqCmdSeqDesc()
{
	{
		int i; // 1721
		CUtlMemory<CSeqPoseSetting, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 325
		CBufferString::~CBufferString(); // 325
		CBufferString::~CBufferString(); // 325
		CSeqPoseSetting::~CSeqPoseSetting(); // 1526
		Destruct<CSeqPoseSetting>(CSeqPoseSetting* pMemory); // 1723
	}
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqPoseSetting, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqPoseSetting, int>::Purge(); // 903
	CUtlMemory<CSeqPoseSetting, int>::Purge(); // 1799
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Purge(); // 560
	ValidateAlignment<CSeqPoseSetting>(void); // 508
	CUtlMemory<CSeqPoseSetting, int>::Purge(); // 510
	CUtlMemory<CSeqPoseSetting, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::~CUtlVector(); // 350
	{
		int i; // 1721
		CUtlMemory<CAnimActivity, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 402
		CAnimActivity::~CAnimActivity(); // 1526
		Destruct<CAnimActivity>(CAnimActivity* pMemory); // 1723
	}
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimActivity, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimActivity, int>::Purge(); // 903
	CUtlMemory<CAnimActivity, int>::Purge(); // 1799
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Purge(); // 560
	ValidateAlignment<CAnimActivity>(void); // 508
	CUtlMemory<CAnimActivity, int>::Purge(); // 510
	CUtlMemory<CAnimActivity, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVector(); // 350
	{
		int i; // 1721
		CUtlMemory<CAnimAnimEvent, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 116
		CBufferString::~CBufferString(); // 116
		CAnimAnimEvent::~CAnimAnimEvent(); // 1526
		Destruct<CAnimAnimEvent>(CAnimAnimEvent* pMemory); // 1723
	}
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimAnimEvent, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimAnimEvent, int>::Purge(); // 903
	CUtlMemory<CAnimAnimEvent, int>::Purge(); // 1799
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Purge(); // 560
	ValidateAlignment<CAnimAnimEvent>(void); // 508
	CUtlMemory<CAnimAnimEvent, int>::Purge(); // 510
	CUtlMemory<CAnimAnimEvent, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::~CUtlVector(); // 350
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqCmdLayer, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqCmdLayer, int>::Purge(); // 903
	CUtlMemory<CSeqCmdLayer, int>::Purge(); // 1799
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Purge(); // 560
	ValidateAlignment<CSeqCmdLayer>(void); // 508
	CUtlMemory<CSeqCmdLayer, int>::Purge(); // 510
	CUtlMemory<CSeqCmdLayer, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::~CUtlVector(); // 350
	CBufferString::~CBufferString(); // 350
} /* size: 418, inline expansions: 41 (1610 bytes) */

// <003534BA> ../public/animationsystem/sequenceresource.h:350
// function calls: 110
void CSeqCmdSeqDesc::operator=(const CSeqCmdSeqDesc &)
{
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 350
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Count(); // 573
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::RemoveMultipleFromTail(
				int num);  // 1323
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::AddMultipleToTail(
				int num);  // 1319
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::SetCount(
		int count);  // 573
	CUtlMemory<CSeqCmdLayer, int>::Base(); // 112
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Base(); // 102
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::begin(); // 574
	CUtlMemory<CSeqCmdLayer, int>::Base(); // 113
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Base(); // 105
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::Count(); // 105
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<CSeqCmdLayer>(const CSeqCmdLayer* pFrom,
					const CSeqCmdLayer* pFromEnd,
					CSeqCmdLayer* pTo);  // 574
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& other);  // 565
	CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVectorBase<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& other);  // 452
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >::operator=(
			const CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> >& src);  // 350
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Count(); // 573
	CUtlMemory<CAnimAnimEvent, int>::Base(); // 112
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Base(); // 102
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::begin(); // 574
	CUtlMemory<CAnimAnimEvent, int>::Base(); // 113
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Base(); // 105
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::Count(); // 105
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 116
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 116
	CAnimAnimEvent::operator=(
			const CAnimAnimEvent  &);  // 209
	UtlTraitsCopyRange<CAnimAnimEvent>(const CAnimAnimEvent* pFrom,
						const CAnimAnimEvent* pFromEnd,
						CAnimAnimEvent* pTo);  // 200
	UtlTraitsCopyRange<CAnimAnimEvent>(const CAnimAnimEvent* pFrom,
						const CAnimAnimEvent* pFromEnd,
						CAnimAnimEvent* pTo);  // 574
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& other);  // 565
	CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVectorBase<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& other);  // 452
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >::operator=(
			const CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> >& src);  // 350
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 573
	CUtlMemory<CAnimActivity, int>::Base(); // 112
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 102
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::begin(); // 574
	CUtlMemory<CAnimActivity, int>::Base(); // 113
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Base(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Count(); // 105
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 402
	CAnimActivity::operator=(
			const CAnimActivity  &);  // 209
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 200
	UtlTraitsCopyRange<CAnimActivity>(const CAnimActivity* pFrom,
						const CAnimActivity* pFromEnd,
						CAnimActivity* pTo);  // 574
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 565
	CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >& other);  // 452
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::operator=(
			const CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >& src);  // 350
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Count(); // 573
	CUtlMemory<CSeqPoseSetting, int>::Base(); // 112
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Base(); // 102
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::begin(); // 574
	CUtlMemory<CSeqPoseSetting, int>::Base(); // 113
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Base(); // 105
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::Count(); // 105
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 325
	CSeqPoseSetting::operator=(
			const CSeqPoseSetting  &);  // 209
	UtlTraitsCopyRange<CSeqPoseSetting>(const CSeqPoseSetting* pFrom,
						const CSeqPoseSetting* pFromEnd,
						CSeqPoseSetting* pTo);  // 200
	UtlTraitsCopyRange<CSeqPoseSetting>(const CSeqPoseSetting* pFrom,
						const CSeqPoseSetting* pFromEnd,
						CSeqPoseSetting* pTo);  // 574
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& other);  // 565
	CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVectorBase<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& other);  // 452
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >::operator=(
			const CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> >& src);  // 350
} /* size: 1179, inline expansions: 110 (6815 bytes) */

// <002167BA> ../public/animationsystem/sequenceresource.h:350
// member functions: 18
// member variables: 12
// static member variable: 1
// struct size: 176
struct CSeqCmdSeqDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	CSeqCmdSeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	CSeqCmdSeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave_CSeqCmdSeqDesc(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad_CSeqCmdSeqDesc(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:355 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:358 */
	const char* GetName(const CSeqCmdSeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nFrameRangeSequence; /* 36 2 */
	int16 m_nFrameCount; /* 38 2 */
	float32 m_flFPS; /* 40 4 */
	int16 m_nSubCycles; /* 44 2 */
	int16 m_numLocalResults; /* 46 2 */
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> > m_cmdLayerArray; /* 48 32 */
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> > m_eventArray; /* 80 32 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 112 32 */
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> > m_poseSettingArray; /* 144 32 */
	/* ../public/animationsystem/sequenceresource.h:381 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* , const CSeqCmdSeqDesc& );
	CSeqCmdSeqDesc& operator=(CSeqCmdSeqDesc* , const CSeqCmdSeqDesc& );
	void ~CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
};

// <0090D562> ../public/animationsystem/sequenceresource.h:350
// member functions: 18
// member variables: 12
// static member variable: 1
// struct size: 176
struct CSeqCmdSeqDesc {
	/* ../public/animationsystem/sequenceresource.h:353 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	CSeqCmdSeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	CSeqCmdSeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave_CSeqCmdSeqDesc(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad_CSeqCmdSeqDesc(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:355 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:358 */
	const char* GetName(const CSeqCmdSeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nFrameRangeSequence; /* 36 2 */
	int16 m_nFrameCount; /* 38 2 */
	float32 m_flFPS; /* 40 4 */
	int16 m_nSubCycles; /* 44 2 */
	int16 m_numLocalResults; /* 46 2 */
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> > m_cmdLayerArray; /* 48 32 */
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> > m_eventArray; /* 80 32 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 112 32 */
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> > m_poseSettingArray; /* 144 32 */
	/* ../public/animationsystem/sequenceresource.h:381 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* , const CSeqCmdSeqDesc& );
	void ~CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
	CSeqCmdSeqDesc& operator=(CSeqCmdSeqDesc* , const CSeqCmdSeqDesc& );
};

// <00B51ACC> ../public/animationsystem/sequenceresource.h:350
// member functions: 17
// member variables: 12
// static member variable: 1
// struct size: 176
struct CSeqCmdSeqDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	CSeqCmdSeqDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	void Schema_CompileTimeVerificationFunction(CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:352 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqCmdSeqDesc* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	CSeqCmdSeqDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferSave_CSeqCmdSeqDesc(const CSeqCmdSeqDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:353 */
	void KV3TransferLoad_CSeqCmdSeqDesc(CSeqCmdSeqDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:355 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:358 */
	const char* GetName(const CSeqCmdSeqDesc* );
	CSeqSeqDescFlag m_flags; /* 16 11 */
	CSeqTransition m_transition; /* 28 8 */
	int16 m_nFrameRangeSequence; /* 36 2 */
	int16 m_nFrameCount; /* 38 2 */
	float32 m_flFPS; /* 40 4 */
	int16 m_nSubCycles; /* 44 2 */
	int16 m_numLocalResults; /* 46 2 */
	CUtlVector<CSeqCmdLayer, CUtlMemory<CSeqCmdLayer, int> > m_cmdLayerArray; /* 48 32 */
	CUtlVector<CAnimAnimEvent, CUtlMemory<CAnimAnimEvent, int> > m_eventArray; /* 80 32 */
	CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> > m_activityArray; /* 112 32 */
	CUtlVector<CSeqPoseSetting, CUtlMemory<CSeqPoseSetting, int> > m_poseSettingArray; /* 144 32 */
	/* ../public/animationsystem/sequenceresource.h:381 */
	void CSeqCmdSeqDesc(CSeqCmdSeqDesc* , const CSeqCmdSeqDesc& );
	void ~CSeqCmdSeqDesc(CSeqCmdSeqDesc* );
};

// <00A4947D> ../public/animationsystem/sequenceresource.h:352
inline void CSeqCmdSeqDesc::Schema_DynamicBinding()
{
} /* size: 0 */

// <009BC469> ../public/animationsystem/sequenceresource.h:355
void CSeqCmdSeqDesc::CSeqCmdSeqDesc()
{
} /* size: 0 */

// <009BC450> ../public/animationsystem/sequenceresource.h:355
inline void CSeqCmdSeqDesc::CSeqCmdSeqDesc()
{
} /* size: 0 */

// <00D205D6> ../public/animationsystem/sequenceresource.h:358
inline void CSeqCmdSeqDesc::GetName()
{
} /* size: 0 */

// <00C2FFC3> ../public/animationsystem/sequenceresource.h:387
void CSeqPoseParamDesc::~CSeqPoseParamDesc()
{
} /* size: 0 */

// <00C2FFA6> ../public/animationsystem/sequenceresource.h:387
inline void CSeqPoseParamDesc::~CSeqPoseParamDesc()
{
} /* size: 0 */

// <009B5E5F> ../public/animationsystem/sequenceresource.h:387
inline void CSeqPoseParamDesc::operator=(const CSeqPoseParamDesc &)
{
} /* size: 0 */

// <009B5E48> ../public/animationsystem/sequenceresource.h:387
void CSeqPoseParamDesc::CSeqPoseParamDesc()
{
} /* size: 0 */

// <009B5E2B> ../public/animationsystem/sequenceresource.h:387
inline void CSeqPoseParamDesc::CSeqPoseParamDesc()
{
} /* size: 0 */

// <002198F1> ../public/animationsystem/sequenceresource.h:387
// member functions: 17
// member variables: 5
// static member variable: 1
// struct size: 32
struct CSeqPoseParamDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	CSeqPoseParamDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	CSeqPoseParamDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave_CSeqPoseParamDesc(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad_CSeqPoseParamDesc(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:393 */
	const char* GetName(const CSeqPoseParamDesc* );
	float32 m_flStart; /* 16 4 */
	float32 m_flEnd; /* 20 4 */
	float32 m_flLoop; /* 24 4 */
	bool m_bLooping; /* 28 1 */
	CSeqPoseParamDesc& operator=(CSeqPoseParamDesc* , const CSeqPoseParamDesc& );
	void ~CSeqPoseParamDesc(CSeqPoseParamDesc* );
	void CSeqPoseParamDesc(CSeqPoseParamDesc* );
};

// <009106B4> ../public/animationsystem/sequenceresource.h:387
// member functions: 17
// member variables: 5
// static member variable: 1
// struct size: 32
struct CSeqPoseParamDesc {
	/* ../public/animationsystem/sequenceresource.h:390 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	CSeqPoseParamDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	CSeqPoseParamDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave_CSeqPoseParamDesc(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad_CSeqPoseParamDesc(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:393 */
	const char* GetName(const CSeqPoseParamDesc* );
	float32 m_flStart; /* 16 4 */
	float32 m_flEnd; /* 20 4 */
	float32 m_flLoop; /* 24 4 */
	bool m_bLooping; /* 28 1 */
	void ~CSeqPoseParamDesc(CSeqPoseParamDesc* );
	void CSeqPoseParamDesc(CSeqPoseParamDesc* );
	CSeqPoseParamDesc& operator=(CSeqPoseParamDesc* , const CSeqPoseParamDesc& );
};

// <00B54BE3> ../public/animationsystem/sequenceresource.h:387
// member functions: 15
// member variables: 5
// static member variable: 1
// struct size: 32
struct CSeqPoseParamDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	CSeqPoseParamDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	void Schema_CompileTimeVerificationFunction(CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:389 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CSeqPoseParamDesc* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	CSeqPoseParamDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferSave_CSeqPoseParamDesc(const CSeqPoseParamDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:390 */
	void KV3TransferLoad_CSeqPoseParamDesc(CSeqPoseParamDesc* , CKV3TransferLoadContext* );
	AnimString_t m_sName; /* 0 16 */
	/* ../public/animationsystem/sequenceresource.h:393 */
	const char* GetName(const CSeqPoseParamDesc* );
	float32 m_flStart; /* 16 4 */
	float32 m_flEnd; /* 20 4 */
	float32 m_flLoop; /* 24 4 */
	bool m_bLooping; /* 28 1 */
	void ~CSeqPoseParamDesc(CSeqPoseParamDesc* );
};

// <00A49458> ../public/animationsystem/sequenceresource.h:389
inline void CSeqPoseParamDesc::Schema_DynamicBinding()
{
} /* size: 0 */

// <00D205BD> ../public/animationsystem/sequenceresource.h:393
inline void CSeqPoseParamDesc::GetName()
{
} /* size: 0 */

// <00C1EABE> ../public/animationsystem/sequenceresource.h:405
// variables: 5
// function calls: 121
void CSequenceGroupData::~CSequenceGroupData()
{
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqIKLock, int>::Purge(); // 903
	CUtlMemory<CSeqIKLock, int>::Purge(); // 1799
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Purge(); // 560
	ValidateAlignment<CSeqIKLock>(void); // 508
	CUtlMemory<CSeqIKLock, int>::Purge(); // 510
	CUtlMemory<CSeqIKLock, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqPoseParamDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 387
		CSeqPoseParamDesc::~CSeqPoseParamDesc(); // 1526
		Destruct<CSeqPoseParamDesc>(CSeqPoseParamDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqPoseParamDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 903
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqPoseParamDesc>(void); // 508
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 510
	CUtlMemory<CSeqPoseParamDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::~CUtlVector(); // 405
	CBufferString::~CBufferString(); // 405
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 405
	CUtlMemory<CSeqBoneMaskList, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 903
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 1799
	CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::Purge(); // 560
	ValidateAlignment<CSeqBoneMaskList>(void); // 508
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 510
	CUtlMemory<CSeqBoneMaskList, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::~CUtlVector(); // 405
	CUtlMemory<CSeqCmdSeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqCmdSeqDesc>(void); // 508
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqCmdSeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqSynthAnimDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::Element(
			int i);  // 1723
		{
			int i; // 1721
			CUtlMemory<CAnimActivity, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Element(
				int i);  // 1723
			CBufferString::~CBufferString(); // 402
			CAnimActivity::~CAnimActivity(); // 1526
			Destruct<CAnimActivity>(CAnimActivity* pMemory); // 1723
		}
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::RemoveAll(); // 1798
		CUtlMemory<CAnimActivity, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CAnimActivity, int>::Purge(); // 903
		CUtlMemory<CAnimActivity, int>::Purge(); // 1799
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Purge(); // 560
		ValidateAlignment<CAnimActivity>(void); // 508
		CUtlMemory<CAnimActivity, int>::Purge(); // 510
		CUtlMemory<CAnimActivity, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVector(); // 234
		CBufferString::~CBufferString(); // 234
		CSeqSynthAnimDesc::~CSeqSynthAnimDesc(); // 1526
		Destruct<CSeqSynthAnimDesc>(CSeqSynthAnimDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqSynthAnimDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 903
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqSynthAnimDesc>(void); // 508
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 510
	CUtlMemory<CSeqSynthAnimDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::~CUtlVector(); // 405
	CUtlMemory<CSeqS1SeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqS1SeqDesc>(void); // 508
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqS1SeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVector(); // 405
	CUtlMemory<CSeqS1SeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqS1SeqDesc>(void); // 508
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqS1SeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 405
	CBufferString::~CBufferString(); // 405
} /* size: 0, inline expansions: 88 (0 bytes) */

// <00C1EA58> ../public/animationsystem/sequenceresource.h:405
void CSequenceGroupData::~CSequenceGroupData()
{
} /* size: 36 */

// <00C1EA3B> ../public/animationsystem/sequenceresource.h:405
inline void CSequenceGroupData::~CSequenceGroupData()
{
} /* size: 0 */

// <009B42C5> ../public/animationsystem/sequenceresource.h:405
inline void CSequenceGroupData::operator=(const CSequenceGroupData &)
{
} /* size: 0 */

// <009B1FA2> ../public/animationsystem/sequenceresource.h:405
// variables: 10
// function calls: 174
void CSequenceGroupData::~CSequenceGroupData()
{
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqIKLock, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqIKLock, int>::Purge(); // 903
	CUtlMemory<CSeqIKLock, int>::Purge(); // 1799
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::Purge(); // 560
	ValidateAlignment<CSeqIKLock>(void); // 508
	CUtlMemory<CSeqIKLock, int>::Purge(); // 510
	CUtlMemory<CSeqIKLock, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqPoseParamDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 387
		CSeqPoseParamDesc::~CSeqPoseParamDesc(); // 1526
		Destruct<CSeqPoseParamDesc>(CSeqPoseParamDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqPoseParamDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 903
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqPoseParamDesc>(void); // 508
	CUtlMemory<CSeqPoseParamDesc, int>::Purge(); // 510
	CUtlMemory<CSeqPoseParamDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> >::~CUtlVector(); // 405
	CBufferString::~CBufferString(); // 405
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqBoneMaskList, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::Element(
			int i);  // 1723
		{
			int i; // 1721
			CUtlMemory<std::pair<CBufferString, float>, int>::operator[](
					int i);  // 602
			CUtlVectorBase<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> >::Element(
				int i);  // 1723
			CBufferString::~CBufferString(); // 302
			pair<CBufferString, float>::~pair(); // 1526
			Destruct<std::pair<CBufferString, float> >(pair<CBufferString, float>* pMemory); // 1723
		}
		CUtlVectorBase<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> >::RemoveAll(); // 1798
		CUtlMemory<std::pair<CBufferString, float>, int>::IsExternallyAllocated(); // 905
		CUtlMemory<std::pair<CBufferString, float>, int>::Purge(); // 903
		CUtlMemory<std::pair<CBufferString, float>, int>::Purge(); // 1799
		CUtlVectorBase<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> >::Purge(); // 560
		ValidateAlignment<std::pair<CBufferString, float> >(void); // 508
		CUtlMemory<std::pair<CBufferString, float>, int>::Purge(); // 510
		CUtlMemory<std::pair<CBufferString, float>, int>::~CUtlMemory(); // 562
		CUtlVectorBase<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> >::~CUtlVectorBase(); // 410
		CUtlVector<std::pair<CBufferString, float>, CUtlMemory<std::pair<CBufferString, float>, int> >::~CUtlVector(); // 84
		CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
		CUtlMemory<float, int>::IsExternallyAllocated(); // 905
		CUtlMemory<float, int>::Purge(); // 903
		CUtlMemory<float, int>::Purge(); // 1799
		CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
		ValidateAlignment<float>(void); // 508
		CUtlMemory<float, int>::Purge(); // 510
		CUtlMemory<float, int>::~CUtlMemory(); // 562
		CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
		CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 84
		CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
		CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<short int, int>::Purge(); // 903
		CUtlMemory<short int, int>::Purge(); // 1799
		CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
		ValidateAlignment<short int>(void); // 508
		CUtlMemory<short int, int>::Purge(); // 510
		CUtlMemory<short int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 84
		CBufferString::~CBufferString(); // 84
		CSeqBoneMaskList::~CSeqBoneMaskList(); // 1526
		Destruct<CSeqBoneMaskList>(CSeqBoneMaskList* pMemory); // 1723
	}
	CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqBoneMaskList, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 903
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 1799
	CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::Purge(); // 560
	ValidateAlignment<CSeqBoneMaskList>(void); // 508
	CUtlMemory<CSeqBoneMaskList, int>::Purge(); // 510
	CUtlMemory<CSeqBoneMaskList, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqCmdSeqDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::Element(
			int i);  // 1723
		Destruct<CSeqCmdSeqDesc>(CSeqCmdSeqDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqCmdSeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqCmdSeqDesc>(void); // 508
	CUtlMemory<CSeqCmdSeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqCmdSeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqSynthAnimDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::Element(
			int i);  // 1723
		{
			int i; // 1721
			CUtlMemory<CAnimActivity, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Element(
				int i);  // 1723
			CBufferString::~CBufferString(); // 402
			CAnimActivity::~CAnimActivity(); // 1526
			Destruct<CAnimActivity>(CAnimActivity* pMemory); // 1723
		}
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::RemoveAll(); // 1798
		CUtlMemory<CAnimActivity, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CAnimActivity, int>::Purge(); // 903
		CUtlMemory<CAnimActivity, int>::Purge(); // 1799
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::Purge(); // 560
		ValidateAlignment<CAnimActivity>(void); // 508
		CUtlMemory<CAnimActivity, int>::Purge(); // 510
		CUtlMemory<CAnimActivity, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CAnimActivity, CUtlMemory<CAnimActivity, int> >::~CUtlVector(); // 234
		CBufferString::~CBufferString(); // 234
		CSeqSynthAnimDesc::~CSeqSynthAnimDesc(); // 1526
		Destruct<CSeqSynthAnimDesc>(CSeqSynthAnimDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqSynthAnimDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 903
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqSynthAnimDesc>(void); // 508
	CUtlMemory<CSeqSynthAnimDesc, int>::Purge(); // 510
	CUtlMemory<CSeqSynthAnimDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqS1SeqDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Element(
			int i);  // 1723
		Destruct<CSeqS1SeqDesc>(CSeqS1SeqDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqS1SeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqS1SeqDesc>(void); // 508
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqS1SeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CSeqS1SeqDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Element(
			int i);  // 1723
		Destruct<CSeqS1SeqDesc>(CSeqS1SeqDesc* pMemory); // 1723
	}
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CSeqS1SeqDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 903
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 1799
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::Purge(); // 560
	ValidateAlignment<CSeqS1SeqDesc>(void); // 508
	CUtlMemory<CSeqS1SeqDesc, int>::Purge(); // 510
	CUtlMemory<CSeqS1SeqDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> >::~CUtlVector(); // 405
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 405
	CBufferString::~CBufferString(); // 405
} /* size: 1252, inline expansions: 92 (4838 bytes) */

// <008E37C9> ../public/animationsystem/sequenceresource.h:405
// member functions: 19
// member variables: 14
// static member variable: 1
// vtable entry: 1
// struct size: 360
struct CSequenceGroupData : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
	CSequenceGroupData& operator=(CSequenceGroupData* , const CSequenceGroupData& );
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:407 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	CSequenceGroupData* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1840 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1869 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1779 */
	void Schema_CompileTimeVerificationFunction(CSequenceGroupData* );
	/* ../public/animationsystem/sequenceresource.h:407 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CSequenceGroupData* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	CSequenceGroupData* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1877 */
	void KV3TransferSave(const CSequenceGroupData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1899 */
	void KV3TransferLoad(CSequenceGroupData* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1882 */
	void KV3TransferSave_CSequenceGroupData(const CSequenceGroupData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/sequenceresource_h_schema.gen_cpp:1904 */
	void KV3TransferLoad_CSequenceGroupData(CSequenceGroupData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:410 */
	void CSequenceGroupData(CSequenceGroupData* );
	AnimString_t m_sName; /* 16 16 */
	/* ../public/animationsystem/sequenceresource.h:413 */
	const char* GetName(const CSequenceGroupData* );
	uint32 m_nFlags; /* 32 4 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_localSequenceNameArray; /* 40 32 */
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> > m_localS1SeqDescArray; /* 72 32 */
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> > m_localMultiSeqDescArray; /* 104 32 */
	CUtlVector<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> > m_localSynthAnimDescArray; /* 136 32 */
	CUtlVector<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> > m_localCmdSeqDescArray; /* 168 32 */
	CUtlVector<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> > m_localBoneMaskArray; /* 200 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_localBoneNameArray; /* 232 32 */
	AnimString_t m_localNodeName; /* 264 16 */
	/* ../public/animationsystem/sequenceresource.h:434 */
	const char* GetLocalNodeName(const CSequenceGroupData* );
	CUtlVector<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> > m_localPoseParamArray; /* 280 32 */
	KeyValues3 m_keyValues; /* 312 16 */
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> > m_localIKAutoplayLockArray; /* 328 32 */
	/* ../public/animationsystem/sequenceresource.h:447 */
	void CSequenceGroupData(CSequenceGroupData* , const CSequenceGroupData& );
	virtual void ~CSequenceGroupData(CSequenceGroupData* );
};

// <00AF407A> ../public/animationsystem/sequenceresource.h:405
// member functions: 18
// member variables: 14
// static member variable: 1
// vtable entry: 1
// struct size: 360
struct CSequenceGroupData : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
	/* ../public/animationsystem/sequenceresource.h:408 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/sequenceresource.h:407 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	CSequenceGroupData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/sequenceresource.h:407 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	void Schema_CompileTimeVerificationFunction(CSequenceGroupData* );
	/* ../public/animationsystem/sequenceresource.h:407 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/sequenceresource.h:407 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CSequenceGroupData* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	CSequenceGroupData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	void KV3TransferSave(const CSequenceGroupData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	void KV3TransferLoad(CSequenceGroupData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	void KV3TransferSave_CSequenceGroupData(const CSequenceGroupData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/sequenceresource.h:408 */
	void KV3TransferLoad_CSequenceGroupData(CSequenceGroupData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/sequenceresource.h:410 */
	void CSequenceGroupData(CSequenceGroupData* );
	AnimString_t m_sName; /* 16 16 */
	/* ../public/animationsystem/sequenceresource.h:413 */
	const char* GetName(const CSequenceGroupData* );
	uint32 m_nFlags; /* 32 4 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_localSequenceNameArray; /* 40 32 */
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> > m_localS1SeqDescArray; /* 72 32 */
	CUtlVector<CSeqS1SeqDesc, CUtlMemory<CSeqS1SeqDesc, int> > m_localMultiSeqDescArray; /* 104 32 */
	CUtlVector<CSeqSynthAnimDesc, CUtlMemory<CSeqSynthAnimDesc, int> > m_localSynthAnimDescArray; /* 136 32 */
	CUtlVector<CSeqCmdSeqDesc, CUtlMemory<CSeqCmdSeqDesc, int> > m_localCmdSeqDescArray; /* 168 32 */
	CUtlVector<CSeqBoneMaskList, CUtlMemory<CSeqBoneMaskList, int> > m_localBoneMaskArray; /* 200 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_localBoneNameArray; /* 232 32 */
	AnimString_t m_localNodeName; /* 264 16 */
	/* ../public/animationsystem/sequenceresource.h:434 */
	const char* GetLocalNodeName(const CSequenceGroupData* );
	CUtlVector<CSeqPoseParamDesc, CUtlMemory<CSeqPoseParamDesc, int> > m_localPoseParamArray; /* 280 32 */
	KeyValues3 m_keyValues; /* 312 16 */
	CUtlVector<CSeqIKLock, CUtlMemory<CSeqIKLock, int> > m_localIKAutoplayLockArray; /* 328 32 */
	/* ../public/animationsystem/sequenceresource.h:447 */
	void CSequenceGroupData(CSequenceGroupData* , const CSequenceGroupData& );
	virtual void ~CSequenceGroupData(CSequenceGroupData* );
};

// <00D205B6> ../public/animationsystem/sequenceresource.h:407
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <00D205AF> ../public/animationsystem/sequenceresource.h:407
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <00D20542> ../public/animationsystem/sequenceresource.h:407
// function call: 1
void CSequenceGroupData::Schema_DynamicBinding()
{
	GetPrimaryBinding(void); // 407
} /* size: 0, inline expansions: 1 (0 bytes) */

// <00A4C601> ../public/animationsystem/sequenceresource.h:407
// function calls: 3
void CSequenceGroupData::Schema_DynamicBinding()
{
	GetPrimaryBinding(void); // 1869
	Schema_VerifyBindingIsRegistered(void); // 407
	GetPrimaryBinding(void); // 407
} /* size: 75, inline expansions: 3 (78 bytes) */

