
//
// scenesystem/scenesystem.cpp
//
//	referenced by: libengine2.so
//
//	functions: 280
//	class: 1
//	structs: 2
//

// <02F11A59> ../scenesystem/scenesystem.cpp:68
void* __CreateCSceneSystemISceneSystem_interface(void)
{
} /* size: 12 */

// <02F11A19> ../scenesystem/scenesystem.cpp:70
bool NametoLightCookieSequence_CompareFunc(const NameToLightCookieSequence_t& a, const NameToLightCookieSequence_t& b)
{
} /* size: 12 */

// <02F119E6> ../scenesystem/scenesystem.cpp:75
uint NametoLightCookieSequence_KeyFunc(const NameToLightCookieSequence_t& a)
{
} /* size: 7 */

// <02F0D571> ../scenesystem/scenesystem.cpp:114
// variables: 5
// function calls: 253
void CSceneSystem::CSceneSystem()
{
	{
		{
			int i; // 127
			{
				int j; // 129
			}
		}
		{
		}
	}
	{
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 83
		ThreadInterlockedExchange(volatile int32* p,
						int32 value);  // 641
		CInterlockedIntT<int, 4>::operator=(
				int newValue);  // 85
		CUtlMultiJobProcessor::CUtlMultiJobProcessor(); // 117
		CUtlMemory<ResourceManifestDesc_t::ValidateGrowSize(); // 475
		CUtlMemory<ResourceManifestDesc_t::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<ResourceManifestDesc_t::ResetDbgInfo(); // 530
		CUtlVectorBase<ResourceManifestDesc_t::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<ResourceManifestDesc_t::CUtlVector(); // 48
		IAppSystem::IAppSystem(); // 445
		ISceneSystem::ISceneSystem(); // 120
		CBaseAppSystem<ISceneSystem>::CBaseAppSystem(); // 171
		CTier0AppSystem<ISceneSystem, 0>::CTier0AppSystem(); // 225
		CTier1AppSystem<ISceneSystem, 0>::CTier1AppSystem(); // 48
		CTier2AppSystem<ISceneSystem, 0>::CTier2AppSystem(); // 18
		CTier3AppSystem<ISceneSystem, 0>::CTier3AppSystem(); // 117
		{
		}
		AlignedByteArrayExplicit_t<256, DisplayListToSubmit_t, 8>::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<256, DisplayListToSubmit_t>::AlignedByteArray_t(); // 228
		CUtlMemory<DisplayListToSubmit_t, int>::CUtlMemory(
				DisplayListToSubmit_t* pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<DisplayListToSubmit_t, int>::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<DisplayListToSubmit_t, int>::CUtlMemoryFixedGrowable_Base(
						DisplayListToSubmit_t* pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<256, DisplayListToSubmit_t, 8>::Base(); // 231
		CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int>::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::ResetDbgInfo(); // 530
		CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<DisplayListToSubmit_t, 256>::CUtlVectorFixedGrowable(
					int growSize);  // 117
		IMaxSwapChainDimensionsChangedListener::IMaxSwapChainDimensionsChangedListener(); // 117
		ICommandCallback::ICommandCallback(); // 556
		ICommandCompletionCallback::ICommandCompletionCallback(); // 556
		CConCommandMemberAccessor<CSceneSystem>::CConCommandMemberAccessor(
						CSceneSystem* pOwner,
						const char* pName,
						FnMemberCommandCallback_t callback,
						const char* pHelpString,
						ConVarFlags_t flags,
						FnMemberCommandCompletionCallback_t completionFunc);  // 949
		CConCommandMemberAccessor<CSceneSystem>::SetOwner(
			CSceneSystem* pOwner);  // 949
		CCommandMemberInitializer_OnPrintExtraDataAllocations::CCommandMemberInitializer_OnPrintExtraDataAllocations(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 117
		CUtlIntrusiveList<QueuedSceneObjectUpdateJob_t>::CUtlIntrusiveList(); // 117
		{
			CHash<true>::CHash(
				int ignored);  // 46
			CCompare<true>::CCompare(
				int ignored);  // 46
			SmallestPowerOfTwoGreaterOrEqual(uint32 x); // 110
		}
		CUtlHashDict<ISceneObjectDesc::CUtlHashDict(
				int bucketCount,
				int growCount,
				int initCount);  // 117
		CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::ValidateGrowSize(); // 475
		CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::ResetDbgInfo(); // 530
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::CUtlVector(); // 117
		CUtlIntrusiveList<CUtlUniqueObjectStore<CSceneSystemStencilState, 17, CThreadRWLock>::Node_t>::CUtlIntrusiveList(); // 1375
		CThreadMutex::CThreadMutex(
				const char* pName);  // 3024
		CThreadRWLock::CThreadRWLock(
				const char* pLockName);  // 1375
		CUtlUniqueObjectStore<CSceneSystemStencilState, 17, CThreadRWLock>::CUtlUniqueObjectStore(); // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CUtlMemory<CSceneView::CUtlMemory(
				CSceneView** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CSceneView::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CSceneView::CUtlMemoryFixedGrowable_Base(
						CSceneView** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		{
		}
		AlignedByteArrayExplicit_t<16, CSceneView::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CSceneView::AlignedByteArray_t(); // 228
		AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 231
		CUtlMemoryFixedGrowable<CSceneView::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CSceneView::ResetDbgInfo(); // 530
		CUtlVectorBase<CSceneView::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CSceneView::CUtlVectorFixedGrowable(
					int growSize);  // 750
		CViewList::CViewList(); // 117
		{
		}
		AlignedByteArrayExplicit_t<16, CSceneView::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CSceneView::AlignedByteArray_t(); // 228
		CUtlMemory<CSceneView::CUtlMemory(
				CSceneView** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CSceneView::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CSceneView::CUtlMemoryFixedGrowable_Base(
						CSceneView** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 231
		CUtlMemoryFixedGrowable<CSceneView::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CSceneView::ResetDbgInfo(); // 530
		CUtlVectorBase<CSceneView::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CSceneView::CUtlVectorFixedGrowable(
					int growSize);  // 750
		CViewList::CViewList(); // 117
		CTSListBase::CTSListBase(); // 337
		CTSPool<CSceneDrawList>::CTSPool(); // 117
		AlignedByteArrayExplicit_t<64, CSceneObject::Base(); // 231
		CUtlMemory<CSceneObject::CUtlMemory(
				CSceneObject** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CSceneObject::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CSceneObject::CUtlMemoryFixedGrowable_Base(
						CSceneObject** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		{
		}
		AlignedByteArrayExplicit_t<64, CSceneObject::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<64, CSceneObject::AlignedByteArray_t(); // 228
		CUtlMemoryFixedGrowable<CSceneObject::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 530
		CUtlVectorBase<CSceneObject::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CSceneObject::CUtlVectorFixedGrowable(
					int growSize);  // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CUtlMemory<ISceneWorld::CUtlMemory(
				ISceneWorld** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<ISceneWorld::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<ISceneWorld::CUtlMemoryFixedGrowable_Base(
						ISceneWorld** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		{
		}
		AlignedByteArrayExplicit_t<64, ISceneWorld::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<64, ISceneWorld::AlignedByteArray_t(); // 228
		AlignedByteArrayExplicit_t<64, ISceneWorld::Base(); // 231
		CUtlMemoryFixedGrowable<ISceneWorld::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 530
		CUtlVectorBase<ISceneWorld::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<ISceneWorld::CUtlVectorFixedGrowable(
					int growSize);  // 117
		CTSListBase::CTSListBase(); // 337
		CTSPool<CSceneObject>::CTSPool(); // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CUtlMemory<CUtlHashtableEntry<const IMaterial2::ValidateGrowSize(); // 475
		CUtlMemory<CUtlHashtableEntry<const IMaterial2::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 178
		CUtlHashtable<const IMaterial2::Init(); // 178
		CUtlHashtable<const IMaterial2::CUtlHashtable(
				int minimumSize);  // 117
		CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 110
		SceneSystemPerFrameStats_t::SceneSystemPerFrameStats_t(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 110
		SceneSystemPerFrameStats_t::SceneSystemPerFrameStats_t(); // 117
		{
		}
		AlignedByteArrayExplicit_t<32, ISceneWorld::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<32, ISceneWorld::AlignedByteArray_t(); // 228
		CUtlMemory<ISceneWorld::CUtlMemory(
				ISceneWorld** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<ISceneWorld::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<ISceneWorld::CUtlMemoryFixedGrowable_Base(
						ISceneWorld** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<32, ISceneWorld::Base(); // 231
		CUtlMemoryFixedGrowable<ISceneWorld::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 530
		CUtlVectorBase<ISceneWorld::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<ISceneWorld::CUtlVectorFixedGrowable(
					int growSize);  // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CSimpleStaticShapeDesc::CSimpleStaticShapeDesc(); // 117
		CStrongHandle<InfoForResourceTypeIMaterial2>::CStrongHandle(); // 117
		CUtlMemory<ISceneSystemListener::ValidateGrowSize(); // 475
		CUtlMemory<ISceneSystemListener::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<ISceneSystemListener::ResetDbgInfo(); // 530
		CUtlVectorBase<ISceneSystemListener::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<ISceneSystemListener::CUtlVector(); // 117
		CUtlMemory<CSceneObject::ValidateGrowSize(); // 475
		CUtlMemory<CSceneObject::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 530
		CUtlVectorBase<CSceneObject::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<CSceneObject::CUtlVector(); // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 3024
		CThreadRWLock::CThreadRWLock(
				const char* pLockName);  // 200
		CUtlSymbolTableMT::CUtlSymbolTableMT(
					int growSize,
					int initSize,
					bool caseInsensitive);  // 29
		CUtlMemory<CUtlDelegate<void(ISceneView::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 472
		CUtlMemory<CUtlDelegate<void(ISceneView::ValidateGrowSize()>, int>* this); // 475
		CUtlMemory<CUtlDelegate<void(ISceneView::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<CUtlDelegate<void(ISceneView::ResetDbgInfo()>, CUtlMemory<CUtlDelegate<void(ISceneView*, this); // 530
		CUtlVectorBase<CUtlDelegate<void(ISceneView::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 419
		CUtlVector<CUtlDelegate<void(ISceneView::CUtlVector(
				int growSize,
				int initCapacity);  // 30
		CUtlStringMap<CUtlDelegate<void(ISceneView::CUtlStringMap(
				bool caseInsensitive,
				int growSize,
				int initSize);  // 299
		CUtlStringMapMT<CUtlDelegate<void(ISceneView::CUtlStringMapMT(
				bool caseInsensitive,
				int growSize,
				int initSize);  // 117
		{
			int i; // 121
			CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 331
			CWeakHandle<InfoForResourceTypeCTextureBase>::operator=(
					const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 123
		}
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
		FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
		StaticInvalidHandle(void); // 127
		RenderTargetDesc_t::Clear(); // 116
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 115
		RenderTargetDesc_t::RenderTargetDesc_t(); // 53
		CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 53
		CMTAtlasDesc_t::CMTAtlasDesc_t(); // 117
		CUtlIntrusiveList<CMorphSet>::CUtlIntrusiveList(); // 117
		CUtlIntrusiveList<FlexDescSetupInfo_t>::CUtlIntrusiveList(); // 620
		CUtlIntrusiveList<FlexDescSetupInfo_t>::CUtlIntrusiveList(); // 620
		CInterlockedIntT<int, 4>::CInterlockedIntT(
				int value);  // 620
		CPreRenderSubmissionSetupList<FlexDescSetupInfo_t>::CPreRenderSubmissionSetupList(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(
				int value);  // 620
		CUtlIntrusiveList<BoneSetupInfo_t>::CUtlIntrusiveList(); // 620
		CUtlIntrusiveList<BoneSetupInfo_t>::CUtlIntrusiveList(); // 620
		CPreRenderSubmissionSetupList<BoneSetupInfo_t>::CPreRenderSubmissionSetupList(); // 117
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
		CWeakHandle<InfoForResourceTypeCTextureBase>::InitUntypedUnchecked(
					ResourceHandle_t hUntypedResource);  // 227
		FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
		StaticInvalidHandle(void); // 117
		CUtlMemory<CLightBinnerStandard::ValidateGrowSize(); // 475
		CUtlMemory<CLightBinnerStandard::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<CLightBinnerStandard::ResetDbgInfo(); // 530
		CUtlVectorBase<CLightBinnerStandard::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<CLightBinnerStandard::CUtlVector(); // 117
		CThreadFastMutex::CThreadFastMutex(
				const char* pLockName);  // 117
		CUtlIntrusiveList<CMorphCompositeSet>::CUtlIntrusiveList(); // 117
		CUtlIntrusiveList<MorphCompositeDesc_t>::CUtlIntrusiveList(); // 117
		CUtlMemory<ISceneWorld::ValidateGrowSize(); // 475
		CUtlMemory<ISceneWorld::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 530
		CUtlVectorBase<ISceneWorld::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<ISceneWorld::CUtlVector(); // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 3024
		CThreadRWLock::CThreadRWLock(
				const char* pLockName);  // 391
		{
			CHash<true>::CHash(
				int ignored);  // 46
			CCompare<true>::CCompare(
				int ignored);  // 46
			SmallestPowerOfTwoGreaterOrEqual(uint32 x); // 110
		}
		CUtlHashDict<unsigned char, true, true>::CUtlHashDict(
				int bucketCount,
				int growCount,
				int initCount);  // 391
		CUtlIntegerIDGenerator<unsigned char>::CUtlIntegerIDGenerator(); // 391
		CUtlIDDictionary<unsigned char, CUtlIntegerIDGenerator<unsigned char>, true>::CUtlIDDictionary(); // 453
		CUtlTSIntIDDictionary<unsigned char>::CUtlTSIntIDDictionary(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(); // 117
		CUtlMemory<std::function<void(CSceneObject::CUtlMemory(
				function<void(CSceneObject*)>** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<std::function<void(CSceneObject::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::CUtlMemoryFixedGrowable_Base(
						function<void(CSceneObject*)>** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		{
		}
		AlignedByteArrayExplicit_t<16, std::function<void(CSceneObject::AlignedByteArrayExplicit_t()>*, 8>* this); // 1597
		AlignedByteArray_t<16, std::function<void(CSceneObject::AlignedByteArray_t()>*>* this); // 228
		AlignedByteArrayExplicit_t<16, std::function<void(CSceneObject::Base()>*, 8>* this); // 231
		CUtlMemoryFixedGrowable<std::function<void(CSceneObject::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<std::function<void(CSceneObject::ResetDbgInfo()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 530
		CUtlVectorBase<std::function<void(CSceneObject::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<std::function<void(CSceneObject::CUtlVectorFixedGrowable(
					int growSize);  // 117
		ValidateAlignment<CRenderBatchList>(void); // 133
		CUtlMemoryPool<CRenderBatchList>::CUtlMemoryPool(
				int numElements,
				MemoryPoolGrowType_t growMode,
				const char* pszAllocOwner);  // 156
		CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::CClassMemoryPool(
				int numElements,
				MemoryPoolGrowType_t growMode);  // 116
		ValidateAlignment<CSceneLayer>(void); // 133
		CUtlMemoryPool<CSceneLayer>::CUtlMemoryPool(
				int numElements,
				MemoryPoolGrowType_t growMode,
				const char* pszAllocOwner);  // 156
		CClassMemoryPool<CSceneLayer, CUtlMemoryPool<CSceneLayer> >::CClassMemoryPool(
				int numElements,
				MemoryPoolGrowType_t growMode);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 117
		CKeyLess::CKeyLess(
			LessFunc_t lessFunc);  // 63
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::ValidateGrowSize()(char const* const&, char const* const&)>::Node_t this); // 475
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 484
		InvalidIndex(void); // 486
		InvalidIndex(void); // 488
		Iterator_t::Iterator_t(
				int i);  // 86
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::InvalidIterator()(char const* const&, char const* const&)>:: this); // 489
		CUtlRBTree<CUtlMap<char const::ResetDbgInfo()(char const* const&, char const* const&)>::Node_t, int, CUtlMap<c this); // 491
		CUtlRBTree<CUtlMap<char const::CUtlRBTree(
				int growSize,
				int initSize,
				const LessFunc_t& lessfunc);  // 63
		CUtlMap<char const::CUtlMap(
			int growSize,
			int initSize,
			LessFunc_t lessfunc);  // 130
		CUtlRBTree<CUtlMap<char const::SetLessFunc(
				const LessFunc_t& func);  // 201
		CKeyLess::CKeyLess(
			LessFunc_t lessFunc);  // 201
		CUtlMap<char const::SetLessFunc(
				LessFunc_t func);  // 150
		CUtlDict<int, int>::SetCompareType(
				EDictCompareType compareType);  // 142
		CUtlDict<int, int>::SetCompareType(
				EDictCompareType compareType);  // 132
		CUtlDict<int, int>::CUtlDict(
			int compareType,
			int growSize,
			int initSize);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 117
		CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::ValidateGrowSize(); // 475
		CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 178
		Init(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this); // 178
		CUtlHashtable(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this,
				int minimumSize);  // 117
		CStrongHandle<InfoForResourceTypeIMaterial2>::CStrongHandle(); // 117
		{
		}
		AlignedByteArrayExplicit_t<8, RenderDescriptorBinding_t, 8>::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<8, RenderDescriptorBinding_t>::AlignedByteArray_t(); // 228
		CUtlMemory<RenderDescriptorBinding_t, int>::CUtlMemory(
				RenderDescriptorBinding_t* pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<RenderDescriptorBinding_t, int>::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<RenderDescriptorBinding_t, int>::CUtlMemoryFixedGrowable_Base(
						RenderDescriptorBinding_t* pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<8, RenderDescriptorBinding_t, 8>::Base(); // 231
		CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int>::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::ResetDbgInfo(); // 530
		CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<RenderDescriptorBinding_t, 8>::CUtlVectorFixedGrowable(
					int growSize);  // 117
		CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::ValidateGrowSize(); // 475
		CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		ResetDbgInfo(const CUtlVectorBase<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> this); // 530
		CUtlVectorBase(const CUtlVectorBase<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>  this,
				int growSize,
				int initCapacity);  // 418
		CUtlVector<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> >::CUtlVector(); // 117
		CInterlockedIntT<int, 4>::CInterlockedIntT(
				int value);  // 117
		CThreadMutex::CThreadMutex(
				const char* pName);  // 117
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 175
		SceneSystemPerFrameStats_t::Zero(); // 125
		CUtlMultiJobProcessor::SetUseCachedWaitSet(
					bool bSet);  // 123
		{
			int i; // 127
			{
				int j; // 129
			}
		}
		memset(void* __dest,
			int __ch,
			size_t __len);  // 140
		memset(void* __dest,
			int __ch,
			size_t __len);  // 141
		{
		}
	}
} /* size: 0 */

// <02F0D518> ../scenesystem/scenesystem.cpp:114
// variables: 4
void CSceneSystem::CSceneSystem()
{
	const char   __FUNCTION__; // 63493
	{
		int i; // 127
		{
			int j; // 129
		}
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 145
	}
} /* size: 0, variables: 1 */

// <02F089DB> ../scenesystem/scenesystem.cpp:170
// variables: 4
// function calls: 378
void CSceneSystem::~CSceneSystem()
{
	CThreadMutex::~CThreadMutex(); // 172
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::RemoveAll(); // 1798
	CUtlMemory<RenderDescriptorBinding_t, int>::IsExternallyAllocated(); // 577
	CUtlMemory<RenderDescriptorBinding_t, int>::ConvertToExternalMemory(
				RenderDescriptorBinding_t* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<RenderDescriptorBinding_t, int>::Purge_FixedGrowable(
				RenderDescriptorBinding_t* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<RenderDescriptorBinding_t, int>::Purge_FixedGrowable(
				RenderDescriptorBinding_t* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, RenderDescriptorBinding_t, 8>::Base(); // 237
	CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int>::Purge(
		int numElements);  // 1799
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::Purge(); // 560
	CUtlMemory<RenderDescriptorBinding_t, int>::Purge(); // 903
	CUtlMemory<RenderDescriptorBinding_t, int>::Purge(); // 510
	ValidateAlignment<RenderDescriptorBinding_t>(void); // 508
	CUtlMemory<RenderDescriptorBinding_t, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<RenderDescriptorBinding_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemoryFixedGrowable<RenderDescriptorBinding_t, 8, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<RenderDescriptorBinding_t, 8>::~CUtlVectorFixedGrowable(); // 172
	CThreadMutex::~CThreadMutex(); // 172
	RemoveAll(const CUtlVectorBase<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> this); // 1798
	CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::Purge(); // 903
	CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> this); // 560
	ValidateAlignment<CSceneSystem::VertexCacheUpdateRequest_t>(void); // 508
	CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::Purge(); // 510
	CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> this); // 410
	CUtlVector<CSceneSystem::VertexCacheUpdateRequest_t, CUtlMemory<CSceneSystem::VertexCacheUpdateRequest_t, int> >::~CUtlVector(); // 172
	CStrongHandle<InfoForResourceTypeIMaterial2>::~CStrongHandle(); // 172
	ValidateAlignment<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this); // 172
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::operator[](
			int i);  // 611
	CUtlRBTree<CUtlMap<char const::LeftChild(
			int i);  // 1329
	CUtlRBTree<CUtlMap<char const::FirstInorder()(char const* const&, char const* const&)>::Node_t, int, CUt this); // 351
	CUtlMap<char const::FirstInorder()(char const* const&, char const* const&)>* this); // 308
	{
		const char* pKey; // 311
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::operator[](
				int i);  // 539
		CUtlRBTree<CUtlMap<char const::Element(
			int i);  // 94
		CUtlMap<char const::Key(
			IndexType_t i);  // 311
		CUtlMap<char const::NextInorder(
				IndexType_t i);  // 313
	}
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::IsExternallyAllocated()(char const* const&, char const* const&)>:: this); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t this); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t this); // 1287
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::InvalidIterator()(char const* const&, char const* const&)>:: this); // 1288
	CUtlRBTree<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t, int, CUtlMap<c this); // 347
	CUtlMap<char const::Purge()(char const* const&, char const* const&)>* this); // 316
	CUtlDict<int, int>::Purge(); // 138
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::IsExternallyAllocated()(char const* const&, char const* const&)>:: this); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t this); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t this); // 1287
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::InvalidIterator()(char const* const&, char const* const&)>:: this); // 1288
	CUtlRBTree<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t, int, CUtlMap<c this); // 509
	ValidateAlignment<UtlRBTreeNode_t<CUtlMap<char const*, int, int, bool (*)(char const* const&, char const* const&)>::Node_t, int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::Purge()(char const* const&, char const* const&)>::Node_t this); // 510
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<char const::~CUtlMemory()(char const* const&, char const* const&)>::Node_t this); // 510
	CUtlRBTree<CUtlMap<char const::~CUtlRBTree()(char const* const&, char const* const&)>::Node_t, int, CUtlMap<c this); // 47
	CUtlMap<char const::~CUtlMap()(char const* const&, char const* const&)>* this); // 139
	CUtlDict<int, int>::~CUtlDict(); // 172
	CThreadMutex::~CThreadMutex(); // 172
	CClassMemoryPool<CSceneLayer, CUtlMemoryPool<CSceneLayer> >::Clear(); // 162
	CUtlMemoryPool<CSceneLayer>::~CUtlMemoryPool(); // 163
	CClassMemoryPool<CSceneLayer, CUtlMemoryPool<CSceneLayer> >::~CClassMemoryPool(); // 172
	CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::Clear(); // 162
	CUtlMemoryPool<CRenderBatchList>::~CUtlMemoryPool(); // 163
	CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::~CClassMemoryPool(); // 172
	CUtlVectorBase<std::function<void(CSceneObject::RemoveAll()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 1798
	CUtlMemory<std::function<void(CSceneObject::IsExternallyAllocated()>*, int>* this); // 577
	CUtlMemory<std::function<void(CSceneObject::ConvertToExternalMemory(
				function<void(CSceneObject*)>** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::Purge_FixedGrowable(
				function<void(CSceneObject*)>** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::Purge_FixedGrowable(
				function<void(CSceneObject*)>** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, std::function<void(CSceneObject::Base()>*, 8>* this); // 237
	CUtlMemoryFixedGrowable<std::function<void(CSceneObject::Purge(
		int numElements);  // 1799
	CUtlVectorBase<std::function<void(CSceneObject::ResetDbgInfo()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 1800
	CUtlVectorBase<std::function<void(CSceneObject::Purge()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 560
	CUtlMemory<std::function<void(CSceneObject::Purge()>*, int>* this); // 903
	CUtlMemory<std::function<void(CSceneObject::Purge()>*, int>* this); // 510
	ValidateAlignment<std::function<void(CSceneObject*)>*>(void); // 508
	CUtlMemory<std::function<void(CSceneObject::~CUtlMemory()>*, int>* this); // 191
	CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::~CUtlMemoryFixedGrowable_Base()>*, int>* this); // 223
	CUtlMemoryFixedGrowable<std::function<void(CSceneObject::~CUtlMemoryFixedGrowable()>*, 16, int>* this); // 562
	CUtlVectorBase<std::function<void(CSceneObject::~CUtlVectorBase()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 478
	CUtlVectorFixedGrowable<std::function<void(CSceneObject::~CUtlVectorFixedGrowable()>*, 16>* this); // 172
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadMutex::~CThreadMutex(); // 2084
	CThreadRWLock::~CThreadRWLock(); // 391
	CUtlIDDictionary<unsigned char, CUtlIntegerIDGenerator<unsigned char>, true>::~CUtlIDDictionary(); // 453
	CUtlTSIntIDDictionary<unsigned char>::~CUtlTSIntIDDictionary(); // 172
	CUtlVectorBase<ISceneWorld::RemoveAll(); // 1798
	CUtlMemory<ISceneWorld::IsExternallyAllocated(); // 905
	CUtlMemory<ISceneWorld::Purge(); // 903
	CUtlMemory<ISceneWorld::Purge(); // 1799
	CUtlVectorBase<ISceneWorld::Purge(); // 560
	ValidateAlignment<ISceneWorld*>(void); // 508
	CUtlMemory<ISceneWorld::Purge(); // 510
	CUtlMemory<ISceneWorld::~CUtlMemory(); // 562
	CUtlVectorBase<ISceneWorld::~CUtlVectorBase(); // 410
	CUtlVector<ISceneWorld::~CUtlVector(); // 172
	CThreadMutex::~CThreadMutex(); // 172
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadMutex::~CThreadMutex(); // 2084
	CThreadRWLock::~CThreadRWLock(); // 193
	CUtlSymbolTableMT::~CUtlSymbolTableMT(); // 15
	CUtlVectorBase<CUtlDelegate<void(ISceneView::RemoveAll()>, CUtlMemory<CUtlDelegate<void(ISceneView*, this); // 1798
	CUtlMemory<CUtlDelegate<void(ISceneView::IsExternallyAllocated()>, int>* this); // 905
	CUtlMemory<CUtlDelegate<void(ISceneView::Purge()>, int>* this); // 903
	CUtlMemory<CUtlDelegate<void(ISceneView::Purge()>, int>* this); // 1799
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Purge()>, CUtlMemory<CUtlDelegate<void(ISceneView*, this); // 560
	ValidateAlignment<CUtlDelegate<void(ISceneView*, const CRenderAttributes*)> >(void); // 508
	CUtlMemory<CUtlDelegate<void(ISceneView::Purge()>, int>* this); // 510
	CUtlMemory<CUtlDelegate<void(ISceneView::~CUtlMemory()>, int>* this); // 562
	CUtlVectorBase<CUtlDelegate<void(ISceneView::~CUtlVectorBase()>, CUtlMemory<CUtlDelegate<void(ISceneView*, this); // 410
	CUtlVector<CUtlDelegate<void(ISceneView::~CUtlVector()>, CUtlMemory<CUtlDelegate<void(ISceneView*, con this); // 15
	CUtlStringMap<CUtlDelegate<void(ISceneView::~CUtlStringMap()>, CUtlSymbolTableMT>* this); // 293
	CUtlStringMapMT<CUtlDelegate<void(ISceneView::~CUtlStringMapMT()> >* this); // 172
	Count(const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMe this); // 226
	{
		int ndxBucket; // 227
		CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<C this,
				int i);  // 229
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::RemoveAll(); // 1798
		CUtlMemory<NameToLightCookieSequence_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<NameToLightCookieSequence_t, int>::Purge(); // 903
		CUtlMemory<NameToLightCookieSequence_t, int>::Purge(); // 1799
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::ResetDbgInfo(); // 1800
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::Purge(); // 229
	}
	CUtlHash<NameToLightCookieSequence_t, bool (::Purge()(const NameToLightCookieSequence_t&, const NameToLightCookieSequence_ this); // 134
	{
		int i; // 1721
		CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<C this,
			int i);  // 1723
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::RemoveAll(); // 1798
		CUtlMemory<NameToLightCookieSequence_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<NameToLightCookieSequence_t, int>::Purge(); // 903
		CUtlMemory<NameToLightCookieSequence_t, int>::Purge(); // 1799
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::Purge(); // 560
		ValidateAlignment<NameToLightCookieSequence_t>(void); // 508
		CUtlMemory<NameToLightCookieSequence_t, int>::Purge(); // 510
		CUtlMemory<NameToLightCookieSequence_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >::~CUtlVector(); // 1526
		Destruct<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> > >(CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<C this); // 1798
	CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::Purge(); // 903
	CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<C this); // 560
	ValidateAlignment<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> > >(void); // 508
	CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::Purge(); // 510
	CUtlMemory<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<C this); // 410
	~CUtlVector(const CUtlVector<CUtlVector<NameToLightCookieSequence_t, CUtlMemory<NameToLightCookieSequence_t, int> >, CUtlMemory<CUtlV this); // 135
	CUtlHash<NameToLightCookieSequence_t, bool (::~CUtlHash()(const NameToLightCookieSequence_t&, const NameToLightCookieSequence_ this); // 172
	CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 53
	CMTAtlasDesc_t::~CMTAtlasDesc_t(); // 172
	CUtlVectorBase<CLightBinnerStandard::RemoveAll(); // 1798
	CUtlMemory<CLightBinnerStandard::IsExternallyAllocated(); // 905
	CUtlMemory<CLightBinnerStandard::Purge(); // 903
	CUtlMemory<CLightBinnerStandard::Purge(); // 1799
	CUtlVectorBase<CLightBinnerStandard::Purge(); // 560
	ValidateAlignment<CLightBinnerStandard*>(void); // 508
	CUtlMemory<CLightBinnerStandard::Purge(); // 510
	CUtlMemory<CLightBinnerStandard::~CUtlMemory(); // 562
	CUtlVectorBase<CLightBinnerStandard::~CUtlVectorBase(); // 410
	CUtlVector<CLightBinnerStandard::~CUtlVector(); // 172
	CThreadMutex::~CThreadMutex(); // 172
	CUtlVectorBase<ISceneWorld::RemoveAll(); // 1798
	CUtlMemory<ISceneWorld::IsExternallyAllocated(); // 577
	CUtlMemory<ISceneWorld::ConvertToExternalMemory(
				ISceneWorld** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<ISceneWorld::Purge_FixedGrowable(
				ISceneWorld** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<ISceneWorld::Purge_FixedGrowable(
				ISceneWorld** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<32, ISceneWorld::Base(); // 237
	CUtlMemoryFixedGrowable<ISceneWorld::Purge(
		int numElements);  // 1799
	CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 1800
	CUtlVectorBase<ISceneWorld::Purge(); // 560
	CUtlMemory<ISceneWorld::Purge(); // 903
	CUtlMemory<ISceneWorld::Purge(); // 510
	ValidateAlignment<ISceneWorld*>(void); // 508
	CUtlMemory<ISceneWorld::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<ISceneWorld::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<ISceneWorld::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<ISceneWorld::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<ISceneWorld::~CUtlVectorFixedGrowable(); // 172
	CUtlVectorBase<CSceneObject::RemoveAll(); // 1798
	CUtlMemory<CSceneObject::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneObject::Purge(); // 903
	CUtlMemory<CSceneObject::Purge(); // 1799
	CUtlVectorBase<CSceneObject::Purge(); // 560
	ValidateAlignment<CSceneObject*>(void); // 508
	CUtlMemory<CSceneObject::Purge(); // 510
	CUtlMemory<CSceneObject::~CUtlMemory(); // 562
	CUtlVectorBase<CSceneObject::~CUtlVectorBase(); // 410
	CUtlVector<CSceneObject::~CUtlVector(); // 172
	CUtlVectorBase<ISceneSystemListener::RemoveAll(); // 1798
	CUtlMemory<ISceneSystemListener::IsExternallyAllocated(); // 905
	CUtlMemory<ISceneSystemListener::Purge(); // 903
	CUtlMemory<ISceneSystemListener::Purge(); // 1799
	CUtlVectorBase<ISceneSystemListener::Purge(); // 560
	ValidateAlignment<ISceneSystemListener*>(void); // 508
	CUtlMemory<ISceneSystemListener::Purge(); // 510
	CUtlMemory<ISceneSystemListener::~CUtlMemory(); // 562
	CUtlVectorBase<ISceneSystemListener::~CUtlVectorBase(); // 410
	CUtlVector<ISceneSystemListener::~CUtlVector(); // 172
	CStrongHandle<InfoForResourceTypeIMaterial2>::~CStrongHandle(); // 170
	CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 170
	ValidateAlignment<CUtlHashtableEntry<const IMaterial2*, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<const IMaterial2::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<const IMaterial2::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<const IMaterial2::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<const IMaterial2::~CUtlMemory(); // 188
	CUtlHashtable<const IMaterial2::~CUtlHashtable(); // 172
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 358
	CManagedHandle::~CManagedHandle(); // 1436
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 577
	CUtlMemory<unsigned int, int>::ConvertToExternalMemory(
				unsigned int* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<3, unsigned int, 4>::Base(); // 237
	CUtlMemoryFixedGrowable<unsigned int, 3, int>::Purge(
		int numElements);  // 1799
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::Purge(); // 560
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 510
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<unsigned int, 3, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<unsigned int, 3>::~CUtlVectorFixedGrowable(); // 1436
	IGenericInterface::~IGenericInterface(); // 1436
	CSceneObject::~CSceneObject(); // 341
	simpleTSPoolStruct_t::~simpleTSPoolStruct_t(); // 361
	CTSPool<CSceneObject>::Purge(); // 350
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 244
	ThreadPause(void); // 230
	CTSListBase::Detach(); // 135
	CTSListBase::~CTSListBase(); // 351
	CTSPool<CSceneObject>::~CTSPool(); // 172
	CUtlVectorBase<ISceneWorld::RemoveAll(); // 1798
	CUtlMemory<ISceneWorld::IsExternallyAllocated(); // 577
	CUtlMemory<ISceneWorld::ConvertToExternalMemory(
				ISceneWorld** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<ISceneWorld::Purge_FixedGrowable(
				ISceneWorld** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<ISceneWorld::Purge_FixedGrowable(
				ISceneWorld** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<64, ISceneWorld::Base(); // 237
	CUtlMemoryFixedGrowable<ISceneWorld::Purge(
		int numElements);  // 1799
	CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 1800
	CUtlVectorBase<ISceneWorld::Purge(); // 560
	ValidateAlignment<ISceneWorld*>(void); // 508
	CUtlMemory<ISceneWorld::Purge(); // 903
	CUtlMemory<ISceneWorld::Purge(); // 510
	CUtlMemory<ISceneWorld::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<ISceneWorld::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<ISceneWorld::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<ISceneWorld::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<ISceneWorld::~CUtlVectorFixedGrowable(); // 172
	CUtlMemory<CSceneObject::IsExternallyAllocated(); // 577
	CUtlMemory<CSceneObject::ConvertToExternalMemory(
				CSceneObject** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CSceneObject::Purge_FixedGrowable(
				CSceneObject** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CSceneObject::Purge_FixedGrowable(
				CSceneObject** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CSceneObject::Purge(
		int numElements);  // 1799
	CUtlMemory<CSceneObject::Base(); // 112
	CUtlVectorBase<CSceneObject::Base(); // 368
	CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 1800
	CUtlVectorBase<CSceneObject::RemoveAll(); // 1798
	CUtlVectorBase<CSceneObject::Purge(); // 560
	CUtlMemory<CSceneObject::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneObject::Purge(); // 903
	CUtlMemory<CSceneObject::Purge(); // 510
	ValidateAlignment<CSceneObject*>(void); // 508
	CUtlMemory<CSceneObject::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CSceneObject::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CSceneObject::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CSceneObject::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CSceneObject::~CUtlVectorFixedGrowable(); // 170
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 358
	CTSPool<CSceneDrawList>::Purge(); // 350
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 244
	ThreadPause(void); // 230
	CTSListBase::Detach(); // 135
	CTSListBase::~CTSListBase(); // 351
	CTSPool<CSceneDrawList>::~CTSPool(); // 172
	CUtlVectorBase<CSceneView::RemoveAll(); // 1798
	CUtlMemory<CSceneView::IsExternallyAllocated(); // 577
	CUtlMemory<CSceneView::ConvertToExternalMemory(
				CSceneView** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 237
	CUtlMemoryFixedGrowable<CSceneView::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CSceneView::ResetDbgInfo(); // 1800
	CUtlVectorBase<CSceneView::Purge(); // 560
	ValidateAlignment<CSceneView*>(void); // 508
	CUtlMemory<CSceneView::Purge(); // 903
	CUtlMemory<CSceneView::Purge(); // 510
	CUtlMemory<CSceneView::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CSceneView::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CSceneView::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CSceneView::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CSceneView::~CUtlVectorFixedGrowable(); // 750
	CViewList::~CViewList(); // 172
	CUtlVectorBase<CSceneView::RemoveAll(); // 1798
	CUtlMemory<CSceneView::IsExternallyAllocated(); // 577
	CUtlMemory<CSceneView::ConvertToExternalMemory(
				CSceneView** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 237
	CUtlMemoryFixedGrowable<CSceneView::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CSceneView::ResetDbgInfo(); // 1800
	CUtlVectorBase<CSceneView::Purge(); // 560
	ValidateAlignment<CSceneView*>(void); // 508
	CUtlMemory<CSceneView::Purge(); // 903
	CUtlMemory<CSceneView::Purge(); // 510
	CUtlMemory<CSceneView::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CSceneView::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CSceneView::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CSceneView::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CSceneView::~CUtlVectorFixedGrowable(); // 750
	CViewList::~CViewList(); // 172
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadEvent::~CThreadEvent(); // 2084
	CThreadMutex::~CThreadMutex(); // 2084
	CThreadRWLock::~CThreadRWLock(); // 1375
	CUtlUniqueObjectStore<CSceneSystemStencilState, 17, CThreadRWLock>::~CUtlUniqueObjectStore(); // 172
	{
		int i; // 1721
		CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 1294
		ScratchRenderTarget_t::~ScratchRenderTarget_t(); // 1526
		Destruct<CSceneSystem::ScratchRenderTarget_t>(ScratchRenderTarget_t* pMemory); // 1723
	}
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::RemoveAll(); // 1798
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::Purge(); // 903
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::Purge(); // 1799
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Purge(); // 560
	ValidateAlignment<CSceneSystem::ScratchRenderTarget_t>(void); // 508
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::Purge(); // 510
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::~CUtlVector(); // 172
	CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::RemoveAll(); // 1798
	CUtlMemory<DisplayListToSubmit_t, int>::IsExternallyAllocated(); // 577
	CUtlMemory<DisplayListToSubmit_t, int>::ConvertToExternalMemory(
				DisplayListToSubmit_t* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<DisplayListToSubmit_t, int>::Purge_FixedGrowable(
				DisplayListToSubmit_t* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<DisplayListToSubmit_t, int>::Purge_FixedGrowable(
				DisplayListToSubmit_t* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<256, DisplayListToSubmit_t, 8>::Base(); // 237
	CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int>::Purge(
		int numElements);  // 1799
	CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::Purge(); // 560
	ValidateAlignment<DisplayListToSubmit_t>(void); // 508
	CUtlMemory<DisplayListToSubmit_t, int>::Purge(); // 903
	CUtlMemory<DisplayListToSubmit_t, int>::Purge(); // 510
	CUtlMemory<DisplayListToSubmit_t, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<DisplayListToSubmit_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<DisplayListToSubmit_t, CUtlMemoryFixedGrowable<DisplayListToSubmit_t, 256, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<DisplayListToSubmit_t, 256>::~CUtlVectorFixedGrowable(); // 172
	CConCommandMemberAccessor<CSceneSystem>::~CConCommandMemberAccessor(); // 949
	CCommandMemberInitializer_OnPrintExtraDataAllocations::~CCommandMemberInitializer_OnPrintExtraDataAllocations(); // 172
	CUtlMultiJobProcessor::~CUtlMultiJobProcessor(); // 172
	CUtlMemory<ResourceManifestDesc_t::IsExternallyAllocated(); // 905
	CUtlMemory<ResourceManifestDesc_t::Purge(); // 903
	CUtlMemory<ResourceManifestDesc_t::Purge(); // 1799
	CUtlVectorBase<ResourceManifestDesc_t::RemoveAll(); // 1798
	CUtlVectorBase<ResourceManifestDesc_t::Purge(); // 560
	CUtlVectorBase<ResourceManifestDesc_t::~CUtlVectorBase(); // 410
	CUtlVector<ResourceManifestDesc_t::~CUtlVector(); // 42
	CTier2AppSystem<ISceneSystem, 0>::~CTier2AppSystem(); // 18
	CTier3AppSystem<ISceneSystem, 0>::~CTier3AppSystem(); // 172
} /* size: 3623, inline expansions: 348 (16011 bytes) */

// <02F08974> ../scenesystem/scenesystem.cpp:170
void CSceneSystem::~CSceneSystem()
{
} /* size: 36 */

// <02F0892D> ../scenesystem/scenesystem.cpp:186
void CSceneSystem::GetDependencies()
{
} /* size: 12 */

// <02F088F7> ../scenesystem/scenesystem.cpp:192
void CSceneSystem::ThreadIsInRenderingJob()
{
} /* size: 33 */

// <02F088DE> ../scenesystem/scenesystem.cpp:197
void CSceneSystem::GetTimeAtStartOfRendering()
{
} /* size: 0 */

// <02F306CA> ../scenesystem/scenesystem.cpp:202
// function call: 1
void ForceScenesystemSynchronizationFromResourceSystem(void* pContext)
{
	ForceScenesystemSynchronizationFromResourceSystem(void* pContext); // 202
} /* size: 50, inline expansions: 1 (30 bytes) */

// <02F088C3> ../scenesystem/scenesystem.cpp:202
void ForceScenesystemSynchronizationFromResourceSystem(void* pContext)
{
} /* size: 0 */

// <02E0F051> ../scenesystem/scenesystem.cpp:211
void DefaultMaterialBasedSceneObjectUpdater(CSceneObject *)
{
} /* size: 0 */

// <02F088A4> ../scenesystem/scenesystem.cpp:213
bool ForceSingleDisplayListForLayer(const CSceneLayer* pLayer)
{
} /* size: 0 */

// <02F079EB> ../scenesystem/scenesystem.cpp:222
// variables: 6
// function calls: 50
void CSceneSystem::Init()
{
	InitReturnVal_t nRetVal; // 224
	int nNumOverridePartitions; // 236
	int nMaxAutoPartitions; // 238
	{
		const int  nNumThreads; // 248
		int nNumPartitions; // 250
		Clamp<int>(const int& val,
				const int& minVal,
				const int& maxVal);  // 256
	}
	CTier0AppSystem<ISceneSystem, 0>::Init(); // 71
	CTier2AppSystem<ISceneSystem, 0>::Init(); // 224
	Vector4D::Vector4D(
		vec_t X,
		vec_t Y,
		vec_t Z,
		vec_t W);  // 228
	_mm_cvtss_si32(__m128 __A); // 1619
	RoundFloatToUnsignedLong(float f); // 1642
	{
	}
	RoundFloatToByte(float f); // 1761
	{
	}
	RoundFloatToByte(float f); // 1763
	{
	}
	RoundFloatToByte(float f); // 1762
	CSceneSystem::CreateExtraShaderData_TintRGBA32(
					Vector4D vTint,
					float fAlphaScale,
					uint nBlendWeightCount);  // 228
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 231
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 231
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 239
	Clamp<int>(const int& val,
			const int& minVal,
			const int& maxVal);  // 242
	Clamp<int>(const int& val,
			const int& minVal,
			const int& maxVal);  // 264
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 273
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 275
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 276
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 276
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 277
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 277
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 278
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 278
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 279
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 279
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 284
	KeyValues::GetBool(
		const char* keyName,
		bool defaultValue);  // 284
	IRenderDevice::IsUsingReverseDepth(); // 285
	IRenderDevice::IsUsing32BitDepthBuffer(); // 286
	{
		_M_create<void (&)(CSceneObject*)>(union _Any_data& __dest,
							void ()(CSceneObject *)& __f,
							true_type); // 217
		_M_init_functor<void (&)(CSceneObject*)>(union _Any_data& __functor,
							void ()(CSceneObject *)& __f); // 451
		_M_not_empty_function<void(CSceneObject*)>(void (*__fp)(CSceneObject *)); // 449
	}
	_Function_base::_Function_base(); // 439
	function<void(CSceneObject::function<void (
						void ()(CSceneObject *)& __f);  // 302
	_Function_base::~_Function_base(); // 336
	function<void(CSceneObject::~function()>* this); // 302
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 241
	CAppSystemDict::GetGameInfo(); // 105
	CTier1Application::GetGameInfo(); // 275
} /* size: 0, variables: 3, inline expansions: 44 (754 bytes) */

// <02F0731C> ../scenesystem/scenesystem.cpp:314
// variables: 2
// function calls: 28
void CSceneSystem::PreShutdown()
{
	{
		int i; // 1807
		CUtlMemory<CSceneView::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneView::Element(
			int i);  // 1809
	}
	CUtlVectorBase<CSceneView::RemoveAll(); // 1798
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 237
	CUtlMemoryFixedGrowable<CSceneView::Purge(
		int numElements);  // 1799
	CUtlMemory<CSceneView::Base(); // 112
	CUtlVectorBase<CSceneView::Base(); // 368
	CUtlVectorBase<CSceneView::ResetDbgInfo(); // 1800
	CUtlVectorBase<CSceneView::Purge(); // 1811
	CUtlVectorBase<CSceneView::PurgeAndDeleteElements(); // 6615
	CViewList::Purge(); // 6620
	{
		int i; // 1807
		CUtlMemory<CSceneView::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneView::Element(
			int i);  // 1809
	}
	CUtlVectorBase<CSceneView::RemoveAll(); // 1798
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CSceneView::Purge_FixedGrowable(
				CSceneView** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, CSceneView::Base(); // 237
	CUtlMemoryFixedGrowable<CSceneView::Purge(
		int numElements);  // 1799
	CUtlMemory<CSceneView::Base(); // 112
	CUtlVectorBase<CSceneView::Base(); // 368
	CUtlVectorBase<CSceneView::ResetDbgInfo(); // 1800
	CUtlVectorBase<CSceneView::Purge(); // 1811
	CUtlVectorBase<CSceneView::PurgeAndDeleteElements(); // 6615
	CViewList::Purge(); // 6621
	CInterlockedIntT<int, 4>::operator==(
			int rhs);  // 6623
	CSceneSystem::CleanupViewList(); // 317
} /* size: 0, inline expansions: 24 (1120 bytes) */

// <02F05A87> ../scenesystem/scenesystem.cpp:320
// variables: 8
// function calls: 110
void CSceneSystem::Shutdown()
{
	{
		UtlHashHandle_t handle; // 324
		CUtlVectorBase<CUtlVector<CUtlHashDict<ISceneObjectDesc::Count(); // 437
		CUtlMemory<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 595
		CUtlVectorBase<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 440
		CUtlVectorBase<CUtlHashDict<ISceneObjectDesc::Count(); // 440
		{
		}
		CUtlHash<CUtlHashDict<ISceneObjectDesc::BuildHandle(
				int ndxBucket,
				int ndxKeyData);  // 441
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetNextHandle(
				UtlHashHandle_t handle);  // 426
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetFirstHandle(); // 342
		CUtlHashDict<ISceneObjectDesc::First(); // 324
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetBucketIndex(
				UtlHashHandle_t handle);  // 403
		CUtlMemory<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 406
		CUtlMemory<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlHashDict<ISceneObjectDesc::Element(
			int i);  // 406
		CUtlHash<CUtlHashDict<ISceneObjectDesc::operator[](
				UtlHashHandle_t handle);  // 127
		CUtlHashDict<ISceneObjectDesc::Element(
			UtlHashHandle_t handle);  // 326
		CUtlVectorBase<CUtlVector<CUtlHashDict<ISceneObjectDesc::Count(); // 437
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetBucketIndex(
				UtlHashHandle_t handle);  // 434
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetKeyDataIndex(
				UtlHashHandle_t handle);  // 435
		CUtlMemory<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 595
		CUtlVectorBase<CUtlVector<CUtlHashDict<ISceneObjectDesc::operator[](
				int i);  // 440
		CUtlVectorBase<CUtlHashDict<ISceneObjectDesc::Count(); // 440
		{
		}
		CUtlHash<CUtlHashDict<ISceneObjectDesc::BuildHandle(
				int ndxBucket,
				int ndxKeyData);  // 441
		CUtlHash<CUtlHashDict<ISceneObjectDesc::GetNextHandle(
				UtlHashHandle_t handle);  // 348
		CUtlHashDict<ISceneObjectDesc::Next(
			UtlHashHandle_t handle);  // 324
	}
	{
		int i; // 1807
		CUtlMemory<CLightBinnerStandard::operator[](
				int i);  // 602
		CUtlVectorBase<CLightBinnerStandard::Element(
			int i);  // 1809
	}
	CUtlVectorBase<CLightBinnerStandard::RemoveAll(); // 1798
	CUtlMemory<CLightBinnerStandard::Purge(); // 903
	CUtlMemory<CLightBinnerStandard::IsExternallyAllocated(); // 905
	CUtlMemory<CLightBinnerStandard::Purge(); // 1799
	CUtlVectorBase<CLightBinnerStandard::ResetDbgInfo(); // 1800
	CUtlVectorBase<CLightBinnerStandard::Purge(); // 1811
	CUtlVectorBase<CLightBinnerStandard::PurgeAndDeleteElements(); // 333
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 358
	CTSPool<CSceneDrawList>::Purge(); // 338
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 358
	CManagedHandle::~CManagedHandle(); // 1436
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 577
	CUtlMemory<unsigned int, int>::ConvertToExternalMemory(
				unsigned int* pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::Purge_FixedGrowable(
				unsigned int* pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<3, unsigned int, 4>::Base(); // 237
	CUtlMemoryFixedGrowable<unsigned int, 3, int>::Purge(
		int numElements);  // 1799
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::Base(); // 368
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::Purge(); // 560
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 510
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<unsigned int, int>::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<unsigned int, 3, int>::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<unsigned int, CUtlMemoryFixedGrowable<unsigned int, 3, int> >::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<unsigned int, 3>::~CUtlVectorFixedGrowable(); // 1436
	IGenericInterface::~IGenericInterface(); // 1436
	CSceneObject::~CSceneObject(); // 341
	simpleTSPoolStruct_t::~simpleTSPoolStruct_t(); // 361
	CTSPool<CSceneObject>::Purge(); // 339
	{
		CMorphCompositeSet* tmp; // 1018
		CMorphCompositeSet::~CMorphCompositeSet(); // 1019
	}
	CUtlIntrusiveList<CMorphCompositeSet>::Purge(); // 341
	{
		MorphCompositeDesc_t* tmp; // 1018
	}
	CUtlIntrusiveList<MorphCompositeDesc_t>::Purge(); // 342
	{
		BoneSetupInfo_t* tmp; // 1018
	}
	CUtlIntrusiveList<BoneSetupInfo_t>::Purge(); // 642
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 643
	CPreRenderSubmissionSetupList<BoneSetupInfo_t>::Purge(); // 343
	{
		FlexDescSetupInfo_t* tmp; // 1018
		CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
		CUtlMemory<float, int>::IsExternallyAllocated(); // 905
		CUtlMemory<float, int>::Purge(); // 903
		CUtlMemory<float, int>::Purge(); // 1799
		CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
		ValidateAlignment<float>(void); // 508
		CUtlMemory<float, int>::Purge(); // 510
		CUtlMemory<float, int>::~CUtlMemory(); // 562
		CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
		CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 586
		FlexDescSetupInfo_t::~FlexDescSetupInfo_t(); // 1019
	}
	CUtlIntrusiveList<FlexDescSetupInfo_t>::Purge(); // 642
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 643
	CPreRenderSubmissionSetupList<FlexDescSetupInfo_t>::Purge(); // 344
	{
		int i; // 1721
		CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 1294
		ScratchRenderTarget_t::~ScratchRenderTarget_t(); // 1526
		Destruct<CSceneSystem::ScratchRenderTarget_t>(ScratchRenderTarget_t* pMemory); // 1723
	}
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::RemoveAll(); // 347
	{
		int i; // 1807
		CUtlMemory<std::function<void(CSceneObject::operator[](
				int i);  // 602
		CUtlVectorBase<std::function<void(CSceneObject::Element(
			int i);  // 1809
		_Function_base::~_Function_base(); // 336
		function<void(CSceneObject::~function()>* this); // 1809
	}
	CUtlVectorBase<std::function<void(CSceneObject::RemoveAll()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 1798
	CUtlMemory<std::function<void(CSceneObject::IsExternallyAllocated()>*, int>* this); // 577
	CUtlMemory<std::function<void(CSceneObject::ConvertToExternalMemory(
				function<void(CSceneObject*)>** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::Purge_FixedGrowable(
				function<void(CSceneObject*)>** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<std::function<void(CSceneObject::Purge_FixedGrowable(
				function<void(CSceneObject*)>** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<16, std::function<void(CSceneObject::Base()>*, 8>* this); // 237
	CUtlMemoryFixedGrowable<std::function<void(CSceneObject::Purge(
		int numElements);  // 1799
	CUtlVectorBase<std::function<void(CSceneObject::ResetDbgInfo()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 1800
	CUtlVectorBase<std::function<void(CSceneObject::Purge()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 1811
	CUtlVectorBase<std::function<void(CSceneObject::PurgeAndDeleteElements()>*, CUtlMemoryFixedGrowable<std::function<void(CSceneObject*)>*, 16 this); // 352
	CTier0AppSystem<ISceneSystem, 0>::Shutdown(); // 85
	CTier2AppSystem<ISceneSystem, 0>::Shutdown(); // 357
} /* size: 0, inline expansions: 63 (3965 bytes) */

// <02F05A59> ../scenesystem/scenesystem.cpp:360
void CSceneSystem::CanAllocateScratchRenderTargetsOnDemand()
{
} /* size: 0 */

// <02F059D0> ../scenesystem/scenesystem.cpp:365
// variable: 1
void CSceneSystem::CreateWorld(const char* pWorldDebugName)
{
	ISceneWorld* pWorld; // 367
} /* size: 48, variables: 1 */

// <02F0539D> ../scenesystem/scenesystem.cpp:372
// variable: 1
// function calls: 23
void CSceneSystem::DestroyWorld(ISceneWorld* pSceneWorld)
{
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_388; // 388
	CSceneWorld::IsFreed(); // 373
	{
	}
	CSceneWorld::GetDeleteAtEndOfFrame(); // 380
	CSceneWorld::IsFreed(); // 372
	{
	}
	CSceneWorld::SetDeleteAtEndOfFrame(
				bool bDelete);  // 386
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 388
	CUtlMemory<ISceneWorld::NumAllocated(); // 1196
	CUtlMemory<ISceneWorld::Base(); // 112
	CUtlVectorBase<ISceneWorld::Base(); // 368
	CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 824
	CUtlVectorBase<ISceneWorld::GrowMemory(
			int num);  // 1198
	CUtlMemory<ISceneWorld::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneWorld::Element(
		int i);  // 1201
	CopyConstruct<ISceneWorld*>(ISceneWorld** pMemory,
					ISceneWorld* const& src);  // 1201
	CUtlVectorBase<ISceneWorld::AddToTail(
			ISceneWorld* const& src);  // 389
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 390
} /* size: 0, variables: 1, inline expansions: 23 (685 bytes) */

// <02F052E7> ../scenesystem/scenesystem.cpp:393
// variables: 4
void CSceneWorld::IsEmpty()
{
	{
		const CSceneWorldObjectList& subList; // 395
		const CSceneWorldObjectList& __for_range; // 60339
		const CSceneWorldObjectList* __for_begin; // 41313
		const CSceneWorldObjectList* __for_end; // 41313
	}
} /* size: 71 */

// <02F3E0D0> ../scenesystem/scenesystem.cpp:406
void CSceneWorld::NumberOfObjectsInPartition(int nPartitionidx)
{
} /* size: 0 */

// <02F018E0> ../scenesystem/scenesystem.cpp:411
// function calls: 119
void CSceneWorld::CSceneWorld(const char* pWorldDebugName)
{
	ISceneWorld::ISceneWorld(); // 411
	CThreadMutex::CThreadMutex(
			const char* pName);  // 235
	CUtlMemory<CSceneWorldObjectListChunk::ValidateGrowSize(); // 475
	CUtlMemory<CSceneWorldObjectListChunk::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CSceneWorldObjectListChunk::ResetDbgInfo(); // 530
	CUtlVectorBase<CSceneWorldObjectListChunk::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CSceneWorldObjectListChunk::CUtlVector(); // 235
	CSceneWorldObjectList::CSceneWorldObjectList(); // 411
	CInterlockedIntT<int, 4>::CInterlockedIntT(
			int value);  // 411
	CUtlSymbol::CUtlSymbol(); // 411
	CTSListBase::CTSListBase(); // 846
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 846
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 862
	Node_t::Node_t(); // 864
	CTSQueue<CSceneObject::End(); // 865
	CTSQueue<CSceneObject::CTSQueue(); // 411
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlMemory<SceneObjectCullingBox_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<SceneObjectCullingBox_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 419
	CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::CUtlVector(
			int growSize,
			int initCapacity);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlVectorMT<CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >, CThreadFastMutex>::CUtlVectorMT(
			int growSize,
			int initCapacity);  // 411
	CUtlMemory<SceneVolumetricFogVolume_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<SceneVolumetricFogVolume_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 419
	CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::CUtlVector(
			int growSize,
			int initCapacity);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlVectorMT(const CUtlVectorMT<CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >, CThreadFastMutex this,
			int growSize,
			int initCapacity);  // 411
	CUtlSymbolTableMT::AddString(
			const char* pString);  // 414
	Vector::Vector(); // 831
	Vector::Vector(); // 831
	FourVectors::FourVectors(); // 831
	CUtlMemory<CacheOptimizedKDNode_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CacheOptimizedKDNode_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CacheOptimizedKDNode_t, CUtlMemory<CacheOptimizedKDNode_t, int> >::CUtlVector(); // 831
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::Init(
		int nGrowSize,
		int nInitSize);  // 126
	CUtlBlockMemory<CacheOptimizedTriangle_t, int>::CUtlBlockMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CacheOptimizedTriangle_t, CUtlBlockMemory<CacheOptimizedTriangle_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 14
	CUtlBlockVector<CacheOptimizedTriangle_t, int>::CUtlBlockVector(
			int growSize,
			int initCapacity);  // 831
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
	CUtlMemory<LightDesc_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<LightDesc_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<LightDesc_t, CUtlMemory<LightDesc_t, int> >::CUtlVector(); // 831
	CUtlMemory<Vector, int>::ValidateGrowSize(); // 475
	CUtlMemory<Vector, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<Vector, CUtlMemory<Vector, int> >::CUtlVector(); // 831
	CUtlMemory<long long unsigned int, int>::ValidateGrowSize(); // 475
	CUtlMemory<long long unsigned int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::CUtlVector(); // 831
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 838
	FourVectors::DuplicateVector(
			const Vector& v);  // 833
	CUtlBlockMemory<Vector2D, int>::Init(
		int nGrowSize,
		int nInitSize);  // 126
	CUtlBlockMemory<Vector2D, int>::CUtlBlockMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<Vector2D, CUtlBlockMemory<Vector2D, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 14
	CUtlBlockVector<Vector2D, int>::CUtlBlockVector(
			int growSize,
			int initCapacity);  // 831
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 837
	CUtlMemory<TraceVertex_t::ValidateGrowSize(); // 475
	CUtlMemory<TraceVertex_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<TraceVertex_t::ResetDbgInfo(); // 530
	CUtlVectorBase<TraceVertex_t::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<TraceVertex_t::CUtlVector(); // 831
	CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> > this); // 530
	CUtlVectorBase(const CUtlVectorBase<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >  this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector<InstancedRayTracingEnvironmentBVHNode_t, CUtlMemory<InstancedRayTracingEnvironmentBVHNode_t, int> >::CUtlVector(); // 831
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::ValidateGrowSize(); // 475
	CUtlMemory<InstancedRayTracingEnvironmentReference_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::ResetDbgInfo(); // 530
	CUtlVectorBase<InstancedRayTracingEnvironmentReference_t::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<InstancedRayTracingEnvironmentReference_t::CUtlVector(); // 1895
	CUtlVectorAutoPurge<InstancedRayTracingEnvironmentReference_t::CUtlVectorAutoPurge(); // 831
	CUtlMemory<RayTracingEnvironment::ValidateGrowSize(); // 475
	CUtlMemory<RayTracingEnvironment::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<RayTracingEnvironment::ResetDbgInfo(); // 530
	CUtlVectorBase<RayTracingEnvironment::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<RayTracingEnvironment::CUtlVector(); // 831
	CUtlMemory<int, int>::ValidateGrowSize(); // 475
	CUtlMemory<int, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 831
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 831
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 833
	RayTracingEnvironment::RayTracingEnvironment(); // 411
	CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::ResetDbgInfo(); // 530
	CUtlMemory<AABB_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<AABB_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<AABB_t, CUtlMemory<AABB_t, int> >::CUtlVector(); // 411
	Vector::Vector(); // 411
	QAngle::QAngle(); // 411
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 411
	CManagedHandle::CManagedHandle(); // 411
	CUtlMemory<CSceneObject::ValidateGrowSize(); // 475
	CUtlMemory<CSceneObject::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 530
	CUtlVectorBase<CSceneObject::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CSceneObject::CUtlVector(); // 411
	CUtlSymbol::operator=(
			const CUtlSymbol& src);  // 414
} /* size: 1582, inline expansions: 119 (3168 bytes) */

// <02F018BA> ../scenesystem/scenesystem.cpp:411
void CSceneWorld::CSceneWorld(const char* pWorldDebugName)
{
} /* size: 0 */

// <02F005EE> ../scenesystem/scenesystem.cpp:422
// variable: 1
// function calls: 79
void CSceneWorld::~CSceneWorld()
{
	{
		{
		}
		{
		}
	}
	{
		CSceneWorld::IsFreed(); // 424
		{
		}
		CSceneWorld::IsFreed(); // 328
		{
		}
		CSceneWorld::IsBusy(); // 425
		{
		}
		CSceneWorld::IsFreed(); // 964
		{
		}
		{
			int nSubList; // 966
		}
		CSceneWorld::GetSceneObjectCount(); // 428
		CUtlVectorBase<CSceneObject::RemoveAll(); // 1798
		CUtlMemory<CSceneObject::IsExternallyAllocated(); // 905
		CUtlMemory<CSceneObject::Purge(); // 903
		CUtlMemory<CSceneObject::Purge(); // 1799
		CUtlVectorBase<CSceneObject::Purge(); // 560
		ValidateAlignment<CSceneObject*>(void); // 508
		CUtlMemory<CSceneObject::Purge(); // 510
		CUtlMemory<CSceneObject::~CUtlMemory(); // 562
		CUtlVectorBase<CSceneObject::~CUtlVectorBase(); // 410
		CUtlVector<CSceneObject::~CUtlVector(); // 435
		CManagedHandle::~CManagedHandle(); // 435
		CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::RemoveAll(); // 1798
		CUtlMemory<AABB_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<AABB_t, int>::Purge(); // 903
		CUtlMemory<AABB_t, int>::Purge(); // 1799
		CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::Purge(); // 560
		ValidateAlignment<AABB_t>(void); // 508
		CUtlMemory<AABB_t, int>::Purge(); // 510
		CUtlMemory<AABB_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<AABB_t, CUtlMemory<AABB_t, int> >::~CUtlVector(); // 435
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 203
		ThreadPause(void); // 208
		CTSListBase::Pop(); // 890
		CInterlockedIntT<int, 4>::operator==(
				int rhs);  // 895
		{
		}
		{
		}
		{
		}
		CTSQueue<CSceneObject::Purge(); // 870
		CInterlockedIntT<int, 4>::operator==(
				int rhs);  // 871
		{
		}
		{
		}
		CTSQueue<CSceneObject::End(); // 873
		{
		}
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 244
		ThreadPause(void); // 230
		CTSListBase::Detach(); // 135
		CTSListBase::~CTSListBase(); // 876
		CTSQueue<CSceneObject::~CTSQueue(); // 435
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::RemoveAll(); // 1798
		CUtlMemory<SceneVolumetricFogVolume_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<SceneVolumetricFogVolume_t, int>::Purge(); // 903
		CUtlMemory<SceneVolumetricFogVolume_t, int>::Purge(); // 1799
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Purge(); // 560
		ValidateAlignment<SceneVolumetricFogVolume_t>(void); // 508
		CUtlMemory<SceneVolumetricFogVolume_t, int>::Purge(); // 510
		CUtlMemory<SceneVolumetricFogVolume_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::~CUtlVector(); // 18
		~CUtlVectorMT(const CUtlVectorMT<CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >, CThreadFastMutex this); // 435
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::RemoveAll(); // 1798
		CUtlMemory<SceneObjectCullingBox_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<SceneObjectCullingBox_t, int>::Purge(); // 903
		CUtlMemory<SceneObjectCullingBox_t, int>::Purge(); // 1799
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Purge(); // 560
		ValidateAlignment<SceneObjectCullingBox_t>(void); // 508
		CUtlMemory<SceneObjectCullingBox_t, int>::Purge(); // 510
		CUtlMemory<SceneObjectCullingBox_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::~CUtlVector(); // 18
		CUtlVectorMT<CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >, CThreadFastMutex>::~CUtlVectorMT(); // 435
		CUtlVectorBase<CSceneWorldObjectListChunk::RemoveAll(); // 1798
		CUtlMemory<CSceneWorldObjectListChunk::Purge(); // 903
		CUtlMemory<CSceneWorldObjectListChunk::IsExternallyAllocated(); // 905
		CUtlMemory<CSceneWorldObjectListChunk::Purge(); // 1799
		CUtlMemory<CSceneWorldObjectListChunk::Base(); // 112
		CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 368
		CUtlVectorBase<CSceneWorldObjectListChunk::ResetDbgInfo(); // 1800
		CUtlVectorBase<CSceneWorldObjectListChunk::Purge(); // 560
		CUtlMemory<CSceneWorldObjectListChunk::IsExternallyAllocated(); // 905
		CUtlMemory<CSceneWorldObjectListChunk::Purge(); // 903
		CUtlMemory<CSceneWorldObjectListChunk::Purge(); // 510
		ValidateAlignment<CSceneWorldObjectListChunk*>(void); // 508
		CUtlMemory<CSceneWorldObjectListChunk::~CUtlMemory(); // 562
		CUtlVectorBase<CSceneWorldObjectListChunk::~CUtlVectorBase(); // 410
		CUtlVector<CSceneWorldObjectListChunk::~CUtlVector(); // 241
		CThreadMutex::~CThreadMutex(); // 241
		CSceneWorldObjectList::~CSceneWorldObjectList(); // 422
	}
} /* size: 0 */

// <02F00587> ../scenesystem/scenesystem.cpp:422
void CSceneWorld::~CSceneWorld()
{
} /* size: 36 */

// <02F0052D> ../scenesystem/scenesystem.cpp:422
// variables: 3
void CSceneWorld::~CSceneWorld()
{
	const char   __FUNCTION__; // 63493
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 424
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 425
	}
} /* size: 0, variables: 1 */

// <02EFFA3D> ../scenesystem/scenesystem.cpp:437
// variables: 15
// function calls: 34
void CSceneWorld::DeleteAllObjects()
{
	const char   __FUNCTION__; // 63601
	CUtlVectorFixedGrowableCompat<CSceneObject*, 1024> objectsToDelete; // 448
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 439
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 440
	}
	{
		CSceneObject* pObj; // 451
		CUtlVectorFixedGrowableCompat<CSceneObject*, 1024>& __for_range; // 40195
		iterator __for_begin; // 62973
		iterator __for_end; // 62973
		{
			int nSettings; // 463
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 456
			}
			CSceneObject::HasFlags(
				ESceneObjectFlags nFlags);  // 470
			CSceneSystem::GetObjectSettings(
						const CSceneObject* pObj);  // 463
			Plat_IsInDebugSession(void); // 467
		}
		CUtlMemory<CSceneObject::Base(); // 112
		CUtlVectorBase<CSceneObject::Base(); // 102
		CUtlVectorBase<CSceneObject::begin(); // 451
		CUtlVectorBase<CSceneObject::Count(); // 104
		CUtlVectorBase<CSceneObject::end(); // 451
	}
	{
		CSceneWorldObjectList& subList; // 480
		CSceneWorldObjectList& __for_range; // 40207
		CSceneWorldObjectList* __for_begin; // 40929
		CSceneWorldObjectList* __for_end; // 40929
	}
	CSceneWorld::IsFreed(); // 439
	CSceneWorld::IsFreed(); // 328
	{
	}
	CSceneWorld::IsBusy(); // 440
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 447
	CUtlMemory<CSceneObject::CUtlMemory(
			CSceneObject** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 535
	CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 538
	CUtlVectorBase<CSceneObject::CUtlVectorBase(
			CSceneObject** pMemory,
			int allocationCount,
			int initialCount,
			bool bGrowable);  // 420
	CUtlVector<CSceneObject::CUtlVector(
			CSceneObject** pMemory,
			int allocationCount,
			int initialCount,
			bool bGrowable);  // 495
	AlignedByteArrayExplicit_t<1024, CSceneObject::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<1024, CSceneObject::AlignedByteArray_t(); // 495
	AlignedByteArrayExplicit_t<1024, CSceneObject::Base(); // 497
	CUtlVectorFixedGrowableCompat<CSceneObject::CUtlVectorFixedGrowableCompat(
					int growSize);  // 448
	CSceneWorld::IsFreed(); // 955
	{
	}
	{
		int nSubList; // 956
	}
	CSceneWorld::GetAllSceneObjects(
				CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> >& objectsOut);  // 449
	CUtlVectorBase<CSceneObject::RemoveAll(); // 1798
	CUtlMemory<CSceneObject::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneObject::Purge(); // 903
	CUtlMemory<CSceneObject::Purge(); // 1799
	CUtlVectorBase<CSceneObject::Purge(); // 560
	ValidateAlignment<CSceneObject*>(void); // 508
	CUtlMemory<CSceneObject::Purge(); // 510
	CUtlMemory<CSceneObject::~CUtlMemory(); // 562
	CUtlVectorBase<CSceneObject::~CUtlVectorBase(); // 410
	CUtlVector<CSceneObject::~CUtlVector(); // 489
	CUtlVectorFixedGrowableCompat<CSceneObject::~CUtlVectorFixedGrowableCompat(); // 484
} /* size: 0, variables: 2, inline expansions: 26 (459 bytes) */

// <02EFF900> ../scenesystem/scenesystem.cpp:486
// variables: 2
// function calls: 4
void CSceneWorld::NextID()
{
	const char   __FUNCTION__; // 63331
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 488
	}
	CSceneWorld::IsFreed(); // 488
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<int, 4>::operator++(); // 489
	HashIntAlternate(uint32 n); // 489
} /* size: 0, variables: 1, inline expansions: 4 (94 bytes) */

// <02EFF805> ../scenesystem/scenesystem.cpp:492
// variables: 2
// function calls: 2
void CSceneWorld::Release()
{
	const char   __FUNCTION__; // 63358
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 494
	}
	CSceneWorld::IsFreed(); // 494
	CSceneWorld::~CSceneWorld(); // 495
} /* size: 0, variables: 1, inline expansions: 2 (24 bytes) */

// <02EFF51E> ../scenesystem/scenesystem.cpp:499
// variables: 9
// function calls: 9
void CSceneWorld::FreeUnusedObjectChunks()
{
	int nMemUsed; // 501
	int nMemWasted; // 502
	int nMemReclaimed; // 503
	{
		int nSubList; // 506
		{
			uint nPrevChunkCount; // 508
			{
				const CSceneWorldObjectListChunk* pChunk; // 514
				const CUtlVector<CSceneWorldObjectListChunk*, CUtlMemory<CSceneWorldObjectListChunk*, int> >& __for_range; // 40343
				const_iterator __for_begin; // 36896
				const_iterator __for_end; // 36896
				CUtlMemory<CSceneWorldObjectListChunk::Base(); // 113
				CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 103
				CUtlVectorBase<CSceneWorldObjectListChunk::begin(); // 514
				CUtlVectorBase<CSceneWorldObjectListChunk::end(); // 514
				CSceneWorldObjectListChunk::NumFree(); // 517
			}
			CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 260
			CSceneWorldObjectList::ChunkCount(); // 508
			CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 260
			CSceneWorldObjectList::ChunkCount(); // 512
		}
	}
} /* size: 318, variables: 3 */

// <02EFE8A5> ../scenesystem/scenesystem.cpp:525
// variables: 4
// function calls: 46
void ConstructBoxPlanes(const Vector& vOrigin, const QAngle& vAngles, const Vector& vExtents, fltx4* boxPlanes)
{
	matrix3x4a_t mRotation; // 527
	const Vector   vNormals; // 530
	{
		int i; // 540
		{
			VPlane plane; // 542
			Vector::Vector(); // 89
			VPlane::VPlane(); // 542
			Vector::Vector(
				vec_t X,
				vec_t Y,
				vec_t Z);  // 1431
			Vector::operator-(); // 543
			Vector::operator[](
					int i);  // 543
			VectorMultiply(const Vector& a,
					vec_t b,
					Vector& c);  // 1451
			Vector::Vector(); // 1450
			Vector::operator*(
					float fl);  // 543
			VectorAdd(const Vector& a,
					const Vector& b,
					Vector& c);  // 1437
			Vector::Vector(); // 1436
			Vector::operator+(
					const Vector& v);  // 543
			Vector::NormalizeInPlace(); // 113
			Vector::operator=(
					const Vector& vOther);  // 112
			DotProduct(const Vector& a,
					const Vector& b);  // 1167
			Vector::Dot(
				const Vector& vOther);  // 114
			VPlane::InitFromPointAndNormal(
						const Vector& vPos,
						const Vector& vNormal);  // 543
			Vector::Vector(); // 1450
			VectorMultiply(const Vector& a,
					vec_t b,
					Vector& c);  // 1451
			Vector::operator*(
					float fl);  // 543
			Vector4D::Init(
				vec_t ix,
				vec_t iy,
				vec_t iz,
				vec_t iw);  // 544
		}
	}
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 532
	matrix3x4_t::matrix3x4_t(); // 303
	matrix3x4a_t::matrix3x4a_t(); // 527
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 532
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 533
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 533
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 534
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 534
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 535
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 535
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 536
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 536
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2,
			Vector& out);  // 1315
	Vector::Vector(); // 1314
	VectorRotate(const Vector& in1,
			const matrix3x4_t& in2);  // 537
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 537
} /* size: 846, variables: 2, inline expansions: 26 (455 bytes) */

// <02EFE27A> ../scenesystem/scenesystem.cpp:549
// variable: 1
// function calls: 21
void CSceneWorld::AddCullingBox(SceneSystemBoxCullMode_t nCullMode, const Vector& vOrigin, const QAngle& vAngles, const Vector& vExtents)
{
	SceneObjectCullingBox_t newBox; // 551
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 897
	CThreadFastMutex::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 555
	CUtlMemory<SceneObjectCullingBox_t, int>::NumAllocated(); // 1196
	CUtlMemory<SceneObjectCullingBox_t, int>::Base(); // 112
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Base(); // 368
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::ResetDbgInfo(); // 824
	CUtlMemory<SceneObjectCullingBox_t, int>::IsGrowable(); // 823
	CUtlMemory<SceneObjectCullingBox_t, int>::IsExternallyAllocated(); // 859
	CUtlMemory<SceneObjectCullingBox_t, int>::IsExternallyAllocated(); // 861
	CUtlMemory<SceneObjectCullingBox_t, int>::Grow(
		int num);  // 806
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::GrowMemory(
			int num);  // 1198
	CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Element(
		int i);  // 1201
	CopyConstruct<SceneObjectCullingBox_t>(SceneObjectCullingBox_t* pMemory,
						const SceneObjectCullingBox_t& src);  // 1201
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::AddToTail(
			const SceneObjectCullingBox_t& src);  // 557
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 897
	CThreadFastMutex::UnlockWrite(
			const char* pFileName,
			int nLineNumber);  // 558
} /* size: 707, variables: 1, inline expansions: 21 (1536 bytes) */

// <02EFDCD6> ../scenesystem/scenesystem.cpp:564
// variables: 3
// function calls: 20
void CSceneWorld::RemoveCullingBox(uint32 nBoxId)
{
	const int  nBoxIndex; // 567
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 897
	CThreadFastMutex::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 566
	{
		int i; // 208
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Count(); // 208
		CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
				int i);  // 609
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Element(
			int i);  // 210
	}
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::FindByField<unsigned int, SceneObjectCullingBox_t>(
								unsigned int SceneObjectCullingBox_t::* pField,
								unsigned int matchValue);  // 567
	CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Element(
		int i);  // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	Destruct<SceneObjectCullingBox_t>(SceneObjectCullingBox_t* pMemory); // 1575
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::FastRemove(
			int elem);  // 570
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 897
	CThreadFastMutex::UnlockWrite(
			const char* pFileName,
			int nLineNumber);  // 572
} /* size: 387, variables: 1, inline expansions: 13 (558 bytes) */

// <02EFD66C> ../scenesystem/scenesystem.cpp:575
// variable: 1
// function calls: 25
void CSceneWorld::AddVolumetricFogVolume(const SceneVolumetricFogVolume_t& volume)
{
	int index; // 578
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 897
	CThreadFastMutex::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 577
	CUtlMemory<SceneVolumetricFogVolume_t, int>::NumAllocated(); // 1196
	CUtlMemory<SceneVolumetricFogVolume_t, int>::Base(); // 112
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Base(); // 368
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::ResetDbgInfo(); // 824
	CUtlMemory<SceneVolumetricFogVolume_t, int>::IsGrowable(); // 823
	CUtlMemory<SceneVolumetricFogVolume_t, int>::IsExternallyAllocated(); // 859
	CUtlMemory<SceneVolumetricFogVolume_t, int>::IsExternallyAllocated(); // 861
	CUtlMemory<SceneVolumetricFogVolume_t, int>::Grow(
		int num);  // 806
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::GrowMemory(
			int num);  // 1198
	CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Element(
		int i);  // 1201
	CopyConstruct<SceneVolumetricFogVolume_t>(SceneVolumetricFogVolume_t* pMemory,
							const SceneVolumetricFogVolume_t& src);  // 1201
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::AddToTail(
			const SceneVolumetricFogVolume_t& src);  // 578
	CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::operator[](
			int i);  // 579
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 897
	CThreadFastMutex::UnlockWrite(
			const char* pFileName,
			int nLineNumber);  // 580
	CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::operator[](
			int i);  // 582
} /* size: 671, variables: 1, inline expansions: 25 (1560 bytes) */

// <02EFD0C8> ../scenesystem/scenesystem.cpp:585
// variables: 3
// function calls: 20
void CSceneWorld::RemoveVolumetricFogVolume(uint32 nId)
{
	const int  nIndex; // 588
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 897
	CThreadFastMutex::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 587
	{
		int i; // 208
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Count(); // 208
		CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
				int i);  // 609
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Element(
			int i);  // 210
	}
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::FindByField<unsigned int, SceneVolumetricFogVolume_t>(
								unsigned int SceneVolumetricFogVolume_t::* pField,
								unsigned int matchValue);  // 588
	CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Element(
		int i);  // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<SceneVolumetricFogVolume_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	Destruct<SceneVolumetricFogVolume_t>(SceneVolumetricFogVolume_t* pMemory); // 1575
	CUtlVectorBase<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >::FastRemove(
			int elem);  // 591
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 897
	CThreadFastMutex::UnlockWrite(
			const char* pFileName,
			int nLineNumber);  // 593
} /* size: 393, variables: 1, inline expansions: 13 (564 bytes) */

// <02EFD08B> ../scenesystem/scenesystem.cpp:596
void CSceneWorld::Add3DSkyboxWorld(ISceneWorld* pWorld)
{
} /* size: 12 */

// <02EFD04E> ../scenesystem/scenesystem.cpp:601
void CSceneWorld::Remove3DSkyboxWorld(ISceneWorld* pWorld)
{
} /* size: 16 */

// <02EFCF88> ../scenesystem/scenesystem.cpp:606
// function calls: 2
void CSceneWorld::Set3DSkyboxParameters(Vector origin, QAngle angles, float scale)
{
	Vector::operator=(
			const Vector& vOther);  // 608
	QAngle::operator=(
			const QAngle& vOther);  // 609
} /* size: 79, inline expansions: 2 (46 bytes) */

// <02EFCE9E> ../scenesystem/scenesystem.cpp:613
// function calls: 2
void CSceneWorld::Get3DSkybox(ISceneWorld *& outpWorld, Vector& outOrigin, QAngle& outAngle, float& outScale)
{
	Vector::operator=(
			const Vector& vOther);  // 616
	QAngle::operator=(
			const QAngle& vOther);  // 617
} /* size: 104, inline expansions: 2 (76 bytes) */

// <02EFCE3B> ../scenesystem/scenesystem.cpp:622
void CSceneSystem::TimestampManager()
{
} /* size: 75 */

// <02EFCDFE> ../scenesystem/scenesystem.cpp:633
void CSceneSystem::SetGPUProfilerMode(SceneSystemGPUProfilerMode_t eGPUProfilerMode)
{
} /* size: 11 */

// <02EFCDD0> ../scenesystem/scenesystem.cpp:639
void CSceneSystem::GetGPUProfilerMode()
{
} /* size: 11 */

// <02F3072B> ../scenesystem/scenesystem.cpp:645
// function call: 1
void CSceneSystem::GetMostRecentTimestampFrameSummary(SwapChainHandle_t hSwapChain, CUtlVector<SceneSystemTimestampFrameData_t, CUtlMemory<SceneSystemTimestampFrameData_t, int> >& timestampFrameSummaryOut)
{
	CSceneSystem::GetMostRecentTimestampFrameSummary(
						SwapChainHandle_t hSwapChain,
						CUtlVector<SceneSystemTimestampFrameData_t, CUtlMemory<SceneSystemTimestampFrameData_t, int> >& timestampFrameSummaryOut);  // 645
} /* size: 33, inline expansions: 1 (18 bytes) */

// <02EFCD9D> ../scenesystem/scenesystem.cpp:645
void CSceneSystem::GetMostRecentTimestampFrameSummary(SwapChainHandle_t hSwapChain, CUtlVector<SceneSystemTimestampFrameData_t, CUtlMemory<SceneSystemTimestampFrameData_t, int> >& timestampFrameSummaryOut)
{
} /* size: 0 */

// <02EFCCDC> ../scenesystem/scenesystem.cpp:654
// variable: 1
void CSceneSystem::SetManagedPerfMarker(IRenderContext* pRenderContext, const char* pMarkerName)
{
	SceneViewTimestampQuery_t* pQuery; // 659
} /* size: 113, variables: 1 */

// <02F30072> ../scenesystem/scenesystem.cpp:665
void CSceneSystem::GetPerFrameStats()
{
} /* size: 12 */

// <02EFB35A> ../scenesystem/scenesystem.cpp:678
// variables: 2
// function calls: 44
void CSceneSystem::GetStatsSummaryString(CBufferString* pOut)
{
	const SceneSystemPerFrameStats_t& stats; // 681
	{
		CCycleCount cycleCount; // 816
		CCycleCount::Init(
			uint64 cycles);  // 243
		CCycleCount::CCycleCount(
				uint64 cycles);  // 816
		Plat_TickDiffMilliSec(uint64 nStartTicks,
					uint64 nEndTicks,
					uint64 nFreq);  // 316
		CCycleCount::GetMilliseconds64(); // 817
	}
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 680
	CInterlockedIntT<int, 4>::operator int(); // 683
	CInterlockedIntT<int, 4>::operator int(); // 690
	ConVar::GetInt(); // 695
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 700
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 702
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 708
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 710
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 719
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 721
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 723
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 737
	CInterlockedIntT<int, 4>::GetRaw(); // 738
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 750
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 752
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 754
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 756
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 758
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 760
	CInterlockedIntT<int, 4>::GetRaw(); // 761
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 762
	CInterlockedIntT<int, 4>::GetRaw(); // 763
	CInterlockedIntT<int, 4>::GetRaw(); // 764
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 765
	CInterlockedIntT<int, 4>::GetRaw(); // 766
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 768
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 771
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 823
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 806
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 800
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 794
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 788
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 782
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 776
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 742
	CBufferString::Append(
		const char* pString,
		int nChars,
		bool bExact);  // 697
	CInterlockedIntT<int, 4>::GetRaw(); // 692
	CInterlockedIntT<int, 4>::GetRaw(); // 685
} /* size: 2589, variables: 1, inline expansions: 40 (967 bytes) */

// <02EFA56D> ../scenesystem/scenesystem.cpp:830
// variables: 14
// function calls: 55
void CSceneWorldObjectList::MoveAllObjectsToAnother(CSceneWorldObjectList* pDest, CSceneWorld* pSrcWorld, CSceneWorld* pNewWorld)
{
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_838; // 838
	{
		CSceneWorldObjectListChunk* pNode; // 840
		CUtlVector<CSceneWorldObjectListChunk*, CUtlMemory<CSceneWorldObjectListChunk*, int> >& __for_range; // 19267
		iterator __for_begin; // 36851
		iterator __for_end; // 36851
		{
			CSceneWorldObjectListChunk* pCheck; // 844
			CUtlVector<CSceneWorldObjectListChunk*, CUtlMemory<CSceneWorldObjectListChunk*, int> >& __for_range; // 19267
			iterator __for_begin; // 36851
			iterator __for_end; // 36851
			{
				int nNumToMove; // 854
				{
					const CSceneObjectReference_t* pSrcRef; // 857
					CSceneObjectReference_t* pDestRef; // 858
					{
						int i; // 859
						ChangeWorldReferencesInsideSceneObject(CSceneObject* pObj,
											ISceneWorld* pNewWorld);  // 864
						VectorAligned::operator=(
								const VectorAligned& src);  // 67
						VectorAligned::operator=(
								const VectorAligned& src);  // 67
						CSceneObjectReference_t::operator=(
								const CSceneObjectReference_t  &);  // 866
					}
				}
				CSceneWorldObjectListChunk::NumFree(); // 854
			}
			CUtlMemory<CSceneWorldObjectListChunk::Base(); // 112
			CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 102
			CUtlVectorBase<CSceneWorldObjectListChunk::begin(); // 844
			CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 104
			CUtlVectorBase<CSceneWorldObjectListChunk::end(); // 844
		}
		{
			int i; // 879
			ChangeWorldReferencesInsideSceneObject(CSceneObject* pObj,
								ISceneWorld* pNewWorld);  // 881
			CSceneWorldObjectListChunk::NumObjects(); // 879
		}
		CUtlMemory<CSceneWorldObjectListChunk::Base(); // 112
		CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 102
		CUtlVectorBase<CSceneWorldObjectListChunk::begin(); // 840
		CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 104
		CUtlVectorBase<CSceneWorldObjectListChunk::end(); // 840
		CSceneWorldObjectListChunk::IsFull(); // 842
		CUtlMemory<CSceneWorldObjectListChunk::NumAllocated(); // 782
		CUtlMemory<CSceneWorldObjectListChunk::Base(); // 112
		CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 368
		CUtlVectorBase<CSceneWorldObjectListChunk::ResetDbgInfo(); // 824
		CUtlVectorBase<CSceneWorldObjectListChunk::GrowMemory(
				int num);  // 784
		CUtlVectorBase<CSceneWorldObjectListChunk::GrowVector(
				int num);  // 1223
		CUtlMemory<CSceneWorldObjectListChunk::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneWorldObjectListChunk::Element(
			int i);  // 1097
		CUtlMemory<CSceneWorldObjectListChunk::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneWorldObjectListChunk::Element(
			int i);  // 1097
		memmove(void* __dest,
			const void* __src,
			size_t __len);  // 115
		V_memmove(void* dest,
				const void* src,
				size_t count);  // 1097
		CUtlVectorBase<CSceneWorldObjectListChunk::ShiftElementsRight(
					int elem,
					int num);  // 1224
		CUtlMemory<CSceneWorldObjectListChunk::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneWorldObjectListChunk::Element(
			int i);  // 1225
		CopyConstruct<CSceneWorldObjectListChunk*>(CSceneWorldObjectListChunk** pMemory,
								CSceneWorldObjectListChunk* const& src);  // 1225
		CUtlVectorBase<CSceneWorldObjectListChunk::InsertBefore(
				int elem,
				CSceneWorldObjectListChunk* const& src);  // 1187
		CUtlVectorBase<CSceneWorldObjectListChunk::AddToHead(
				CSceneWorldObjectListChunk* const& src);  // 891
		CSceneWorld::IsFreed(); // 357
		CSceneWorld::VerifyWorld(); // 893
		CUtlMemory<CSceneWorldObjectListChunk::NumAllocated(); // 1196
		CUtlMemory<CSceneWorldObjectListChunk::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneWorldObjectListChunk::Element(
			int i);  // 1201
		CopyConstruct<CSceneWorldObjectListChunk*>(CSceneWorldObjectListChunk** pMemory,
								CSceneWorldObjectListChunk* const& src);  // 1201
		CUtlMemory<CSceneWorldObjectListChunk::Base(); // 112
		CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 368
		CUtlVectorBase<CSceneWorldObjectListChunk::ResetDbgInfo(); // 824
		CUtlVectorBase<CSceneWorldObjectListChunk::GrowMemory(
				int num);  // 1198
		CUtlVectorBase<CSceneWorldObjectListChunk::AddToTail(
				CSceneWorldObjectListChunk* const& src);  // 886
		CSceneWorldObjectListChunk::NumObjects(); // 875
	}
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 943
	Lock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
			const CThreadMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 838
	CUtlVectorBase<CSceneWorldObjectListChunk::RemoveAll(); // 903
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 904
} /* size: 0, variables: 1, inline expansions: 7 (235 bytes) */

// <02EF9850> ../scenesystem/scenesystem.cpp:907
// variables: 6
// function calls: 43
void CSceneWorld::MoveAllObjectsToAnotherSceneWorld(ISceneWorld* pDestinationWorld)
{
	const char   __FUNCTION__; // 64055
	CSceneWorld* pDest; // 911
	CSceneObject* pObjToKill; // 922
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 909
	}
	{
		int i; // 914
		CSceneWorld::IsFreed(); // 357
		CSceneWorld::VerifyWorld(); // 917
		CSceneWorld::IsFreed(); // 357
		CSceneWorld::VerifyWorld(); // 918
	}
	CSceneWorld::IsFreed(); // 909
	{
	}
	assert_cast<CSceneWorld*, ISceneWorld>(ISceneWorld* pSource); // 462
	assert_cast<CSceneWorld*, ISceneWorld>(ISceneWorld* pSource); // 911
	CSceneWorld::IsFreed(); // 357
	CSceneWorld::VerifyWorld(); // 912
	CSceneWorld::IsFreed(); // 357
	CSceneWorld::VerifyWorld(); // 913
	ThreadPause(void); // 173
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 168
	CTSListBase::Push(
		TSLNodeBase_t* pNode);  // 1080
	CTSQueue<CSceneObject::FreeNode(
		Node_t* pNode);  // 1103
	CTSQueue<CSceneObject::PopItem(
		CSceneObject** pResult);  // 923
	ThreadPause(void); // 208
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	CTSListBase::Pop(); // 1085
	CopyConstruct<CSceneObject*>(CSceneObject** pMemory,
					CSceneObject* const& src);  // 1090
	{
	}
	{
	}
	{
		Node_t* pCurEnd; // 977
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 1147
		CTSQueue<CSceneObject::InterlockedCompareExchangeNodeLink(
							volatile union NodeLink_t* pLink,
							const union NodeLink_t& value,
							const union NodeLink_t& comperand);  // 1135
		CTSQueue<CSceneObject::FinishPush(
				Node_t* pNode,
				const union NodeLink_t& oldTail);  // 985
		{
		}
		ThreadInterlockedCompareExchange64(volatile int64* p,
							int64 value,
							int64 comparand);  // 416
		ThreadInterlockedCompareExchangePointer(volatile void** p,
							void* value,
							void* comparand);  // 1142
		CTSQueue<CSceneObject::InterlockedCompareExchangeNode(
						volatile Node_t** ppNode,
						Node_t* value,
						Node_t* comperand);  // 977
	}
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 1147
	CTSQueue<CSceneObject::InterlockedCompareExchangeNodeLink(
						volatile union NodeLink_t* pLink,
						const union NodeLink_t& value,
						const union NodeLink_t& comperand);  // 1135
	CTSQueue<CSceneObject::FinishPush(
			Node_t* pNode,
			const union NodeLink_t& oldTail);  // 991
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<int, 4>::operator++(); // 582
	CInterlockedIntT<int, 4>::operator++(
			int);  // 993
	CTSQueue<CSceneObject::Push(
		Node_t* pNode);  // 1091
	Node_t::Node_t(); // 1088
	CTSQueue<CSceneObject::PushItem(
		CSceneObject* const& init);  // 925
	CSceneWorld::IsFreed(); // 357
	CSceneWorld::VerifyWorld(); // 927
	CSceneWorld::IsFreed(); // 357
	CSceneWorld::VerifyWorld(); // 928
} /* size: 0, variables: 3, inline expansions: 32 (1582 bytes) */

// <02EF95EE> ../scenesystem/scenesystem.cpp:931
// variables: 3
// function calls: 7
void CSceneWorld::DeleteEndOfFrameObjects()
{
	const char   __FUNCTION__; // 63790
	CSceneObject* pObjToKill; // 934
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 933
	}
	CSceneWorld::IsFreed(); // 933
	ThreadPause(void); // 173
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 168
	CTSListBase::Push(
		TSLNodeBase_t* pNode);  // 1080
	CTSQueue<CSceneObject::FreeNode(
		Node_t* pNode);  // 1103
	CTSQueue<CSceneObject::PopItem(
		CSceneObject** pResult);  // 935
} /* size: 0, variables: 2, inline expansions: 7 (302 bytes) */

// <02EF934B> ../scenesystem/scenesystem.cpp:942
// variables: 5
// function calls: 5
void CSceneWorld::GetWorldBounds(Vector& vecMins, Vector& vecMaxes)
{
	const char   __FUNCTION__; // 63547
	const float  RADIUS; // 946
	const Vector  WORLD_MINS; // 947
	const Vector  WORLD_MAXES; // 948
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 944
	}
	CSceneWorld::IsFreed(); // 944
	Vector::operator=(
			const Vector& vOther);  // 949
	Vector::operator=(
			const Vector& vOther);  // 950
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 947
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 948
} /* size: 0, variables: 4, inline expansions: 5 (97 bytes) */

// <02F3057A> ../scenesystem/scenesystem.cpp:953
// variable: 1
// function call: 1
void CSceneWorld::GetAllSceneObjects(CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> >& objectsOut)
{
	CSceneWorld::IsFreed(); // 955
	{
	}
	{
		int nSubList; // 956
	}
} /* size: 0, inline expansions: 1 (0 bytes) */

// <02EF92B8> ../scenesystem/scenesystem.cpp:953
// variables: 3
void CSceneWorld::GetAllSceneObjects(CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> >& objectsOut)
{
	const char   __FUNCTION__; // 63655
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 955
	}
	{
		int nSubList; // 956
	}
} /* size: 0, variables: 1 */

// <02F304E6> ../scenesystem/scenesystem.cpp:962
// variables: 2
// function call: 1
void CSceneWorld::GetSceneObjectCount()
{
	int nResult; // 965
	CSceneWorld::IsFreed(); // 964
	{
	}
	{
		int nSubList; // 966
	}
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <02EF922B> ../scenesystem/scenesystem.cpp:962
// variables: 4
void CSceneWorld::GetSceneObjectCount()
{
	const char   __FUNCTION__; // 63682
	int nResult; // 965
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 964
	}
	{
		int nSubList; // 966
	}
} /* size: 0, variables: 2 */

// <02EF8E7E> ../scenesystem/scenesystem.cpp:974
// variables: 2
// function calls: 10
void CSceneWorld::GetWorldDebugName()
{
	const char   __FUNCTION__; // 63628
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 976
	}
	CSceneWorld::IsFreed(); // 976
	CUtlSymbol::CUtlSymbol(
			const CUtlSymbol& sym);  // 977
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 3047
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 3053
	CThreadRWLock::LockForRead(
			const char* pFileName,
			int nLineNumber);  // 267
	CUtlSymbol::CUtlSymbol(
			const CUtlSymbol& sym);  // 268
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 3058
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 3064
	CThreadRWLock::UnlockRead(
			const char* pFileName,
			int nLineNumber);  // 269
	CUtlSymbolTableMT::String(
		CUtlSymbol id);  // 977
} /* size: 0, variables: 1, inline expansions: 10 (1186 bytes) */

// <02EF8648> ../scenesystem/scenesystem.cpp:981
// variables: 9
// function calls: 30
void CSceneWorld::OnPVSChanged()
{
	const char   __FUNCTION__; // 63493
	CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> > objects; // 990
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 988
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 989
	}
	{
		CSceneObject* pObject; // 992
		CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> >& __for_range; // 40940
		iterator __for_begin; // 62973
		iterator __for_end; // 62973
		CUtlMemory<CSceneObject::Base(); // 112
		CUtlVectorBase<CSceneObject::Base(); // 102
		CUtlVectorBase<CSceneObject::begin(); // 992
		CUtlVectorBase<CSceneObject::Count(); // 104
		CUtlVectorBase<CSceneObject::end(); // 992
		CSceneObject::GetBounds(
				Vector& vecWorldMins,
				Vector& vecWorldMaxes);  // 1463
		Vector::Vector(); // 1462
		Vector::Vector(); // 1462
		CSceneObject::RecomputePVS(
				IPVS* pPVS);  // 1453
		CSceneObject::RecomputePVS(
				IPVS* pPVS);  // 994
	}
	CSceneWorld::IsFreed(); // 988
	CSceneWorld::IsFreed(); // 328
	{
	}
	CSceneWorld::IsBusy(); // 989
	CUtlMemory<CSceneObject::ValidateGrowSize(); // 475
	CUtlMemory<CSceneObject::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CSceneObject::ResetDbgInfo(); // 530
	CUtlVectorBase<CSceneObject::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CSceneObject::CUtlVector(); // 990
	CSceneWorld::IsFreed(); // 955
	{
	}
	{
		int nSubList; // 956
	}
	CSceneWorld::GetAllSceneObjects(
				CUtlVector<CSceneObject*, CUtlMemory<CSceneObject*, int> >& objectsOut);  // 991
	CUtlMemory<CSceneObject::Purge(); // 903
	CUtlMemory<CSceneObject::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneObject::Purge(); // 1799
	CUtlVectorBase<CSceneObject::RemoveAll(); // 1798
	CUtlVectorBase<CSceneObject::Purge(); // 560
	ValidateAlignment<CSceneObject*>(void); // 508
	CUtlMemory<CSceneObject::Purge(); // 510
	CUtlMemory<CSceneObject::~CUtlMemory(); // 562
	CUtlVectorBase<CSceneObject::~CUtlVectorBase(); // 410
	CUtlVector<CSceneObject::~CUtlVector(); // 996
} /* size: 0, variables: 2, inline expansions: 20 (355 bytes) */

// <02EF8566> ../scenesystem/scenesystem.cpp:999
// variables: 3
void CSceneSystem::ComputeScratchTargetActualSize(const SceneScratchRenderTargetInfo_t& info, int* pWidth, int* pHeight)
{
	const char   __FUNCTION__; // 63974
	{
		const RenderDeviceInfo_t& deviceInfo; // 1014
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1023
	}
} /* size: 0, variables: 1 */

// <02EF7B6B> ../scenesystem/scenesystem.cpp:1029
// variables: 5
// function calls: 39
void CSceneSystem::AllocateActualScratchRenderTarget(int nUniqueId, ScratchRenderTarget_t& target)
{
	const char   __FUNCTION__; // 64055
	CTextureCreationDesc specRT; // 1035
	CPathBufferString tempStr; // 1055
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1032
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1033
	}
	V_memset(void* dest,
		int fill,
		size_t count);  // 142
	CTextureDesc::CTextureDesc(); // 221
	Vector4D::Vector4D(); // 221
	CUtlMemory<TextureCreationExtraData_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<TextureCreationExtraData_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVector(); // 221
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 222
	CTextureCreationDesc::CTextureCreationDesc(); // 1035
	IsDepthFormat(ImageFormat fmt); // 1043
	Vector4D::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz,
		vec_t iw);  // 1052
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<200>::CBufferStringN(); // 1055
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 781
	CBufferString::operator char const*(); // 1057
	CWeakHandle<InfoForResourceTypeCTextureBase>::GetBinding(); // 673
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<int, 4>::operator++(); // 570
	CStrongHandle<InfoForResourceTypeCTextureBase>::Init(
		ResourceHandleTyped_t hResource);  // 673
	CStrongHandle<InfoForResourceTypeCTextureBase>::operator=(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1057
	CBufferString::~CBufferString(); // 587
	CBufferStringN<200>::~CBufferStringN(); // 1058
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::RemoveAll(); // 1798
	CUtlMemory<TextureCreationExtraData_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 903
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 1799
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Purge(); // 560
	ValidateAlignment<TextureCreationExtraData_t>(void); // 508
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 510
	CUtlMemory<TextureCreationExtraData_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVector(); // 234
	CTextureCreationDesc::~CTextureCreationDesc(); // 1058
	operator&(RuntimeTextureSpecificationFlags_t a,
			RuntimeTextureSpecificationFlags_t b);  // 35
	operator&=(RuntimeTextureSpecificationFlags_t& a,
			RuntimeTextureSpecificationFlags_t b);  // 1047
} /* size: 0, variables: 3, inline expansions: 39 (711 bytes) */

// <02EF715E> ../scenesystem/scenesystem.cpp:1060
// variables: 11
// function calls: 34
void CSceneSystem::AllocateScratchRenderTargets(CUtlStringToken groupName, int nSerialNumber, int nCount, const SceneScratchRenderTargetInfo_t* pInfo)
{
	CScratchRenderTargetEditScope srtEditScope; // 1062
	const char   __FUNCTION__; // 63925
	{
		int i; // 1065
		{
			ScratchRenderTarget_t& target; // 1067
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
					int i);  // 1067
			CUtlStringToken::operator!=(
					const CUtlStringToken& other);  // 1068
		}
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1065
	}
	{
		CRenderContextPtr pRenderContext; // 1084
		CRenderContextPtr::CRenderContextPtr<>(
					IRenderDevice* pDevice,
					const char* pDebugStringFmt);  // 1084
		CRenderContextPtr::operator->(); // 1085
		CRenderContextPtr::Release(); // 845
		CRenderContextPtr::~CRenderContextPtr(); // 1086
	}
	{
		int i; // 1088
		{
			int t; // 1092
			ScratchRenderTarget_t& target; // 1093
			ImageFormat fmt; // 1095
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1090
			}
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
			}
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::Base(); // 112
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Base(); // 368
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::GrowMemory(
					int num);  // 1145
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::NumAllocated(); // 1143
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Element(
				int i);  // 1148
			memset(void* __dest,
				int __ch,
				size_t __len);  // 67
			V_memset(void* dest,
				int fill,
				size_t count);  // 50
			SceneScratchRenderTargetInfo_t::SceneScratchRenderTargetInfo_t(); // 1294
			CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 1294
			CUtlStringToken::CUtlStringToken(); // 1294
			ScratchRenderTarget_t::ScratchRenderTarget_t(); // 1479
			Construct<CSceneSystem::ScratchRenderTarget_t>(ScratchRenderTarget_t* pMemory); // 1148
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::AddToTail(); // 1092
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
					int i);  // 1093
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 1094
		}
	}
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 1715
	CSceneSystem::GetScratchRenderTargetMutex(); // 1715
	CSceneSystem::IncrementSRTMutexLockCount(
					int nAmount);  // 1716
	CScratchRenderTargetEditScope::CScratchRenderTargetEditScope(); // 1062
	CSceneSystem::IncrementSRTMutexLockCount(
					int nAmount);  // 1721
	CSceneSystem::GetScratchRenderTargetMutex(); // 1722
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 1722
	CScratchRenderTargetEditScope::~CScratchRenderTargetEditScope(); // 1107
} /* size: 0, variables: 2, inline expansions: 8 (264 bytes) */

// <02EF6B45> ../scenesystem/scenesystem.cpp:1113
// variables: 4
// function calls: 22
void CSceneSystem::AllocateDebugScratchRenderTarget(const SceneScratchRenderTargetInfo_t& info)
{
	const char   __FUNCTION__; // 64028
	int t; // 1117
	ScratchRenderTarget_t& target; // 1118
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1115
	}
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::NumAllocated(); // 1143
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
			int i);  // 602
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Element(
		int i);  // 1148
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 50
	SceneScratchRenderTargetInfo_t::SceneScratchRenderTargetInfo_t(); // 1294
	CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 1294
	CUtlStringToken::CUtlStringToken(); // 1294
	ScratchRenderTarget_t::ScratchRenderTarget_t(); // 1479
	Construct<CSceneSystem::ScratchRenderTarget_t>(ScratchRenderTarget_t* pMemory); // 1148
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::Base(); // 112
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Base(); // 368
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::GrowMemory(
			int num);  // 1145
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::AddToTail(); // 1117
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1120
	CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
			int i);  // 588
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
			int i);  // 1118
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 1119
	CSceneSystem::GetFrameUpdateCounter(); // 1122
} /* size: 0, variables: 3, inline expansions: 22 (798 bytes) */

// <02EF6AE6> ../scenesystem/scenesystem.cpp:1128
// function call: 1
void CSceneSystem::GetScratchRenderTargetCount()
{
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1130
} /* size: 11, inline expansions: 1 (0 bytes) */

// <02EF6898> ../scenesystem/scenesystem.cpp:1133
// variables: 3
// function calls: 8
void CSceneSystem::GetScratchRenderTargetDesc(int nFirst, int nCount, SceneScratchRenderTargetDesc_t* pDesc)
{
	int nLast; // 1135
	{
		int i; // 1137
		{
			const ScratchRenderTarget_t& target; // 1139
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
					int i);  // 1139
			CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
			FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
			CStrongHandle<InfoForResourceTypeCTextureBase>::operator CWeakHandle<InfoForResourceTypeCTextureBase>(); // 1144
			CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 331
			CWeakHandle<InfoForResourceTypeCTextureBase>::operator=(
					const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1144
		}
	}
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1135
} /* size: 124, variables: 1, inline expansions: 1 (0 bytes) */

// <02EF66E5> ../scenesystem/scenesystem.cpp:1150
// variables: 3
// function calls: 5
void CSceneSystem::MarkScratchRenderTargetUsed(int nIndex, bool bExactDimensions)
{
	{
		ScratchRenderTarget_t& target; // 1154
		const int  nNumFramesForExactMatch; // 1161
		const uint32  nKeepUntilFrame; // 1162
		CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
				int i);  // 1154
		CSceneSystem::GetFrameUpdateCounter(); // 1162
		Max<unsigned int>(const unsigned int& val1,
					const unsigned int& val2);  // 1167
	}
	CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1152
} /* size: 60, inline expansions: 1 (0 bytes) */

// <02F3E132> ../scenesystem/scenesystem.cpp:1174
// variables: 2
void CSceneSystem::IsScratchRenderTargetValid(const ScratchRenderTarget_t& target)
{
	int nWidth; // 1176
	int nHeight; // 1176
} /* size: 0, variables: 2 */

// <02EF64C2> ../scenesystem/scenesystem.cpp:1189
// variables: 7
// function calls: 2
void CSceneSystem::SetMainSwapChain(SwapChainHandle_t hSwapChain)
{
	RenderMultisampleType_t nPrevMultisampleType; // 1207
	const char   __FUNCTION__; // 63601
	int nSwapChainWidth; // 1211
	int nSwapChainHeight; // 1212
	{
		int32 nSwapChainWidth; // 1199
		int32 nSwapChainHeight; // 1200
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1210
	}
	CAppSystemDict::IsInToolsMode(); // 110
	CTier1Application::IsInToolsMode(); // 1194
} /* size: 0, variables: 4, inline expansions: 2 (22 bytes) */

// <02EF6254> ../scenesystem/scenesystem.cpp:1225
// variables: 6
// function calls: 5
void CSceneSystem::ComputePipelineRenderTargetInfo(int nWidth, int nHeight, RenderMultisampleType_t nMultisampleType, bool bToolView, PipelineRenderTargetInfo_t* pInfo)
{
	RenderDeviceInfo_t temp; // 1227
	const RenderDeviceInfo_t* pMainInfo; // 1228
	int nActualWidth; // 1251
	int nActualHeight; // 1251
	const char   __FUNCTION__; // 64001
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1275
	}
	V_memset(void* dest,
		int fill,
		size_t count);  // 213
	RenderDisplayMode_t::RenderDisplayMode_t(); // 239
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 239
	RenderDeviceInfo_t::RenderDeviceInfo_t(); // 1227
} /* size: 0, variables: 5, inline expansions: 5 (131 bytes) */

// <02EF6189> ../scenesystem/scenesystem.cpp:1278
// variable: 1
void CSceneSystem::ComputePipelineRenderTargetInfo(SwapChainHandle_t hSwapChain, bool bToolView, PipelineRenderTargetInfo_t* pInfo)
{
	const RenderDeviceInfo_t& info; // 1280
} /* size: 76, variables: 1 */

// <02EF51A3> ../scenesystem/scenesystem.cpp:1289
// variables: 16
// function calls: 60
void CSceneSystem::FrameUpdate()
{
	const char   __FUNCTION__; // 63466
	{
		CScratchRenderTargetEditScope srtEditScope; // 1292
		{
			int i; // 1295
			{
				ScratchRenderTarget_t& target; // 1297
				CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
						int i);  // 588
				CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
						int i);  // 1297
				CUtlStringToken::operator==(
						const CUtlStringToken& other);  // 1299
			}
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1295
		}
		{
			FrameBufferScratchTexInfo_t& target; // 1310
			CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined_t, CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int> >& __for_range; // 9856
			iterator __for_begin; // 7387
			iterator __for_end; // 7387
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Base(); // 914
			{
				int i; // 915
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Count(); // 915
				CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IsValid(); // 917
			}
			NextHandle(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, Defa this,
					handle_t start);  // 208
			FirstHandle(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, Defa this); // 387
			iterator::iterator(
				CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunc pTable,
				UtlHashHandle_t hHandle);  // 387
			begin(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this); // 1310
			iterator::iterator(
				CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunc pTable,
				UtlHashHandle_t hHandle);  // 388
			end(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this); // 1310
			iterator::operator!=(
					const iterator& other);  // 1310
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
					int i);  // 295
			Element(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this,
				handle_t idx);  // 346
			iterator::operator*(); // 1310
			{
				int i; // 915
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Count(); // 915
				CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IsValid(); // 917
			}
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Base(); // 914
			NextHandle(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, Defa this,
					handle_t start);  // 350
			iterator::operator++(); // 1310
			Mix32HashFunctor::operator(
					uint32 n);  // 267
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::Count(); // 747
			IdealIndex(uint32_if32BitStorage h,
					uint32 m);  // 653
			CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IdealIndex(
					uint32 slotmask);  // 656
			CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IdealIndex(
					uint32 slotmask);  // 667
			DoLookup<unsigned int>(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, Defa this,
						unsigned int x,
						unsigned int h,
						handle_t* pPreviousInChain);  // 749
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
					int i);  // 756
			CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IdealIndex(
					uint32 slotmask);  // 757
			CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 1621
			FrameBufferScratchTexInfo_t::~FrameBufferScratchTexInfo_t(); // 51
			CUtlKeyValuePair<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::~CUtlKeyValuePair(); // 1526
			Destruct<CUtlKeyValuePair<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t> >(CUtlKeyValuePair<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>* pMemory); // 761
			CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::MarkInvalid(); // 760
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
					int i);  // 761
			CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
					int i);  // 769
			{
				unsigned int chainid; // 776
				unsigned int nextIdx; // 777
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
						int i);  // 781
				CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::IdealIndex(
						uint32 slotmask);  // 781
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
						int i);  // 789
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
						int i);  // 790
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
						int i);  // 790
				{
					int i; // 121
				}
				CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::MoveDataFrom(
						CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>& src);  // 790
				CUtlMemory<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>, int>::operator[](
						int i);  // 791
				CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>::MarkInvalid(); // 791
			}
			DoRemove<unsigned int>(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this,
						unsigned int x,
						unsigned int h);  // 267
			Remove(const CUtlHashtable<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t, DefaultHashFunctor<unsigned int>, DefaultEqu this,
				KeyArg_t k);  // 1319
		}
		CSceneSystem::GetScratchRenderTargetMutex(); // 1715
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 1715
		CSceneSystem::IncrementSRTMutexLockCount(
						int nAmount);  // 1716
		CScratchRenderTargetEditScope::CScratchRenderTargetEditScope(); // 1292
		CSceneSystem::IncrementSRTMutexLockCount(
						int nAmount);  // 1721
		CSceneSystem::GetScratchRenderTargetMutex(); // 1722
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 1722
		CScratchRenderTargetEditScope::~CScratchRenderTargetEditScope(); // 1321
	}
	{
		int i; // 1328
		{
			ScratchRenderTarget_t& target; // 1330
			{
				const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1334
			}
			CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::operator[](
					int i);  // 1330
			CSceneSystem::IsScratchRenderTargetValid(
							const ScratchRenderTarget_t& target);  // 1331
		}
		CUtlVectorBase<CSceneSystem::ScratchRenderTarget_t, CUtlMemory<CSceneSystem::ScratchRenderTarget_t, int> >::Count(); // 1328
	}
	CSceneSystem::GetGPUProfilerModeInline(); // 1344
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <02EF41C9> ../scenesystem/scenesystem.cpp:1359
// variables: 12
// function calls: 50
void CSceneSystem::FillOutViewConstants(PerViewConstantBuffer_t* pViewConstantsOut, const CFrustum* pFrustum, const RenderViewport_t& viewport, const RenderTargetDesc_t& rtDesc, float flTonemapScalar, float32 flCurTime, const Vector4D& vClipPlane)
{
	Vector vForward; // 1368
	float flRenderTime; // 1370
	const float  flNearPlane; // 1402
	const float  flFarPlane; // 1403
	const char   __FUNCTION__; // 63709
	int nRenderTargetWidth; // 1416
	int nRenderTargetHeight; // 1417
	const CMTAtlasDesc_t& morphTextureAtlasDesc; // 1440
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1412
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1413
	}
	{
		const VMatrix& proj; // 1455
		{
			VMatrix matProjectionToWorld; // 1467
			VMatrix::VMatrix(); // 1467
			VMatrix::Identity(); // 1468
		}
		CFrustum::GetReverseZProj(); // 1455
		Vector::Vector(
			vec_t X,
			vec_t Y,
			vec_t Z);  // 1431
		Vector::operator-(); // 1462
		Vector4D::operator=(
				const Vector4D& vOther);  // 1462
		ConVar::GetInt(); // 351
		ConVar::GetBool(); // 1465
		Vector4D::Vector4D(
			const Vector& xyz,
			vec_t W);  // 1462
	}
	matrix3x4_t::GetRow(
		int nRow);  // 629
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 1431
	Vector::operator-(); // 631
	CFrustum::ViewForward(
			Vector& vViewForward);  // 1369
	Vector::Vector(); // 1368
	matrix3x4_t::Base(); // 560
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 560
	VMatrix::Init(
		const matrix3x4_t& matrix3x4);  // 499
	VMatrix::VMatrix(
		const matrix3x4_t& matrix3x4);  // 1373
	CFrustum::GetReverseZProj(); // 1377
	CFrustum::GetReverseZViewProjTranspose(); // 1380
	CFrustum::GetInvReverseZViewProjTranspose(); // 1381
	Vector4D::Vector4D(
		const float* pFloat);  // 892
	MatrixGetRowAsVector4D(const VMatrix& src,
				MatrixAxisType_t nRow);  // 1382
	Vector4D::operator=(
			const Vector4D& vOther);  // 1382
	Vector::operator=(
			const Vector& vOther);  // 1398
	Vector::operator=(
			const Vector& vOther);  // 1399
	Vector::operator=(
			const Vector& vOther);  // 1400
	CFrustum::GetCameraNearPlane(); // 1402
	CFrustum::GetCameraFarPlane(); // 1403
	CFrustum::GetCameraFOV(); // 1405
	Vector::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz);  // 1408
	Vector4D::operator=(
			const Vector4D& vOther);  // 1426
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1428
	Vector4D::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz,
		vec_t iw);  // 1430
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1429
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1436
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1437
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1438
	ConVar::GetInt(); // 351
	ConVar::GetBool(); // 1452
	Vector2D::Init(
		vec_t ix,
		vec_t iy);  // 1441
	DEG2RAD(float flDegrees); // 1444
	DEG2RAD(float flDegrees); // 1445
	DEG2RAD(float flDegrees); // 1446
	CFrustum::GetProj(); // 1386
	CFrustum::GetViewProjTranspose(); // 1389
	CFrustum::GetInvViewProjTranspose(); // 1390
	Vector4D::Vector4D(
		const float* pFloat);  // 892
	MatrixGetRowAsVector4D(const VMatrix& src,
				MatrixAxisType_t nRow);  // 1391
} /* size: 0, variables: 8, inline expansions: 41 (1051 bytes) */

// <02EF29B7> ../scenesystem/scenesystem.cpp:1488
// variables: 34
// function calls: 76
void CreatePerLayerViewConstants(PerViewConstantBuffer_t* pViewConstantsOut, const CSceneView* pView, const CSceneLayer* pLayer, float32 flCurTime, bool bCameraTranslationInProjection, int nCameraIndex, int nGpuIndex)
{
	const CFrustum* pFrustum; // 1498
	Vector4D vProjCol3; // 1520
	float flSpectatorRemoveRollL; // 1527
	float flSpectatorRemoveRollR; // 1528
	CFrustum frustumVrLeft; // 1530
	CFrustum frustumVrRight; // 1530
	float flTonemapScalar; // 1585
	const CFrustum& currFrameFrustum; // 1600
	const CFrustum& prevFrameFrustum; // 1601
	const float  flW; // 1605
	const float  flH; // 1606
	VMatrix matScreen; // 1607
	RenderMultisampleType_t nMsaaType; // 1615
	Vector4D vClipPlane; // 1621
	{
		int nUseOverride; // 1502
		AlignedByteArrayExplicit_t<2, CFrustum, 16>::Base(); // 269
		CUtlMemoryFixed<CFrustum, 2>::Base(); // 273
		CUtlMemoryFixed<CFrustum, 2>::operator[](
				int i);  // 595
		CUtlVectorBase<CFrustum, CUtlMemoryFixed<CFrustum, 2> >::operator[](
				int i);  // 1503
	}
	{
		const CFrustum* pRightEyeFrustum; // 1536
		const VMatrix& proj; // 1561
		{
			int i; // 1550
			Vector::operator=(
					const Vector& vOther);  // 1552
		}
		{
			int i; // 1556
			CFrustum::GetViewProjTranspose(); // 1558
		}
		Vector::operator=(
				const Vector& vOther);  // 1533
		CUtlVectorBase<CFrustum, CUtlMemoryFixed<CFrustum, 2> >::Count(); // 299
		CSceneLayer::IsOverridingFrustum(); // 1537
		Vector4D::Vector4D(
			vec_t X,
			vec_t Y,
			vec_t Z,
			vec_t W);  // 1562
	}
	{
		int i; // 1572
		Vector::Vector(
			vec_t X,
			vec_t Y,
			vec_t Z);  // 1431
		Vector::operator-(); // 1581
		Vector4D::operator=(
				const Vector4D& vOther);  // 1581
		Vector4D::Vector4D(
			const Vector& xyz,
			vec_t W);  // 1581
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1496
	ISceneView::GetFrustum(); // 1498
	CUtlVectorBase<CFrustum, CUtlMemoryFixed<CFrustum, 2> >::Count(); // 299
	CSceneLayer::IsOverridingFrustum(); // 1499
	CUtlMemory<CFrustum, int>::operator[](
			int i);  // 595
	CUtlVectorBase<CFrustum, CUtlMemory<CFrustum, int> >::operator[](
			int i);  // 1507
	CSceneView::GetRenderAttributes(); // 1516
	{
		__m128i retVal; // 1105
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 648
		_mm_set1_epi32(int __A); // 1106
	}
	ReplicateIX4<>(int nValue); // 376
	{
		int nIndex; // 381
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 272
		{
			const OverflowChunk_t& p; // 279
			const CUtlIntrusiveList<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>& __for_range; // 38814
			CUtlIntrusiveListIterator<const CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t> __for_begin; // 38824
			CUtlIntrusiveListIterator<const CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t> __for_end; // 38834
			CUtlIntrusiveList<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::Head(); // 1160
			CUtlIntrusiveListIterator<const CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							const OverflowChunk_t* pNode);  // 1160
			CUtlIntrusiveList<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::begin(); // 279
			CUtlIntrusiveListIterator<const CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							const OverflowChunk_t* pNode);  // 1165
			CUtlIntrusiveList<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::end(); // 279
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 281
			CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>::GetValuePtrFromIndex(
						int nIdx);  // 284
			CUtlIntrusiveListIterator<const CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::OverflowChunk_t>::operator++(); // 279
		}
		CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				const IntVector4D ** pValueOut);  // 270
		CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>::GetValuePtrFromIndex(
					int nIdx);  // 275
		CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				const IntVector4D ** pValueOut);  // 381
	}
	CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::GetValueOrDefault(
				uint32 k,
				IntVector4D nDefault);  // 393
	CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::GetValueOrDefault(
				CUtlStringToken nTok,
				IntVector4D nDefault);  // 465
	CRenderAttributes::GetIntValue(
			CUtlStringToken nTokenID,
			int nDefaultValue);  // 1516
	ConVar::GetInt(); // 351
	ConVar::GetBool(); // 1570
	CFrustum::GetInvViewProjTranspose(); // 1603
	VMatrix::Init(
		vec_t m00,
		vec_t m01,
		vec_t m02,
		vec_t m03,
		vec_t m10,
		vec_t m11,
		vec_t m12,
		vec_t m13,
		vec_t m20,
		vec_t m21,
		vec_t m22,
		vec_t m23,
		vec_t m30,
		vec_t m31,
		vec_t m32,
		vec_t m33);  // 488
	VMatrix::VMatrix(
		vec_t m00,
		vec_t m01,
		vec_t m02,
		vec_t m03,
		vec_t m10,
		vec_t m11,
		vec_t m12,
		vec_t m13,
		vec_t m20,
		vec_t m21,
		vec_t m22,
		vec_t m23,
		vec_t m30,
		vec_t m31,
		vec_t m32,
		vec_t m33);  // 1610
	CFrustum::GetInvReverseZProj(); // 1611
	CFrustum::GetReverseZProj(); // 1612
	matrix3x4_t::Base(); // 560
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 560
	VMatrix::Init(
		const matrix3x4_t& matrix3x4);  // 499
	VMatrix::VMatrix(
		const matrix3x4_t& matrix3x4);  // 1613
	CFrustum::GetReverseZViewProj(); // 1613
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
	StaticInvalidHandle(void); // 1616
	CWeakHandle<InfoForResourceTypeCTextureBase>::operator!=(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& hResource);  // 1616
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1617
	RenderMultisampleTypeNumSamples(RenderMultisampleType_t msaaType); // 1619
	Vector4D::Vector4D(); // 1621
	Vector::operator=(
			const Vector& vOther);  // 159
	VPlane::ConvertToPlaneEquation(
				Vector4D& vOut);  // 1622
	CSceneLayer::GetRenderTargetDesc(); // 1623
	CFrustum::~CFrustum(); // 1625
	CFrustum::~CFrustum(); // 1625
} /* size: 2096, variables: 14, inline expansions: 38 (1850 bytes) */

// <02EF2276> ../scenesystem/scenesystem.cpp:1627
// variables: 6
// function calls: 19
void CSceneSystem::BeginRenderingViews(IRenderDevice* pRenderDevice, bool bUpdateStats)
{
	const char   __FUNCTION__; // 63682
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_1649; // 1649
	{
		int* _pCrash; // 1632
	}
	{
		int* _pCrash; // 1638
	}
	{
		int* _pCrash; // 1643
	}
	{
		CRenderContextPtr pRenderContext; // 1673
		CRenderContextPtr::CRenderContextPtr<>(
					IRenderDevice* pDevice,
					const char* pDebugStringFmt);  // 1673
		CRenderContextPtr::Release(); // 845
		CRenderContextPtr::~CRenderContextPtr(); // 1674
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1632
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1638
	CInterlockedIntT<int, 4>::operator!=(
			int rhs);  // 129
	CUtlMultiJobProcessor::JobsRunning(); // 1641
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1643
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1649
	CSceneSystem::InitLightingSystemForFrame(); // 1656
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 1675
} /* size: 633, variables: 2, inline expansions: 16 (524 bytes) */

// <02EF20E6> ../scenesystem/scenesystem.cpp:1678
// variable: 1
// function calls: 3
void CSceneSystem::NewView(const char* pszDebugName, ISceneWorld* pWorld, const CPVSBits* pVis)
{
	CSceneView* pNewView; // 1680
	CUtlMemoryPool<CSceneView>::Alloc(); // 246
	operator new(size_t nBytes); // 1680
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 1683
} /* size: 153, variables: 1, inline expansions: 3 (43 bytes) */

// <02EF1821> ../scenesystem/scenesystem.cpp:1696
// variables: 2
// function calls: 24
void CSceneSystem::InstallTemplateViewFactory(const char* pViewTemplateName, SceneTemplateViewFactoryDelegate_t factory)
{
	const char   __FUNCTION__; // 63871
	{
		int* _pCrash; // 1700
	}
	CUtlSymbolTableMT::Find(
		const char* pString);  // 84
	CUtlSymbol::IsValid(); // 85
	CUtlStringMap<CUtlDelegate<void(ISceneView::Defined(
		const char* pString);  // 1698
	CUtlSymbol::IsValid(); // 64
	CUtlSymbolTable::AddStringElement(
			const char* pString);  // 222
	CUtlSymbolTableMT::AddStringElement(
			const char* pString);  // 37
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Count()>, CUtlMemory<CUtlDelegate<void(IScene this); // 43
	CUtlMemory<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 588
	CUtlVectorBase<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 47
	CUtlStringMap<CUtlDelegate<void(ISceneView::operator[](
			const char* pString);  // 1698
	CUtlAbstractDelegate::operator!(); // 1307
	FastDelegate2<ISceneView::IsEmpty(); // 1698
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1700
	CUtlSymbol::IsValid(); // 64
	CUtlSymbolTable::AddStringElement(
			const char* pString);  // 222
	CUtlSymbolTableMT::AddStringElement(
			const char* pString);  // 37
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Count()>, CUtlMemory<CUtlDelegate<void(IScene this); // 43
	CUtlMemory<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 588
	CUtlVectorBase<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 47
	CUtlStringMap<CUtlDelegate<void(ISceneView::operator[](
			const char* pString);  // 1704
	CUtlAbstractDelegate::SetMementoFrom(
			const CUtlAbstractDelegate& right);  // 843
	ClosurePtr<void (detail::GenericClass::::CopyFrom<FastDelegate2<ISceneView*, const CRenderAttributes*, void> >(
										FastDelegate2<ISceneView*, const CRenderAttributes*, void>* pParent,
										const CUtlAbstractDelegate& right);  // 1218
	FastDelegate2<ISceneView::operator=(
			const FastDelegate2<ISceneView*, const CRenderAttributes*, void>& x);  // 2188
	CUtlDelegate<void(ISceneView::operator=(
			const CUtlDelegate<void(ISceneView*, const CRenderAttributes*)> &);  // 1704
} /* size: 0, variables: 1, inline expansions: 24 (934 bytes) */

// <02F40CA5> ../scenesystem/scenesystem.cpp:1707
// function calls: 13
void CSceneSystem::RemoveTemplateViewFactory(const char* pViewTemplateName)
{
	CUtlSymbolTableMT::Find(
		const char* pString);  // 84
	CUtlSymbol::IsValid(); // 85
	CUtlStringMap<CUtlDelegate<void(ISceneView::Defined(
		const char* pString);  // 1710
	CUtlSymbol::IsValid(); // 64
	CUtlSymbolTable::AddStringElement(
			const char* pString);  // 222
	CUtlSymbolTableMT::AddStringElement(
			const char* pString);  // 37
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Count()>, CUtlMemory<CUtlDelegate<void(IScene this); // 43
	CUtlMemory<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 588
	CUtlVectorBase<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 47
	CUtlStringMap<CUtlDelegate<void(ISceneView::operator[](
			const char* pString);  // 1716
	CUtlAbstractDelegate::Clear(); // 1309
	FastDelegate2<ISceneView::Clear(); // 1716
	{
	}
	CSceneSystem::RemoveTemplateViewFactory(
					const char* pViewTemplateName);  // 1707
} /* size: 0, inline expansions: 13 (570 bytes) */

// <02EF17D7> ../scenesystem/scenesystem.cpp:1707
// variables: 2
void CSceneSystem::RemoveTemplateViewFactory(const char* pViewTemplateName)
{
	const char   __FUNCTION__; // 63844
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1712
	}
} /* size: 0, variables: 1 */

// <02EF11DD> ../scenesystem/scenesystem.cpp:1719
// variables: 2
// function calls: 17
void CSceneSystem::AddViewFromTemplate(const char* pViewTemplateName, const char* pszDebugName, const ISceneView* pParentView, const CFrustum& frustum, SwapChainHandle_t hSwapChain, ISceneWorld* pWorld, const RenderViewport_t& mainViewport, const CPVSBits* pVis, const CRenderAttributes* pAttributes)
{
	UtlSymId_t nId; // 1723
	ISceneView* pNewView; // 1730
	CUtlSymbol::IsValid(); // 88
	CUtlSymbolTable::FindElement(
			const char* pString);  // 245
	CUtlSymbolTableMT::FindElement(
			const char* pString);  // 90
	CUtlStringMap<CUtlDelegate<void(ISceneView::Find(
		const char* pString);  // 1723
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Count()>, CUtlMemory<CUtlDelegate<void(IScene this); // 53
	{
	}
	CUtlMemory<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 588
	CUtlVectorBase<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 54
	CUtlStringMap<CUtlDelegate<void(ISceneView::operator[](
			IndexType_t n);  // 1727
	CUtlAbstractDelegate::operator!(); // 1307
	FastDelegate2<ISceneView::IsEmpty(); // 1727
	CUtlVectorBase<CUtlDelegate<void(ISceneView::Count()>, CUtlMemory<CUtlDelegate<void(IScene this); // 53
	{
	}
	CUtlMemory<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 588
	CUtlVectorBase<CUtlDelegate<void(ISceneView::operator[](
			int i);  // 54
	CUtlStringMap<CUtlDelegate<void(ISceneView::operator[](
			IndexType_t n);  // 1731
	ClosurePtr<void (detail::GenericClass::::GetClosureThis()(ISceneView*, const CRenderAttributes*), void (*)(ISceneView*, const this); // 1277
	ClosurePtr<void (detail::GenericClass::::GetClosureMemPtr()(ISceneView*, const CRenderAttributes*), void (*)(ISceneView*, const this); // 1277
	FastDelegate2<ISceneView::operator(
			ISceneView* p1,
			const CRenderAttributes* p2);  // 1731
} /* size: 0, variables: 2, inline expansions: 17 (573 bytes) */

// <02EF0B1B> ../scenesystem/scenesystem.cpp:1736
// variable: 1
// function calls: 28
void CSceneSystem::GetAllActiveSceneWorlds(CUtlVector<ISceneWorld*, CUtlMemory<ISceneWorld*, int> >& activeSceneWorlds)
{
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_1738; // 1738
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 943
	Lock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
			const CThreadMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1738
	CUtlVectorBase<ISceneWorld::Count(); // 1739
	CUtlMemory<ISceneWorld::Base(); // 112
	CUtlVectorBase<ISceneWorld::Base(); // 1739
	CUtlMemory<ISceneWorld::NumAllocated(); // 782
	CUtlMemory<ISceneWorld::Base(); // 112
	CUtlVectorBase<ISceneWorld::Base(); // 368
	CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 824
	CUtlVectorBase<ISceneWorld::GrowMemory(
			int num);  // 784
	CUtlVectorBase<ISceneWorld::GrowVector(
			int num);  // 1445
	CUtlVectorBase<ISceneWorld::InsertMultipleBefore(
				int elem,
				int num);  // 1437
	CUtlVectorBase<ISceneWorld::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<ISceneWorld::AddMultipleToTail(
				int num);  // 1319
	CUtlVectorBase<ISceneWorld::RemoveMultipleFromTail(
				int num);  // 1323
	CUtlVectorBase<ISceneWorld::SetCount(
		int count);  // 1341
	CUtlMemory<ISceneWorld::Base(); // 112
	CUtlVectorBase<ISceneWorld::Base(); // 102
	CUtlVectorBase<ISceneWorld::begin(); // 1344
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<ISceneWorld*>(ISceneWorld* const* pFrom,
					ISceneWorld* const* pFromEnd,
					ISceneWorld** pTo);  // 173
	UtlTraitsCopyRange<ISceneWorld*>(ISceneWorld* const* pFrom,
					ISceneWorld* const* pFromEnd,
					ISceneWorld** pTo);  // 1344
	CUtlVectorBase<ISceneWorld::CopyArray(
			ISceneWorld* const* pArray,
			int size);  // 1739
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 1740
} /* size: 262, variables: 1, inline expansions: 28 (840 bytes) */

// <02EF0749> ../scenesystem/scenesystem.cpp:1742
// variable: 1
// function calls: 15
void CSceneSystem::RegisterActiveSceneWorld(CSceneWorld* pSceneWorld)
{
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_1744; // 1744
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 943
	Lock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
			const CThreadMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1744
	CUtlMemory<ISceneWorld::NumAllocated(); // 1247
	CUtlMemory<ISceneWorld::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneWorld::Element(
		int i);  // 1252
	Construct<ISceneWorld*, ISceneWorld*>(ISceneWorld** pMemory); // 1252
	CUtlMemory<ISceneWorld::Base(); // 112
	CUtlVectorBase<ISceneWorld::Base(); // 368
	CUtlVectorBase<ISceneWorld::ResetDbgInfo(); // 824
	CUtlVectorBase<ISceneWorld::GrowMemory(
			int num);  // 1249
	CUtlVectorBase<ISceneWorld::AddToTail(
			ISceneWorld *& src);  // 1745
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 1746
} /* size: 217, variables: 1, inline expansions: 15 (469 bytes) */

// <02EF02D8> ../scenesystem/scenesystem.cpp:1748
// variables: 3
// function calls: 19
void CSceneSystem::UnregisterActiveSceneWorld(CSceneWorld* pSceneWorld)
{
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_1750; // 1750
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 943
	Lock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
			const CThreadMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1750
	{
		int i; // 1531
		CUtlVectorBase<ISceneWorld::Count(); // 1531
		CUtlMemory<ISceneWorld::operator[](
				int i);  // 609
		CUtlVectorBase<ISceneWorld::Element(
			int i);  // 1533
	}
	CUtlVectorBase<ISceneWorld::Find(
		ISceneWorld* const& src);  // 1629
	CUtlMemory<ISceneWorld::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneWorld::Element(
		int i);  // 1575
	Destruct<ISceneWorld*>(ISceneWorld** pMemory); // 1575
	{
		const bool  bNotLast; // 1578
		CUtlMemory<ISceneWorld::operator[](
				int i);  // 602
		CUtlVectorBase<ISceneWorld::Element(
			int i);  // 1584
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 1584
	}
	CUtlVectorBase<ISceneWorld::FastRemove(
			int elem);  // 1632
	CUtlVectorBase<ISceneWorld::FindAndFastRemove(
				ISceneWorld* const& src);  // 1751
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 1752
} /* size: 271, variables: 1, inline expansions: 12 (612 bytes) */

// <02EEFF2D> ../scenesystem/scenesystem.cpp:1754
// variable: 1
// function calls: 15
void CSceneSystem::AddListener(ISceneSystemListener* pListener)
{
	{
		int i; // 1531
		CUtlVectorBase<ISceneSystemListener::Count(); // 1531
		CUtlMemory<ISceneSystemListener::operator[](
				int i);  // 609
		CUtlVectorBase<ISceneSystemListener::Element(
			int i);  // 1533
	}
	CUtlVectorBase<ISceneSystemListener::Find(
		ISceneSystemListener* const& src);  // 1756
	CUtlMemory<ISceneSystemListener::NumAllocated(); // 1196
	CUtlMemory<ISceneSystemListener::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneSystemListener::Element(
		int i);  // 1201
	CopyConstruct<ISceneSystemListener*>(ISceneSystemListener** pMemory,
						ISceneSystemListener* const& src);  // 1201
	CUtlMemory<ISceneSystemListener::IsGrowable(); // 823
	CUtlMemory<ISceneSystemListener::IsExternallyAllocated(); // 859
	CUtlMemory<ISceneSystemListener::IsExternallyAllocated(); // 861
	CUtlMemory<ISceneSystemListener::Grow(
		int num);  // 806
	CUtlVectorBase<ISceneSystemListener::ResetDbgInfo(); // 824
	CUtlVectorBase<ISceneSystemListener::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<ISceneSystemListener::AddToTail(
			ISceneSystemListener* const& src);  // 1761
} /* size: 416, inline expansions: 12 (928 bytes) */

// <02EEFC2A> ../scenesystem/scenesystem.cpp:1764
// variable: 1
// function calls: 13
void CSceneSystem::RemoveListener(ISceneSystemListener* pListener)
{
	{
		int i; // 1531
		CUtlVectorBase<ISceneSystemListener::Count(); // 1531
		CUtlMemory<ISceneSystemListener::operator[](
				int i);  // 609
		CUtlVectorBase<ISceneSystemListener::Element(
			int i);  // 1533
	}
	CUtlVectorBase<ISceneSystemListener::Find(
		ISceneSystemListener* const& src);  // 1617
	CUtlMemory<ISceneSystemListener::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneSystemListener::Element(
		int i);  // 1114
	CUtlMemory<ISceneSystemListener::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneSystemListener::Element(
		int i);  // 1114
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 115
	V_memmove(void* dest,
			const void* src,
			size_t count);  // 1114
	CUtlVectorBase<ISceneSystemListener::ShiftElementsLeft(
				int elem,
				int num);  // 1608
	CUtlVectorBase<ISceneSystemListener::Remove(
		int elem);  // 1620
	CUtlVectorBase<ISceneSystemListener::FindAndRemove(
			ISceneSystemListener* const& src);  // 1766
} /* size: 149, inline expansions: 10 (377 bytes) */

// <02EEF3E7> ../scenesystem/scenesystem.cpp:1769
// variables: 5
// function calls: 24
void CSceneSystem::AddView(const char* pszDebugName, const CViewId& viewId, const CFrustum& frustum, SwapChainHandle_t hSwapChain, ISceneWorld* pWorld, const RenderViewport_t& mainViewport, const CPVSBits* pVis, int nPriority)
{
	const char   __FUNCTION__; // 63358
	CSceneView* pNewView; // 1776
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_1780; // 1780
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1772
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1775
	}
	CInterlockedIntT<int, 4>::operator!=(
			int rhs);  // 129
	CUtlMultiJobProcessor::JobsRunning(); // 1775
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1780
	CUtlVectorBase<CSceneView::Count(); // 1781
	ISceneView::SetFrustum(
			const CFrustum& frustum);  // 1782
	ISceneView::SetMainViewport(
			const RenderViewport_t& viewport);  // 1783
	CUtlMemory<CSceneView::NumAllocated(); // 1196
	CUtlMemory<CSceneView::operator[](
			int i);  // 602
	CUtlVectorBase<CSceneView::Element(
		int i);  // 1201
	CopyConstruct<CSceneView*>(CSceneView** pMemory,
					CSceneView* const& src);  // 1201
	CUtlMemory<CSceneView::Base(); // 112
	CUtlVectorBase<CSceneView::Base(); // 368
	CUtlVectorBase<CSceneView::ResetDbgInfo(); // 824
	CUtlVectorBase<CSceneView::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<CSceneView::AddToTail(
			CSceneView* const& src);  // 1785
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 1788
} /* size: 0, variables: 3, inline expansions: 24 (697 bytes) */

// <02EEEDCB> ../scenesystem/scenesystem.cpp:1790
// variables: 8
// function calls: 18
void CSceneSystem::FindView(const char* pName)
{
	const char   __FUNCTION__; // 63385
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_1797; // 1797
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1793
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1796
	}
	{
		CSceneView* pView; // 1798
		CUtlVectorFixedGrowable<CSceneView*, 16>& __for_range; // 59616
		iterator __for_begin; // 5711
		iterator __for_end; // 5711
		CUtlMemory<CSceneView::Base(); // 112
		CUtlVectorBase<CSceneView::Base(); // 102
		CUtlVectorBase<CSceneView::begin(); // 1798
		CUtlVectorBase<CSceneView::Count(); // 104
		CUtlVectorBase<CSceneView::end(); // 1798
		CSceneView::GetDebugName(); // 1800
	}
	CInterlockedIntT<int, 4>::operator!=(
			int rhs);  // 129
	CUtlMultiJobProcessor::JobsRunning(); // 1796
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 1797
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 1806
} /* size: 0, variables: 2, inline expansions: 12 (454 bytes) */

// <02EEE92B> ../scenesystem/scenesystem.cpp:1808
// variables: 3
// function calls: 10
void CSceneSystem::AddDynamicView(const char* pszDebugName, const ISceneView* pParentView, const CFrustum& frustum, SwapChainHandle_t hSwapChain, ISceneWorld* pWorld, const RenderViewport_t& mainViewport, const CPVSBits* pVis, int nPriority, int nViewProducerIndex)
{
	const char   __FUNCTION__; // 63547
	CSceneView* pNewView; // 1815
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1813
	}
	CInterlockedIntT<int, 4>::operator!=(
			int rhs);  // 129
	CUtlMultiJobProcessor::JobsRunning(); // 1813
	ISceneView::SetFrustum(
			const CFrustum& frustum);  // 1819
	ISceneView::SetMainViewport(
			const RenderViewport_t& viewport);  // 1820
	CSceneView::GetFlags(); // 1826
	CSceneView::AddFlags(
		SceneViewFlags_t nFlags);  // 1828
	CSceneView::GetFlags(); // 1830
	CSceneView::AddFlags(
		SceneViewFlags_t nFlags);  // 1832
	CSceneView::GetFlags(); // 1834
	CSceneView::AddFlags(
		SceneViewFlags_t nFlags);  // 1836
} /* size: 0, variables: 2, inline expansions: 10 (136 bytes) */

// <02EEDA69> ../scenesystem/scenesystem.cpp:1844
// variables: 16
// function calls: 45
void CSceneSystem::AddShadowView(const char* pszDebugName, ISceneView* pParentView, const CFrustum* frustum, const RenderViewport_t& viewport, HRenderTexture renderTarget, int renderTargetIndex, ESceneObjectFlags requiredFlags, ESceneObjectFlags excludedFlags, int depthBias, float slopeScaledDepthBias, const CFrustum* pExclusionFrustum)
{
	ISceneView* pView; // 1849
	HSceneViewRenderTarget hRenderTargetDepth; // 1866
	SceneLayerOutputs_t outputs; // 1867
	RsDepthBiasStateOverride_t depthBiasOverride; // 1878
	const char* s_layerNames; // 1883
	{
		CVolumeCuller culler; // 1857
		VPlane exclusionPlanes; // 1859
		CVolumeCuller::Clear(); // 17
		CVolumeCuller::CVolumeCuller(); // 1857
		CFrustum::GetViewProj(); // 1860
		{
			int i; // 47
			Vector4D::Init(
				vec_t ix,
				vec_t iy,
				vec_t iz,
				vec_t iw);  // 50
		}
		CVolumeCuller::SetExclusionFrustumPlanes(
						const VPlane* pPlanes);  // 37
		CVolumeCuller::SetExclusionFrustumPlanes(
						const VPlane* pPlanes);  // 1862
	}
	{
		int nOpaquenessPass; // 1884
		{
			ISceneLayer* pNewLayer; // 1886
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 605
			ISceneLayer::AddObjectFlagsRequiredMask(
							ESceneObjectFlags nRequiredFlags);  // 1893
			{
				const uint32  m; // 80
				uint32 h; // 81
				uint32 k; // 82
				const int  r; // 83
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 1886
			CSceneLayer::DisableReflectionsAndRefractionsForObjectsInThisLayer(
										bool bOnOff);  // 1889
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 605
			ISceneLayer::AddObjectFlagsRequiredMask(
							ESceneObjectFlags nRequiredFlags);  // 1890
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 610
			ISceneLayer::AddObjectFlagsExcludedMask(
							ESceneObjectFlags nExcludedFlags);  // 1891
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 610
			ISceneLayer::AddObjectFlagsExcludedMask(
							ESceneObjectFlags nExcludedFlags);  // 1894
			ISceneLayer::SetDepthBiasStateOverride(
							const RsDepthBiasStateOverride_t& depthBiasOverride);  // 1909
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 610
			ISceneLayer::AddObjectFlagsExcludedMask(
							ESceneObjectFlags nExcludedFlags);  // 1906
			operator|=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 605
			ISceneLayer::AddObjectFlagsRequiredMask(
							ESceneObjectFlags nRequiredFlags);  // 1900
		}
	}
	{
		int w; // 1914
		{
			ISceneWorld* pWorld; // 1916
			CUtlMemory<ISceneView::WorldList_t, int>::operator[](
					int i);  // 595
			CUtlVectorBase<ISceneView::WorldList_t, CUtlMemoryFixedGrowable<ISceneView::WorldList_t, 16, int> >::operator[](
					int i);  // 449
			ISceneView::GetWorldToRender(
					int nIndex);  // 1916
		}
		CUtlVectorBase<ISceneView::WorldList_t, CUtlMemoryFixedGrowable<ISceneView::WorldList_t, 16, int> >::Count(); // 446
		ISceneView::NumWorldsToRender(); // 1914
	}
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1866
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 135
	SceneLayerOutputs_t::Init(
		HSceneViewRenderTarget hColor0,
		HSceneViewRenderTarget hDepth,
		RenderColorSpace_t allowSrgbWrites);  // 135
	SceneLayerOutputs_t::SceneLayerOutputs_t(
				HSceneViewRenderTarget hColor0,
				HSceneViewRenderTarget hDepth,
				RenderColorSpace_t allowSrgbWrites);  // 1867
	CSceneView::AddFlags(
		SceneViewFlags_t nFlags);  // 1872
	CSceneView::GetRenderAttributes(); // 1920
	CSceneView::GetRenderAttributes(); // 1920
	CUtlMemory<ISceneView::NumAllocated(); // 1196
	CUtlMemory<ISceneView::operator[](
			int i);  // 602
	CUtlVectorBase<ISceneView::Element(
		int i);  // 1201
	CopyConstruct<ISceneView*>(ISceneView** pMemory,
					ISceneView* const& src);  // 1201
	CUtlMemory<ISceneView::Base(); // 112
	CUtlVectorBase<ISceneView::Base(); // 368
	CUtlVectorBase<ISceneView::ResetDbgInfo(); // 824
	CUtlVectorBase<ISceneView::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<ISceneView::AddToTail(
			ISceneView* const& src);  // 364
	CSceneView::AddDependentView(
			ISceneView* pView);  // 1923
} /* size: 1908, variables: 5, inline expansions: 19 (380 bytes) */

// <02F31578> ../scenesystem/scenesystem.cpp:1939
// variables: 29
// function calls: 33
bool SortLessFunc<true, true>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	CSceneObject::GetDesc(); // 1954
	CSceneObject::GetDesc(); // 1955
	{
		bool bLeftUsesShadowFastPath; // 1974
		bool bRightUsesShadowFastPath; // 1975
	}
	CMeshDrawPrimitive_t::GetDrawCall(); // 2009
	CMeshDrawPrimitive_t::GetDrawCall(); // 2010
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2017
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2018
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2072
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2073
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 97
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator!=<CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2074
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 81
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator< <CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2076
	SortLessFunc<true, true>(const CMeshDrawPrimitive_t& left,
				const CMeshDrawPrimitive_t& right);  // 1939
} /* size: 383, variables: 23, inline expansions: 33 (402 bytes) */

// <02F30C5C> ../scenesystem/scenesystem.cpp:1939
// variables: 29
// function calls: 33
bool SortLessFunc<true, false>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	CSceneObject::GetDesc(); // 1954
	CSceneObject::GetDesc(); // 1955
	{
		EBatchFlags leftLightingMethod; // 1993
		EBatchFlags rightLightingMethod; // 1994
	}
	CMeshDrawPrimitive_t::GetDrawCall(); // 2009
	CMeshDrawPrimitive_t::GetDrawCall(); // 2010
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2017
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2018
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2072
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2073
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 97
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator!=<CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2074
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 81
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator< <CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2076
	SortLessFunc<true, false>(const CMeshDrawPrimitive_t& left,
					const CMeshDrawPrimitive_t& right);  // 1939
} /* size: 361, variables: 23, inline expansions: 33 (388 bytes) */

// <02EAAEFD> ../scenesystem/scenesystem.cpp:1939
// variables: 31
bool SortLessFunc<true, true>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	{
		bool bLeftUsesShadowFastPath; // 1974
		bool bRightUsesShadowFastPath; // 1975
	}
	{
		EBatchFlags leftLightingMethod; // 1993
		EBatchFlags rightLightingMethod; // 1994
	}
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
} /* size: 0, variables: 23 */

// <02EAACD0> ../scenesystem/scenesystem.cpp:1939
// variables: 31
bool SortLessFunc<true, false>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	{
		bool bLeftUsesShadowFastPath; // 1974
		bool bRightUsesShadowFastPath; // 1975
	}
	{
		EBatchFlags leftLightingMethod; // 1993
		EBatchFlags rightLightingMethod; // 1994
	}
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
} /* size: 0, variables: 23 */

// <02EAA2DD> ../scenesystem/scenesystem.cpp:1939
// variables: 31
// function calls: 33
bool SortLessFunc<false, true>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	{
		bool bLeftUsesShadowFastPath; // 1974
		bool bRightUsesShadowFastPath; // 1975
	}
	{
		EBatchFlags leftLightingMethod; // 1993
		EBatchFlags rightLightingMethod; // 1994
	}
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
	CSceneObject::GetDesc(); // 1954
	CSceneObject::GetDesc(); // 1955
	CMeshDrawPrimitive_t::GetDrawCall(); // 2009
	CMeshDrawPrimitive_t::GetDrawCall(); // 2010
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2017
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2018
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2072
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2073
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 97
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator!=<CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2074
	CWeakHandle<InfoForResourceTypeCModel>::operator<(
			const CWeakHandle<InfoForResourceTypeCModel>& rhs);  // 85
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 81
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator< <CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2076
} /* size: 413, variables: 23, inline expansions: 33 (87 bytes) */

// <02EA991C> ../scenesystem/scenesystem.cpp:1939
// variables: 31
// function calls: 33
bool SortLessFunc<false, false>(const CMeshDrawPrimitive_t& left, const CMeshDrawPrimitive_t& right)
{
	const CMeshDrawPrimitive_t* pLeft; // 1941
	const CMeshDrawPrimitive_t* pRight; // 1942
	ISceneObjectDesc* pLeftDesc; // 1954
	ISceneObjectDesc* pRightDesc; // 1955
	bool bLeftUsesPayload; // 1962
	bool bRightUsesPayload; // 1963
	bool bLeftUniqueBatchGroup; // 1983
	bool bRightUniqueBatchGroup; // 1984
	const CMaterialDrawDescriptor* pLeftDrawCall; // 2007
	const CMaterialDrawDescriptor* pRightDrawCall; // 2008
	const bool  bLeftCallDrawLast; // 2017
	const bool  bRightCallDrawLast; // 2018
	const IMaterial2* pLeftDrawMaterial; // 2047
	const IMaterial2* pRightDrawMaterial; // 2048
	const InputLayoutVariation_t  sortVariation; // 2055
	RenderInputLayout_t leftInputLayout; // 2056
	RenderInputLayout_t rightInputLayout; // 2057
	EBatchFlags nLeftBatchFlagsControllingCombos; // 2064
	EBatchFlags nRightBatchFlagsControllingCombos; // 2065
	CModelMeshHandle hLeftMesh; // 2072
	CModelMeshHandle hRightMesh; // 2073
	EBatchFlags nLeftBatchFlags; // 2080
	EBatchFlags nRightBatchFlags; // 2081
	{
		bool bLeftUsesShadowFastPath; // 1974
		bool bRightUsesShadowFastPath; // 1975
	}
	{
		EBatchFlags leftLightingMethod; // 1993
		EBatchFlags rightLightingMethod; // 1994
	}
	{
		const IMaterial2* pLeftKeyMaterial; // 2037
		const IMaterial2* pRightKeyMaterial; // 2038
	}
	{
		const CMaterialDrawDescriptor* pLeftDraw; // 2090
		const CMaterialDrawDescriptor* pRightDraw; // 2092
	}
	CSceneObject::GetDesc(); // 1954
	CSceneObject::GetDesc(); // 1955
	CMeshDrawPrimitive_t::GetDrawCall(); // 2009
	CMeshDrawPrimitive_t::GetDrawCall(); // 2010
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2017
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2018
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2072
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 38
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::CModelMeshHandleBase(); // 142
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 188
	CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetMeshIndex(); // 189
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::Assign(
		const CModelMeshHandleStrong& h);  // 143
	CModelMeshHandle::CModelMeshHandle(
			const CModelMeshHandleStrong& h);  // 2073
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 97
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator!=<CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2074
	CWeakHandle<InfoForResourceTypeCModel>::operator<(
			const CWeakHandle<InfoForResourceTypeCModel>& rhs);  // 85
	CWeakHandle<InfoForResourceTypeCModel>::Init(
		const CWeakHandle<InfoForResourceTypeCModel>& src);  // 273
	CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCModel>& src);  // 100
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 81
	CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >::operator< <CWeakHandle<InfoForResourceTypeCModel> >(
								const CModelMeshHandleBase<CWeakHandle<InfoForResourceTypeCModel> >& rhs);  // 2076
} /* size: 410, variables: 23, inline expansions: 33 (87 bytes) */

// <02F3E1B8> ../scenesystem/scenesystem.cpp:2104
void CSceneSystem::GetPointerFromTransformTextureSlot(int nSlot)
{
} /* size: 19 */

// <02EED975> ../scenesystem/scenesystem.cpp:2110
// variables: 3
void CSceneSystem::BindTransformSlot(IRenderContext* pRenderContext, int nVBSlot, int nTransformSlotIndex)
{
	const int  nNumTransformBlocksPerInstance; // 2112
	const int  nInstanceIDBufferStride; // 2114
	const int  nTransformIndexWithOffset; // 2115
} /* size: 41, variables: 3 */

// <02EED73C> ../scenesystem/scenesystem.cpp:2123
// variables: 5
// function calls: 5
void CSceneSystem::CalculateStencilMask(const CUtlStringToken* pIDs, ISceneLayer* pLayer1)
{
	CSceneLayer* pLayer; // 2125
	uint8 nRet; // 2126
	{
		int i; // 2128
		{
			int nSlot; // 2132
			CUtlStringToken::IsValid(); // 2130
			{
				uint32 nAssociatedID; // 59
				ReadVolatileMemory<unsigned int>(const unsigned int* pPtr); // 59
				ThreadInterlockedAssignIf(volatile int32* p,
								int32 value,
								int32 comparand);  // 433
				ThreadInterlockedAssignIf(volatile uint32* p,
								uint32 value,
								uint32 comparand);  // 67
			}
			CUtlSlotAllocator<8>::FindOrAllocateSlot(
						CUtlStringToken nID);  // 2132
		}
	}
} /* size: 191, variables: 2 */

// <02EED3B2> ../scenesystem/scenesystem.cpp:2147
// variable: 1
// function calls: 11
void CSceneSystem::GenerateOverrideDescriptor(const CSceneSystemStencilState* pObjectStencilState, RsStencilStateOverride_t* pHardwareStencilState, ISceneLayer* pLayer)
{
	RsStencilStateDesc_t* pDesc; // 2149
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2150
	RsStencilStateDesc_t::SetStencilEnabled(
				bool bEnable);  // 2151
	RsStencilStateDesc_t::SetFrontStencilFailOp(
				RsStencilOp_t value);  // 2154
	RsStencilStateDesc_t::SetFrontStencilDepthFailOp(
					RsStencilOp_t value);  // 2155
	RsStencilStateDesc_t::SetFrontStencilPassOp(
				RsStencilOp_t value);  // 2156
	RsStencilStateDesc_t::SetFrontStencilFunc(
				RsComparison_t value);  // 2157
	RsStencilStateDesc_t::SetBackStencilFailOp(
				RsStencilOp_t value);  // 2158
	RsStencilStateDesc_t::SetBackStencilDepthFailOp(
					RsStencilOp_t value);  // 2159
	RsStencilStateDesc_t::SetBackStencilPassOp(
				RsStencilOp_t value);  // 2160
	RsStencilStateDesc_t::SetBackStencilFunc(
				RsComparison_t value);  // 2161
} /* size: 272, variables: 1, inline expansions: 11 (207 bytes) */

// <02EED2B2> ../scenesystem/scenesystem.cpp:2165
// function calls: 3
void CSceneSystem::ShouldOverrideDepthMaterial(const CMaterialDrawDescriptor* pDrawDesc, const ISceneLayer* pLayer)
{
	ConVar::GetInt(); // 2177
	ConVar::GetInt(); // 2177
	operator&(RenderMeshDrawPrimitiveFlags_t a,
			RenderMeshDrawPrimitiveFlags_t b);  // 2183
} /* size: 103, inline expansions: 3 (14 bytes) */

// <02EED273> ../scenesystem/scenesystem.cpp:2189
// variable: 1
inline CDisplayList* QueueDebugDisplayList(CRenderContextPtr& ctx, CSceneLayer* pLayer)
{
	CDisplayList* pCommands; // 2191
} /* size: 0, variables: 1 */

// <02EECF53> ../scenesystem/scenesystem.cpp:2200
// variables: 2
// function calls: 9
void CSceneSystem::AllocatePerFrameTransformData(int nNumSlots, SceneSystemTransformEntry_t *& pData)
{
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_2202; // 2202
	int nSlot; // 2203
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 943
	Lock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
			const CThreadMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 2202
	{
	}
	CSceneSystem::AllocateGetTransformSlot(
				int nNumSlots);  // 921
	CSceneSystem::AllocateGetTransformSlot(
				int nNumSlots);  // 2203
	CSceneSystem::GetPerFrameTransformData(
				int nSlot);  // 2205
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 2208
} /* size: 0, variables: 2, inline expansions: 9 (369 bytes) */

// <02F39339> ../scenesystem/scenesystem.cpp:2211
// variables: 5
// function call: 1
void CSceneView::DrawObjectsToLayerInternal<false>()
{
	CMeshDrawPrimitive_t* pMesh; // 2226
	int nNumToDraw; // 2227
	{
	}
	CSceneDrawList::Check(); // 2213
	{
	}
	{
		int i; // 2231
		{
			int nObjectClassSettings; // 2234
			int nDebugLevel; // 2235
		}
	}
} /* size: 0, variables: 2, inline expansions: 1 (63 bytes) */

// <02F39165> ../scenesystem/scenesystem.cpp:2211
// variables: 5
// function call: 1
void CSceneView::DrawObjectsToLayerInternal<true>()
{
	CMeshDrawPrimitive_t* pMesh; // 2226
	int nNumToDraw; // 2227
	{
	}
	CSceneDrawList::Check(); // 2213
	{
	}
	{
		int i; // 2231
		{
			int nObjectClassSettings; // 2234
			int nDebugLevel; // 2235
		}
	}
} /* size: 0, variables: 2, inline expansions: 1 (62 bytes) */

// <02EAB1A3> ../scenesystem/scenesystem.cpp:2211
// variables: 6
void CSceneSystem::DrawObjectsToLayerInternal<true>(CSceneView* pView, CSceneDrawList* pList, CSceneLayer* pLayer, CRenderBatchList* pBatchList)
{
	CMeshDrawPrimitive_t* pMesh; // 2226
	int nNumToDraw; // 2227
	{
		bool bBreakOnRenderingEnabled; // 2218
	}
	{
		int i; // 2231
		{
			int nObjectClassSettings; // 2234
			int nDebugLevel; // 2235
		}
	}
} /* size: 0, variables: 2 */

// <02EAB0E6> ../scenesystem/scenesystem.cpp:2211
// variables: 6
void CSceneSystem::DrawObjectsToLayerInternal<false>(CSceneView* pView, CSceneDrawList* pList, CSceneLayer* pLayer, CRenderBatchList* pBatchList)
{
	CMeshDrawPrimitive_t* pMesh; // 2226
	int nNumToDraw; // 2227
	{
		bool bBreakOnRenderingEnabled; // 2218
	}
	{
		int i; // 2231
		{
			int nObjectClassSettings; // 2234
			int nDebugLevel; // 2235
		}
	}
} /* size: 0, variables: 2 */

// <02EECF06> ../scenesystem/scenesystem.cpp:2273
inline void CSceneSystem::DrawObjectsToLayer(CSceneView* pView, CSceneDrawList* pList, CSceneLayer* pLayer, CRenderBatchList* pBatchList)
{
} /* size: 0 */

// <02EECEB9> ../scenesystem/scenesystem.cpp:2286
inline void CSceneSystem::DrawDrawList(CSceneView* pView, CSceneLayer* pLayer, CSceneDrawList* pList, CRenderBatchList* pBatchList)
{
} /* size: 0 */

// <02EEC206> ../scenesystem/scenesystem.cpp:2301
// variables: 5
// function calls: 42
void CSceneSystem::DrawMeshes(CSceneView* pView, CSceneDrawList* pList, CSceneLayer* pLayer, CRenderBatchList* pBatchList, int nSubList)
{
	{
		bool bIsDepthPass; // 2305
		int nNumToDraw; // 2306
		{
		}
		CSceneDrawList::Check(); // 2307
		_Iter_comp_iter<bool (::_Iter_comp_iter(
				bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &));  // 165
		__iter_comp_iter<bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 4874
		sort<CMeshDrawPrimitive_t*, bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(CMeshDrawPrimitive_t* __first,
														CMeshDrawPrimitive_t* __last,
														bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 2338
		{
		}
		CSceneDrawList::Check(); // 2345
		ConVar::GetInt(); // 2346
		ConVar::GetInt(); // 351
		ConVar::GetBool(); // 216
		ForceSingleDisplayListForLayer(const CSceneLayer* pLayer); // 2354
		{
			CSceneDrawList* pCurHead; // 516
			ReadVolatileMemory<CSceneDrawList*>(CSceneDrawList* const* pPtr); // 516
			ThreadInterlockedCompareExchange64(volatile int64* p,
								int64 value,
								int64 comparand);  // 417
			ThreadInterlockedAssignPointerIf(volatile void** p,
							void* value,
							void* comparand);  // 519
		}
		AddToHeadTS<CSceneDrawList, CSceneDrawList>(CSceneDrawList *& pHead,
								CSceneDrawList* pNode);  // 965
		CUtlIntrusiveList<CSceneDrawList>::AddToHeadTS(
				CSceneDrawList* pNode);  // 2356
		_Iter_comp_iter<bool (::_Iter_comp_iter(
				bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &));  // 165
		__iter_comp_iter<bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 4874
		sort<CMeshDrawPrimitive_t*, bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(CMeshDrawPrimitive_t* __first,
														CMeshDrawPrimitive_t* __last,
														bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 2324
		{
		}
		CSceneDrawList::Check(); // 2328
		{
			CSceneDrawList* pCurHead; // 516
			ReadVolatileMemory<CSceneDrawList*>(CSceneDrawList* const* pPtr); // 516
			ThreadInterlockedCompareExchange64(volatile int64* p,
								int64 value,
								int64 comparand);  // 417
			ThreadInterlockedAssignPointerIf(volatile void** p,
							void* value,
							void* comparand);  // 519
		}
		AddToHeadTS<CSceneDrawList, CSceneDrawList>(CSceneDrawList *& pHead,
								CSceneDrawList* pNode);  // 965
		CUtlIntrusiveList<CSceneDrawList>::AddToHeadTS(
				CSceneDrawList* pNode);  // 2330
		_Iter_comp_iter<bool (::_Iter_comp_iter(
				bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &));  // 165
		__iter_comp_iter<bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 4874
		sort<CMeshDrawPrimitive_t*, bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(CMeshDrawPrimitive_t* __first,
														CMeshDrawPrimitive_t* __last,
														bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 2342
		_Iter_comp_iter<bool (::_Iter_comp_iter(
				bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &));  // 165
		__iter_comp_iter<bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 4874
		sort<CMeshDrawPrimitive_t*, bool (*)(const CMeshDrawPrimitive_t&, const CMeshDrawPrimitive_t&)>(CMeshDrawPrimitive_t* __first,
														CMeshDrawPrimitive_t* __last,
														bool (*__comp)(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)); // 2320
	}
	{
	}
	CSceneDrawList::Check(); // 2288
	CSceneSystem::DrawObjectsToLayer(
				CSceneView* pView,
				CSceneDrawList* pList,
				CSceneLayer* pLayer,
				CRenderBatchList* pBatchList);  // 2290
	CSceneSystem::DrawObjectsToLayer(
				CSceneView* pView,
				CSceneDrawList* pList,
				CSceneLayer* pLayer,
				CRenderBatchList* pBatchList);  // 2293
	CSceneSystem::DrawDrawList(
			CSceneView* pView,
			CSceneLayer* pLayer,
			CSceneDrawList* pList,
			CRenderBatchList* pBatchList);  // 2362
	{
		CSceneDrawList* pCurHead; // 516
		ReadVolatileMemory<CSceneDrawList*>(CSceneDrawList* const* pPtr); // 516
		ThreadInterlockedCompareExchange64(volatile int64* p,
							int64 value,
							int64 comparand);  // 417
		ThreadInterlockedAssignPointerIf(volatile void** p,
						void* value,
						void* comparand);  // 519
	}
	AddToHeadTS<CSceneDrawList, CSceneDrawList>(CSceneDrawList *& pHead,
							CSceneDrawList* pNode);  // 965
	CUtlIntrusiveList<CSceneDrawList>::AddToHeadTS(
			CSceneDrawList* pNode);  // 2368
} /* size: 0, inline expansions: 6 (377 bytes) */

// <02EEB552> ../scenesystem/scenesystem.cpp:2372
// variables: 5
// function calls: 42
void CSceneSystem::Thread_DrawDrawList(CSceneView* pView, CSceneLayer* pLayer, CSceneDrawList* pList, CRenderBatchList* pBatchList, EBatchStartFlags_t nBatchFlags)
{
	{
	}
	CSceneDrawList::Check(); // 2288
	CSceneSystem::DrawObjectsToLayer(
				CSceneView* pView,
				CSceneDrawList* pList,
				CSceneLayer* pLayer,
				CRenderBatchList* pBatchList);  // 2290
	CSceneSystem::DrawObjectsToLayer(
				CSceneView* pView,
				CSceneDrawList* pList,
				CSceneLayer* pLayer,
				CRenderBatchList* pBatchList);  // 2293
	CSceneSystem::DrawDrawList(
			CSceneView* pView,
			CSceneLayer* pLayer,
			CSceneDrawList* pList,
			CRenderBatchList* pBatchList);  // 2382
	{
	}
	CSceneDrawList::Check(); // 1278
	ThreadPause(void); // 173
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 168
	CTSListBase::Push(
		TSLNodeBase_t* pNode);  // 371
	CTSPool<CSceneDrawList>::PutObject(
			CSceneDrawList* pInfo);  // 1281
	ThreadInterlockedDecrement(volatile int32* p); // 586
	CInterlockedIntT<int, 4>::operator--(); // 1282
	CSceneSystem::ReturnDrawListToPool(
				CSceneDrawList* pList);  // 2386
	ThreadInterlockedExchangeAdd(volatile int32* p,
					int32 value);  // 660
	CInterlockedIntT<int, 4>::AtomicAdd(
			int add);  // 2388
	ThreadInterlockedExchangeAdd(volatile int32* p,
					int32 value);  // 660
	CInterlockedIntT<int, 4>::AtomicAdd(
			int add);  // 118
	CInterlockedIntT<int, 4>::operator==(
			int rhs);  // 121
	{
	}
	ThreadInterlockedDecrement(volatile int32* p); // 586
	CInterlockedIntT<int, 4>::operator--(); // 592
	CInterlockedIntT<int, 4>::operator--(
			int);  // 122
	CUtlMultiJobProcessor::MarkJobFinished(); // 2392
	Scope::Scope(
		const char* name,
		const char* data,
		uint32 color);  // 380
	{
		int v; // 386
		CUtlVectorBase<ISceneView::Count(); // 386
		CUtlMemory<ISceneView::operator[](
				int i);  // 588
		CUtlVectorBase<ISceneView::operator[](
				int i);  // 388
	}
	{
		CSceneLayer* pLayer; // 397
		CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short unsigned int>, int> >& __for_range; // 16122
		iterator __for_begin; // 16132
		iterator __for_end; // 16142
		CUtlLinkedList<CSceneLayer::Head(); // 334
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 334
		CUtlLinkedList<CSceneLayer::begin(); // 397
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 343
		CUtlLinkedList<CSceneLayer::end(); // 397
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 482
		CUtlLinkedList<CSceneLayer::Element(
			int i);  // 317
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator*(); // 397
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 368
		CUtlLinkedList<CSceneLayer::InternalElement(
				int i);  // 550
		CUtlLinkedList<CSceneLayer::Next(
			int i);  // 272
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator++(); // 397
	}
	Scope::~Scope(); // 404
	CSceneView::AtFinish(); // 2390
} /* size: 0, inline expansions: 25 (1227 bytes) */

// <02EEB411> ../scenesystem/scenesystem.cpp:2397
// variables: 2
inline void CSceneSystem::QueueDrawDrawList(CSceneView* pView, CSceneLayer* pLayer, CSceneDrawList* pList, CRenderBatchList* pBatchList, EBatchStartFlags_t nBatchFlags)
{
	{
		const char* szLabel; // 2405
		CFmtStr1024 label; // 2407
	}
} /* size: 0 */

// <02EE6618> ../scenesystem/scenesystem.cpp:2426
// variables: 54
// function calls: 317
void CSceneSystem::SortAndDrawPendingObjects(CSceneView* pView, CSceneLayer* pLayer)
{
	CUtlVectorFixedGrowableCompat<CSceneDrawList*, 32> outputDrawLists; // 2428
	int nNumDraws; // 2431
	CUtlIntrusiveList<CSceneDrawList> pendingLists; // 2434
	bool bIsTranslucentLayer; // 2447
	bool bIsFullSortLayer; // 2448
	bool bFullSortOpaqueLayers; // 2449
	int nMinChunkSize; // 2451
	int nMaxNodesPerDraw; // 2458
	const char   __FUNCTION__; // 63844
	int nOutputDrawLists; // 2638
	{
		CUtlIntrusiveList<CSceneDrawList>& drawList; // 2435
		CUtlIntrusiveList<CSceneDrawList>& __for_range; // 19305
		CUtlIntrusiveList<CSceneDrawList>* __for_begin; // 35039
		CUtlIntrusiveList<CSceneDrawList>* __for_end; // 35039
		{
			CSceneDrawList* pNode; // 2437
			{
				CSceneDrawList* pRet; // 1090
			}
			CUtlIntrusiveList<CSceneDrawList>::RemoveHead(); // 2437
			AddToHead<CSceneDrawList, CSceneDrawList>(CSceneDrawList *& head,
									CSceneDrawList* node);  // 960
			CUtlIntrusiveList<CSceneDrawList>::AddToHead(
					CSceneDrawList* node);  // 2439
			{
			}
			CSceneDrawList::Check(); // 2442
		}
	}
	{
		CSceneDrawList* pHead; // 2467
		{
		}
		CSceneDrawList::Check(); // 2468
		CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
		CUtlMemory<CSceneDrawList::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneDrawList::Element(
			int i);  // 1201
		CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
						CSceneDrawList* const& src);  // 1201
		CUtlMemory<CSceneDrawList::Base(); // 112
		CUtlVectorBase<CSceneDrawList::Base(); // 368
		CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
		CUtlVectorBase<CSceneDrawList::GrowMemory(
				int num);  // 1198
		CUtlVectorBase<CSceneDrawList::AddToTail(
				CSceneDrawList* const& src);  // 2469
	}
	{
		CSceneDrawList* pCurOutList; // 2474
		CSceneDrawList* pUnmergedLists; // 2476
		{
			CSceneDrawList* pNode; // 2480
			{
				int nPrimitivesToCopy; // 2482
				{
					int nCopyAmount; // 2493
					CMeshDrawPrimitive_t* pOut; // 2495
					CMeshDrawPrimitive_t* pIn; // 2496
					ThreadPause(void); // 208
					ThreadInterlockedAssignIf128(volatile int128* pDest,
									const int128& value,
									const int128& comparand);  // 478
					ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
										const InterlockedPointerX2SizedInt_t& value,
										const InterlockedPointerX2SizedInt_t& comperand);  // 203
					CTSListBase::Pop(); // 376
					LightProbeVolumeBinding_t::LightProbeVolumeBinding_t(); // 1113
					Vector4D::Vector4D(); // 1113
					CMeshDrawPrimitive_t::CMeshDrawPrimitive_t(); // 698
					CSceneDrawList::Init(); // 699
					CSceneDrawList::CSceneDrawList(); // 341
					simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
					CTSPool<CSceneDrawList>::GetObject(); // 1269
					CSceneDrawList::Init(); // 1270
					ThreadInterlockedIncrement(volatile int32* p); // 576
					CInterlockedIntT<int, 4>::operator++(); // 1272
					CSceneSystem::GetNewDrawList(); // 2489
					{
					}
					CSceneDrawList::Check(); // 736
					CSceneDrawList::NumRemainingSlots(); // 2493
					Min<int>(const int& val1,
						const int& val2);  // 2493
					memcpy(void* __dest,
						const void* __src,
						size_t __len);  // 91
					V_memcpy(void* dest,
						const void* src,
						size_t count);  // 2497
					{
					}
					CSceneDrawList::Check(); // 736
					CSceneDrawList::NumRemainingSlots(); // 2486
					CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
					CUtlMemory<CSceneDrawList::operator[](
							int i);  // 602
					CUtlVectorBase<CSceneDrawList::Element(
						int i);  // 1201
					CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
									CSceneDrawList* const& src);  // 1201
					CUtlMemory<CSceneDrawList::Base(); // 112
					CUtlVectorBase<CSceneDrawList::Base(); // 368
					CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
					CUtlVectorBase<CSceneDrawList::GrowMemory(
							int num);  // 1198
					CUtlVectorBase<CSceneDrawList::AddToTail(
							CSceneDrawList* const& src);  // 2490
				}
				{
				}
				CSceneDrawList::Check(); // 1278
				ThreadPause(void); // 173
				ThreadInterlockedAssignIf128(volatile int128* pDest,
								const int128& value,
								const int128& comparand);  // 478
				ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
									const InterlockedPointerX2SizedInt_t& value,
									const InterlockedPointerX2SizedInt_t& comperand);  // 168
				CTSListBase::Push(
					TSLNodeBase_t* pNode);  // 371
				CTSPool<CSceneDrawList>::PutObject(
						CSceneDrawList* pInfo);  // 1281
				ThreadInterlockedDecrement(volatile int32* p); // 586
				CInterlockedIntT<int, 4>::operator--(); // 1282
				CSceneSystem::ReturnDrawListToPool(
							CSceneDrawList* pList);  // 2504
			}
		}
		{
			int nNumRemainingSlots; // 2509
			{
				bool bIsDepthPass; // 2518
				bool ()(const CMeshDrawPrimitive_t &, const CMeshDrawPrimitive_t &)* pSortLessFunc; // 2519
				CUtlVectorFixedGrowable<CSceneDrawList*, 32> listsSeen; // 2523
				int nNumTotalPrimitives; // 2524
				int nNumLists; // 2531
				{
					CSceneDrawList* pNode; // 2525
					CUtlMemory<CSceneDrawList::Base(); // 112
					CUtlVectorBase<CSceneDrawList::Base(); // 368
					CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
					CUtlVectorBase<CSceneDrawList::GrowMemory(
							int num);  // 1198
					CUtlMemory<CSceneDrawList::operator[](
							int i);  // 602
					CUtlVectorBase<CSceneDrawList::Element(
						int i);  // 1201
					CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
									CSceneDrawList* const& src);  // 1201
					CUtlVectorBase<CSceneDrawList::AddToTail(
							CSceneDrawList* const& src);  // 2528
				}
				{
					int nCurObjectCounter; // 2535
					{
						CMeshDrawPrimitive_t* pNextNode; // 2537
						int nLowestListIndex; // 2538
						CMeshDrawPrimitive_t* pOut; // 2553
						CMeshDrawPrimitive_t* pIn; // 2554
						{
							int i; // 2539
							{
								CSceneDrawList* subList; // 2541
								CUtlMemory<CSceneDrawList::operator[](
										int i);  // 588
								CUtlVectorBase<CSceneDrawList::operator[](
										int i);  // 2541
								CSceneDrawList::Count(); // 2544
							}
						}
						{
							const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2569
						}
						ThreadPause(void); // 208
						ThreadInterlockedAssignIf128(volatile int128* pDest,
										const int128& value,
										const int128& comparand);  // 478
						ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
											const InterlockedPointerX2SizedInt_t& value,
											const InterlockedPointerX2SizedInt_t& comperand);  // 203
						CTSListBase::Pop(); // 376
						LightProbeVolumeBinding_t::LightProbeVolumeBinding_t(); // 1113
						Vector4D::Vector4D(); // 1113
						CMeshDrawPrimitive_t::CMeshDrawPrimitive_t(); // 698
						CSceneDrawList::Init(); // 699
						CSceneDrawList::CSceneDrawList(); // 341
						simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
						CTSPool<CSceneDrawList>::GetObject(); // 1269
						CSceneDrawList::Init(); // 1270
						ThreadInterlockedIncrement(volatile int32* p); // 576
						CInterlockedIntT<int, 4>::operator++(); // 1272
						CSceneSystem::GetNewDrawList(); // 2564
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 588
						CUtlVectorBase<CSceneDrawList::operator[](
								int i);  // 2554
						Vector4D::operator=(
								const Vector4D& vOther);  // 1113
						CMeshDrawPrimitive_t::operator=(
								const CMeshDrawPrimitive_t  &);  // 2555
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 588
						CUtlVectorBase<CSceneDrawList::operator[](
								int i);  // 2572
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 588
						CUtlVectorBase<CSceneDrawList::operator[](
								int i);  // 2575
						CSceneDrawList::Count(); // 2575
						{
						}
						CSceneDrawList::Check(); // 736
						CSceneDrawList::NumRemainingSlots(); // 2565
						CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 602
						CUtlVectorBase<CSceneDrawList::Element(
							int i);  // 1201
						CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
										CSceneDrawList* const& src);  // 1201
						CUtlMemory<CSceneDrawList::Base(); // 112
						CUtlVectorBase<CSceneDrawList::Base(); // 368
						CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
						CUtlVectorBase<CSceneDrawList::GrowMemory(
								int num);  // 1198
						CUtlVectorBase<CSceneDrawList::AddToTail(
								CSceneDrawList* const& src);  // 2566
						{
						}
						CSceneDrawList::Check(); // 1278
						ThreadPause(void); // 173
						ThreadInterlockedAssignIf128(volatile int128* pDest,
										const int128& value,
										const int128& comparand);  // 478
						ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
											const InterlockedPointerX2SizedInt_t& value,
											const InterlockedPointerX2SizedInt_t& comperand);  // 168
						CTSListBase::Push(
							TSLNodeBase_t* pNode);  // 371
						CTSPool<CSceneDrawList>::PutObject(
								CSceneDrawList* pInfo);  // 1281
						ThreadInterlockedDecrement(volatile int32* p); // 586
						CInterlockedIntT<int, 4>::operator--(); // 1282
						CSceneSystem::ReturnDrawListToPool(
									CSceneDrawList* pList);  // 2578
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 588
						CUtlVectorBase<CSceneDrawList::operator[](
								int i);  // 2583
						CUtlMemory<CSceneDrawList::operator[](
								int i);  // 588
						CUtlVectorBase<CSceneDrawList::operator[](
								int i);  // 2583
						{
						}
						CSceneDrawList::Check(); // 736
						CSceneDrawList::NumRemainingSlots(); // 2565
					}
				}
				CUtlMemory<CSceneDrawList::CUtlMemory(
						CSceneDrawList** pMemory,
						int numElements,
						bool bGrowable,
						uint32 nGrowable_GrowSize);  // 197
				CUtlMemory<CSceneDrawList::EnsureCapacity(
						int num);  // 199
				CUtlMemoryFixedGrowable_Base<CSceneDrawList::CUtlMemoryFixedGrowable_Base(
								CSceneDrawList** pFixedMemory,
								int nFixedElements,
								int nGrowSize,
								int nInitAllocationCount);  // 228
				AlignedByteArrayExplicit_t<32, CSceneDrawList::AlignedByteArrayExplicit_t(); // 1597
				AlignedByteArray_t<32, CSceneDrawList::AlignedByteArray_t(); // 228
				AlignedByteArrayExplicit_t<32, CSceneDrawList::Base(); // 231
				CUtlMemoryFixedGrowable<CSceneDrawList::CUtlMemoryFixedGrowable(
							int nGrowSize,
							int nInitSize);  // 527
				CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 530
				CUtlVectorBase<CSceneDrawList::CUtlVectorBase(
						int growSize,
						int initCapacity);  // 484
				CUtlVectorFixedGrowable<CSceneDrawList::CUtlVectorFixedGrowable(
							int growSize);  // 2523
				CUtlVectorBase<CSceneDrawList::Count(); // 2531
				CUtlMemory<CSceneDrawList::IsExternallyAllocated(); // 577
				CUtlMemory<CSceneDrawList::ConvertToExternalMemory(
							CSceneDrawList** pMemory,
							int numElements,
							int nCopyElements,
							bool bSetGrowable,
							uint32 nGrowable_GrowSize);  // 207
				CUtlMemoryFixedGrowable_Base<CSceneDrawList::Purge_FixedGrowable(
							CSceneDrawList** pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 203
				CUtlMemoryFixedGrowable_Base<CSceneDrawList::Purge_FixedGrowable(
							CSceneDrawList** pFixedMemory,
							int nFixedElements,
							int nPurgeToCount);  // 237
				AlignedByteArrayExplicit_t<32, CSceneDrawList::Base(); // 237
				CUtlMemoryFixedGrowable<CSceneDrawList::Purge(
					int numElements);  // 1799
				CUtlVectorBase<CSceneDrawList::RemoveAll(); // 1798
				CUtlMemory<CSceneDrawList::Base(); // 112
				CUtlVectorBase<CSceneDrawList::Base(); // 368
				CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 1800
				CUtlVectorBase<CSceneDrawList::Purge(); // 560
				CUtlMemory<CSceneDrawList::Purge(); // 903
				CUtlMemory<CSceneDrawList::Purge(); // 510
				ValidateAlignment<CSceneDrawList*>(void); // 508
				CUtlMemory<CSceneDrawList::~CUtlMemory(); // 191
				CUtlMemoryFixedGrowable_Base<CSceneDrawList::~CUtlMemoryFixedGrowable_Base(); // 223
				CUtlMemoryFixedGrowable<CSceneDrawList::~CUtlMemoryFixedGrowable(); // 562
				CUtlVectorBase<CSceneDrawList::~CUtlVectorBase(); // 478
				CUtlVectorFixedGrowable<CSceneDrawList::~CUtlVectorFixedGrowable(); // 2589
			}
			{
				CSceneDrawList** pPrev; // 2595
				CSceneDrawList* pBest; // 2596
				CSceneDrawList** pPrevOfBest; // 2597
				uint32 nLowestSortKey; // 2598
				{
					CSceneDrawList* pNode; // 2599
				}
				Vector4D::operator=(
						const Vector4D& vOther);  // 1113
				CMeshDrawPrimitive_t::operator=(
						const CMeshDrawPrimitive_t  &);  // 2611
				ThreadPause(void); // 208
				ThreadInterlockedAssignIf128(volatile int128* pDest,
								const int128& value,
								const int128& comparand);  // 478
				ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
									const InterlockedPointerX2SizedInt_t& value,
									const InterlockedPointerX2SizedInt_t& comperand);  // 203
				CTSListBase::Pop(); // 376
				LightProbeVolumeBinding_t::LightProbeVolumeBinding_t(); // 1113
				Vector4D::Vector4D(); // 1113
				CMeshDrawPrimitive_t::CMeshDrawPrimitive_t(); // 698
				CSceneDrawList::Init(); // 699
				CSceneDrawList::CSceneDrawList(); // 341
				simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
				CTSPool<CSceneDrawList>::GetObject(); // 1269
				CSceneDrawList::Init(); // 1270
				ThreadInterlockedIncrement(volatile int32* p); // 576
				CInterlockedIntT<int, 4>::operator++(); // 1272
				CSceneSystem::GetNewDrawList(); // 2627
				{
				}
				CSceneDrawList::Check(); // 736
				CSceneDrawList::NumRemainingSlots(); // 2628
				CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
				CUtlMemory<CSceneDrawList::operator[](
						int i);  // 602
				CUtlVectorBase<CSceneDrawList::Element(
					int i);  // 1201
				CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
								CSceneDrawList* const& src);  // 1201
				CUtlMemory<CSceneDrawList::Base(); // 112
				CUtlVectorBase<CSceneDrawList::Base(); // 368
				CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
				CUtlVectorBase<CSceneDrawList::GrowMemory(
						int num);  // 1198
				CUtlVectorBase<CSceneDrawList::AddToTail(
						CSceneDrawList* const& src);  // 2629
				{
				}
				CSceneDrawList::Check(); // 1278
				ThreadPause(void); // 173
				ThreadInterlockedAssignIf128(volatile int128* pDest,
								const int128& value,
								const int128& comparand);  // 478
				ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
									const InterlockedPointerX2SizedInt_t& value,
									const InterlockedPointerX2SizedInt_t& comperand);  // 168
				CTSListBase::Push(
					TSLNodeBase_t* pNode);  // 371
				CTSPool<CSceneDrawList>::PutObject(
						CSceneDrawList* pInfo);  // 1281
				ThreadInterlockedDecrement(volatile int32* p); // 586
				CInterlockedIntT<int, 4>::operator--(); // 1282
				CSceneSystem::ReturnDrawListToPool(
							CSceneDrawList* pList);  // 2619
				{
				}
				CSceneDrawList::Check(); // 736
				CSceneDrawList::NumRemainingSlots(); // 2628
			}
			{
			}
			CSceneDrawList::Check(); // 736
			CSceneDrawList::NumRemainingSlots(); // 2509
			{
			}
			CSceneDrawList::Check(); // 736
			CSceneDrawList::NumRemainingSlots(); // 2509
		}
		ThreadPause(void); // 208
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 203
		CTSListBase::Pop(); // 376
		LightProbeVolumeBinding_t::LightProbeVolumeBinding_t(); // 1113
		Vector4D::Vector4D(); // 1113
		CMeshDrawPrimitive_t::CMeshDrawPrimitive_t(); // 698
		CSceneDrawList::Init(); // 699
		CSceneDrawList::CSceneDrawList(); // 341
		simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
		CTSPool<CSceneDrawList>::GetObject(); // 1269
		CSceneDrawList::Init(); // 1270
		ThreadInterlockedIncrement(volatile int32* p); // 576
		CInterlockedIntT<int, 4>::operator++(); // 1272
		CSceneSystem::GetNewDrawList(); // 2474
		CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
		CUtlMemory<CSceneDrawList::operator[](
				int i);  // 602
		CUtlVectorBase<CSceneDrawList::Element(
			int i);  // 1201
		CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
						CSceneDrawList* const& src);  // 1201
		CUtlMemory<CSceneDrawList::Base(); // 112
		CUtlVectorBase<CSceneDrawList::Base(); // 368
		CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
		CUtlVectorBase<CSceneDrawList::GrowMemory(
				int num);  // 1198
		CUtlVectorBase<CSceneDrawList::AddToTail(
				CSceneDrawList* const& src);  // 2475
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2636
	}
	{
		int i; // 2640
		{
			CSceneDrawList* pCurOutList; // 2642
			{
				CRenderBatchList* pBatchList; // 2645
				int nIndex; // 2646
				bool bFirstBatch; // 2647
				CUtlMemoryPool<CRenderBatchList>::Alloc(); // 180
				Construct<CRenderBatchList>(CRenderBatchList* pMemory); // 185
				CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::Alloc(); // 2666
				ThreadInterlockedIncrement(volatile int32* p); // 576
				CInterlockedIntT<int, 4>::operator++(); // 582
				CInterlockedIntT<int, 4>::operator++(
						int);  // 2664
				CSceneSystem::GetBatchList(); // 2645
				CUtlMemory<CRenderBatchList::NumAllocated(); // 1196
				CUtlMemory<CRenderBatchList::operator[](
						int i);  // 602
				CUtlVectorBase<CRenderBatchList::Element(
					int i);  // 1201
				CopyConstruct<CRenderBatchList*>(CRenderBatchList** pMemory,
								CRenderBatchList* const& src);  // 1201
				CUtlMemory<CRenderBatchList::Base(); // 112
				CUtlVectorBase<CRenderBatchList::Base(); // 368
				CUtlVectorBase<CRenderBatchList::ResetDbgInfo(); // 824
				CUtlVectorBase<CRenderBatchList::GrowMemory(
						int num);  // 1198
				CUtlVectorBase<CRenderBatchList::AddToTail(
						CRenderBatchList* const& src);  // 2646
				ConVar::GetInt(); // 2400
				{
				}
				CSceneDrawList::Check(); // 2288
				CSceneSystem::DrawObjectsToLayer(
							CSceneView* pView,
							CSceneDrawList* pList,
							CSceneLayer* pLayer,
							CRenderBatchList* pBatchList);  // 2290
				CSceneSystem::DrawObjectsToLayer(
							CSceneView* pView,
							CSceneDrawList* pList,
							CSceneLayer* pLayer,
							CRenderBatchList* pBatchList);  // 2293
				CSceneSystem::DrawDrawList(
						CSceneView* pView,
						CSceneLayer* pLayer,
						CSceneDrawList* pList,
						CRenderBatchList* pBatchList);  // 2419
				{
				}
				CSceneDrawList::Check(); // 1278
				ThreadPause(void); // 173
				ThreadInterlockedAssignIf128(volatile int128* pDest,
								const int128& value,
								const int128& comparand);  // 478
				ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
									const InterlockedPointerX2SizedInt_t& value,
									const InterlockedPointerX2SizedInt_t& comperand);  // 168
				CTSListBase::Push(
					TSLNodeBase_t* pNode);  // 371
				CTSPool<CSceneDrawList>::PutObject(
						CSceneDrawList* pInfo);  // 1281
				CSceneSystem::ReturnDrawListToPool(
							CSceneDrawList* pList);  // 2422
				{
					const char* szLabel; // 2405
					CFmtStr1024 label; // 2407
					ThreadInterlockedIncrement(volatile int32* p); // 576
					CInterlockedIntT<int, 4>::operator++(); // 582
					CInterlockedIntT<int, 4>::operator++(
							int);  // 2402
					ThreadInterlockedIncrement(volatile int32* p); // 576
					CInterlockedIntT<int, 4>::operator++(); // 582
					CInterlockedIntT<int, 4>::operator++(
							int);  // 2403
					ISceneLayer::GetDebugName(); // 2407
					CBufferString::ReadBuffer(); // 1374
					CBufferString::ReadBuffer(); // 771
					CBufferString::Get(); // 81
					CFmtStrN<1024>::String(); // 2408
					{
						_M_create<CSceneSystem::QueueDrawDrawList(CSceneView*, CSceneLayer*, CSceneDrawList*, CRenderBatchList*, EBatchStartFlags_t)::<lambda()> >(union _Any_data& __dest,
																class& __f,
																false_type); // 217
						_M_init_functor<CSceneSystem::QueueDrawDrawList(CSceneView*, CSceneLayer*, CSceneDrawList*, CRenderBatchList*, EBatchStartFlags_t)::<lambda()> >(union _Any_data& __functor,
																class& __f); // 451
						_M_not_empty_function<CSceneSystem::QueueDrawDrawList(CSceneView*, CSceneLayer*, CSceneDrawList*, CRenderBatchList*, EBatchStartFlags_t)::<lambda()> >(const &); // 449
					}
					_Function_base::_Function_base(); // 439
					function<void()>::function<CSceneSystem::QueueDrawDrawList(
																class& __f); // 2411
					ThreadInterlockedIncrement(volatile int32* p); // 576
					CInterlockedIntT<int, 4>::operator++(); // 582
					CInterlockedIntT<int, 4>::operator++(
							int);  // 100
					CUtlMultiJobProcessor::RegisterUnfinishedJob(); // 52
					IThreadPool::QueueCallWithFlags(
								const char* szDescription,
								JobPriority_t jobPriority,
								uint nFlags,
								function<void()>& func);  // 55
					CUtlMultiJobProcessor::QueueJobWithFlags(
								const char* szDescription,
								JobPriority_t jobPriority,
								uint nFlags,
								function<void()>& func);  // 50
					_Function_base::_M_empty(); // 591
					function<void()>::operator()(const function<void()>* this); // 57
					CUtlMultiJobProcessor::QueueJobWithFlags(
								const char* szDescription,
								JobPriority_t jobPriority,
								uint nFlags,
								function<void()>& func);  // 62
					CUtlMultiJobProcessor::QueueJob(
						const char* szDescription,
						function<void()>& func);  // 2411
					_Function_base::~_Function_base(); // 336
					function<void()>::~function()>* this); // 2411
					CBufferString::~CBufferString(); // 587
					CBufferStringN<1024>::~CBufferStringN(); // 41
					CFmtStrN<1024>::~CFmtStrN(); // 2415
				}
				CSceneSystem::QueueDrawDrawList(
							CSceneView* pView,
							CSceneLayer* pLayer,
							CSceneDrawList* pList,
							CRenderBatchList* pBatchList,
							EBatchStartFlags_t nBatchFlags);  // 2648
			}
			ThreadPause(void); // 173
			ThreadInterlockedAssignIf128(volatile int128* pDest,
							const int128& value,
							const int128& comparand);  // 478
			ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
								const InterlockedPointerX2SizedInt_t& value,
								const InterlockedPointerX2SizedInt_t& comperand);  // 168
			CTSListBase::Push(
				TSLNodeBase_t* pNode);  // 371
			CTSPool<CSceneDrawList>::PutObject(
					CSceneDrawList* pInfo);  // 1281
			ThreadInterlockedDecrement(volatile int32* p); // 586
			CInterlockedIntT<int, 4>::operator--(); // 1282
			{
			}
			CSceneDrawList::Check(); // 1278
			CSceneSystem::ReturnDrawListToPool(
						CSceneDrawList* pList);  // 2652
			CSceneDrawList::IsEmpty(); // 2643
			CUtlMemory<CSceneDrawList::operator[](
					int i);  // 588
			CUtlVectorBase<CSceneDrawList::operator[](
					int i);  // 2642
		}
	}
	CUtlIntrusiveList<CSceneDrawList>::CUtlIntrusiveList(); // 2434
	CUtlMemory<CSceneDrawList::CUtlMemory(
			CSceneDrawList** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 535
	CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 538
	CUtlVectorBase<CSceneDrawList::CUtlVectorBase(
			CSceneDrawList** pMemory,
			int allocationCount,
			int initialCount,
			bool bGrowable);  // 420
	CUtlVector<CSceneDrawList::CUtlVector(
			CSceneDrawList** pMemory,
			int allocationCount,
			int initialCount,
			bool bGrowable);  // 495
	AlignedByteArrayExplicit_t<32, CSceneDrawList::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<32, CSceneDrawList::AlignedByteArray_t(); // 495
	AlignedByteArrayExplicit_t<32, CSceneDrawList::Base(); // 497
	CUtlVectorFixedGrowableCompat<CSceneDrawList::CUtlVectorFixedGrowableCompat(
					int growSize);  // 2428
	ConVar::GetInt(); // 351
	ConVar::GetBool(); // 216
	ForceSingleDisplayListForLayer(const CSceneLayer* pLayer); // 2449
	ISceneLayer::GetObjectFlagsRequiredMask(); // 2447
	ConVar::GetInt(); // 2459
	CUtlVectorBase<CRenderBatchList::Count(); // 2636
	CUtlVectorBase<CSceneDrawList::Count(); // 2638
	CUtlMemory<CRenderBatchList::IsGrowable(); // 881
	CUtlMemory<CRenderBatchList::IsExternallyAllocated(); // 888
	CUtlMemory<CRenderBatchList::EnsureCapacity(
			int num);  // 1006
	CUtlVectorBase<CRenderBatchList::ResetDbgInfo(); // 1024
	CUtlVectorBase<CRenderBatchList::EnsureCapacity(
			int num);  // 2639
	CUtlVectorBase<CSceneDrawList::RemoveAll(); // 1798
	CUtlMemory<CSceneDrawList::IsExternallyAllocated(); // 905
	CUtlMemory<CSceneDrawList::Purge(); // 903
	CUtlMemory<CSceneDrawList::Purge(); // 1799
	CUtlVectorBase<CSceneDrawList::Purge(); // 560
	ValidateAlignment<CSceneDrawList*>(void); // 508
	CUtlMemory<CSceneDrawList::Purge(); // 510
	CUtlMemory<CSceneDrawList::~CUtlMemory(); // 562
	CUtlVectorBase<CSceneDrawList::~CUtlVectorBase(); // 410
	CUtlVector<CSceneDrawList::~CUtlVector(); // 489
	CUtlVectorFixedGrowableCompat<CSceneDrawList::~CUtlVectorFixedGrowableCompat(); // 2655
} /* size: 0, variables: 10, inline expansions: 32 (795 bytes) */

// <02F3E1E9> ../scenesystem/scenesystem.cpp:2661
// function calls: 6
void CSceneSystem::GetBatchList()
{
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<int, 4>::operator++(); // 582
	CInterlockedIntT<int, 4>::operator++(
			int);  // 2664
	CUtlMemoryPool<CRenderBatchList>::Alloc(); // 180
	Construct<CRenderBatchList>(CRenderBatchList* pMemory); // 185
	CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::Alloc(); // 2666
} /* size: 55, inline expansions: 6 (85 bytes) */

// <02EE65FF> ../scenesystem/scenesystem.cpp:2661
void CSceneSystem::GetBatchList()
{
} /* size: 0 */

// <02F3E36A> ../scenesystem/scenesystem.cpp:2669
// function calls: 6
void CSceneSystem::FreeBatchList(CRenderBatchList* pList)
{
	ThreadInterlockedDecrement(volatile int32* p); // 586
	CInterlockedIntT<int, 4>::operator--(); // 592
	CInterlockedIntT<int, 4>::operator--(
			int);  // 2672
	Destruct<CRenderBatchList>(CRenderBatchList* pMemory); // 211
	CUtlMemoryPool<CRenderBatchList>::Free(
		CRenderBatchList* pMem);  // 214
	CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::Free(
		CRenderBatchList* pMem);  // 2674
} /* size: 0, inline expansions: 6 (0 bytes) */

// <02EE65D9> ../scenesystem/scenesystem.cpp:2669
void CSceneSystem::FreeBatchList(CRenderBatchList* pList)
{
} /* size: 0 */

// <02EE64EC> ../scenesystem/scenesystem.cpp:2677
// function calls: 3
void CSceneSystem::GetSceneLayer()
{
	CUtlMemoryPool<CSceneLayer>::Alloc(); // 180
	Construct<CSceneLayer>(CSceneLayer* pMemory); // 185
	CClassMemoryPool<CSceneLayer, CUtlMemoryPool<CSceneLayer> >::Alloc(); // 2679
} /* size: 47, inline expansions: 3 (61 bytes) */

// <02EE63E0> ../scenesystem/scenesystem.cpp:2682
// function calls: 3
void CSceneSystem::FreeSceneLayer(CSceneLayer* pLayer)
{
	Destruct<CSceneLayer>(CSceneLayer* pMemory); // 211
	CUtlMemoryPool<CSceneLayer>::Free(
		CSceneLayer* pMem);  // 214
	CClassMemoryPool<CSceneLayer, CUtlMemoryPool<CSceneLayer> >::Free(
		CSceneLayer* pMem);  // 2684
} /* size: 58, inline expansions: 3 (69 bytes) */

// <02DF13FE> ../scenesystem/scenesystem.cpp:2687
// member functions: 3
// member variables: 3
// struct size: 24
struct PendingVisitList_t {
	uint m_nNumObjects; /* 0 4 */
	const class CSceneObjectReference_t * m_pObjectReferences; /* 8 8 */
	const uint32 * m_pVisBits; /* 16 8 */
	/* ../scenesystem/scenesystem.cpp:2693 */
	void PendingVisitList_t(PendingVisitList_t* );
	/* ../scenesystem/scenesystem.cpp:2697 */
	void PendingVisitList_t(PendingVisitList_t* , const CSceneObjectReference_t* , int, const uint32* );
	/* ../scenesystem/scenesystem.cpp:2704 */
	void PendingVisitList_t(PendingVisitList_t* , const CSceneWorldObjectListChunk* , const uint32* );
};

// <02EE63BF> ../scenesystem/scenesystem.cpp:2704
void PendingVisitList_t::PendingVisitList_t(const CSceneWorldObjectListChunk* pChunk, const uint32* pVisBits)
{
} /* size: 0 */

// <02EE638C> ../scenesystem/scenesystem.cpp:2704
inline void PendingVisitList_t::PendingVisitList_t(const CSceneWorldObjectListChunk* pChunk, const uint32* pVisBits)
{
} /* size: 0 */

// <02EA7E2C> ../scenesystem/scenesystem.cpp:2723
// variables: 4
inline bool HasAnyElementsPassingTest<CUtlIntrusiveList<CSceneDrawList> [8], CSceneSystem::CheckForPendingDraws(CSceneView*)::<lambda(const CUtlIntrusiveList<CSceneDrawList>&)> >(const CUtlIntrusiveList<CSceneDrawList>& c, f)
{
	{
		const CUtlIntrusiveList<CSceneDrawList>& elem; // 2725
		const CUtlIntrusiveList<CSceneDrawList>& __for_range; // 5831
		const CUtlIntrusiveList<CSceneDrawList>* __for_begin; // 35028
		const CUtlIntrusiveList<CSceneDrawList>* __for_end; // 35028
	}
} /* size: 0 */

// <02EE3F3F> ../scenesystem/scenesystem.cpp:2753
// variables: 12
// function calls: 100
void DebugDrawRejectedObject(CSceneView* pView, const CSceneObjectReference_t* pRef, ERejectedReason_t nReason)
{
	ISceneViewDebugOverlays* pOverlay; // 2755
	Vector vCenter; // 2757
	const float  flTextLineSize; // 2758
	const VMatrix& mViewProj; // 2760
	Vector vCenter2D; // 2761
	int nLineOffset; // 2769
	CSceneObject* pObject; // 2771
	CPathBufferString txt; // 2772
	{
		CMeshInstance* pCurrentMeshInstance; // 2777
		{
			CPathBufferString modelName; // 2779
			CBufferString::InitMinConstruct(
					bool bGrowable);  // 712
			CBufferString::CBufferString(); // 591
			CBufferStringN<200>::CBufferStringN(); // 2779
			CWeakHandle<InfoForResourceTypeCModel>::CWeakHandle(); // 226
			FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
			CStrongHandle<InfoForResourceTypeCModel>::operator CWeakHandle<InfoForResourceTypeCModel>(); // 100
			CModelMeshHandleBase<CStrongHandle<InfoForResourceTypeCModel> >::GetModelHandle(); // 2780
			CUtlSymbolLarge::String(); // 148
			CBufferString::Append(
				const char* pString,
				int nChars,
				bool bExact);  // 148
			ResourceGetName(ResourceNameHandle_t hResourceName,
					CBufferString* pOutBuffer,
					bool bAppend);  // 172
			ResourceGetName(ResourceHandle_t hResource,
					CBufferString* pOutBuffer,
					bool bAppend);  // 2780
			CBufferString::ReadBuffer(); // 1374
			CBufferString::ReadBuffer(); // 781
			CBufferString::operator char const*(); // 2781
			Vector2D::Vector2D(
				vec_t X,
				vec_t Y);  // 560
			VertexColor_t::VertexColor_t(
					uint8 ir,
					uint8 ig,
					uint8 ib,
					uint8 ia);  // 560
			ISceneViewDebugOverlays::ScreenTextOffset(
					float fXpos,
					float fYpos,
					int nTextLineOffsetY,
					const char* pText,
					int r,
					int g,
					int b,
					int a,
					float64 flTimeToLive);  // 2781
			CBufferString::~CBufferString(); // 587
			CBufferStringN<200>::~CBufferStringN(); // 2783
		}
		CSceneObject::GetMeshInstanceData(); // 2777
	}
	{
		fltx4 retVal; // 1593
		_mm_add_ps(__m128 __A,
				__m128 __B);  // 1594
	}
	AddSIMD<>(const fltx4& a,
			const fltx4& b);  // 250
	VectorAligned::operator fltx4(); // 250
	VectorAligned::VectorAligned(
			fltx4 rhs);  // 250
	VectorAligned::operator+(
			const VectorAligned& v);  // 2757
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 268
	VectorAligned::VectorAligned(
			fltx4 rhs);  // 268
	VectorAligned::operator*(
			vec_t s);  // 2757
	CFrustum::GetViewProj(); // 2760
	_mm_cvtss_f32(__m128 __A); // 1534
	GetZSIMD<>(fltx4 a); // 76
	VectorAligned::z(); // 40
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 40
	VectorAligned::operator Vector(); // 2757
	Vector::Vector(); // 2761
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 2763
	Vector::operator*=(
			const Vector& v);  // 2763
	Vector::operator+=(
			const Vector& v);  // 2764
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<200>::CBufferStringN(); // 2772
	CSceneObject::GetDesc(); // 2773
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 2764
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 781
	CBufferString::operator char const*(); // 2774
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2774
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 2860
	ISceneViewDebugOverlays::Box(
		const Vector& vWorldMins,
		const Vector& vWorldMaxs,
		const VertexColor_t& color,
		bool bNoDepthTest,
		float64 flTimeToLive);  // 2860
	_mm_cvtss_f32(__m128 __A); // 1534
	GetZSIMD<>(fltx4 a); // 76
	VectorAligned::z(); // 40
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 40
	VectorAligned::operator Vector(); // 2860
	_mm_cvtss_f32(__m128 __A); // 1534
	GetZSIMD<>(fltx4 a); // 76
	VectorAligned::z(); // 40
	Vector::Vector(
		vec_t X,
		vec_t Y,
		vec_t Z);  // 40
	VectorAligned::operator Vector(); // 2860
	CBufferString::~CBufferString(); // 587
	CBufferStringN<200>::~CBufferStringN(); // 2861
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2851
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2846
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2841
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2836
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2826
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2821
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2816
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2806
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2801
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2796
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2791
	Vector2D::Vector2D(
		vec_t X,
		vec_t Y);  // 560
	VertexColor_t::VertexColor_t(
			uint8 ir,
			uint8 ig,
			uint8 ib,
			uint8 ia);  // 560
	ISceneViewDebugOverlays::ScreenTextOffset(
			float fXpos,
			float fYpos,
			int nTextLineOffsetY,
			const char* pText,
			int r,
			int g,
			int b,
			int a,
			float64 flTimeToLive);  // 2786
} /* size: 2022, variables: 8, inline expansions: 78 (1641 bytes) */

// <02F42A6E> ../scenesystem/scenesystem.cpp:2875
// variable: 1
// function calls: 2
void CSceneSystem::CheckForPendingDraws(CSceneView* pView)
{
	int nNumLeft; // 2880
	ThreadInterlockedExchangeAdd(volatile int32* p,
					int32 value);  // 660
	CInterlockedIntT<int, 4>::AtomicAdd(
			int add);  // 2880
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <02F4211C> ../scenesystem/scenesystem.cpp:2875
// variables: 13
// function calls: 36
void CSceneSystem::CheckForPendingDraws(CSceneView* pView)
{
	int nNumLeft; // 2880
	{
		CSceneLayer* pLayer; // 2885
		CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short unsigned int>, int> >& __for_range; // 54947
		iterator __for_begin; // 54957
		iterator __for_end; // 54967
		CUtlLinkedList<CSceneLayer::Head(); // 334
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 334
		CUtlLinkedList<CSceneLayer::begin(); // 2885
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 343
		CUtlLinkedList<CSceneLayer::end(); // 2885
		{
			ConVar::GetInt(); // 351
			ConVar::GetBool(); // 216
			ForceSingleDisplayListForLayer(const CSceneLayer* pLayer); // 2895
			{
				CRenderBatchList* pBatchList; // 2899
				int nIndex; // 2900
				ThreadInterlockedIncrement(volatile int32* p); // 576
				CInterlockedIntT<int, 4>::operator++(); // 582
				CInterlockedIntT<int, 4>::operator++(
						int);  // 2664
				CUtlMemoryPool<CRenderBatchList>::Alloc(); // 180
				Construct<CRenderBatchList>(CRenderBatchList* pMemory); // 185
				CClassMemoryPool<CRenderBatchList, CUtlMemoryPool<CRenderBatchList> >::Alloc(); // 2666
				CSceneSystem::GetBatchList(); // 2899
				CUtlMemory<CRenderBatchList::NumAllocated(); // 1196
				CUtlMemory<CRenderBatchList::operator[](
						int i);  // 602
				CUtlVectorBase<CRenderBatchList::Element(
					int i);  // 1201
				CopyConstruct<CRenderBatchList*>(CRenderBatchList** pMemory,
								CRenderBatchList* const& src);  // 1201
				CUtlMemory<CRenderBatchList::Base(); // 112
				CUtlVectorBase<CRenderBatchList::Base(); // 368
				CUtlVectorBase<CRenderBatchList::ResetDbgInfo(); // 824
				CUtlVectorBase<CRenderBatchList::GrowMemory(
						int num);  // 1198
				CUtlVectorBase<CRenderBatchList::AddToTail(
						CRenderBatchList* const& src);  // 2900
				{
				}
			}
			{
				const CUtlIntrusiveList<CSceneDrawList>& elem; // 2725
				const CUtlIntrusiveList<CSceneDrawList>& __for_range; // 5777
				const CUtlIntrusiveList<CSceneDrawList>* __for_begin; // 5787
				const CUtlIntrusiveList<CSceneDrawList>* __for_end; // 5797
				CUtlIntrusiveList<CSceneDrawList>::Head(); // 2887
				operator()(const class* __closure,
						const CUtlIntrusiveList<CSceneDrawList>& list); // 2727
			}
			HasAnyElementsPassingTest<CUtlIntrusiveList<CSceneDrawList> [8], CSceneSystem::CheckForPendingDraws(CSceneView*)::<lambda(const CUtlIntrusiveList<CSceneDrawList>&)> >(const CUtlIntrusiveList<CSceneDrawList>& c,
																 f); // 2887
		}
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 482
		CUtlLinkedList<CSceneLayer::Element(
			int i);  // 317
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator*(); // 2885
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 368
		CUtlLinkedList<CSceneLayer::InternalElement(
				int i);  // 550
		CUtlLinkedList<CSceneLayer::Next(
			int i);  // 272
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator++(); // 2885
	}
} /* size: 0, variables: 1 */

// <02EE3E3C> ../scenesystem/scenesystem.cpp:2875
// variables: 9
void CSceneSystem::CheckForPendingDraws(CSceneView* pView)
{
	int nNumLeft; // 2880
	const char   __FUNCTION__; // 63709
	{
		CSceneLayer* pLayer; // 2885
		CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short unsigned int>, int> >& __for_range; // 46800
		iterator __for_begin; // 65515
		iterator __for_end; // 65515
		{
			{
				CRenderBatchList* pBatchList; // 2899
				int nIndex; // 2900
				{
					const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2901
				}
			}
		}
	}
} /* size: 0, variables: 2 */

// <02EE2F68> ../scenesystem/scenesystem.cpp:2914
// variables: 37
// function calls: 58
bool IsBoxCulledByCullingBoxes(const VectorAligned& vBoxMin, const VectorAligned& vBoxMax, const CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >& includerBoxes, const CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >& excluderBoxes)
{
	const int  NUM_BOX_PLANES; // 2916
	fltx4 vMins4; // 2918
	fltx4 vMaxs4; // 2919
	fltx4 vCenter4; // 2922
	fltx4 vDiagonal4; // 2923
	const int  nNumExcluders; // 2931
	const int  nNumIncluders; // 2941
	{
		int iExcluder; // 2932
		CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::operator[](
				int i);  // 2934
	}
	{
		int iIncluder; // 2944
		{
			uint i; // 127
			{
				fltx4 np; // 129
				fltx4 mp; // 130
				fltx4 a; // 131
				{
					fltx4 retVal; // 602
					_mm_load_ps(const float* __P); // 603
				}
				LoadAlignedSIMD<>(const void* pSIMD); // 2267
				{
					fltx4 retVal; // 718
					_mm_and_ps(__m128 __A,
							__m128 __B);  // 719
				}
				AndSIMD<>(const fltx4& a,
						const fltx4& b);  // 2267
				fabs<>(const fltx4& x); // 2272
				AbsSIMD<>(const fltx4& val); // 129
				{
					fltx4 fl4Product; // 1725
					fltx4 fl4YXWZ; // 1727
					fltx4 fl4UUVV; // 1729
					fltx4 fl4VVUU; // 1731
					{
						fltx4 retVal; // 1639
						_mm_mul_ps(__m128 __A,
								__m128 __B);  // 1640
					}
					MulSIMD<>(const fltx4& a,
							const fltx4& b);  // 1725
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1728
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 1730
					{
						fltx4 retVal; // 373
						_mm_shuffle_ps(__m128 __A,
								__m128 __B,
								const int  __mask);  // 374
					}
					RotateLeft2<>(const fltx4& a); // 1732
					{
						fltx4 retVal; // 1593
						_mm_add_ps(__m128 __A,
								__m128 __B);  // 1594
					}
					AddSIMD<>(const fltx4& a,
							const fltx4& b);  // 1733
				}
				Dot4SIMD<>(const fltx4& a,
						const fltx4& b);  // 130
				{
					fltx4 retVal; // 1639
					_mm_mul_ps(__m128 __A,
							__m128 __B);  // 1640
				}
				MulSIMD<>(const fltx4& a,
						const fltx4& b);  // 1694
				{
					fltx4 retVal; // 1333
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1334
				}
				SplatZSIMD<>(const fltx4& a); // 1695
				{
					fltx4 retVal; // 1314
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1315
				}
				SplatYSIMD<>(const fltx4& a); // 1695
				{
					fltx4 retVal; // 1295
					_mm_shuffle_ps(__m128 __A,
							__m128 __B,
							const int  __mask);  // 1296
				}
				SplatXSIMD<>(const fltx4& a); // 1695
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1695
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 1695
				Dot3SIMD<>(const fltx4& a,
						const fltx4& b);  // 129
				{
					fltx4 retVal; // 1593
					_mm_add_ps(__m128 __A,
							__m128 __B);  // 1594
				}
				AddSIMD<>(const fltx4& a,
						const fltx4& b);  // 131
				{
					fltx4 retVal; // 2200
					_mm_min_ps(__m128 __A,
							__m128 __B);  // 2201
				}
				MinSIMD<>(const fltx4& a,
						const fltx4& b);  // 132
			}
		}
		_mm_movemask_ps(__m128 __A); // 1805
		TestSignSIMD<>(const fltx4& a); // 1842
		IsAnyNegative<>(const fltx4& a); // 134
		AABBTouchesOrInsideVolume(const fltx4* pPlanes,
						uint nNumPlanes,
						FLTX4 vCenter4,
						FLTX4 vDiagonal4);  // 2946
		CUtlMemory<SceneObjectCullingBox_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::operator[](
				int i);  // 2946
	}
	VectorAligned::operator fltx4(); // 2918
	VectorAligned::operator fltx4(); // 2919
	{
		fltx4 retVal; // 1639
		_mm_mul_ps(__m128 __A,
				__m128 __B);  // 1640
	}
	MulSIMD<>(const fltx4& a,
			const fltx4& b);  // 2922
	{
		fltx4 retVal; // 1593
		_mm_add_ps(__m128 __A,
				__m128 __B);  // 1594
	}
	AddSIMD<>(const fltx4& a,
			const fltx4& b);  // 2922
	{
		fltx4 retVal; // 1616
		_mm_sub_ps(__m128 __A,
				__m128 __B);  // 1617
	}
	SubSIMD<>(const fltx4& a,
			const fltx4& b);  // 2923
	{
		fltx4 zzww; // 1414
		{
			fltx4 retVal; // 1276
			_mm_shuffle_ps(__m128 __A,
					__m128 __B,
					const int  __mask);  // 1277
		}
		ShuffleSIMD<250>(const fltx4& a,
				const fltx4& b);  // 665
		ShuffleSIMD<250>(const fltx4& a,
				const fltx4& b);  // 1414
		{
			fltx4 retVal; // 1276
			_mm_shuffle_ps(__m128 __A,
					__m128 __B,
					const int  __mask);  // 1277
		}
		ShuffleSIMD<148>(const fltx4& a,
				const fltx4& b);  // 665
		ShuffleSIMD<148>(const fltx4& a,
				const fltx4& b);  // 1415
	}
	SetWSIMD<>(const fltx4& a,
			const fltx4& w);  // 2926
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Count(); // 2931
	CUtlVectorBase<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >::Count(); // 2941
} /* size: 308, variables: 7, inline expansions: 8 (58 bytes) */

// <02EE29D3> ../scenesystem/scenesystem.cpp:2958
// variables: 9
// function calls: 15
int CalculateLODLevel(const CSceneObject* pObject, const ISceneView* pRootView, const Vector& vOrigin, int nLodScreenWidthInPixels)
{
	int nMaxLodLevel; // 2960
	int nLodLevel; // 2977
	{
		CMeshInstance* pMeshInstance; // 2961
		{
			const CModel* pModel; // 2963
		}
		CSceneObject::GetMeshInstanceData(); // 2961
	}
	{
		CMeshInstance* pMeshInstance; // 2983
		{
			const CModel* pModel; // 2985
			{
				float flScreenWidthInPixels; // 2988
				Vector vScale; // 2991
				float flScale; // 2992
				ISceneView::GetFrustum(); // 2988
				CSceneObject::GetTransform(); // 2991
				Vector::LargestComponentValue(); // 2992
			}
		}
		CSceneObject::GetMeshInstanceData(); // 2983
	}
	Max<int>(const int& val1,
		const int& val2);  // 2970
	CSceneObject::GetParent(); // 2972
	ConVar::GetInt(); // 351
	ConVar::GetBool(); // 2972
	ConVar::GetInt(); // 460
	CSceneView::GetOverrideLODLevel(); // 463
	CSceneObject::GetCurrentLODLevel(); // 467
	RootLODLevel(const CSceneObject* pObject,
			const ISceneView* pRootView);  // 456
	RootLODLevel(const CSceneObject* pObject,
			const ISceneView* pRootView);  // 2977
	Min<int>(const int& val1,
		const int& val2);  // 2998
} /* size: 432, variables: 2, inline expansions: 10 (180 bytes) */

// <02E7BFE7> ../scenesystem/scenesystem.cpp:3008
// variables: 250
// function calls: 858
void Thread_RenderPartitionInternalFinal<true, false, CSceneSystem::true>(CSceneView* pView, int nPartitionMask, int nJobIndex, const CSceneView* _pRootView)
{
	const bool  bLightShadowView; // 3010
	const bool  bDisableAlphaFade; // 3011
	const CSceneView* pRootView; // 3012
	const bool  bSkipBoxCull; // 3014
	const bool  bNoCull; // 3015
	const bool  bNoVis; // 3016
	const int  nLodScreenWidthInPixels; // 3017
	GeneratePrimitivesArgs_t gpArgs; // 3019
	CUtlVectorFixedGrowable<CSceneLayer*, 32> layers; // 3040
	CUtlVectorFixedGrowable<CUtlVectorFixedGrowableCompat<CSceneDrawList*, 32>, 32> drawListVectorPerLayer; // 3041
	ESceneObjectFlags nFlagsRequiredAnd; // 3044
	ESceneObjectFlags nFlagsExcludedAnd; // 3045
	CUtlVectorFixedGrowable<int, 32> fadingRedirectIndex; // 3065
	ESceneObjectFlags nFlagsExcludedMask; // 3081
	ESceneObjectFlags nFlagsRequiredMask; // 3082
	CUtlVectorFixedGrowable<PendingVisitList_t, 64> visitList; // 3094
	Vector cameraPos; // 3150
	float flDistanceScaleForFade; // 3151
	int nRejectValue; // 3159
	bool bShowRejectedObjects; // 3160
	float flShowRejectedObjectsRange; // 3161
	const bool  bFullsortEarly; // 3509
	{
		CSceneLayer* i; // 3046
		CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short unsigned int>, int> >& __for_range; // 46800
		iterator __for_begin; // 65515
		iterator __for_end; // 65515
		{
			DrawListVector_t& drawListVector; // 3057
			CSceneDrawList* pList; // 3058
			ThreadInterlockedAssignIf128(volatile int128* pDest,
							const int128& value,
							const int128& comparand);  // 478
			ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
								const InterlockedPointerX2SizedInt_t& value,
								const InterlockedPointerX2SizedInt_t& comperand);  // 203
			ThreadPause(void); // 208
			CTSListBase::Pop(); // 376
			LightProbeVolumeBinding_t::LightProbeVolumeBinding_t(); // 1113
			Vector4D::Vector4D(); // 1113
			CMeshDrawPrimitive_t::CMeshDrawPrimitive_t(); // 698
			CSceneDrawList::Init(); // 699
			CSceneDrawList::CSceneDrawList(); // 341
			simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
			CTSPool<CSceneDrawList>::GetObject(); // 1269
			CSceneDrawList::Init(); // 1270
			ThreadInterlockedIncrement(volatile int32* p); // 576
			CInterlockedIntT<int, 4>::operator++(); // 1272
			CSceneSystem::GetNewDrawList(); // 3058
			operator&=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 3053
			operator&=(ESceneObjectFlags& a,
					ESceneObjectFlags b);  // 3054
			CUtlMemory<CUtlVectorFixedGrowableCompat<CSceneDrawList::NumAllocated(); // 1143
			CUtlMemory<CUtlVectorFixedGrowableCompat<CSceneDrawList::operator[](
					int i);  // 602
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::Element(
				int i);  // 1148
			CUtlMemory<CSceneDrawList::CUtlMemory(
					CSceneDrawList** pMemory,
					int numElements,
					bool bGrowable,
					uint32 nGrowable_GrowSize);  // 535
			CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 538
			CUtlVectorBase<CSceneDrawList::CUtlVectorBase(
					CSceneDrawList** pMemory,
					int allocationCount,
					int initialCount,
					bool bGrowable);  // 420
			CUtlVector<CSceneDrawList::CUtlVector(
					CSceneDrawList** pMemory,
					int allocationCount,
					int initialCount,
					bool bGrowable);  // 495
			{
			}
			AlignedByteArrayExplicit_t<32, CSceneDrawList::AlignedByteArrayExplicit_t(); // 1597
			AlignedByteArray_t<32, CSceneDrawList::AlignedByteArray_t(); // 495
			AlignedByteArrayExplicit_t<32, CSceneDrawList::Base(); // 497
			CUtlVectorFixedGrowableCompat<CSceneDrawList::CUtlVectorFixedGrowableCompat(
							int growSize);  // 1479
			Construct<CUtlVectorFixedGrowableCompat<CSceneDrawList*, 32> >(CUtlVectorFixedGrowableCompat<CSceneDrawList*, 32>* pMemory); // 1148
			CUtlMemory<CUtlVectorFixedGrowableCompat<CSceneDrawList::Base(); // 112
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::Base(); // 368
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::ResetDbgInfo(); // 824
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::AddToTail(); // 3057
			CUtlMemory<CUtlVectorFixedGrowableCompat<CSceneDrawList::operator[](
					int i);  // 588
			CUtlVectorBase<CUtlVectorFixedGrowableCompat<CSceneDrawList::operator[](
					int i);  // 3057
			CUtlMemory<CSceneDrawList::NumAllocated(); // 1196
			CUtlMemory<CSceneDrawList::operator[](
					int i);  // 602
			CUtlVectorBase<CSceneDrawList::Element(
				int i);  // 1201
			CopyConstruct<CSceneDrawList*>(CSceneDrawList** pMemory,
							CSceneDrawList* const& src);  // 1201
			CUtlMemory<CSceneDrawList::Base(); // 112
			CUtlVectorBase<CSceneDrawList::Base(); // 368
			CUtlVectorBase<CSceneDrawList::ResetDbgInfo(); // 824
			CUtlVectorBase<CSceneDrawList::GrowMemory(
					int num);  // 1198
			CUtlVectorBase<CSceneDrawList::AddToTail(
					CSceneDrawList* const& src);  // 3059
			CUtlMemory<CSceneLayer::NumAllocated(); // 1196
			CUtlMemory<CSceneLayer::operator[](
					int i);  // 602
			CUtlVectorBase<CSceneLayer::Element(
				int i);  // 1201
			CopyConstruct<CSceneLayer*>(CSceneLayer** pMemory,
							CSceneLayer* const& src);  // 1201
			CUtlMemory<CSceneLayer::Base(); // 112
			CUtlVectorBase<CSceneLayer::Base(); // 368
			CUtlVectorBase<CSceneLayer::ResetDbgInfo(); // 824
			CUtlVectorBase<CSceneLayer::GrowMemory(
					int num);  // 1198
			CUtlVectorBase<CSceneLayer::AddToTail(
					CSceneLayer* const& src);  // 3061
		}
		CUtlLinkedList<CSceneLayer::Head(); // 334
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 334
		CUtlLinkedList<CSceneLayer::begin(); // 3046
		_CUtlLinkedList_constiterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_constiterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 264
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::_CUtlLinkedList_iterator_t(
						const CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short uns list,
						IndexType_t index);  // 343
		CUtlLinkedList<CSceneLayer::end(); // 3046
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 482
		CUtlLinkedList<CSceneLayer::Element(
			int i);  // 317
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator*(); // 3046
		CUtlMemory<UtlLinkedListElem_t<CSceneLayer::operator[](
				int i);  // 368
		CUtlLinkedList<CSceneLayer::InternalElement(
				int i);  // 550
		CUtlLinkedList<CSceneLayer::Next(
			int i);  // 272
		_CUtlLinkedList_iterator_t<CUtlLinkedList<CSceneLayer::operator++(); // 3046
	}
	{
		int i; // 3068
		{
			CSceneLayer* pRedirect; // 3070
			int nRedirectIndex; // 3071
			CUtlMemory<int, int>::NumAllocated(); // 1196
			CUtlMemory<int, int>::operator[](
					int i);  // 602
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 32, int> >::Element(
				int i);  // 1201
			CopyConstruct<int>(int* pMemory,
						const int& src);  // 1201
			CUtlMemory<int, int>::Base(); // 112
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 32, int> >::Base(); // 368
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 32, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 32, int> >::GrowMemory(
					int num);  // 1198
			CUtlVectorBase<int, CUtlMemoryFixedGrowable<int, 32, int> >::AddToTail(
					const int& src);  // 3078
			CUtlMemory<CSceneLayer::operator[](
					int i);  // 588
			CUtlVectorBase<CSceneLayer::operator[](
					int i);  // 3070
			{
				int i; // 1543
			}
			CUtlVectorBase<CSceneLayer::FindComparable<CSceneLayer*>(
							CSceneLayer* const& src);  // 3076
		}
		CUtlVectorBase<CSceneLayer::Count(); // 3068
	}
	{
		int i; // 3098
		{
			CSceneWorld* pDebugWorld; // 3105
			{
				const CSceneWorldObjectListChunk* pList; // 3108
				const CUtlVector<CSceneWorldObjectListChunk*, CUtlMemory<CSceneWorldObjectListChunk*, int> >& __for_range; // 40343
				const_iterator __for_begin; // 36896
				const_iterator __for_end; // 36896
				CSceneWorldObjectList::ChunkList(); // 3108
				CUtlMemory<CSceneWorldObjectListChunk::Base(); // 113
				CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 103
				CUtlVectorBase<CSceneWorldObjectListChunk::begin(); // 3108
				CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 105
				CUtlVectorBase<CSceneWorldObjectListChunk::end(); // 3108
				CUtlMemory<PendingVisitList_t, int>::Base(); // 112
				CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::Base(); // 368
				CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::ResetDbgInfo(); // 824
				CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::GrowMemory(
						int num);  // 1249
				CUtlMemory<PendingVisitList_t, int>::operator[](
						int i);  // 602
				CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::Element(
					int i);  // 1252
				Construct<PendingVisitList_t, PendingVisitList_t>(PendingVisitList_t* pMemory); // 1252
				CUtlMemory<PendingVisitList_t, int>::NumAllocated(); // 1247
				CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::AddToTail(
						PendingVisitList_t& src);  // 3110
				PendingVisitList_t::PendingVisitList_t(
							const CSceneWorldObjectListChunk* pChunk,
							const uint32* pVisBits);  // 3110
			}
			CSceneViewDebugOverlays::GetSceneWorldForRendering(); // 3105
		}
		{
			int nWorldIdx; // 3114
			{
				CSceneWorld* pWorld; // 3116
				const uint32* pVisBits; // 3117
				const CUtlVector<AABB_t, CUtlMemory<AABB_t, int> >& hierarchicalBounds; // 3128
				const bool  bBoundsGroupCulling; // 3129
				{
					const CSceneWorldObjectListChunk* pList; // 3131
					const CUtlVector<CSceneWorldObjectListChunk*, CUtlMemory<CSceneWorldObjectListChunk*, int> >& __for_range; // 40343
					const_iterator __for_begin; // 36896
					const_iterator __for_end; // 36896
					{
						const AABB_t& aabb; // 3135
						CUtlMemory<AABB_t, int>::operator[](
								int i);  // 595
						CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::operator[](
								int i);  // 3135
						{
							fltx4 retVal; // 602
							_mm_load_ps(const float* __P); // 603
						}
						LoadAlignedSIMD<>(const void* pSIMD); // 669
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 670
						{
							fltx4 retVal; // 1616
							_mm_sub_ps(__m128 __A,
									__m128 __B);  // 1617
						}
						SubSIMD<>(const fltx4& a,
								const fltx4& b);  // 671
						{
							fltx4 retVal; // 1295
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1296
						}
						SplatXSIMD<>(const fltx4& a); // 673
						{
							fltx4 retVal; // 1314
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1315
						}
						SplatYSIMD<>(const fltx4& a); // 674
						{
							fltx4 retVal; // 1333
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1334
						}
						SplatZSIMD<>(const fltx4& a); // 675
						{
							fltx4 retVal; // 1295
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1296
						}
						SplatXSIMD<>(const fltx4& a); // 676
						{
							fltx4 retVal; // 1314
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1315
						}
						SplatYSIMD<>(const fltx4& a); // 677
						{
							fltx4 retVal; // 1333
							_mm_shuffle_ps(__m128 __A,
									__m128 __B,
									const int  __mask);  // 1334
						}
						SplatZSIMD<>(const fltx4& a); // 678
						{
							int i; // 682
							{
								fltx4 xTotalBack; // 684
								fltx4 yTotalBack; // 685
								fltx4 zTotalBack; // 686
								fltx4 dotBack; // 687
								fltx4 isOut; // 693
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 718
									_mm_and_ps(__m128 __A,
											__m128 __B);  // 719
								}
								AndSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								MaskedAssign<>(const fltx4& ReplacementMask,
										const fltx4& a,
										const fltx4& b);  // 686
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 718
									_mm_and_ps(__m128 __A,
											__m128 __B);  // 719
								}
								AndSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								MaskedAssign<>(const fltx4& ReplacementMask,
										const fltx4& a,
										const fltx4& b);  // 684
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 718
									_mm_and_ps(__m128 __A,
											__m128 __B);  // 719
								}
								AndSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								{
									fltx4 retVal; // 826
									_mm_xor_ps(__m128 __A,
											__m128 __B);  // 827
								}
								XorSIMD<>(const fltx4& a,
										const fltx4& b);  // 1259
								MaskedAssign<>(const fltx4& ReplacementMask,
										const fltx4& a,
										const fltx4& b);  // 685
								{
									fltx4 retVal; // 1639
									_mm_mul_ps(__m128 __A,
											__m128 __B);  // 1640
								}
								MulSIMD<>(const fltx4& a,
										const fltx4& b);  // 685
								{
									fltx4 retVal; // 1639
									_mm_mul_ps(__m128 __A,
											__m128 __B);  // 1640
								}
								MulSIMD<>(const fltx4& a,
										const fltx4& b);  // 686
								{
									fltx4 retVal; // 1639
									_mm_mul_ps(__m128 __A,
											__m128 __B);  // 1640
								}
								MulSIMD<>(const fltx4& a,
										const fltx4& b);  // 684
								{
									fltx4 retVal; // 1593
									_mm_add_ps(__m128 __A,
											__m128 __B);  // 1594
								}
								AddSIMD<>(const fltx4& a,
										const fltx4& b);  // 687
								{
									fltx4 retVal; // 1593
									_mm_add_ps(__m128 __A,
											__m128 __B);  // 1594
								}
								AddSIMD<>(const fltx4& a,
										const fltx4& b);  // 687
								{
									fltx4 retVal; // 2067
									_mm_cmplt_ps(__m128 __A,
											__m128 __B);  // 2068
								}
								CmpLtSIMD<>(const fltx4& a,
										const fltx4& b);  // 693
								_mm_movemask_ps(__m128 __A); // 1805
								TestSignSIMD<>(const fltx4& a); // 1842
								IsAnyNegative<>(const fltx4& a); // 694
							}
						}
						CFrustum::CheckBoxInline(
								const VectorAligned& mins,
								const VectorAligned& maxs);  // 3136
						{
							fltx4 retVal; // 186
							_mm_set_ps(const float  __Z,
									const float  __Y,
									const float  __X,
									const float  __W);  // 187
						}
						Set4Floats<>(float p0,
								float p1,
								float p2,
								float p3);  // 146
						VectorAligned::Init(
							vec_t X,
							vec_t Y,
							vec_t Z);  // 31
						VectorAligned::VectorAligned(
								const Vector& rhs);  // 3136
						{
							fltx4 retVal; // 186
							_mm_set_ps(const float  __Z,
									const float  __Y,
									const float  __X,
									const float  __W);  // 187
						}
						Set4Floats<>(float p0,
								float p1,
								float p2,
								float p3);  // 146
						VectorAligned::Init(
							vec_t X,
							vec_t Y,
							vec_t Z);  // 31
						VectorAligned::VectorAligned(
								const Vector& rhs);  // 3136
					}
					CUtlMemory<PendingVisitList_t, int>::Base(); // 112
					CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::Base(); // 368
					CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::GrowMemory(
							int num);  // 1249
					CUtlMemory<PendingVisitList_t, int>::operator[](
							int i);  // 602
					CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::Element(
						int i);  // 1252
					Construct<PendingVisitList_t, PendingVisitList_t>(PendingVisitList_t* pMemory); // 1252
					CUtlMemory<PendingVisitList_t, int>::NumAllocated(); // 1247
					CUtlVectorBase<PendingVisitList_t, CUtlMemoryFixedGrowable<PendingVisitList_t, 64, int> >::AddToTail(
							PendingVisitList_t& src);  // 3143
					CUtlVectorBase<AABB_t, CUtlMemory<AABB_t, int> >::IsValidIndex(
							int i);  // 3133
					PendingVisitList_t::PendingVisitList_t(
								const CSceneWorldObjectListChunk* pChunk,
								const uint32* pVisBits);  // 3143
					CUtlVectorBase<CSceneWorldObjectListChunk::Count(); // 105
					CUtlVectorBase<CSceneWorldObjectListChunk::end(); // 3131
					CUtlMemory<CSceneWorldObjectListChunk::Base(); // 113
					CUtlVectorBase<CSceneWorldObjectListChunk::Base(); // 103
					CUtlVectorBase<CSceneWorldObjectListChunk::begin(); // 3131
					CSceneWorldObjectList::ChunkList(); // 3131
				}
				CUtlMemory<ISceneView::WorldList_t, int>::operator[](
						int i);  // 595
				CUtlVectorBase<ISceneView::WorldList_t, CUtlMemoryFixedGrowable<ISceneView::WorldList_t, 16, int> >::operator[](
						int i);  // 449
				ISceneView::GetWorldToRender(
						int nIndex);  // 3116
				CPVSBits::IsEmpty(); // 457
				ISceneView::GetWorldToRenderVisBits(
							int nIndex);  // 3117
				ConVar::GetInt(); // 351
				ConVar::GetBool(); // 3119
				CSceneWorld::IsFreed(); // 357
				CSceneWorld::VerifyWorld(); // 3125
				CSceneWorld::GetBoundsGroups(); // 3128
				ConVar::GetInt(); // 351
				ConVar::GetBool(); // 3129
				{
					uint nPartition; // 6174
				}
				CSceneWorld::VerifyWorldForReal(); // 3121
			}
			CUtlVectorBase<ISceneView::WorldList_t, CUtlMemoryFixedGrowable<ISceneView::WorldList_t, 16, int> >::Count(); // 3114
		}
	}
	{
		CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> > includerCullBoxes; // 3164
		CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> > excluderCullBoxes; // 3165
		const bool  bHasCullBoxes; // 3167
		const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined_t, CU* renderTags; // 3169
		const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined_t, CU* excludeTags; // 3170
		const uint  tag; // 3172
		bool renderWorld; // 3173
		bool excludeWorld; // 3174
		ESceneObjectFlags worldFlags; // 3175
		{
			PendingVisitList_t& pList; // 3177
			CUtlVectorFixedGrowable<PendingVisitList_t, 64>& __for_range; // 46806
			iterator __for_begin; // 64338
			iterator __for_end; // 64338
			{
				uint o; // 3184
				{
					const CSceneObjectReference_t* pRef; // 3186
					ESceneObjectFlags nFlags; // 3187
					{
						CSceneObject* pObj; // 3204
						{
							const VectorAligned  vOrigin; // 3244
							const float  flRadius; // 3245
							float flScreenSize; // 3246
							const float  flDistanceSquared; // 3285
							float flDistanceSquaredForCulling; // 3287
							const float  flDistanceForCulling; // 3292
							float flAlphaFade; // 3304
							bool bTranslucent; // 3351
							bool bOpaque; // 3352
							float flBias; // 3353
							uint32 nSortKey; // 3354
							int nLodLevel; // 3356
							LODGroupMask_t lodGroupMask; // 3357
							bool bAdded; // 3360
							ERejectedReason_t nRejectReason; // 3361
							VisibleSceneObject_t visibleObj; // 3485
							{
								float flBloatScale; // 3250
								{
									float flScreenSize2; // 3262
									ISceneView::GetCullFrustum(); // 3262
									Vector::Vector(
										vec_t X,
										vec_t Y,
										vec_t Z);  // 40
									VectorAligned::operator Vector(); // 3262
									CFrustum::GetCameraPosition(); // 3266
									_mm_cvtss_f32(__m128 __A); // 1534
									GetZSIMD<>(fltx4 a); // 76
									VectorAligned::z(); // 40
									Vector::Vector(
										vec_t X,
										vec_t Y,
										vec_t Z);  // 40
									VectorAligned::operator Vector(); // 3266
									_mm_cvtss_f32(__m128 __A); // 1534
									GetZSIMD<>(fltx4 a); // 76
									VectorAligned::z(); // 40
									Vector::Vector(
										vec_t X,
										vec_t Y,
										vec_t Z);  // 40
									VectorAligned::operator Vector(); // 3266
								}
								CSceneObject::GetSizeCullBloatScale(); // 3250
							}
							{
								const bool  bCulled; // 3332
								_mm_cvtss_f32(__m128 __A); // 1534
								GetZSIMD<>(fltx4 a); // 76
								VectorAligned::z(); // 40
								Vector::Vector(
									vec_t X,
									vec_t Y,
									vec_t Z);  // 40
								VectorAligned::operator Vector(); // 3336
								_mm_cvtss_f32(__m128 __A); // 1534
								GetZSIMD<>(fltx4 a); // 76
								VectorAligned::z(); // 40
								Vector::Vector(
									vec_t X,
									vec_t Y,
									vec_t Z);  // 40
								VectorAligned::operator Vector(); // 3336
							}
							{
								int i; // 3362
								{
									CSceneLayer* pLayer; // 3364
									bool bForceMatchBasedOnID; // 3368
									uint32 nNewSortKey; // 3418
									bool bIsTranslucentLayer; // 3420
									{
										float flShadowStrength; // 3438
										Vector4D::Vector4D(
											vec_t X,
											vec_t Y,
											vec_t Z,
											vec_t W);  // 153
										Vector4D::Vector4D(
											const Vector4D& vOther);  // 393
										{
											__m128i retVal; // 1105
											_mm_set_epi32(int __q3,
													int __q2,
													int __q1,
													int __q0);  // 648
											_mm_set1_epi32(int __A); // 1106
										}
										ReplicateIX4<>(int nValue); // 376
										{
											int nIndex; // 381
											{
												int i; // 212
												{
													int nTestResult; // 217
													{
														fltx4 retVal; // 1880
														_mm_cmpeq_epi32(__m128i __A,
																__m128i __B);  // 1881
														_mm_castsi128_ps(__m128i __A); // 1881
													}
													CmpEqSIMD<>(const i32x4& a,
															const i32x4& b);  // 217
													_mm_movemask_ps(__m128 __A); // 1805
													TestSignSIMD<>(const fltx4& a); // 217
													{
														const int  nIndex; // 220
													}
												}
											}
											CUtlAttributeListChunk<Vector4D, 8, Vector4D>::FindIndexOfMatch(
													i32x4 i4KMatch);  // 272
											{
												const OverflowChunk_t& p; // 279
