
//
// scenesystem/sceneview.h
//
//	referenced by: libengine2.so
//
//	functions: 38
//	class: 1
//

// <0320329C> ../scenesystem/sceneview.h:54
// member functions: 218
// member variables: 47
// static member variable: 1
// vtable entries: 81
// class size: 22,560
class CSceneView : public ISceneView {
public:
	/* class ISceneView <ancestor>; */ /* 0 4960 */
	void CSceneView(CSceneView* , const CSceneView& );
	/* ../scenesystem/sceneview.cpp:785 */
	virtual ISceneLayer* AddRenderLayer(CSceneView* , const char* , const RenderViewport_t& , const CUtlStringToken& , ISceneLayer* );
	/* ../scenesystem/sceneview.cpp:792 */
	virtual ISceneLayer* AddProceduralLayer(CSceneView* , const char* , const RenderViewport_t& , IProceduralLayerRenderer* , ISceneLayer* , bool);
	/* ../scenesystem/sceneview.cpp:800 */
	virtual ISceneLayer* AddClearLayer(CSceneView* , const char* , const RenderViewport_t& , int, ISceneLayer* );
	/* ../scenesystem/sceneview.cpp:839 */
	virtual ISceneLayer* AddManagedProceduralLayer(CSceneView* , const char* , const RenderViewport_t& , SboxProceduralLayerCallback, ISceneLayer* , bool);
	/* ../scenesystem/sceneview.cpp:1147 */
	virtual ISceneLayer* AddResolveRenderTargetLayer(CSceneView* , const char* , const RenderViewport_t& , int, int, int, HSceneViewRenderTarget, ISceneLayer* );
	/* ../scenesystem/sceneview.cpp:1185 */

	void CSceneView(CSceneView* );
	/* ../scenesystem/sceneview.cpp:69 */
	virtual void ~CSceneView(CSceneView* );
	/* ../scenesystem/sceneview.h:336 */
	CLightBinner2* GetLightBinner2(const CSceneView* );
	/* ../scenesystem/sceneview.h:341 */
	CLightBinnerStandard* GetLightBinnerStandard(const CSceneView* );
	/* ../scenesystem/sceneview.h:346 */
	void SetLightBinner(CSceneView* , CLightBinnerStandard* );
	/* ../scenesystem/sceneview.h:156 */
	virtual const char* GetDebugName(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:327 */
	virtual void ComputeRenderTargetAllocations(CSceneView* );
	/* ../scenesystem/sceneview.cpp:1217 */
	virtual ISceneLayer* GetFinalOutputLayer(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:1274 */
	void SetViewIdInternal(CSceneView* , CViewIdInternal);
	/* ../scenesystem/sceneview.cpp:1279 */
	CViewIdInternal GetViewIdInternal(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:1284 */
	void SetViewIdInternal(CSceneView* , const ISceneView* , int);
	/* ../scenesystem/sceneview.h:167 */
	bool HasBeenSubmitted(const CSceneView* );
	/* ../scenesystem/sceneview.h:168 */
	void MarkSubmitted(CSceneView* );
	/* ../scenesystem/sceneview.h:326 */
	int GetViewIndex(const CSceneView* );
	/* ../scenesystem/sceneview.h:331 */
	int GetViewPriority(const CSceneView* );
	/* ../scenesystem/sceneview.h:172 */
	virtual int GetPriority(CSceneView* );
	/* ../scenesystem/sceneview.h:173 */
	virtual void SetPriority(CSceneView* , int);
	/* ../scenesystem/sceneview.h:372 */
	void QueueViewToBeginAfterMe(CSceneView* , ISceneView* );
	/* ../scenesystem/sceneview.h:178 */
	virtual void AddAuxiliaryRenderCamera(CSceneView* , const CFrustum& );
	/* ../scenesystem/sceneview.cpp:116 */
	virtual const CFrustum* GetFirstAuxilaryRenderCamera(const CSceneView* );
	/* ../scenesystem/sceneview.h:378 */
	void AtFinish(CSceneView* );
	/* ../scenesystem/sceneview.cpp:459 */
	virtual void CopyRenderTargetOutputsAndViewportFromPreviousLayer(const CSceneView* , ISceneLayer* );
	/* ../scenesystem/sceneview.cpp:764 */
	int GetIssueSortIndex(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:1303 */
	void GetCullBoxListForView(const CSceneView* , CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >* , CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> >* );
	/* ../scenesystem/sceneview.cpp:1326 */
	virtual void RemoveCullBoxes(CSceneView* );
	/* ../scenesystem/sceneview.cpp:1338 */
	virtual void SetVolumeCuller(CSceneView* , const CVolumeCuller& );
	/* ../scenesystem/sceneview.cpp:1343 */
	virtual const CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> >& GetVolumetricFogVolumes(const CSceneView* );
	/* ../scenesystem/sceneview.h:197 */
	SceneViewTimestampQuery_t* GetLightBinnerTimestampBeginQuery(const CSceneView* );
	/* ../scenesystem/sceneview.h:198 */
	SceneViewTimestampQuery_t* GetLightBinnerTimestampEndQuery(const CSceneView* );
	CVolumeCuller m_volumeCuller __attribute__((__aligned__(16))); /* 4960 304 */
	VPlane m_userClipPlanes[1]; /* 5264 16 */
	SwapChainHandle_t m_hSwapChain; /* 5280 8 */
	CUtlLinkedList<CSceneLayer*, short unsigned int, false, int, CUtlMemory<UtlLinkedListElem_t<CSceneLayer*, short unsigned int>, int> > m_layerList; /* 5288 40 */
	CUtlVector<CFrustum, CUtlMemory<CFrustum, int> > m_auxiliaryCameras; /* 5328 32 */
	CInterlockedInt m_nNumPendingDrawPartitionsInFlight __attribute__((__aligned__(4))); /* 5360 4 */
	/* ../scenesystem/sceneview.cpp:373 */
	CSceneLayer* AddLayer(CSceneView* , const char* , const RenderViewport_t& , ELayerType, ISceneLayer* );
	/* ../scenesystem/sceneview.cpp:1122 */
	CSceneLayer* ComputePreviousLayer(CSceneView* , CSceneLayer* );
	/* ../scenesystem/sceneview.cpp:337 */
	CSceneLayer* CreateLayer(CSceneView* , const char* , const RenderViewport_t& , ELayerType);
	/* ../scenesystem/sceneview.h:222 */
	bool HasRenderPasses(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:565 */
	void CreateRenderPasses(CSceneView* );
	/* ../scenesystem/sceneview.h:227 */
	void SetNoRenderPasses(CSceneView* );
	CThreadFastMutex m_queuedViewMutex; /* 5368 24 */
	CUtlVectorFixedGrowable<ISceneView*, 8> m_queuedBeginViews __attribute__((__aligned__(8))); /* 5392 96 */
	CInterlockedInt m_nOutstandingPartitionJobs __attribute__((__aligned__(4))); /* 5488 4 */
	SceneSystemPerFrameStats_t m_perFrameStats[8] __attribute__((__aligned__(8))); /* 5496 1664 */
	CDisplayList * m_pLightBinnerSetupDisplayList; /* 7160 8 */
	CDisplayList * m_pPerLayerViewConstantsDisplayList; /* 7168 8 */
	ConstantBufferHandle_t m_hAllPerLayerViewConstants; /* 7176 8 */
	/* ../scenesystem/sceneview.h:244 */
	void* operator new(size_t);
	/* ../scenesystem/sceneview.h:248 */
	void operator delete(void* );
private:
	static CUtlMemoryPoolMT s_ViewPool; /* 0 0 */
	int m_nIndex; /* 7184 4 */
	int m_nPriority; /* 7188 4 */
	float m_flDistanceScaleForLODAndCullingSquared; /* 7192 4 */
	CUtlVectorFixedGrowable<ISceneView*, 16> m_pDependentViews __attribute__((__aligned__(8))); /* 7200 160 */
	CSceneView * m_pNext; /* 7360 8 */
	CSceneViewDebugOverlays * m_pDebugRenderLists; /* 7368 8 */
	void * m_pUserData; /* 7376 8 */
	char m_szDebugName[64]; /* 7384 64 */
	CLightBinnerStandard * m_pLightBinner; /* 7448 8 */
	SceneViewFlags_t m_nFlags; /* 7456 4 */
	TonemapState_t m_tonemapState; /* 7460 4 */
	ESceneObjectFlags m_nDefaultLayerObjectRequiredFlags; /* 7464 8 */
	ESceneObjectFlags m_nDefaultLayerObjectExcludedFlags; /* 7472 8 */
	CScratchRenderTargetSystem m_ScratchRenderTargetSystem __attribute__((__aligned__(8))); /* 7480 5400 */
	CViewIdInternal m_viewId; /* 12880 8 */
	CRenderAttributes m_Attrs; /* 12896 1184 */
	CUtlVector<SceneObjectCullingBox_t, CUtlMemory<SceneObjectCullingBox_t, int> > m_CullingBoxes; /* 14080 32 */
	CUtlVector<SceneVolumetricFogVolume_t, CUtlMemory<SceneVolumetricFogVolume_t, int> > m_VolumetricFogVolumes; /* 14112 32 */
	CUtlVectorFixedGrowable<CPVSBits, 16> m_pvs __attribute__((__aligned__(8))); /* 14144 8288 */
	bool m_bAddedToOpimizerList; /* 22432 1 */
	float m_flSizeCullThreshold; /* 22436 4 */
	int m_nOverrideLODLevel; /* 22440 4 */
	bool m_bShadowsEnabled; /* 22444 1 */
	bool m_bPostProcessEnabled; /* 22445 1 */
	bool m_bHasBeenSubmitted; /* 22446 1 */
	bool m_bHasRenderPasses; /* 22447 1 */
	bool m_bCaptureWithRenderDoc; /* 22448 1 */
	CSceneView * m_pParentView; /* 22456 8 */
	int m_nIssueSortIndex; /* 22464 4 */
	SceneViewTimestampQuery_t * m_pLightBinnerTimestampBeginQuery; /* 22472 8 */
	SceneViewTimestampQuery_t * m_pLightBinnerTimestampEndQuery; /* 22480 8 */
	CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined_t, CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int> > m_renderTags; /* 22488 32 */
	CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined_t, CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int> > m_excludeTags; /* 22520 32 */
	/* ../scenesystem/sceneview.cpp:1348 */
	virtual const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined GetRenderTags(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:1363 */
	virtual const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined GetExcludeTags(const CSceneView* );
	/* ../scenesystem/sceneview.cpp:1378 */
	virtual void SetRenderTags(CSceneView* , const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined);
	/* ../scenesystem/sceneview.cpp:1390 */
	virtual void SetExcludeTags(CSceneView* , const CUtlHashtable<unsigned int, empty_t, DefaultHashFunctor<unsigned int>, DefaultEqualFunctor<unsigned int>, undefined);
	/* <2f2fee6> ../scenesystem/sceneview.h:367 */
