
//
// thirdparty/zstd/zstd.c
//
//	referenced by: libengine2.so
//				   libmaterialsystem2.so
//				   librendersystemvulkan.so
//				   libvfx_vulkan.so
//
//	functions: 1,243
//	structs: 117
//

// <07016FA1> thirdparty/zstd/zstd.c:890
inline const unsigned char* ZSTD_wrappedPtrAdd(const unsigned char* ptr, ptrdiff_t add)
{
} /* size: 0 */

// <07016F74> thirdparty/zstd/zstd.c:903
inline const unsigned char* ZSTD_wrappedPtrSub(const unsigned char* ptr, ptrdiff_t sub)
{
} /* size: 0 */

// <07016F47> thirdparty/zstd/zstd.c:915
inline unsigned char* ZSTD_maybeNullPtrAdd(unsigned char* ptr, ptrdiff_t add)
{
} /* size: 0 */

// <07016F38> thirdparty/zstd/zstd.c:1114
inline unsigned int MEM_32bits(void)
{
} /* size: 0 */

// <07016F29> thirdparty/zstd/zstd.c:1115
inline unsigned int MEM_64bits(void)
{
} /* size: 0 */

// <07016F1A> thirdparty/zstd/zstd.c:1117
inline unsigned int MEM_isLittleEndian(void)
{
} /* size: 0 */

// <07016EFA> thirdparty/zstd/zstd.c:1159
inline U16 MEM_read16(const void* ptr)
{
} /* size: 0 */

// <07016EDA> thirdparty/zstd/zstd.c:1160
inline U32 MEM_read32(const void* ptr)
{
} /* size: 0 */

// <07016EBA> thirdparty/zstd/zstd.c:1161
inline U64 MEM_read64(const void* ptr)
{
} /* size: 0 */

// <07016E9A> thirdparty/zstd/zstd.c:1162
inline size_t MEM_readST(const void* ptr)
{
} /* size: 0 */

// <07016E71> thirdparty/zstd/zstd.c:1164
inline void MEM_write16(void* memPtr, U16 value)
{
} /* size: 0 */

// <07016E48> thirdparty/zstd/zstd.c:1165
inline void MEM_write32(void* memPtr, U32 value)
{
} /* size: 0 */

// <07016E1F> thirdparty/zstd/zstd.c:1166
inline void MEM_write64(void* memPtr, U64 value)
{
} /* size: 0 */

// <07016E00> thirdparty/zstd/zstd.c:1218
inline U32 MEM_swap32(U32 in)
{
} /* size: 0 */

// <07016DE1> thirdparty/zstd/zstd.c:1244
inline U64 MEM_swap64(U64 in)
{
} /* size: 0 */

// <07016DB4> thirdparty/zstd/zstd.c:1266
// variable: 1
inline U16 MEM_readLE16(const void* memPtr)
{
	{
		const BYTE* p; // 1271
	}
} /* size: 0 */

// <07016D7E> thirdparty/zstd/zstd.c:1276
// variable: 1
inline void MEM_writeLE16(void* memPtr, U16 val)
{
	{
		BYTE* p; // 1281
	}
} /* size: 0 */

// <07016D5E> thirdparty/zstd/zstd.c:1287
inline U32 MEM_readLE24(const void* memPtr)
{
} /* size: 0 */

// <07016D35> thirdparty/zstd/zstd.c:1292
inline void MEM_writeLE24(void* memPtr, U32 val)
{
} /* size: 0 */

// <07016D15> thirdparty/zstd/zstd.c:1298
inline U32 MEM_readLE32(const void* memPtr)
{
} /* size: 0 */

// <07016CEC> thirdparty/zstd/zstd.c:1306
inline void MEM_writeLE32(void* memPtr, U32 val32)
{
} /* size: 0 */

// <07016CCC> thirdparty/zstd/zstd.c:1314
inline U64 MEM_readLE64(const void* memPtr)
{
} /* size: 0 */

// <07016CA3> thirdparty/zstd/zstd.c:1322
inline void MEM_writeLE64(void* memPtr, U64 val64)
{
} /* size: 0 */

// <07016C83> thirdparty/zstd/zstd.c:1330
inline size_t MEM_readLEST(const void* memPtr)
{
} /* size: 0 */

// <07016C5A> thirdparty/zstd/zstd.c:1338
inline void MEM_writeLEST(void* memPtr, size_t val)
{
} /* size: 0 */

// <07016C3A> thirdparty/zstd/zstd.c:1561
unsigned int ERR_isError(size_t code)
{
} /* size: 0 */

// <07016C1A> thirdparty/zstd/zstd.c:1563
ERR_ERR_getErrorCode(size_t code)
{
} /* size: 0 */

// <07016BFA> thirdparty/zstd/zstd.c:1581
const char* ERR_getErrorName(size_t code)
{
} /* size: 0 */

// <07016BDA> thirdparty/zstd/zstd.c:1957
inline unsigned int ZSTD_countTrailingZeros32(U32 val)
{
} /* size: 0 */

// <07016BBA> thirdparty/zstd/zstd.c:1998
inline unsigned int ZSTD_countLeadingZeros32(U32 val)
{
} /* size: 0 */

// <07016B9A> thirdparty/zstd/zstd.c:2022
inline unsigned int ZSTD_countTrailingZeros64(U64 val)
{
} /* size: 0 */

// <07016B7A> thirdparty/zstd/zstd.c:2054
inline unsigned int ZSTD_countLeadingZeros64(U64 val)
{
} /* size: 0 */

// <07016B5A> thirdparty/zstd/zstd.c:2086
inline unsigned int ZSTD_NbCommonBytes(size_t val)
{
} /* size: 0 */

// <07016B3A> thirdparty/zstd/zstd.c:2103
inline unsigned int ZSTD_highbit32(U32 val)
{
} /* size: 0 */

// <07016B0D> thirdparty/zstd/zstd.c:2114
inline U64 ZSTD_rotateRight_U64(const U64 value, U32 count)
{
} /* size: 0 */

// <07016AE0> thirdparty/zstd/zstd.c:2121
inline U32 ZSTD_rotateRight_U32(const U32 value, U32 count)
{
} /* size: 0 */

// <07016AB3> thirdparty/zstd/zstd.c:2128
inline U16 ZSTD_rotateRight_U16(const U16 value, U32 count)
{
} /* size: 0 */

// <06F39D1B> thirdparty/zstd/zstd.c:2161
// member variables: 5
// struct size: 40
typedef struct {
	BitContainerType bitContainer; /* 0 8 */
	unsigned int bitPos; /* 8 4 */
	char * startPtr; /* 16 8 */
	char * ptr; /* 24 8 */
	char * endPtr; /* 32 8 */
} BIT_CStream_t;

// <06F39D87> thirdparty/zstd/zstd.c:2195
// member variables: 5
// struct size: 40
typedef struct {
	BitContainerType bitContainer; /* 0 8 */
	unsigned int bitsConsumed; /* 8 4 */
	const char * ptr; /* 16 8 */
	const char * start; /* 24 8 */
	const char * limitPtr; /* 32 8 */
} BIT_DStream_t;

// <07016A79> thirdparty/zstd/zstd.c:2255
inline size_t BIT_initCStream(BIT_CStream_t* bitC, void* startPtr, size_t dstCapacity)
{
} /* size: 0 */

// <07016A4C> thirdparty/zstd/zstd.c:2267
inline BitContainerType BIT_getLowerBits(BitContainerType bitContainer, const U32 nbBits)
{
} /* size: 0 */

// <07016A16> thirdparty/zstd/zstd.c:2285
inline void BIT_addBits(BIT_CStream_t* bitC, BitContainerType value, unsigned int nbBits)
{
} /* size: 0 */

// <070169E0> thirdparty/zstd/zstd.c:2298
inline void BIT_addBitsFast(BIT_CStream_t* bitC, BitContainerType value, unsigned int nbBits)
{
} /* size: 0 */

// <070169B7> thirdparty/zstd/zstd.c:2310
// variable: 1
inline void BIT_flushBitsFast(BIT_CStream_t* bitC)
{
	const size_t  nbBytes; // 2312
} /* size: 0, variables: 1 */

// <0701698E> thirdparty/zstd/zstd.c:2326
// variable: 1
inline void BIT_flushBits(BIT_CStream_t* bitC)
{
	const size_t  nbBytes; // 2328
} /* size: 0, variables: 1 */

// <0701696E> thirdparty/zstd/zstd.c:2341
inline size_t BIT_closeCStream(BIT_CStream_t* bitC)
{
} /* size: 0 */

// <07016912> thirdparty/zstd/zstd.c:2359
// variables: 2
inline size_t BIT_initDStream(BIT_DStream_t* bitD, const void* srcBuffer, size_t srcSize)
{
	{
		const BYTE  lastByte; // 2369
	}
	{
		const BYTE  lastByte; // 2397
	}
} /* size: 0 */

// <070168CB> thirdparty/zstd/zstd.c:2412
// variable: 1
inline BitContainerType BIT_getMiddleBits(BitContainerType bitContainer, const U32 start, const U32 nbBits)
{
	const U32  regMask; // 2414
} /* size: 0, variables: 1 */

// <0701689E> thirdparty/zstd/zstd.c:2435
inline BitContainerType BIT_lookBits(const BIT_DStream_t* bitD, U32 nbBits)
{
} /* size: 0 */

// <07016864> thirdparty/zstd/zstd.c:2451
// variable: 1
inline BitContainerType BIT_lookBitsFast(const BIT_DStream_t* bitD, U32 nbBits)
{
	const U32  regMask; // 2453
} /* size: 0, variables: 1 */

// <0701683B> thirdparty/zstd/zstd.c:2458
inline void BIT_skipBits(BIT_DStream_t* bitD, U32 nbBits)
{
} /* size: 0 */

// <07016801> thirdparty/zstd/zstd.c:2467
// variable: 1
inline BitContainerType BIT_readBits(BIT_DStream_t* bitD, unsigned int nbBits)
{
	const BitContainerType  value; // 2469
} /* size: 0, variables: 1 */

// <070167C7> thirdparty/zstd/zstd.c:2476
// variable: 1
inline BitContainerType BIT_readBitsFast(BIT_DStream_t* bitD, unsigned int nbBits)
{
	const BitContainerType  value; // 2478
} /* size: 0, variables: 1 */

// <070167A7> thirdparty/zstd/zstd.c:2489
inline BIT_DStream_status BIT_reloadDStream_internal(BIT_DStream_t* bitD)
{
} /* size: 0 */

// <07016787> thirdparty/zstd/zstd.c:2505
inline BIT_DStream_status BIT_reloadDStreamFast(BIT_DStream_t* bitD)
{
} /* size: 0 */

// <0701672E> thirdparty/zstd/zstd.c:2517
// variables: 3
inline BIT_DStream_status BIT_reloadDStream(BIT_DStream_t* bitD)
{
	{
		const BitContainerType  zeroFilled; // 2521
	}
	{
		U32 nbBytes; // 2538
		BIT_DStream_status result; // 2539
	}
} /* size: 0 */

// <07016708> thirdparty/zstd/zstd.c:2554
inline unsigned int BIT_endOfDStream(const BIT_DStream_t* DStream)
{
} /* size: 0 */

// <06F39E90> thirdparty/zstd/zstd.c:2622
// member variables: 4
// struct size: 32
typedef struct {
	ptrdiff_t value; /* 0 8 */
	const void * stateTable; /* 8 8 */
	const void * symbolTT; /* 16 8 */
	unsigned int stateLog; /* 24 4 */
} FSE_CState_t;

// <06F39EF1> thirdparty/zstd/zstd.c:2682
// member variables: 2
// struct size: 16
typedef struct {
	size_t state; /* 0 8 */
	const void * table; /* 8 8 */
} FSE_DState_t;

// <06F39F2D> thirdparty/zstd/zstd.c:2754
// member variables: 2
// struct size: 8
typedef struct {
	int deltaFindState; /* 0 4 */
	U32 deltaNbBits; /* 4 4 */
} FSE_symbolCompressionTransform;

// <070166B9> thirdparty/zstd/zstd.c:2759
// variables: 3
inline void FSE_initCState(FSE_CState_t* statePtr, const FSE_CTable* ct)
{
	const void* ptr; // 2761
	const U16* u16ptr; // 2762
	const U32  tableLog; // 2763
} /* size: 0, variables: 3 */

// <0701665B> thirdparty/zstd/zstd.c:2774
// variables: 3
inline void FSE_initCState2(FSE_CState_t* statePtr, const FSE_CTable* ct, U32 symbol)
{
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
} /* size: 0 */

// <070165F8> thirdparty/zstd/zstd.c:2785
// variables: 3
inline void FSE_encodeSymbol(BIT_CStream_t* bitC, FSE_CState_t* statePtr, unsigned int symbol)
{
	const FSE_symbolCompressionTransform  symbolTT; // 2787
	const U16* stateTable; // 2788
	const U32  nbBitsOut; // 2789
} /* size: 0, variables: 3 */

// <070165C3> thirdparty/zstd/zstd.c:2794
inline void FSE_flushCState(BIT_CStream_t* bitC, const FSE_CState_t* statePtr)
{
} /* size: 0 */

// <07016589> thirdparty/zstd/zstd.c:2806
// variable: 1
inline U32 FSE_getMaxNbBits(const void* symbolTTPtr, U32 symbolValue)
{
	const FSE_symbolCompressionTransform* symbolTT; // 2808
} /* size: 0, variables: 1 */

// <070164DF> thirdparty/zstd/zstd.c:2816
// variables: 7
inline U32 FSE_bitCost(const void* symbolTTPtr, U32 tableLog, U32 symbolValue, U32 accuracyLog)
{
	const FSE_symbolCompressionTransform* symbolTT; // 2818
	const U32  minNbBits; // 2819
	const U32  threshold; // 2820
	{
		const U32  tableSize; // 2823
		const U32  deltaFromThreshold; // 2824
		const U32  normalizedDeltaFromThreshold; // 2825
		const U32  bitMultiplier; // 2826
	}
} /* size: 0, variables: 3 */

// <06F39F6E> thirdparty/zstd/zstd.c:2836
// member variables: 2
// struct size: 4
typedef struct {
	U16 tableLog; /* 0 2 */
	U16 fastMode; /* 2 2 */
} FSE_DTableHeader;

// <06F39FAF> thirdparty/zstd/zstd.c:2842
// member variables: 3
// struct size: 4
typedef struct {
	short unsigned int newState; /* 0 2 */
	unsigned char symbol; /* 2 1 */
	unsigned char nbBits; /* 3 1 */
} FSE_decode_t;

// <07016490> thirdparty/zstd/zstd.c:2848
// variables: 2
inline void FSE_initDState(FSE_DState_t* DStatePtr, BIT_DStream_t* bitD, const FSE_DTable* dt)
{
	const void* ptr; // 2850
	const FSE_DTableHeader* DTableH; // 2851
} /* size: 0, variables: 2 */

// <0701642F> thirdparty/zstd/zstd.c:2871
// variables: 4
inline BYTE FSE_decodeSymbol(FSE_DState_t* DStatePtr, BIT_DStream_t* bitD)
{
	const FSE_decode_t  DInfo; // 2873
	const U32  nbBits; // 2874
	const BYTE  symbol; // 2875
	const size_t  lowBits; // 2876
} /* size: 0, variables: 4 */

// <070163C8> thirdparty/zstd/zstd.c:2884
// variables: 4
inline BYTE FSE_decodeSymbolFast(FSE_DState_t* DStatePtr, BIT_DStream_t* bitD)
{
	const FSE_decode_t  DInfo; // 2886
	const U32  nbBits; // 2887
	const BYTE  symbol; // 2888
	const size_t  lowBits; // 2889
} /* size: 0, variables: 4 */

// <06F3A09C> thirdparty/zstd/zstd.c:3158
// member variables: 3
// struct size: 8
typedef struct {
	BYTE tableLog; /* 0 1 */
	BYTE maxSymbolValue; /* 1 1 */
	BYTE unused[6]; /* 2 6 */
} HUF_CTableHeader;

// <070163A1> thirdparty/zstd/zstd.c:3241
unsigned int FSE_versionNumber(void)
{
} /* size: 0 */

// <0701637C> thirdparty/zstd/zstd.c:3245
unsigned int FSE_isError(size_t code)
{
} /* size: 0 */

// <07016357> thirdparty/zstd/zstd.c:3246
const char* FSE_getErrorName(size_t code)
{
} /* size: 0 */

// <07016332> thirdparty/zstd/zstd.c:3248
unsigned int HUF_isError(size_t code)
{
} /* size: 0 */

// <0701630D> thirdparty/zstd/zstd.c:3249
const char* HUF_getErrorName(size_t code)
{
} /* size: 0 */

// <070161DA> thirdparty/zstd/zstd.c:3256
// variables: 16
inline size_t FSE_readNCount_body(short int* normalizedCounter, unsigned int* maxSVPtr, unsigned int* tableLogPtr, const void* headerBuffer, size_t hbSize)
{
	const BYTE* istart; // 3259
	const BYTE* iend; // 3260
	const BYTE* ip; // 3261
	int nbBits; // 3262
	int remaining; // 3263
	int threshold; // 3264
	U32 bitStream; // 3265
	int bitCount; // 3266
	unsigned int charnum; // 3267
	const unsigned int  maxSV1; // 3268
	int previous0; // 3269
	{
		char buffer; // 3273
		{
			const size_t  countSize; // 3275
		}
	}
	{
		int repeats; // 3302
	}
	{
		const int  max; // 3346
		int count; // 3347
	}
} /* size: 0, variables: 11 */

// <07015C85> thirdparty/zstd/zstd.c:3404
// variables: 5
// function calls: 15
size_t FSE_readNCount_body_default(short int* normalizedCounter, unsigned int* maxSVPtr, unsigned int* tableLogPtr, const void* headerBuffer, size_t hbSize)
{
	{
		char buffer; // 3273
		{
			const size_t  countSize; // 3275
			FSE_readNCount_bmi2(short int* normalizedCounter,
						unsigned int* maxSVPtr,
						unsigned int* tableLogPtr,
						const void* headerBuffer,
						size_t hbSize,
						int bmi2);  // 3437
			FSE_readNCount(short int* normalizedCounter,
					unsigned int* maxSVPtr,
					unsigned int* tableLogPtr,
					const void* headerBuffer,
					size_t hbSize);  // 3275
		}
	}
	MEM_read32(const void* ptr); // 1301
	MEM_readLE32(const void* memPtr); // 3285
	{
		const int  max; // 3346
		int count; // 3347
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 3378
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3391
	}
	{
		int repeats; // 3302
		ZSTD_countTrailingZeros32(U32 val); // 3302
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3312
		ZSTD_countTrailingZeros32(U32 val); // 3313
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3343
	}
	FSE_readNCount_body(short int* normalizedCounter,
				unsigned int* maxSVPtr,
				unsigned int* tableLogPtr,
				const void* headerBuffer,
				size_t hbSize);  // 3408
} /* size: 874, inline expansions: 3 (785 bytes) */

// <07015781> thirdparty/zstd/zstd.c:3412
// variables: 5
// function calls: 15
size_t FSE_readNCount_body_bmi2(short int* normalizedCounter, unsigned int* maxSVPtr, unsigned int* tableLogPtr, const void* headerBuffer, size_t hbSize)
{
	{
		char buffer; // 3273
		{
			const size_t  countSize; // 3275
			FSE_readNCount_bmi2(short int* normalizedCounter,
						unsigned int* maxSVPtr,
						unsigned int* tableLogPtr,
						const void* headerBuffer,
						size_t hbSize,
						int bmi2);  // 3437
			FSE_readNCount(short int* normalizedCounter,
					unsigned int* maxSVPtr,
					unsigned int* tableLogPtr,
					const void* headerBuffer,
					size_t hbSize);  // 3275
		}
	}
	MEM_read32(const void* ptr); // 1301
	MEM_readLE32(const void* memPtr); // 3285
	{
		const int  max; // 3346
		int count; // 3347
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 3378
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3391
	}
	{
		int repeats; // 3302
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3312
		ZSTD_countTrailingZeros32(U32 val); // 3313
		ZSTD_countTrailingZeros32(U32 val); // 3302
		MEM_read32(const void* ptr); // 1301
		MEM_readLE32(const void* memPtr); // 3343
	}
	FSE_readNCount_body(short int* normalizedCounter,
				unsigned int* maxSVPtr,
				unsigned int* tableLogPtr,
				const void* headerBuffer,
				size_t hbSize);  // 3416
} /* size: 797, inline expansions: 3 (716 bytes) */

// <0701571B> thirdparty/zstd/zstd.c:3420
size_t FSE_readNCount_bmi2(short int* normalizedCounter, unsigned int* maxSVPtr, unsigned int* tableLogPtr, const void* headerBuffer, size_t hbSize, int bmi2)
{
} /* size: 0 */

// <070156C2> thirdparty/zstd/zstd.c:3433
size_t FSE_readNCount(short int* normalizedCounter, unsigned int* maxSVPtr, unsigned int* tableLogPtr, const void* headerBuffer, size_t hbSize)
{
} /* size: 0 */

// <07015642> thirdparty/zstd/zstd.c:3448
// variable: 1
size_t HUF_readStats(BYTE* huffWeight, size_t hwSize, U32* rankStats, U32* nbSymbolsPtr, U32* tableLogPtr, const void* src, size_t srcSize)
{
	U32 wksp; // 3452
} /* size: 0, variables: 1 */

// <07015513> thirdparty/zstd/zstd.c:3457
// variables: 11
inline size_t HUF_readStats_body(BYTE* huffWeight, size_t hwSize, U32* rankStats, U32* nbSymbolsPtr, U32* tableLogPtr, const void* src, size_t srcSize, void* workSpace, size_t wkspSize, int bmi2)
{
	U32 weightTotal; // 3463
	const BYTE* ip; // 3464
	size_t iSize; // 3465
	size_t oSize; // 3466
	{
		U32 n; // 3478
	}
	{
		U32 n; // 3493
	}
	{
		const U32  tableLog; // 3501
		{
			const U32  total; // 3505
			const U32  rest; // 3506
			const U32  verif; // 3507
			const U32  lastWeight; // 3508
		}
	}
} /* size: 0, variables: 4 */

// <07015151> thirdparty/zstd/zstd.c:3523
// variables: 7
// function calls: 6
size_t HUF_readStats_body_default(BYTE* huffWeight, size_t hwSize, U32* rankStats, U32* nbSymbolsPtr, U32* tableLogPtr, const void* src, size_t srcSize, void* workSpace, size_t wkspSize)
{
	{
		U32 n; // 3478
	}
	FSE_decompress_wksp_bmi2(void* dst,
				size_t dstCapacity,
				const void* cSrc,
				size_t cSrcSize,
				unsigned int maxLog,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3486
	{
		U32 n; // 3493
	}
	{
		const U32  tableLog; // 3501
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 3501
		{
			const U32  total; // 3505
			const U32  rest; // 3506
			const U32  verif; // 3507
			const U32  lastWeight; // 3508
			ZSTD_countLeadingZeros32(U32 val); // 2106
			ZSTD_highbit32(U32 val); // 3507
		}
	}
	HUF_readStats_body(BYTE* huffWeight,
				size_t hwSize,
				U32* rankStats,
				U32* nbSymbolsPtr,
				U32* tableLogPtr,
				const void* src,
				size_t srcSize,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3528
} /* size: 539, inline expansions: 2 (541 bytes) */

// <07014D8F> thirdparty/zstd/zstd.c:3532
// variables: 7
// function calls: 6
size_t HUF_readStats_body_bmi2(BYTE* huffWeight, size_t hwSize, U32* rankStats, U32* nbSymbolsPtr, U32* tableLogPtr, const void* src, size_t srcSize, void* workSpace, size_t wkspSize)
{
	{
		U32 n; // 3478
	}
	FSE_decompress_wksp_bmi2(void* dst,
				size_t dstCapacity,
				const void* cSrc,
				size_t cSrcSize,
				unsigned int maxLog,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3486
	{
		U32 n; // 3493
	}
	{
		const U32  tableLog; // 3501
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 3501
		{
			const U32  total; // 3505
			const U32  rest; // 3506
			const U32  verif; // 3507
			const U32  lastWeight; // 3508
			ZSTD_countLeadingZeros32(U32 val); // 2106
			ZSTD_highbit32(U32 val); // 3507
		}
	}
	HUF_readStats_body(BYTE* huffWeight,
				size_t hwSize,
				U32* rankStats,
				U32* nbSymbolsPtr,
				U32* tableLogPtr,
				const void* src,
				size_t srcSize,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3537
} /* size: 539, inline expansions: 2 (545 bytes) */

// <07014CF5> thirdparty/zstd/zstd.c:3541
size_t HUF_readStats_wksp(BYTE* huffWeight, size_t hwSize, U32* rankStats, U32* nbSymbolsPtr, U32* tableLogPtr, const void* src, size_t srcSize, void* workSpace, size_t wkspSize, int flags)
{
} /* size: 0 */

// <07014C9D> thirdparty/zstd/zstd.c:3571
// variable: 1
const char* ERR_getErrorString(ERR_code)
{
	const char* notErrorCode; // 3577
} /* size: 320, variables: 1 */

// <07014847> thirdparty/zstd/zstd.c:3680
// variables: 31
// function calls: 4
size_t FSE_buildDTable_internal(FSE_DTable* dt, const short int* normalizedCounter, unsigned int maxSymbolValue, unsigned int tableLog, void* workSpace, size_t wkspSize)
{
	const void* tdPtr; // 3682
	const FSE_decode_t* tableDecode; // 3683
	U16* symbolNext; // 3684
	BYTE* spread; // 3685
	const U32  maxSV1; // 3687
	const U32  tableSize; // 3688
	U32 highThreshold; // 3689
	{
		FSE_DTableHeader DTableH; // 3697
		{
			const S16  largeLimit; // 3700
			U32 s; // 3701
		}
	}
	{
		const size_t  tableMask; // 3715
		const size_t  step; // 3716
		{
			const U64  add; // 3723
			size_t pos; // 3724
			U64 sv; // 3725
			U32 s; // 3726
			{
				int i; // 3728
				const int  n; // 3729
				MEM_write64(void* memPtr,
						U64 value);  // 3730
				MEM_write64(void* memPtr,
						U64 value);  // 3732
			}
		}
		{
			size_t position; // 3743
			size_t s; // 3744
			const size_t  unroll; // 3745
			{
				size_t u; // 3748
				{
					const size_t  uPosition; // 3750
				}
			}
		}
	}
	{
		const U32  tableMask; // 3758
		const U32  step; // 3759
		U32 s; // 3760
		U32 position; // 3760
		{
			int i; // 3762
		}
	}
	{
		U32 u; // 3772
		{
			const BYTE  symbol; // 3774
			const U32  nextState; // 3775
			ZSTD_countLeadingZeros32(U32 val); // 2106
			ZSTD_highbit32(U32 val); // 3776
		}
	}
} /* size: 644, variables: 7 */

// <07014774> thirdparty/zstd/zstd.c:3783
size_t FSE_buildDTable_wksp(FSE_DTable* dt, const short int* normalizedCounter, unsigned int maxSymbolValue, unsigned int tableLog, void* workSpace, size_t wkspSize)
{
} /* size: 0 */

// <070146A5> thirdparty/zstd/zstd.c:3795
// variables: 8
inline size_t FSE_decompress_usingDTable_generic(void* dst, size_t maxDstSize, const void* cSrc, size_t cSrcSize, const FSE_DTable* dt, const unsigned int fast)
{
	const BYTE* ostart; // 3800
	BYTE* op; // 3801
	const BYTE* omax; // 3802
	const BYTE* olimit; // 3803
	BIT_DStream_t bitD; // 3805
	FSE_DState_t state1; // 3806
	FSE_DState_t state2; // 3807
	{
		const size_t  _var_err__; // 3810
	}
} /* size: 0, variables: 7 */

// <06F3A0F8> thirdparty/zstd/zstd.c:3860
// member variable: 1
// struct size: 512
typedef struct {
	short int ncount[256]; /* 0 512 */
} FSE_DecompressWksp;

// <07014560> thirdparty/zstd/zstd.c:3865
// variables: 12
inline size_t FSE_decompress_wksp_body(void* dst, size_t dstCapacity, const void* cSrc, size_t cSrcSize, unsigned int maxLog, void* workSpace, size_t wkspSize, int bmi2)
{
	const BYTE* istart; // 3871
	const BYTE* ip; // 3872
	unsigned int tableLog; // 3873
	unsigned int maxSymbolValue; // 3874
	const FSE_DecompressWksp* wksp; // 3875
	const size_t  dtablePos; // 3876
	const FSE_DTable* dtable; // 3877
	{
		const size_t  NCountLength; // 3886
	}
	{
		const size_t  _var_err__; // 3900
	}
	{
		const void* ptr; // 3903
		const FSE_DTableHeader* DTableH; // 3904
		const U32  fastMode; // 3905
	}
} /* size: 0, variables: 7 */

// <0701193D> thirdparty/zstd/zstd.c:3914
// variables: 35
// function calls: 191
size_t FSE_decompress_wksp_body_default(void* dst, size_t dstCapacity, const void* cSrc, size_t cSrcSize, unsigned int maxLog, void* workSpace, size_t wkspSize)
{
	{
		const size_t  NCountLength; // 3886
		FSE_readNCount_bmi2(short int* normalizedCounter,
					unsigned int* maxSVPtr,
					unsigned int* tableLogPtr,
					const void* headerBuffer,
					size_t hbSize,
					int bmi2);  // 3887
	}
	{
		const size_t  _var_err__; // 3900
	}
	{
		const void* ptr; // 3903
		const FSE_DTableHeader* DTableH; // 3904
		const U32  fastMode; // 3905
		{
			const size_t  _var_err__; // 3810
			{
				const BYTE  lastByte; // 2369
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2370
			}
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2368
			{
				const BYTE  lastByte; // 2397
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2398
			}
			BIT_initDStream(BIT_DStream_t* bitD,
					const void* srcBuffer,
					size_t srcSize);  // 3810
		}
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3812
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3813
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3815
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
		}
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3820
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3821
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3826
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3831
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3836
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3843
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3844
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3850
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3851
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3845
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3852
		FSE_decompress_usingDTable_generic(void* dst,
							size_t maxDstSize,
							const void* cSrc,
							size_t cSrcSize,
							const FSE_DTable* dt,
							const unsigned int  fast);  // 3908
		{
			const size_t  _var_err__; // 3810
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2368
			{
				const BYTE  lastByte; // 2369
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2370
			}
			{
				const BYTE  lastByte; // 2397
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2398
			}
			BIT_initDStream(BIT_DStream_t* bitD,
					const void* srcBuffer,
					size_t srcSize);  // 3810
		}
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3812
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3813
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3815
		{
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3820
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3821
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3826
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3831
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3836
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3843
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3844
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3850
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3851
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3845
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3852
		FSE_decompress_usingDTable_generic(void* dst,
							size_t maxDstSize,
							const void* cSrc,
							size_t cSrcSize,
							const FSE_DTable* dt,
							const unsigned int  fast);  // 3909
	}
	FSE_decompress_wksp_body(void* dst,
				size_t dstCapacity,
				const void* cSrc,
				size_t cSrcSize,
				unsigned int maxLog,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3916
} /* size: 3454, inline expansions: 1 (3363 bytes) */

// <0700ECE5> thirdparty/zstd/zstd.c:3920
// variables: 35
// function calls: 191
size_t FSE_decompress_wksp_body_bmi2(void* dst, size_t dstCapacity, const void* cSrc, size_t cSrcSize, unsigned int maxLog, void* workSpace, size_t wkspSize)
{
	{
		const size_t  NCountLength; // 3886
		FSE_readNCount_bmi2(short int* normalizedCounter,
					unsigned int* maxSVPtr,
					unsigned int* tableLogPtr,
					const void* headerBuffer,
					size_t hbSize,
					int bmi2);  // 3887
	}
	{
		const size_t  _var_err__; // 3900
	}
	{
		const void* ptr; // 3903
		const FSE_DTableHeader* DTableH; // 3904
		const U32  fastMode; // 3905
		{
			const size_t  _var_err__; // 3810
			{
				const BYTE  lastByte; // 2369
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2370
			}
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2368
			{
				const BYTE  lastByte; // 2397
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2398
			}
			BIT_initDStream(BIT_DStream_t* bitD,
					const void* srcBuffer,
					size_t srcSize);  // 3810
		}
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3812
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3813
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3815
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
		}
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3820
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3821
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3826
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3831
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3836
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3843
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3844
		BIT_lookBitsFast(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2478
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2480
		BIT_readBitsFast(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2889
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3850
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3851
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3845
		FSE_decodeSymbolFast(FSE_DState_t* DStatePtr,
					BIT_DStream_t* bitD);  // 3852
		FSE_decompress_usingDTable_generic(void* dst,
							size_t maxDstSize,
							const void* cSrc,
							size_t cSrcSize,
							const FSE_DTable* dt,
							const unsigned int  fast);  // 3908
		{
			const size_t  _var_err__; // 3810
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2368
			{
				const BYTE  lastByte; // 2369
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2370
			}
			{
				const BYTE  lastByte; // 2397
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 2398
			}
			BIT_initDStream(BIT_DStream_t* bitD,
					const void* srcBuffer,
					size_t srcSize);  // 3810
		}
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3812
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2852
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 2853
		FSE_initDState(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD,
				const FSE_DTable* dt);  // 3813
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3815
		{
		}
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3820
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3821
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3826
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3831
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3836
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3843
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3844
		BIT_getMiddleBits(BitContainerType bitContainer,
					const U32  start,
					const U32  nbBits);  // 2441
		BIT_lookBits(const BIT_DStream_t* bitD,
				U32 nbBits);  // 2469
		BIT_skipBits(BIT_DStream_t* bitD,
				U32 nbBits);  // 2470
		BIT_readBits(BIT_DStream_t* bitD,
				unsigned int nbBits);  // 2876
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3850
		MEM_read64(const void* ptr); // 1317
		MEM_readLE64(const void* memPtr); // 1335
		MEM_readLEST(const void* memPtr); // 2495
		BIT_reloadDStream_internal(BIT_DStream_t* bitD); // 2530
		{
			U32 nbBytes; // 2538
			BIT_DStream_status result; // 2539
			MEM_read64(const void* ptr); // 1317
			MEM_readLE64(const void* memPtr); // 1335
			MEM_readLEST(const void* memPtr); // 2546
		}
		BIT_reloadDStream(BIT_DStream_t* bitD); // 3851
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3845
		FSE_decodeSymbol(FSE_DState_t* DStatePtr,
				BIT_DStream_t* bitD);  // 3852
		FSE_decompress_usingDTable_generic(void* dst,
							size_t maxDstSize,
							const void* cSrc,
							size_t cSrcSize,
							const FSE_DTable* dt,
							const unsigned int  fast);  // 3909
	}
	FSE_decompress_wksp_body(void* dst,
				size_t dstCapacity,
				const void* cSrc,
				size_t cSrcSize,
				unsigned int maxLog,
				void* workSpace,
				size_t wkspSize,
				int bmi2);  // 3922
} /* size: 3290, inline expansions: 1 (3204 bytes) */

// <0700EC65> thirdparty/zstd/zstd.c:3926
size_t FSE_decompress_wksp_bmi2(void* dst, size_t dstCapacity, const void* cSrc, size_t cSrcSize, unsigned int maxLog, void* workSpace, size_t wkspSize, int bmi2)
{
} /* size: 0 */

// <06F3AB2B> thirdparty/zstd/zstd.c:4842
// member variables: 3
// struct size: 16
typedef struct {
	size_t error; /* 0 8 */
	int lowerBound; /* 8 4 */
	int upperBound; /* 12 4 */
} ZSTD_bounds;

// <06F3AC00> thirdparty/zstd/zstd.c:4999
// member variables: 3
// struct size: 24
struct ZSTD_inBuffer_s {
	const void * src; /* 0 8 */
	size_t size; /* 8 8 */
	size_t pos; /* 16 8 */
};

// <06F3AC51> thirdparty/zstd/zstd.c:5005
// member variables: 3
// struct size: 24
struct ZSTD_outBuffer_s {
	void * dst; /* 0 8 */
	size_t size; /* 8 8 */
	size_t pos; /* 16 8 */
};

// <06F3B07C> thirdparty/zstd/zstd.c:5613
// member variables: 4
// struct size: 16
typedef struct {
	unsigned int offset; /* 0 4 */
	unsigned int litLength; /* 4 4 */
	unsigned int matchLength; /* 8 4 */
	unsigned int rep; /* 12 4 */
} ZSTD_Sequence;

// <06F3B0DD> thirdparty/zstd/zstd.c:5650
// member variables: 7
// struct size: 28
typedef struct {
	unsigned int windowLog; /* 0 4 */
	unsigned int chainLog; /* 4 4 */
	unsigned int hashLog; /* 8 4 */
	unsigned int searchLog; /* 12 4 */
	unsigned int minMatch; /* 16 4 */
	unsigned int targetLength; /* 20 4 */
	ZSTD_strategy strategy; /* 24 4 */
} ZSTD_compressionParameters;

// <06F3B16E> thirdparty/zstd/zstd.c:5660
// member variables: 3
// struct size: 12
typedef struct {
	int contentSizeFlag; /* 0 4 */
	int checksumFlag; /* 4 4 */
	int noDictIDFlag; /* 8 4 */
} ZSTD_frameParameters;

// <06F3B1BF> thirdparty/zstd/zstd.c:5666
// member variables: 2
// struct size: 40
typedef struct {
	ZSTD_compressionParameters cParams; /* 0 28 */
	ZSTD_frameParameters fParams; /* 28 12 */
} ZSTD_parameters;

// <06F3B38A> thirdparty/zstd/zstd.c:5810
// member variables: 9
// struct size: 48
typedef struct {
	long long unsigned int frameContentSize; /* 0 8 */
	long long unsigned int windowSize; /* 8 8 */
	unsigned int blockSizeMax; /* 16 4 */
	ZSTD_FrameType_e frameType; /* 20 4 */
	unsigned int headerSize; /* 24 4 */
	unsigned int dictID; /* 28 4 */
	unsigned int checksumFlag; /* 32 4 */
	unsigned int _reserved1; /* 36 4 */
	unsigned int _reserved2; /* 40 4 */
} ZSTD_FrameHeader;

// <06F3B4AD> thirdparty/zstd/zstd.c:6168
// member variables: 3
// struct size: 24
typedef struct {
	ZSTD_allocFunction customAlloc; /* 0 8 */
	ZSTD_freeFunction customFree; /* 8 8 */
	void * opaque; /* 16 8 */
} ZSTD_customMem;

// <06F3B614> thirdparty/zstd/zstd.c:7034
// member variables: 6
// struct size: 40
typedef struct {
	long long unsigned int ingested; /* 0 8 */
	long long unsigned int consumed; /* 8 8 */
	long long unsigned int produced; /* 16 8 */
	long long unsigned int flushed; /* 24 8 */
	unsigned int currentJobID; /* 32 4 */
	unsigned int nbActiveWorkers; /* 36 4 */
} ZSTD_frameProgression;

// <0700EC38> thirdparty/zstd/zstd.c:7504
inline void* ZSTD_customMalloc(size_t size, ZSTD_customMem customMem)
{
} /* size: 0 */

// <0700EBFC> thirdparty/zstd/zstd.c:7511
// variable: 1
inline void* ZSTD_customCalloc(size_t size, ZSTD_customMem customMem)
{
	{
		const void* ptr; // 7516
	}
} /* size: 0 */

// <0700EBD3> thirdparty/zstd/zstd.c:7523
inline void ZSTD_customFree(void* ptr, ZSTD_customMem customMem)
{
} /* size: 0 */

// <06F3B744> thirdparty/zstd/zstd.c:7632
// member variables: 2
// struct size: 16
struct POOL_job_s {
	POOL_function function; /* 0 8 */
	void * opaque; /* 8 8 */
};

// <06F3B522> thirdparty/zstd/zstd.c:7637
// member variables: 14
// struct size: 240
struct POOL_ctx_s {
	ZSTD_customMem customMem; /* 0 24 */
	pthread_t * threads; /* 24 8 */
	size_t threadCapacity; /* 32 8 */
	size_t threadLimit; /* 40 8 */
	POOL_job * queue; /* 48 8 */
	size_t queueHead; /* 56 8 */
	size_t queueTail; /* 64 8 */
	size_t queueSize; /* 72 8 */
	size_t numThreadsBusy; /* 80 8 */
	int queueEmpty; /* 88 4 */
	pthread_mutex_t queueMutex; /* 96 40 */
	pthread_cond_t queuePushCond; /* 136 48 */
	pthread_cond_t queuePopCond; /* 184 48 */
	int shutdown; /* 232 4 */
};

// <07017543> thirdparty/zstd/zstd.c:7670
// variables: 2
// function call: 1
void* POOL_thread(void* opaque)
{
	const POOL_ctx* ctx; // 7671
	{
		const POOL_job  job; // 7689
	}
	POOL_thread(void* opaque); // 7670
} /* size: 254, variables: 1, inline expansions: 1 (207 bytes) */

// <0700EB97> thirdparty/zstd/zstd.c:7670
// variables: 2
void* POOL_thread(void* opaque)
{
	const POOL_ctx* ctx; // 7671
	{
		const POOL_job  job; // 7689
	}
} /* size: 0, variables: 1 */

// <0700EB0E> thirdparty/zstd/zstd.c:7710
// function call: 1
POOL_ctx* ZSTD_createThreadPool(size_t numThreads)
{
	POOL_create(size_t numThreads,
			size_t queueSize);  // 7711
} /* size: 56, inline expansions: 1 (46 bytes) */

// <0700EADC> thirdparty/zstd/zstd.c:7714
POOL_ctx* POOL_create(size_t numThreads, size_t queueSize)
{
} /* size: 0 */

// <0700E6DA> thirdparty/zstd/zstd.c:7718
// variables: 6
// function calls: 8
POOL_ctx* POOL_create_advanced(size_t numThreads, size_t queueSize, ZSTD_customMem customMem)
{
	POOL_ctx* ctx; // 7721
	{
		int error; // 7738
	}
	{
		size_t i; // 7752
		POOL_free(POOL_ctx* ctx); // 7756
	}
	{
		const void* ptr; // 7516
	}
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7511
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7725
	{
		const void* ptr; // 7516
	}
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7511
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7732
	{
		const void* ptr; // 7516
	}
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7511
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7746
	POOL_free(POOL_ctx* ctx); // 7750
} /* size: 506, variables: 1, inline expansions: 7 (229 bytes) */

// <0700E6B1> thirdparty/zstd/zstd.c:7768
// variable: 1
void POOL_join(POOL_ctx* ctx)
{
	{
		size_t i; // 7777
	}
} /* size: 0 */

// <0700E690> thirdparty/zstd/zstd.c:7783
void POOL_free(POOL_ctx* ctx)
{
} /* size: 0 */

// <0700E602> thirdparty/zstd/zstd.c:7797
void POOL_joinJobs(POOL_ctx* ctx)
{
} /* size: 0 */

// <0700E583> thirdparty/zstd/zstd.c:7805
// function call: 1
void ZSTD_freeThreadPool(ZSTD_threadPool* pool)
{
	POOL_free(POOL_ctx* ctx); // 7806
} /* size: 17, inline expansions: 1 (12 bytes) */

// <0700E55E> thirdparty/zstd/zstd.c:7809
size_t POOL_sizeof(const POOL_ctx* ctx)
{
} /* size: 0 */

// <0700E36A> thirdparty/zstd/zstd.c:7818
// variables: 3
// function calls: 3
int POOL_resize_internal(POOL_ctx* ctx, size_t numThreads)
{
	{
		const pthread_t* threadPool; // 7826
		{
			size_t threadId; // 7833
		}
		{
			const void* ptr; // 7516
		}
		ZSTD_customCalloc(size_t size,
					ZSTD_customMem customMem);  // 7511
		ZSTD_customCalloc(size_t size,
					ZSTD_customMem customMem);  // 7826
		ZSTD_customFree(void* ptr,
				ZSTD_customMem customMem);  // 7830
	}
} /* size: 317 */

// <0700E32B> thirdparty/zstd/zstd.c:7847
// variable: 1
int POOL_resize(POOL_ctx* ctx, size_t numThreads)
{
	int result; // 7849
} /* size: 0, variables: 1 */

// <0700E305> thirdparty/zstd/zstd.c:7864
int isQueueFull(const POOL_ctx* ctx)
{
} /* size: 0 */

// <0700E2C2> thirdparty/zstd/zstd.c:7875
// variable: 1
void POOL_add_internal(POOL_ctx* ctx, POOL_function function, void* opaque)
{
	POOL_job job; // 7877
} /* size: 0, variables: 1 */

// <0700E0F7> thirdparty/zstd/zstd.c:7889
// function calls: 4
void POOL_add(POOL_ctx* ctx, POOL_function function, void* opaque)
{
	isQueueFull(const POOL_ctx* ctx); // 7864
	isQueueFull(const POOL_ctx* ctx); // 7894
	POOL_add_internal(POOL_ctx* ctx,
				POOL_function function,
				void* opaque);  // 7875
	POOL_add_internal(POOL_ctx* ctx,
				POOL_function function,
				void* opaque);  // 7897
} /* size: 209, inline expansions: 4 (179 bytes) */

// <0700DF3E> thirdparty/zstd/zstd.c:7902
// function calls: 4
int POOL_tryAdd(POOL_ctx* ctx, POOL_function function, void* opaque)
{
	isQueueFull(const POOL_ctx* ctx); // 7864
	isQueueFull(const POOL_ctx* ctx); // 7906
	POOL_add_internal(POOL_ctx* ctx,
				POOL_function function,
				void* opaque);  // 7875
	POOL_add_internal(POOL_ctx* ctx,
				POOL_function function,
				void* opaque);  // 7910
} /* size: 197, inline expansions: 4 (195 bytes) */

// <0700DEB7> thirdparty/zstd/zstd.c:8049
// variables: 8
inline ZSTD_cpuid_t ZSTD_cpuid(void)
{
	U32 f1c; // 8050
	U32 f1d; // 8051
	U32 f7b; // 8052
	U32 f7c; // 8053
	U32 n; // 8139
	{
		U32 f1a; // 8142
	}
	{
		U32 f7a; // 8146
	}
	{
		ZSTD_cpuid_t cpuid; // 8154
	}
} /* size: 0, variables: 5 */

// <0700DE97> thirdparty/zstd/zstd.c:8234
inline int ZSTD_cpuid_bmi1(const ZSTD_cpuid_t cpuid)
{
} /* size: 0 */

// <0700DE77> thirdparty/zstd/zstd.c:8238
inline int ZSTD_cpuid_bmi2(const ZSTD_cpuid_t cpuid)
{
} /* size: 0 */

// <06F3B860> thirdparty/zstd/zstd.c:9922
// member variables: 6
// struct size: 88
struct XXH_NAMESPACEXXH64_state_s {
	XXH64_hash_t total_len; /* 0 8 */
	XXH64_hash_t v[4]; /* 8 32 */
	XXH64_hash_t mem64[4]; /* 40 32 */
	XXH32_hash_t memsize; /* 72 4 */
	XXH32_hash_t reserved32; /* 76 4 */
	XXH64_hash_t reserved64; /* 80 8 */
};

// <0700DE3D> thirdparty/zstd/zstd.c:10637
void* XXH_memcpy(void* dest, const void* src, size_t size)
{
} /* size: 0 */

// <0700DE1D> thirdparty/zstd/zstd.c:10860
xxh_u32 XXH_read32(const void* ptr)
{
} /* size: 0 */

// <0700DDFD> thirdparty/zstd/zstd.c:11079
inline xxh_u32 XXH_readLE32(const void* ptr)
{
} /* size: 0 */

// <0700DDD0> thirdparty/zstd/zstd.c:11091
inline xxh_u32 XXH_readLE32_align(const void* ptr, XXH_alignment align)
{
} /* size: 0 */

// <0700DDB0> thirdparty/zstd/zstd.c:11539
xxh_u64 XXH_read64(const void* ptr)
{
} /* size: 0 */

// <0700DD90> thirdparty/zstd/zstd.c:11609
inline xxh_u64 XXH_readLE64(const void* ptr)
{
} /* size: 0 */

// <0700DD63> thirdparty/zstd/zstd.c:11621
inline xxh_u64 XXH_readLE64_align(const void* ptr, XXH_alignment align)
{
} /* size: 0 */

// <0700DD36> thirdparty/zstd/zstd.c:11655
xxh_u64 XXH64_round(xxh_u64 acc, xxh_u64 input)
{
} /* size: 0 */

// <0700DD09> thirdparty/zstd/zstd.c:11680
xxh_u64 XXH64_mergeRound(xxh_u64 acc, xxh_u64 val)
{
} /* size: 0 */

// <0700DCE9> thirdparty/zstd/zstd.c:11689
xxh_u64 XXH64_avalanche(xxh_u64 hash)
{
} /* size: 0 */

// <0700DB75> thirdparty/zstd/zstd.c:11718
// variable: 1
// function calls: 4
xxh_u64 XXH64_finalize(xxh_u64 hash, const xxh_u8* ptr, size_t len, XXH_alignment align)
{
	{
		const xxh_u64  k1; // 11723
		XXH64_round(xxh_u64 acc,
				xxh_u64 input);  // 11723
		XXH_readLE64_align(const void* ptr,
					XXH_alignment align);  // 11723
	}
	XXH_readLE32_align(const void* ptr,
				XXH_alignment align);  // 11730
	XXH64_avalanche(xxh_u64 hash); // 11740
} /* size: 309, inline expansions: 2 (58 bytes) */

// <0700DAD5> thirdparty/zstd/zstd.c:11762
// variables: 7
inline xxh_u64 XXH64_endian_align(const xxh_u8* input, size_t len, xxh_u64 seed, XXH_alignment align)
{
	xxh_u64 h64; // 11764
	{
		const xxh_u8* bEnd; // 11768
		const xxh_u8* limit; // 11769
		xxh_u64 v1; // 11770
		xxh_u64 v2; // 11771
		xxh_u64 v3; // 11772
		xxh_u64 v4; // 11773
	}
} /* size: 0, variables: 1 */

// <0700DA9B> thirdparty/zstd/zstd.c:11799
inline XXH64_hash_t XXH_INLINE_XXH64(const void* input, size_t len, XXH64_hash_t seed)
{
} /* size: 0 */

// <0700DA6E> thirdparty/zstd/zstd.c:11839
inline XXH_NAMESPACEXXH_errorcode XXH_INLINE_XXH64_reset(XXH_NAMESPACEXXH64_state_t* statePtr, XXH64_hash_t seed)
{
} /* size: 0 */

// <0701A146> thirdparty/zstd/zstd.c:11852
// variables: 3
// function calls: 30
XXH_NAMESPACEXXH_errorcode XXH_INLINE_XXH64_update(XXH_NAMESPACEXXH64_state_t* state, const void* input, size_t len)
{
	{
		const xxh_u8* p; // 11859
		const xxh_u8* bEnd; // 11860
		{
			const xxh_u8* limit; // 11881
			XXH64_round(xxh_u64 acc,
					xxh_u64 input);  // 11884
			XXH_read64(const void* ptr); // 11611
			XXH_readLE64(const void* ptr); // 11884
			XXH_read64(const void* ptr); // 11611
			XXH_readLE64(const void* ptr); // 11885
			XXH64_round(xxh_u64 acc,
					xxh_u64 input);  // 11885
			XXH_read64(const void* ptr); // 11611
			XXH_readLE64(const void* ptr); // 11886
			XXH64_round(xxh_u64 acc,
					xxh_u64 input);  // 11886
			XXH_read64(const void* ptr); // 11611
			XXH_readLE64(const void* ptr); // 11887
			XXH64_round(xxh_u64 acc,
					xxh_u64 input);  // 11887
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 10639
		XXH_memcpy(void* dest,
				const void* src,
				size_t size);  // 11871
		XXH_read64(const void* ptr); // 11611
		XXH_readLE64(const void* ptr); // 11872
		XXH64_round(xxh_u64 acc,
				xxh_u64 input);  // 11872
		XXH_read64(const void* ptr); // 11611
		XXH_readLE64(const void* ptr); // 11873
		XXH64_round(xxh_u64 acc,
				xxh_u64 input);  // 11873
		XXH_read64(const void* ptr); // 11611
		XXH_readLE64(const void* ptr); // 11874
		XXH64_round(xxh_u64 acc,
				xxh_u64 input);  // 11874
		XXH64_round(xxh_u64 acc,
				xxh_u64 input);  // 11875
		XXH_read64(const void* ptr); // 11611
		XXH_readLE64(const void* ptr); // 11875
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 10639
		XXH_memcpy(void* dest,
				const void* src,
				size_t size);  // 11893
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 10639
		XXH_memcpy(void* dest,
				const void* src,
				size_t size);  // 11865
	}
} /* size: 550 */

// <0700D9FA> thirdparty/zstd/zstd.c:11852
// variables: 3
inline XXH_NAMESPACEXXH_errorcode XXH_INLINE_XXH64_update(XXH_NAMESPACEXXH64_state_t* state, const void* input, size_t len)
{
	{
		const xxh_u8* p; // 11859
		const xxh_u8* bEnd; // 11860
		{
			const xxh_u8* limit; // 11881
		}
	}
} /* size: 0 */

// <0700D9C7> thirdparty/zstd/zstd.c:11903
// variable: 1
inline XXH64_hash_t XXH_INLINE_XXH64_digest(const XXH_NAMESPACEXXH64_state_t* state)
{
	xxh_u64 h64; // 11905
} /* size: 0, variables: 1 */

// <0700D99E> thirdparty/zstd/zstd.c:15666
void ZSTD_copy8(void* dst, const void* src)
{
} /* size: 0 */

// <0700D975> thirdparty/zstd/zstd.c:15679
void ZSTD_copy16(void* dst, const void* src)
{
} /* size: 0 */

// <0700D900> thirdparty/zstd/zstd.c:15712
// variables: 4
inline void ZSTD_wildcopy(void* dst, const void* src, ptrdiff_t length, const ZSTD_overlap_e ovtype)
{
	ptrdiff_t diff; // 15714
	const BYTE* ip; // 15715
	BYTE* op; // 15716
	const BYTE* oend; // 15717
} /* size: 0, variables: 4 */

// <0700D8AC> thirdparty/zstd/zstd.c:15744
// variable: 1
inline size_t ZSTD_limitCopy(void* dst, size_t dstCapacity, const void* src, size_t srcSize)
{
	const size_t  length; // 15746
} /* size: 0, variables: 1 */

// <06F3BB8F> thirdparty/zstd/zstd.c:15780
// member variables: 3
// struct size: 24
typedef struct {
	size_t nbBlocks; /* 0 8 */
	size_t compressedSize; /* 8 8 */
	long long unsigned int decompressedBound; /* 16 8 */
} ZSTD_frameSizeInfo;

// <06F3BBE0> thirdparty/zstd/zstd.c:15793
// member variables: 3
// struct size: 12
typedef struct {
	blockType_e blockType; /* 0 4 */
	U32 lastBlock; /* 4 4 */
	U32 origSize; /* 8 4 */
} blockProperties_t;

// <0700D88C> thirdparty/zstd/zstd.c:15814
// variable: 1
inline int ZSTD_cpuSupportsBmi2(void)
{
	ZSTD_cpuid_t cpuid; // 15816
} /* size: 0, variables: 1 */

// <0700D86A> thirdparty/zstd/zstd.c:15827
unsigned int ZSTD_versionNumber(void)
{
} /* size: 10 */

// <0700D848> thirdparty/zstd/zstd.c:15829
const char* ZSTD_versionString(void)
{
} /* size: 12 */

// <0700D827> thirdparty/zstd/zstd.c:15839
unsigned int ZSTD_isError(size_t code)
{
} /* size: 0 */

// <0700D806> thirdparty/zstd/zstd.c:15843
const char* ZSTD_getErrorName(size_t code)
{
} /* size: 0 */

// <0700D79F> thirdparty/zstd/zstd.c:15847
// function call: 1
ZSTD_ErrorCode ZSTD_getErrorCode(size_t code)
{
	ERR_getErrorCode(size_t code); // 15847
} /* size: 18, inline expansions: 1 (13 bytes) */

// <0700D74D> thirdparty/zstd/zstd.c:15851
const char* ZSTD_getErrorString(ZSTD_ErrorCode code)
{
} /* size: 9 */

// <0700D28D> thirdparty/zstd/zstd.c:16005
// variables: 34
// function calls: 4
size_t FSE_buildCTable_wksp(FSE_CTable* ct, const short int* normalizedCounter, unsigned int maxSymbolValue, unsigned int tableLog, void* workSpace, size_t wkspSize)
{
	const U32  tableSize; // 16009
	const U32  tableMask; // 16010
	const void* ptr; // 16011
	const U16* tableU16; // 16012
	const void* FSCT; // 16013
	const FSE_symbolCompressionTransform* symbolTT; // 16014
	const U32  step; // 16015
	const U32  maxSV1; // 16016
	U16* cumul; // 16018
	const BYTE* tableSymbol; // 16019
	U32 highThreshold; // 16021
	{
		U32 u; // 16038
	}
	{
		const BYTE* spread; // 16057
		{
			const U64  add; // 16058
			size_t pos; // 16059
			U64 sv; // 16060
			U32 s; // 16061
			{
				int i; // 16063
				const int  n; // 16064
				MEM_write64(void* memPtr,
						U64 value);  // 16065
				MEM_write64(void* memPtr,
						U64 value);  // 16067
			}
		}
		{
			size_t position; // 16077
			size_t s; // 16078
			const size_t  unroll; // 16079
			{
				size_t u; // 16082
				{
					const size_t  uPosition; // 16084
				}
			}
		}
	}
	{
		U32 position; // 16092
		U32 symbol; // 16093
		{
			int nbOccurrences; // 16095
			const int  freq; // 16096
		}
	}
	{
		U32 u; // 16107
		{
			BYTE s; // 16108
		}
	}
	{
		unsigned int total; // 16113
		unsigned int s; // 16114
		{
			const U32  maxBitsOut; // 16132
			const U32  minStatePlus; // 16133
			ZSTD_countLeadingZeros32(U32 val); // 2106
			ZSTD_highbit32(U32 val); // 16132
		}
	}
} /* size: 919, variables: 11 */

// <0700D24E> thirdparty/zstd/zstd.c:16160
// variable: 1
size_t FSE_NCountWriteBound(unsigned int maxSymbolValue, unsigned int tableLog)
{
	const size_t  maxHeaderSize; // 16162
} /* size: 0, variables: 1 */

// <0700D05E> thirdparty/zstd/zstd.c:16171
// variables: 15
size_t FSE_writeNCount_generic(void* header, size_t headerBufferSize, const short int* normalizedCounter, unsigned int maxSymbolValue, unsigned int tableLog, unsigned int writeIsSafe)
{
	const BYTE* ostart; // 16175
	BYTE* out; // 16176
	const BYTE* oend; // 16177
	int nbBits; // 16178
	const int  tableSize; // 16179
	int remaining; // 16180
	int threshold; // 16181
	U32 bitStream; // 16182
	int bitCount; // 16183
	unsigned int symbol; // 16184
	const unsigned int  alphabetSize; // 16185
	int previousIs0; // 16186
	{
		unsigned int start; // 16199
	}
	{
		int count; // 16228
		const int  max; // 16229
	}
} /* size: 683, variables: 12 */

// <0700D005> thirdparty/zstd/zstd.c:16267
size_t FSE_writeNCount(void* buffer, size_t bufferSize, const short int* normalizedCounter, unsigned int maxSymbolValue, unsigned int tableLog)
{
} /* size: 0 */

// <0700CFB1> thirdparty/zstd/zstd.c:16285
// variables: 3
unsigned int FSE_minTableLog(size_t srcSize, unsigned int maxSymbolValue)
{
	U32 minBitsSrc; // 16287
	U32 minBitsSymbols; // 16288
	U32 minBits; // 16289
} /* size: 0, variables: 3 */

// <0700CF3E> thirdparty/zstd/zstd.c:16294
// variables: 3
unsigned int FSE_optimalTableLog_internal(unsigned int maxTableLog, size_t srcSize, unsigned int maxSymbolValue, unsigned int minus)
{
	U32 maxBitsSrc; // 16296
	U32 tableLog; // 16297
	U32 minBits; // 16298
} /* size: 0, variables: 3 */

// <0700CEFF> thirdparty/zstd/zstd.c:16308
unsigned int FSE_optimalTableLog(unsigned int maxTableLog, size_t srcSize, unsigned int maxSymbolValue)
{
} /* size: 0 */

// <0700CDC6> thirdparty/zstd/zstd.c:16316
// variables: 16
size_t FSE_normalizeM2(short int* norm, U32 tableLog, const unsigned int* count, size_t total, U32 maxSymbolValue, short int lowProbCount)
{
	const short int  NOT_YET_ASSIGNED; // 16318
	U32 s; // 16319
	U32 distributed; // 16320
	U32 ToDistribute; // 16321
	const U32  lowThreshold; // 16324
	U32 lowOne; // 16325
	{
		U32 maxV; // 16369
		U32 maxC; // 16369
	}
	{
		const U64  vStepLog; // 16383
		const U64  mid; // 16384
		const U64  rStep; // 16385
		U64 tmpTotal; // 16386
		{
			const U64  end; // 16389
			const U32  sStart; // 16390
			const U32  sEnd; // 16391
			const U32  weight; // 16392
		}
	}
} /* size: 0, variables: 6 */

// <0700C93F> thirdparty/zstd/zstd.c:16402
// variables: 23
// function calls: 6
size_t FSE_normalizeCount(short int* normalizedCounter, unsigned int tableLog, const unsigned int* count, size_t total, unsigned int maxSymbolValue, unsigned int useLowProbCount)
{
	{
		const U32   rtbTable; // 16412
		const short int  lowProbCount; // 16413
		const U64  scale; // 16414
		const U64  step; // 16415
		const U64  vStep; // 16416
		int stillToDistribute; // 16417
		unsigned int s; // 16418
		unsigned int largest; // 16419
		short int largestP; // 16420
		U32 lowThreshold; // 16421
		{
			short int proba; // 16430
			{
				U64 restToBeat; // 16432
			}
		}
		{
			const size_t  errorCode; // 16441
			{
				U32 maxV; // 16369
				U32 maxC; // 16369
			}
			{
				const U64  vStepLog; // 16383
				const U64  mid; // 16384
				const U64  rStep; // 16385
				U64 tmpTotal; // 16386
				{
					const U64  end; // 16389
					const U32  sStart; // 16390
					const U32  sEnd; // 16391
					const U32  weight; // 16392
				}
			}
			FSE_normalizeM2(short int* norm,
					U32 tableLog,
					const unsigned int* count,
					size_t total,
					U32 maxSymbolValue,
					short int lowProbCount);  // 16441
		}
	}
	ZSTD_countLeadingZeros32(U32 val); // 2106
	ZSTD_highbit32(U32 val); // 16287
	ZSTD_countLeadingZeros32(U32 val); // 2106
	ZSTD_highbit32(U32 val); // 16288
	FSE_minTableLog(size_t srcSize,
			unsigned int maxSymbolValue);  // 16410
} /* size: 961, inline expansions: 5 (18 bytes) */

// <0700C8CF> thirdparty/zstd/zstd.c:16465
// variables: 4
size_t FSE_buildCTable_rle(FSE_CTable* ct, BYTE symbolValue)
{
	void* ptr; // 16467
	U16* tableU16; // 16468
	void* FSCTptr; // 16469
	FSE_symbolCompressionTransform* symbolTT; // 16470
} /* size: 0, variables: 4 */

// <0700B621> thirdparty/zstd/zstd.c:16488
// variables: 19
// function calls: 71
size_t FSE_compress_usingCTable_generic(void* dst, size_t dstSize, const void* src, size_t srcSize, const FSE_CTable* ct, const unsigned int fast)
{
	const BYTE* istart; // 16492
	const BYTE* iend; // 16493
	const BYTE* ip; // 16494
	BIT_CStream_t bitC; // 16496
	FSE_CState_t CState1; // 16497
	FSE_CState_t CState2; // 16497
	{
		const size_t  initError; // 16501
		BIT_initCStream(BIT_CStream_t* bitC,
				void* startPtr,
				size_t dstCapacity);  // 16501
	}
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 16507
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2315
	BIT_flushBitsFast(BIT_CStream_t* bitC); // 16510
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16509
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 16508
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16519
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16520
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2315
	BIT_flushBitsFast(BIT_CStream_t* bitC); // 16521
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 16512
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 16513
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16527
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16532
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16535
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2315
	BIT_flushBitsFast(BIT_CStream_t* bitC); // 16539
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2790
	FSE_encodeSymbol(BIT_CStream_t* bitC,
			FSE_CState_t* statePtr,
			unsigned int symbol);  // 16536
	BIT_flushBits(BIT_CStream_t* bitC); // 16539
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 16542
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 16543
	BIT_addBitsFast(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2343
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2344
	BIT_closeCStream(BIT_CStream_t* bitC); // 16544
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 16510
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 16521
} /* size: 1327, variables: 6, inline expansions: 70 (1663 bytes) */

// <0700B5BC> thirdparty/zstd/zstd.c:16547
// variable: 1
size_t FSE_compress_usingCTable(void* dst, size_t dstSize, const void* src, size_t srcSize, const FSE_CTable* ct)
{
	const unsigned int  fast; // 16551
} /* size: 0, variables: 1 */

// <0700B582> thirdparty/zstd/zstd.c:16560
size_t FSE_compressBound(size_t size)
{
} /* size: 0 */

// <0700B55D> thirdparty/zstd/zstd.c:16588
unsigned int HIST_isError(size_t code)
{
} /* size: 0 */

// <0700B509> thirdparty/zstd/zstd.c:16593
// variables: 2
void HIST_add(unsigned int* count, const void* src, size_t srcSize)
{
	const BYTE* ip; // 16595
	const BYTE* end; // 16596
} /* size: 0, variables: 2 */

// <0700B3F1> thirdparty/zstd/zstd.c:16603
// variables: 5
unsigned int HIST_count_simple(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* src, size_t srcSize)
{
	const BYTE* ip; // 16606
	const BYTE* end; // 16607
	unsigned int maxSymbolValue; // 16608
	unsigned int largestCount; // 16609
	{
		U32 s; // 16622
	}
} /* size: 180, variables: 4 */

// <0700B0C6> thirdparty/zstd/zstd.c:16640
// variables: 12
// function calls: 5
size_t HIST_count_parallel_wksp(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* source, size_t sourceSize, HIST_checkInput_e check, const U32* workSpace)
{
	const BYTE* ip; // 16646
	const BYTE* iend; // 16647
	const size_t  countSize; // 16648
	unsigned int max; // 16649
	const U32* Counting1; // 16650
	const U32* Counting2; // 16651
	const U32* Counting3; // 16652
	const U32* Counting4; // 16653
	{
		U32 cached; // 16665
		{
			U32 c; // 16667
			MEM_read32(const void* ptr); // 16667
			MEM_read32(const void* ptr); // 16672
			MEM_read32(const void* ptr); // 16677
			MEM_read32(const void* ptr); // 16682
		}
		MEM_read32(const void* ptr); // 16665
	}
	{
		U32 s; // 16694
	}
	{
		unsigned int maxSymbolValue; // 16700
	}
} /* size: 705, variables: 8 */

// <0700B060> thirdparty/zstd/zstd.c:16714
size_t HIST_countFast_wksp(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* source, size_t sourceSize, void* workSpace, size_t workSpaceSize)
{
} /* size: 0 */

// <0700AFFA> thirdparty/zstd/zstd.c:16728
size_t HIST_count_wksp(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* source, size_t sourceSize, void* workSpace, size_t workSpaceSize)
{
} /* size: 0 */

// <0700AE39> thirdparty/zstd/zstd.c:16742
// variable: 1
// function calls: 2
size_t HIST_countFast(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* source, size_t sourceSize)
{
	unsigned int tmpCounters; // 16745
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16714
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16746
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <0700AB72> thirdparty/zstd/zstd.c:16749
// variable: 1
// function calls: 4
size_t HIST_count(unsigned int* count, unsigned int* maxSymbolValuePtr, const void* src, size_t srcSize)
{
	unsigned int tmpCounters; // 16752
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16714
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16737
	HIST_count_wksp(unsigned int* count,
			unsigned int* maxSymbolValuePtr,
			const void* source,
			size_t sourceSize,
			void* workSpace,
			size_t workSpaceSize);  // 16728
	HIST_count_wksp(unsigned int* count,
			unsigned int* maxSymbolValuePtr,
			const void* source,
			size_t sourceSize,
			void* workSpace,
			size_t workSpaceSize);  // 16753
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <06F3BC59> thirdparty/zstd/zstd.c:16804
// member variables: 4
// struct size: 8
struct nodeElt_s {
	U32 count; /* 0 4 */
	U16 parent; /* 4 2 */
	BYTE byte; /* 6 1 */
	BYTE nbBits; /* 7 1 */
};

// <0700AB04> thirdparty/zstd/zstd.c:16869
// variables: 4
void* HUF_alignUpWorkspace(void* workspace, size_t* workspaceSizePtr, size_t align)
{
	const size_t  mask; // 16871
	const size_t  rem; // 16872
	const size_t  add; // 16873
	const BYTE* aligned; // 16874
} /* size: 0, variables: 4 */

// <06F3BCBA> thirdparty/zstd/zstd.c:16896
// member variables: 4
// struct size: 480
typedef struct {
	FSE_CTable CTable[59]; /* 0 236 */
	U32 scratchBuffer[41]; /* 236 164 */
	unsigned int count[13]; /* 400 52 */
	S16 norm[13]; /* 452 26 */
} HUF_CompressWeightsWksp;

// <0700A9F5> thirdparty/zstd/zstd.c:16904
// variables: 11
size_t HUF_compressWeights(void* dst, size_t dstSize, const void* weightTable, size_t wtSize, void* workspace, size_t workspaceSize)
{
	const BYTE* ostart; // 16908
	BYTE* op; // 16909
	const BYTE* oend; // 16910
	unsigned int maxSymbolValue; // 16912
	U32 tableLog; // 16913
	HUF_CompressWeightsWksp* wksp; // 16914
	{
		const unsigned int  maxCount; // 16922
	}
	{
		const size_t  _var_err__; // 16928
	}
	{
		const size_t  hSize; // 16931
	}
	{
		const size_t  _var_err__; // 16936
	}
	{
		const size_t  cSize; // 16937
	}
} /* size: 0, variables: 6 */

// <0700A9D5> thirdparty/zstd/zstd.c:16945
size_t HUF_getNbBits(HUF_CElt elt)
{
} /* size: 0 */

// <0700A9B5> thirdparty/zstd/zstd.c:16950
size_t HUF_getNbBitsFast(HUF_CElt elt)
{
} /* size: 0 */

// <0700A995> thirdparty/zstd/zstd.c:16955
size_t HUF_getValue(HUF_CElt elt)
{
} /* size: 0 */

// <0700A975> thirdparty/zstd/zstd.c:16960
size_t HUF_getValueFast(HUF_CElt elt)
{
} /* size: 0 */

// <0700A94C> thirdparty/zstd/zstd.c:16965
void HUF_setNbBits(HUF_CElt* elt, size_t nbBits)
{
} /* size: 0 */

// <0700A916> thirdparty/zstd/zstd.c:16971
// variable: 1
void HUF_setValue(HUF_CElt* elt, size_t value)
{
	const size_t  nbBits; // 16973
} /* size: 0, variables: 1 */

// <0700A8E4> thirdparty/zstd/zstd.c:16980
// variable: 1
HUF_CTableHeader HUF_readCTableHeader(const HUF_CElt* ctable)
{
	HUF_CTableHeader header; // 16982
} /* size: 0, variables: 1 */

// <0700A8A1> thirdparty/zstd/zstd.c:16987
// variable: 1
void HUF_writeCTableHeader(HUF_CElt* ctable, U32 tableLog, U32 maxSymbolValue)
{
	HUF_CTableHeader header; // 16989
} /* size: 0, variables: 1 */

// <06F3BD5A> thirdparty/zstd/zstd.c:16999
// member variables: 3
// struct size: 748
typedef struct {
	HUF_CompressWeightsWksp wksp; /* 0 480 */
	BYTE bitsToWeight[13]; /* 480 13 */
	BYTE huffWeight[255]; /* 493 255 */
} HUF_WriteCTableWksp;

// <0700A0D3> thirdparty/zstd/zstd.c:17005
// variables: 10
// function calls: 15
size_t HUF_writeCTable_wksp(void* dst, size_t maxDstSize, const HUF_CElt* CTable, unsigned int maxSymbolValue, unsigned int huffLog, void* workspace, size_t workspaceSize)
{
	const HUF_CElt* ct; // 17009
	BYTE* op; // 17010
	U32 n; // 17011
	HUF_WriteCTableWksp* wksp; // 17012
	{
		const size_t  hSize; // 17032
		HUF_alignUpWorkspace(void* workspace,
					size_t* workspaceSizePtr,
					size_t align);  // 16914
		{
			const unsigned int  maxCount; // 16922
		}
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16296
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16287
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16288
		FSE_minTableLog(size_t srcSize,
				unsigned int maxSymbolValue);  // 16298
		FSE_optimalTableLog_internal(unsigned int maxTableLog,
						size_t srcSize,
						unsigned int maxSymbolValue,
						unsigned int minus);  // 16310
		FSE_optimalTableLog(unsigned int maxTableLog,
					size_t srcSize,
					unsigned int maxSymbolValue);  // 16927
		{
			const size_t  _var_err__; // 16928
		}
		{
			const size_t  hSize; // 16931
		}
		{
			const size_t  _var_err__; // 16936
		}
		{
			const size_t  cSize; // 16937
			FSE_compress_usingCTable(void* dst,
						size_t dstSize,
						const void* src,
						size_t srcSize,
						const FSE_CTable* ct);  // 16547
			FSE_compress_usingCTable(void* dst,
						size_t dstSize,
						const void* src,
						size_t srcSize,
						const FSE_CTable* ct);  // 16937
		}
		HUF_compressWeights(void* dst,
					size_t dstSize,
					const void* weightTable,
					size_t wtSize,
					void* workspace,
					size_t workspaceSize);  // 17032
	}
	HUF_alignUpWorkspace(void* workspace,
				size_t* workspaceSizePtr,
				size_t align);  // 17012
	HUF_getNbBits(HUF_CElt elt); // 17028
} /* size: 1099, variables: 4, inline expansions: 2 (20 bytes) */

// <07009C1E> thirdparty/zstd/zstd.c:17049
// variables: 17
// function calls: 7
size_t HUF_readCTable(HUF_CElt* CTable, unsigned int* maxSymbolValuePtr, const void* src, size_t srcSize, unsigned int* hasZeroWeights)
{
	BYTE huffWeight; // 17051
	U32 rankVal; // 17052
	U32 tableLog; // 17053
	U32 nbSymbols; // 17054
	const HUF_CElt* ct; // 17055
	const size_t  readSize; // 17058
	{
		U32 n; // 17070
		U32 nextRankStart; // 17070
		{
			U32 curr; // 17072
		}
	}
	{
		U32 n; // 17078
		{
			const U32  w; // 17079
			HUF_setNbBits(HUF_CElt* elt,
					size_t nbBits);  // 17080
		}
	}
	{
		U16 nbPerRank; // 17084
		U16 valPerRank; // 17085
		{
			U32 n; // 17086
			HUF_getNbBits(HUF_CElt elt); // 17086
		}
		{
			U16 min; // 17089
			U32 n; // 17090
		}
		{
			U32 n; // 17096
			HUF_getNbBits(HUF_CElt elt); // 17096
			HUF_setValue(HUF_CElt* elt,
					size_t value);  // 17096
		}
	}
	HUF_readStats_wksp(BYTE* huffWeight,
				size_t hwSize,
				U32* rankStats,
				U32* nbSymbolsPtr,
				U32* tableLogPtr,
				const void* src,
				size_t srcSize,
				void* workSpace,
				size_t wkspSize,
				int flags);  // 3453
	HUF_readStats(BYTE* huffWeight,
			size_t hwSize,
			U32* rankStats,
			U32* nbSymbolsPtr,
			U32* tableLogPtr,
			const void* src,
			size_t srcSize);  // 17058
	HUF_writeCTableHeader(HUF_CElt* ctable,
				U32 tableLog,
				U32 maxSymbolValue);  // 17067
} /* size: 1207, variables: 6, inline expansions: 3 (170 bytes) */

// <07009BE0> thirdparty/zstd/zstd.c:17102
// variable: 1
U32 HUF_getNbBitsFromCTable(const HUF_CElt* CTable, U32 symbolValue)
{
	const HUF_CElt* ct; // 17104
} /* size: 0, variables: 1 */

// <07009ADF> thirdparty/zstd/zstd.c:17133
// variables: 13
U32 HUF_setMaxHeight(nodeElt* huffNode, U32 lastNonNull, U32 targetNbBits)
{
	const U32  largestBits; // 17135
	{
		int totalCost; // 17142
		const U32  baseCost; // 17143
		int n; // 17144
		{
			const U32  noSymbol; // 17167
			U32 rankLast; // 17168
			{
				U32 currentNbBits; // 17172
				int pos; // 17173
			}
			{
				U32 nBitsToDecrease; // 17184
				{
					const U32  highPos; // 17186
					const U32  lowPos; // 17187
					{
						const U32  highTotal; // 17193
						const U32  lowTotal; // 17194
					}
				}
			}
		}
	}
} /* size: 0, variables: 1 */

// <06F3BDC9> thirdparty/zstd/zstd.c:17257
// member variables: 2
// struct size: 4
typedef struct {
	U16 base; /* 0 2 */
	U16 curr; /* 2 2 */
} rankPos;

// <06F3BE23> thirdparty/zstd/zstd.c:17267
// member variables: 2
// struct size: 4,864
typedef struct {
	huffNodeTable huffNodeTbl; /* 0 4096 */
	rankPos rankPosition[192]; /* 4096 768 */
} HUF_buildCTable_wksp_tables;

// <07009ABF> thirdparty/zstd/zstd.c:17287
U32 HUF_getIndex(const U32 count)
{
} /* size: 0 */

// <07009A8D> thirdparty/zstd/zstd.c:17294
// variable: 1
void HUF_swapNodes(nodeElt* a, nodeElt* b)
{
	nodeElt tmp; // 17295
} /* size: 0, variables: 1 */

// <07009A25> thirdparty/zstd/zstd.c:17312
// variables: 4
inline void HUF_insertionSort(nodeElt* huffNode, const int low, const int high)
{
	int i; // 17313
	const int  size; // 17314
	{
		const nodeElt  key; // 17317
		int j; // 17318
	}
} /* size: 0, variables: 2 */

// <070099C8> thirdparty/zstd/zstd.c:17328
// variables: 3
int HUF_quickSortPartition(nodeElt* arr, const int low, const int high)
{
	const U32  pivot; // 17332
	int i; // 17333
	int j; // 17334
} /* size: 0, variables: 3 */

// <0700979C> thirdparty/zstd/zstd.c:17348
// variables: 4
// function calls: 4
void HUF_simpleQuickSort(nodeElt* arr, int low, int high)
{
	const int  kInsertionSortThreshold; // 17349
	{
		const int  idx; // 17355
		HUF_swapNodes(nodeElt* a,
				nodeElt* b);  // 17338
		HUF_swapNodes(nodeElt* a,
				nodeElt* b);  // 17341
		HUF_quickSortPartition(nodeElt* arr,
					const int  low,
					const int  high);  // 17355
	}
	{
		const nodeElt  key; // 17317
		int j; // 17318
	}
	HUF_insertionSort(nodeElt* huffNode,
				const int  low,
				const int  high);  // 17351
} /* size: 450, variables: 1, inline expansions: 1 (133 bytes) */

// <070096E3> thirdparty/zstd/zstd.c:17377
// variables: 8
void HUF_sort(nodeElt* huffNode, const unsigned int* count, const U32 maxSymbolValue, rankPos* rankPosition)
{
	U32 n; // 17378
	const U32  maxSymbolValue1; // 17379
	{
		U32 lowerRank; // 17389
	}
	{
		const U32  c; // 17403
		const U32  r; // 17404
		const U32  pos; // 17405
	}
	{
		const int  bucketSize; // 17413
		const U32  bucketStartIdx; // 17414
	}
} /* size: 0, variables: 2 */

// <07009643> thirdparty/zstd/zstd.c:17438
// variables: 9
int HUF_buildTree(nodeElt* huffNode, U32 maxSymbolValue)
{
	const nodeElt* huffNode0; // 17440
	int nonNullRank; // 17441
	int lowS; // 17442
	int lowN; // 17442
	int nodeNb; // 17443
	int n; // 17444
	int nodeRoot; // 17444
	{
		const int  n1; // 17458
		const int  n2; // 17459
	}
} /* size: 0, variables: 7 */

// <07009590> thirdparty/zstd/zstd.c:17487
// variables: 6
void HUF_buildCTableFromTree(HUF_CElt* CTable, const nodeElt* huffNode, int nonNullRank, U32 maxSymbolValue, U32 maxNbBits)
{
	const HUF_CElt* ct; // 17489
	int n; // 17491
	U16 nbPerRank; // 17492
	U16 valPerRank; // 17493
	const int  alphabetSize; // 17494
	{
		U16 min; // 17498
	}
} /* size: 0, variables: 5 */

// <07008DBC> thirdparty/zstd/zstd.c:17513
// variables: 25
// function calls: 17
size_t HUF_buildCTable_wksp(HUF_CElt* CTable, const unsigned int* count, U32 maxSymbolValue, U32 maxNbBits, void* workSpace, size_t wkspSize)
{
	const HUF_buildCTable_wksp_tables* wksp_tables; // 17516
	const nodeElt* huffNode0; // 17518
	const nodeElt* huffNode; // 17519
	int nonNullRank; // 17520
	HUF_alignUpWorkspace(void* workspace,
				size_t* workspaceSizePtr,
				size_t align);  // 17517
	{
		U32 lowerRank; // 17389
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 17290
		HUF_getIndex(const U32 count); // 17389
	}
	{
		const U32  c; // 17403
		const U32  r; // 17404
		const U32  pos; // 17405
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 17290
		HUF_getIndex(const U32 count); // 17404
	}
	{
		const int  bucketSize; // 17413
		const U32  bucketStartIdx; // 17414
	}
	HUF_sort(nodeElt* huffNode,
		const unsigned int* count,
		const U32  maxSymbolValue,
		rankPos* rankPosition);  // 17535
	{
		const int  n1; // 17458
		const int  n2; // 17459
	}
	HUF_buildTree(nodeElt* huffNode,
			U32 maxSymbolValue);  // 17539
	{
		int totalCost; // 17142
		const U32  baseCost; // 17143
		int n; // 17144
		{
			const U32  noSymbol; // 17167
			U32 rankLast; // 17168
			{
				U32 currentNbBits; // 17172
				int pos; // 17173
			}
			{
				U32 nBitsToDecrease; // 17184
				ZSTD_countLeadingZeros32(U32 val); // 2106
				ZSTD_highbit32(U32 val); // 17184
				{
					const U32  highPos; // 17186
					const U32  lowPos; // 17187
					{
						const U32  highTotal; // 17193
						const U32  lowTotal; // 17194
					}
				}
			}
		}
	}
	HUF_setMaxHeight(nodeElt* huffNode,
			U32 lastNonNull,
			U32 targetNbBits);  // 17542
	{
		U16 min; // 17498
	}
	HUF_setNbBits(HUF_CElt* elt,
			size_t nbBits);  // 17505
	HUF_getNbBits(HUF_CElt elt); // 17507
	HUF_setValue(HUF_CElt* elt,
			size_t value);  // 17507
	HUF_writeCTableHeader(HUF_CElt* ctable,
				U32 tableLog,
				U32 maxSymbolValue);  // 17509
	HUF_buildCTableFromTree(HUF_CElt* CTable,
				const nodeElt* huffNode,
				int nonNullRank,
				U32 maxSymbolValue,
				U32 maxNbBits);  // 17545
} /* size: 2514, variables: 4, inline expansions: 9 (2386 bytes) */

// <07008D59> thirdparty/zstd/zstd.c:17550
// variables: 3
size_t HUF_estimateCompressedSize(const HUF_CElt* CTable, const unsigned int* count, unsigned int maxSymbolValue)
{
	const HUF_CElt* ct; // 17552
	size_t nbBits; // 17553
	int s; // 17554
} /* size: 0, variables: 3 */

// <07008CE9> thirdparty/zstd/zstd.c:17561
// variables: 4
int HUF_validateCTable(const HUF_CElt* CTable, const unsigned int* count, unsigned int maxSymbolValue)
{
	HUF_CTableHeader header; // 17562
	const HUF_CElt* ct; // 17563
	int bad; // 17564
	int s; // 17565
} /* size: 0, variables: 4 */

// <07008CAF> thirdparty/zstd/zstd.c:17578
size_t HUF_compressBound(size_t size)
{
} /* size: 0 */

// <06F3BE71> thirdparty/zstd/zstd.c:17600
// member variables: 5
// struct size: 56
typedef struct {
	size_t bitContainer[2]; /* 0 16 */
	size_t bitPos[2]; /* 16 16 */
	BYTE * startPtr; /* 32 8 */
	BYTE * ptr; /* 40 8 */
	BYTE * endPtr; /* 48 8 */
} HUF_CStream_t;

// <07008C75> thirdparty/zstd/zstd.c:17613
size_t HUF_initCStream(HUF_CStream_t* bitC, void* startPtr, size_t dstCapacity)
{
} /* size: 0 */

// <07008C32> thirdparty/zstd/zstd.c:17634
inline void HUF_addBits(HUF_CStream_t* bitC, HUF_CElt elt, int idx, int kFast)
{
} /* size: 0 */

// <07008BFA> thirdparty/zstd/zstd.c:17678
inline void HUF_mergeIndex1(HUF_CStream_t* bitC)
{
} /* size: 0 */

// <07008BAA> thirdparty/zstd/zstd.c:17694
// variables: 3
inline void HUF_flushBits(HUF_CStream_t* bitC, int kFast)
{
	const size_t  nbBits; // 17697
	const size_t  nbBytes; // 17698
	const size_t  bitContainer; // 17700
} /* size: 0, variables: 3 */

// <07008B8A> thirdparty/zstd/zstd.c:17719
// variable: 1
HUF_CElt HUF_endMark(void)
{
	HUF_CElt endMark; // 17721
} /* size: 0, variables: 1 */

// <07008B5B> thirdparty/zstd/zstd.c:17730
// variable: 1
size_t HUF_closeCStream(HUF_CStream_t* bitC)
{
	{
		const size_t  nbBits; // 17735
	}
} /* size: 0 */

// <07008B0B> thirdparty/zstd/zstd.c:17742
inline void HUF_encodeSymbol(HUF_CStream_t* bitCPtr, U32 symbol, const HUF_CElt* CTable, int idx, int fast)
{
} /* size: 0 */

// <07008A67> thirdparty/zstd/zstd.c:17748
// variables: 4
inline void HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC, const BYTE* ip, size_t srcSize, const HUF_CElt* ct, int kUnroll, int kFastFlush, int kLastFast)
{
	int n; // 17754
	int rem; // 17755
	{
		int u; // 17766
	}
	{
		int u; // 17778
	}
} /* size: 0, variables: 2 */

// <07008A3A> thirdparty/zstd/zstd.c:17806
size_t HUF_tightCompressBound(size_t srcSize, size_t tableLog)
{
} /* size: 0 */

// <0700897F> thirdparty/zstd/zstd.c:17813
// variables: 8
inline size_t HUF_compress1X_usingCTable_internal_body(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable)
{
	const U32  tableLog; // 17817
	const HUF_CElt* ct; // 17818
	const BYTE* ip; // 17819
	const BYTE* ostart; // 17820
	const BYTE* oend; // 17821
	HUF_CStream_t bitC; // 17822
	{
		BYTE* op; // 17826
		const size_t  initErr; // 17827
	}
} /* size: 0, variables: 6 */

// <07003271> thirdparty/zstd/zstd.c:17880
// variables: 17
// function calls: 312
size_t HUF_compress1X_usingCTable_internal_bmi2(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable)
{
	HUF_readCTableHeader(const HUF_CElt* ctable); // 17817
	{
		BYTE* op; // 17826
		const size_t  initErr; // 17827
		HUF_initCStream(HUF_CStream_t* bitC,
				void* startPtr,
				size_t dstCapacity);  // 17827
	}
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17851
	HUF_tightCompressBound(size_t srcSize,
				size_t tableLog);  // 17830
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17831
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17732
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17733
	{
		const size_t  nbBits; // 17735
	}
	HUF_closeCStream(HUF_CStream_t* bitC); // 17874
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17854
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17857
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17860
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17863
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17867
	HUF_compress1X_usingCTable_internal_body(void* dst,
						size_t dstSize,
						const void* src,
						size_t srcSize,
						const HUF_CElt* CTable);  // 17884
} /* size: 3838, inline expansions: 72 (7924 bytes) */

// <06FFDD41> thirdparty/zstd/zstd.c:17888
// variables: 17
// function calls: 312
size_t HUF_compress1X_usingCTable_internal_default(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable)
{
	HUF_readCTableHeader(const HUF_CElt* ctable); // 17817
	{
		BYTE* op; // 17826
		const size_t  initErr; // 17827
		HUF_initCStream(HUF_CStream_t* bitC,
				void* startPtr,
				size_t dstCapacity);  // 17827
	}
	HUF_tightCompressBound(size_t srcSize,
				size_t tableLog);  // 17830
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17851
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17831
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17732
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17733
	{
		const size_t  nbBits; // 17735
	}
	HUF_closeCStream(HUF_CStream_t* bitC); // 17874
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17854
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17857
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17860
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_getValue(HUF_CElt elt); // 17644
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17863
	HUF_getNbBits(HUF_CElt elt); // 17643
	HUF_getValue(HUF_CElt elt); // 17644
	HUF_addBits(HUF_CStream_t* bitC,
			HUF_CElt elt,
			int idx,
			int kFast);  // 17744
	HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
			U32 symbol,
			const HUF_CElt* CTable,
			int idx,
			int fast);  // 17758
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 17706
	HUF_flushBits(HUF_CStream_t* bitC,
			int kFast);  // 17760
	{
		int u; // 17766
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17768
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17770
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17771
	}
	{
		int u; // 17778
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17780
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17782
		HUF_zeroIndex1(HUF_CStream_t* bitC); // 17788
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17783
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17790
		HUF_getNbBits(HUF_CElt elt); // 17643
		HUF_addBits(HUF_CStream_t* bitC,
				HUF_CElt elt,
				int idx,
				int kFast);  // 17744
		HUF_encodeSymbol(HUF_CStream_t* bitCPtr,
				U32 symbol,
				const HUF_CElt* CTable,
				int idx,
				int fast);  // 17792
		HUF_mergeIndex1(HUF_CStream_t* bitC); // 17794
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 17706
		HUF_flushBits(HUF_CStream_t* bitC,
				int kFast);  // 17795
	}
	HUF_compress1X_usingCTable_internal_body_loop(HUF_CStream_t* bitC,
							const BYTE* ip,
							size_t srcSize,
							const HUF_CElt* ct,
							int kUnroll,
							int kFastFlush,
							int kLastFast);  // 17867
	HUF_compress1X_usingCTable_internal_body(void* dst,
						size_t dstSize,
						const void* src,
						size_t srcSize,
						const HUF_CElt* CTable);  // 17892
} /* size: 3801, inline expansions: 72 (7773 bytes) */

// <06FFDCE0> thirdparty/zstd/zstd.c:17896
size_t HUF_compress1X_usingCTable_internal(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable, const int flags)
{
} /* size: 0 */

// <06FFDC7A> thirdparty/zstd/zstd.c:17919
size_t HUF_compress1X_usingCTable(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable, int flags)
{
} /* size: 0 */

// <06FFD699> thirdparty/zstd/zstd.c:17925
// variables: 10
// function calls: 10
size_t HUF_compress4X_usingCTable_internal(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable, int flags)
{
	const size_t  segmentSize; // 17929
	const BYTE* ip; // 17930
	const BYTE* iend; // 17931
	const BYTE* ostart; // 17932
	const BYTE* oend; // 17933
	BYTE* op; // 17934
	{
		const size_t  cSize; // 17941
		HUF_compress1X_usingCTable_internal(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							const int  flags);  // 17941
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 17943
	}
	{
		const size_t  cSize; // 17949
		HUF_compress1X_usingCTable_internal(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							const int  flags);  // 17949
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 17951
	}
	{
		const size_t  cSize; // 17957
		HUF_compress1X_usingCTable_internal(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							const int  flags);  // 17957
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 17959
	}
	{
		const size_t  cSize; // 17966
		HUF_compress1X_usingCTable_internal(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							const int  flags);  // 17966
	}
} /* size: 398, variables: 6 */

// <06FFD633> thirdparty/zstd/zstd.c:17974
size_t HUF_compress4X_usingCTable(void* dst, size_t dstSize, const void* src, size_t srcSize, const HUF_CElt* CTable, int flags)
{
} /* size: 0 */

// <06FFD47D> thirdparty/zstd/zstd.c:17981
// variable: 1
// function call: 1
size_t HUF_compressCTable_internal(const BYTE* ostart, BYTE* op, const BYTE* oend, const void* src, size_t srcSize, HUF_nbStreams_e nbStreams, const HUF_CElt* CTable, const int flags)
{
	const size_t  cSize; // 17986
	HUF_compress1X_usingCTable_internal(void* dst,
						size_t dstSize,
						const void* src,
						size_t srcSize,
						const HUF_CElt* CTable,
						const int  flags);  // 17987
} /* size: 151, variables: 1, inline expansions: 1 (31 bytes) */

// <06F3BF25> thirdparty/zstd/zstd.c:17998
// member variables: 3
// struct size: 7,944
typedef struct {
	/* thirdparty/zstd/zstd.c:18001 */
	typedef union {
		HUF_buildCTable_wksp_tables buildCTable_wksp; /* 0 4864 */
		HUF_WriteCTableWksp writeCTable_wksp; /* 0 748 */
		U32 hist_wksp[1024]; /* 0 4096 */
	} HUF_compress_tables_t;
	unsigned int count[256]; /* 0 1024 */
	HUF_CElt CTable[257]; /* 1024 2056 */
	union {
		HUF_buildCTable_wksp_tables buildCTable_wksp; /* 3080 4864 */
		HUF_WriteCTableWksp writeCTable_wksp; /* 3080 748 */
		U32 hist_wksp[1024]; /* 3080 4096 */
	} wksps; /* 3080 4864 */
} HUF_compress_tables_t;

// <06FFD433> thirdparty/zstd/zstd.c:18011
// variables: 2
unsigned int HUF_cardinality(const unsigned int* count, unsigned int maxSymbolValue)
{
	unsigned int cardinality; // 18013
	unsigned int i; // 18014
} /* size: 0, variables: 2 */

// <06FFD401> thirdparty/zstd/zstd.c:18023
// variable: 1
unsigned int HUF_minTableLog(unsigned int symbolCardinality)
{
	U32 minBitsSymbols; // 18025
} /* size: 0, variables: 1 */

// <06FFD2FB> thirdparty/zstd/zstd.c:18029
// variables: 10
unsigned int HUF_optimalTableLog(unsigned int maxTableLog, size_t srcSize, unsigned int maxSymbolValue, void* workSpace, size_t wkspSize, HUF_CElt* table, const unsigned int* count, int flags)
{
	{
		BYTE* dst; // 18046
		size_t dstSize; // 18047
		size_t hSize; // 18048
		size_t newSize; // 18048
		const unsigned int  symbolCardinality; // 18049
		const unsigned int  minTableLog; // 18050
		size_t optSize; // 18051
		unsigned int optLog; // 18052
		unsigned int optLogGuess; // 18052
		{
			size_t maxBits; // 18060
		}
	}
} /* size: 0 */

// <06FFC9A3> thirdparty/zstd/zstd.c:18090
// variables: 15
// function calls: 13
size_t HUF_compress_internal(void* dst, size_t dstSize, const void* src, size_t srcSize, unsigned int maxSymbolValue, unsigned int huffLog, HUF_nbStreams_e nbStreams, void* workSpace, size_t wkspSize, HUF_CElt* oldHufTable, HUF_repeat* repeat, int flags)
{
	const HUF_compress_tables_t* table; // 18097
	const BYTE* ostart; // 18098
	const BYTE* oend; // 18099
	BYTE* op; // 18100
	{
		size_t largestTotal; // 18125
		{
			unsigned int maxSymbolValueBegin; // 18127
			const size_t  largestBegin; // 18128
		}
		{
			unsigned int maxSymbolValueEnd; // 18131
			const size_t  largestEnd; // 18132
		}
	}
	{
		const size_t  largest; // 18139
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16714
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16737
		HIST_count_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16728
		HIST_count_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 18139
	}
	{
		const size_t  maxBits; // 18160
		{
			const size_t  _var_err__; // 18163
		}
	}
	{
		const size_t  hSize; // 18169
		{
			const size_t  oldSize; // 18173
			const size_t  newSize; // 18174
			HUF_getNbBits(HUF_CElt elt); // 17556
			HUF_estimateCompressedSize(const HUF_CElt* CTable,
							const unsigned int* count,
							unsigned int maxSymbolValue);  // 18173
			HUF_getNbBits(HUF_CElt elt); // 17556
			HUF_estimateCompressedSize(const HUF_CElt* CTable,
							const unsigned int* count,
							unsigned int maxSymbolValue);  // 18174
		}
	}
	HUF_alignUpWorkspace(void* workspace,
				size_t* workspaceSizePtr,
				size_t align);  // 18097
	HUF_readCTableHeader(const HUF_CElt* ctable); // 17562
	HUF_getNbBits(HUF_CElt elt); // 17573
	HUF_validateCTable(const HUF_CElt* CTable,
				const unsigned int* count,
				unsigned int maxSymbolValue);  // 17561
	HUF_validateCTable(const HUF_CElt* CTable,
				const unsigned int* count,
				unsigned int maxSymbolValue);  // 18148
} /* size: 1451, variables: 4, inline expansions: 5 (181 bytes) */

// <06FFC85D> thirdparty/zstd/zstd.c:18193
size_t HUF_compress1X_repeat(void* dst, size_t dstSize, const void* src, size_t srcSize, unsigned int maxSymbolValue, unsigned int huffLog, void* workSpace, size_t wkspSize, HUF_CElt* hufTable, HUF_repeat* repeat, int flags)
{
} /* size: 33 */

// <06FFC717> thirdparty/zstd/zstd.c:18210
size_t HUF_compress4X_repeat(void* dst, size_t dstSize, const void* src, size_t srcSize, unsigned int maxSymbolValue, unsigned int huffLog, void* workSpace, size_t wkspSize, HUF_CElt* hufTable, HUF_repeat* repeat, int flags)
{
} /* size: 33 */

// <06F3C045> thirdparty/zstd/zstd.c:18428
// member variables: 11
// struct size: 72
typedef struct {
	void * workspace; /* 0 8 */
	void * workspaceEnd; /* 8 8 */
	void * objectEnd; /* 16 8 */
	void * tableEnd; /* 24 8 */
	void * tableValidEnd; /* 32 8 */
	void * allocStart; /* 40 8 */
	void * initOnceStart; /* 48 8 */
	BYTE allocFailed; /* 56 1 */
	int workspaceOversizedDuration; /* 60 4 */
	ZSTD_cwksp_alloc_phase_e phase; /* 64 4 */
	ZSTD_cwksp_static_alloc_e isStatic; /* 68 4 */
} ZSTD_cwksp;

// <06FFC6FC> thirdparty/zstd/zstd.c:18451
inline void ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC6C2> thirdparty/zstd/zstd.c:18479
// variable: 1
inline size_t ZSTD_cwksp_align(size_t size, size_t align)
{
	const size_t  mask; // 18480
} /* size: 0, variables: 1 */

// <06FFC6A2> thirdparty/zstd/zstd.c:18497
inline size_t ZSTD_cwksp_alloc_size(size_t size)
{
} /* size: 0 */

// <06FFC675> thirdparty/zstd/zstd.c:18507
inline size_t ZSTD_cwksp_aligned_alloc_size(size_t size, size_t alignment)
{
} /* size: 0 */

// <06FFC655> thirdparty/zstd/zstd.c:18515
inline size_t ZSTD_cwksp_aligned64_alloc_size(size_t size)
{
} /* size: 0 */

// <06FFC635> thirdparty/zstd/zstd.c:18523
// variable: 1
inline size_t ZSTD_cwksp_slack_space_required(void)
{
	const size_t  slackSpace; // 18527
} /* size: 0, variables: 1 */

// <06FFC5EE> thirdparty/zstd/zstd.c:18536
// variables: 2
inline size_t ZSTD_cwksp_bytes_to_align_ptr(void* ptr, const size_t alignBytes)
{
	const size_t  alignBytesMask; // 18537
	const size_t  bytes; // 18538
} /* size: 0, variables: 2 */

// <06FFC5C2> thirdparty/zstd/zstd.c:18548
// variable: 1
inline void* ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws)
{
	char* endPtr; // 18550
} /* size: 0, variables: 1 */

// <06FFC57C> thirdparty/zstd/zstd.c:18564
// variables: 2
inline void* ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws, const size_t bytes)
{
	const void* alloc; // 18566
	const void* bottom; // 18567
} /* size: 0, variables: 2 */

// <06FFC527> thirdparty/zstd/zstd.c:18592
// variables: 3
inline size_t ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws, ZSTD_cwksp_alloc_phase_e phase)
{
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
	}
} /* size: 0 */

// <06FFC4FB> thirdparty/zstd/zstd.c:18625
inline int ZSTD_cwksp_owns_buffer(const ZSTD_cwksp* ws, const void* ptr)
{
} /* size: 0 */

// <06FFC4B5> thirdparty/zstd/zstd.c:18634
// variable: 1
inline void* ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws, size_t bytes, ZSTD_cwksp_alloc_phase_e phase)
{
	void* alloc; // 18636
} /* size: 0, variables: 1 */

// <06FFC489> thirdparty/zstd/zstd.c:18667
inline BYTE* ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws, size_t bytes)
{
} /* size: 0 */

// <06FFC443> thirdparty/zstd/zstd.c:18681
// variables: 2
inline void* ZSTD_cwksp_reserve_aligned_init_once(ZSTD_cwksp* ws, size_t bytes)
{
	const size_t  alignedBytes; // 18683
	void* ptr; // 18684
} /* size: 0, variables: 2 */

// <06FFC40A> thirdparty/zstd/zstd.c:18705
// variable: 1
inline void* ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws, size_t bytes)
{
	const void* ptr; // 18707
} /* size: 0, variables: 1 */

// <06FFC3AA> thirdparty/zstd/zstd.c:18719
// variables: 4
inline void* ZSTD_cwksp_reserve_table(ZSTD_cwksp* ws, size_t bytes)
{
	const ZSTD_cwksp_alloc_phase_e  phase; // 18721
	void* alloc; // 18722
	void* end; // 18723
	void* top; // 18724
} /* size: 0, variables: 4 */

// <06FFC357> thirdparty/zstd/zstd.c:18764
// variables: 3
inline void* ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws, size_t bytes)
{
	const size_t  roundedBytes; // 18766
	void* alloc; // 18767
	void* end; // 18768
} /* size: 0, variables: 3 */

// <06FFC33C> thirdparty/zstd/zstd.c:18817
inline void ZSTD_cwksp_mark_tables_dirty(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC321> thirdparty/zstd/zstd.c:18846
inline void ZSTD_cwksp_mark_tables_clean(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC306> thirdparty/zstd/zstd.c:18859
inline void ZSTD_cwksp_clean_tables(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC2EB> thirdparty/zstd/zstd.c:18873
inline void ZSTD_cwksp_clear_tables(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC2D0> thirdparty/zstd/zstd.c:18896
inline void ZSTD_cwksp_clear(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC2B1> thirdparty/zstd/zstd.c:18933
inline size_t ZSTD_cwksp_sizeof(const ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC26F> thirdparty/zstd/zstd.c:18947
inline void ZSTD_cwksp_init(ZSTD_cwksp* ws, void* start, size_t size, ZSTD_cwksp_static_alloc_e isStatic)
{
} /* size: 0 */

// <06FFC229> thirdparty/zstd/zstd.c:18962
// variable: 1
inline size_t ZSTD_cwksp_create(ZSTD_cwksp* ws, size_t size, ZSTD_customMem customMem)
{
	void* workspace; // 18963
} /* size: 0, variables: 1 */

// <06FFC1F4> thirdparty/zstd/zstd.c:18970
// variable: 1
inline void ZSTD_cwksp_free(ZSTD_cwksp* ws, ZSTD_customMem customMem)
{
	void* ptr; // 18971
} /* size: 0, variables: 1 */

// <06FFC1CB> thirdparty/zstd/zstd.c:18986
inline void ZSTD_cwksp_move(ZSTD_cwksp* dst, ZSTD_cwksp* src)
{
} /* size: 0 */

// <06FFC1A6> thirdparty/zstd/zstd.c:18991
inline int ZSTD_cwksp_reserve_failed(const ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC187> thirdparty/zstd/zstd.c:19011
inline size_t ZSTD_cwksp_available_space(ZSTD_cwksp* ws)
{
} /* size: 0 */

// <06FFC15B> thirdparty/zstd/zstd.c:19015
inline int ZSTD_cwksp_check_available(ZSTD_cwksp* ws, size_t additionalNeededSpace)
{
} /* size: 0 */

// <06FFC12F> thirdparty/zstd/zstd.c:19019
inline int ZSTD_cwksp_check_too_large(ZSTD_cwksp* ws, size_t additionalNeededSpace)
{
} /* size: 0 */

// <06FFC103> thirdparty/zstd/zstd.c:19024
inline int ZSTD_cwksp_check_wasteful(ZSTD_cwksp* ws, size_t additionalNeededSpace)
{
} /* size: 0 */

// <06FFC0DB> thirdparty/zstd/zstd.c:19029
inline void ZSTD_cwksp_bump_oversized_duration(ZSTD_cwksp* ws, size_t additionalNeededSpace)
{
} /* size: 0 */

// <06F3C34B> thirdparty/zstd/zstd.c:19203
// member variables: 3
// struct size: 24
struct ZSTD_prefixDict_s {
	const void * dict; /* 0 8 */
	size_t dictSize; /* 8 8 */
	ZSTD_dictContentType_e dictContentType; /* 16 4 */
};

// <06F3C39C> thirdparty/zstd/zstd.c:19209
// member variables: 5
// struct size: 40
typedef struct {
	void * dictBuffer; /* 0 8 */
	const void * dict; /* 8 8 */
	size_t dictSize; /* 16 8 */
	ZSTD_dictContentType_e dictContentType; /* 24 4 */
	ZSTD_CDict * cdict; /* 32 8 */
} ZSTD_localDict;

// <06F3C413> thirdparty/zstd/zstd.c:19217
// member variables: 2
// struct size: 2,064
typedef struct {
	HUF_CElt CTable[257]; /* 0 2056 */
	HUF_repeat repeatMode; /* 2056 4 */
} ZSTD_hufCTables_t;

// <06F3C456> thirdparty/zstd/zstd.c:19222
// member variables: 6
// struct size: 3,552
typedef struct {
	FSE_CTable offcodeCTable[193]; /* 0 772 */
	FSE_CTable matchlengthCTable[363]; /* 772 1452 */
	FSE_CTable litlengthCTable[329]; /* 2224 1316 */
	FSE_repeat offcode_repeatMode; /* 3540 4 */
	FSE_repeat matchlength_repeatMode; /* 3544 4 */
	FSE_repeat litlength_repeatMode; /* 3548 4 */
} ZSTD_fseCTables_t;

// <06F3C50F> thirdparty/zstd/zstd.c:19231
// member variables: 2
// struct size: 5,616
typedef struct {
	ZSTD_hufCTables_t huf; /* 0 2064 */
	ZSTD_fseCTables_t fse; /* 2064 3552 */
} ZSTD_entropyCTables_t;

// <06F3C552> thirdparty/zstd/zstd.c:19239
// member variables: 3
// struct size: 8
struct SeqDef_s {
	U32 offBase; /* 0 4 */
	U16 litLength; /* 4 2 */
	U16 mlBase; /* 6 2 */
};

// <06F3C5D6> thirdparty/zstd/zstd.c:19252
// member variables: 11
// struct size: 80
typedef struct {
	SeqDef * sequencesStart; /* 0 8 */
	SeqDef * sequences; /* 8 8 */
	BYTE * litStart; /* 16 8 */
	BYTE * lit; /* 24 8 */
	BYTE * llCode; /* 32 8 */
	BYTE * mlCode; /* 40 8 */
	BYTE * ofCode; /* 48 8 */
	size_t maxNbSeq; /* 56 8 */
	size_t maxNbLit; /* 64 8 */
	ZSTD_longLengthType_e longLengthType; /* 72 4 */
	U32 longLengthPos; /* 76 4 */
} SeqStore_t;

// <06F3C6B2> thirdparty/zstd/zstd.c:19271
// member variables: 2
// struct size: 8
typedef struct {
	U32 litLength; /* 0 4 */
	U32 matchLength; /* 4 4 */
} ZSTD_SequenceLength;

// <06FFC0A1> thirdparty/zstd/zstd.c:19280
// variable: 1
inline ZSTD_SequenceLength ZSTD_getSequenceLength(const SeqStore_t* seqStore, const SeqDef* seq)
{
	ZSTD_SequenceLength seqLen; // 19282
} /* size: 0, variables: 1 */

// <06F3C6F3> thirdparty/zstd/zstd.c:19308
// member variables: 3
// struct size: 144
typedef struct {
	SymbolEncodingType_e hType; /* 0 4 */
	BYTE hufDesBuffer[128]; /* 4 128 */
	size_t hufDesSize; /* 136 8 */
} ZSTD_hufCTablesMetadata_t;

// <06F3C755> thirdparty/zstd/zstd.c:19319
// member variables: 6
// struct size: 168
typedef struct {
	SymbolEncodingType_e llType; /* 0 4 */
	SymbolEncodingType_e ofType; /* 4 4 */
	SymbolEncodingType_e mlType; /* 8 4 */
	BYTE fseTablesBuffer[133]; /* 12 133 */
	size_t fseTablesSize; /* 152 8 */
	size_t lastCountSize; /* 160 8 */
} ZSTD_fseCTablesMetadata_t;

// <06F3C7E8> thirdparty/zstd/zstd.c:19328
// member variables: 2
// struct size: 312
typedef struct {
	ZSTD_hufCTablesMetadata_t hufMetadata; /* 0 144 */
	ZSTD_fseCTablesMetadata_t fseMetadata; /* 144 168 */
} ZSTD_entropyCTablesMetadata_t;

// <06F3C82B> thirdparty/zstd/zstd.c:19348
// member variables: 2
// struct size: 8
typedef struct {
	U32 off; /* 0 4 */
	U32 len; /* 4 4 */
} ZSTD_match_t;

// <06F3C867> thirdparty/zstd/zstd.c:19353
// member variables: 3
// struct size: 12
typedef struct {
	U32 offset; /* 0 4 */
	U32 litLength; /* 4 4 */
	U32 matchLength; /* 8 4 */
} rawSeq;

// <06F3C8B8> thirdparty/zstd/zstd.c:19359
// member variables: 5
// struct size: 40
typedef struct {
	rawSeq * seq; /* 0 8 */
	size_t pos; /* 8 8 */
	size_t posInSequence; /* 16 8 */
	size_t size; /* 24 8 */
	size_t capacity; /* 32 8 */
} RawSeqStore_t;

// <06F3C94B> thirdparty/zstd/zstd.c:19370
// member variables: 5
// struct size: 28
typedef struct {
	int price; /* 0 4 */
	U32 off; /* 4 4 */
	U32 mlen; /* 8 4 */
	U32 litlen; /* 12 4 */
	U32 rep[3]; /* 16 12 */
} ZSTD_optimal_t;

// <06F3C9F9> thirdparty/zstd/zstd.c:19381
// member variables: 17
// struct size: 104
typedef struct {
	unsigned int * litFreq; /* 0 8 */
	unsigned int * litLengthFreq; /* 8 8 */
	unsigned int * matchLengthFreq; /* 16 8 */
	unsigned int * offCodeFreq; /* 24 8 */
	ZSTD_match_t * matchTable; /* 32 8 */
	ZSTD_optimal_t * priceTable; /* 40 8 */
	U32 litSum; /* 48 4 */
	U32 litLengthSum; /* 52 4 */
	U32 matchLengthSum; /* 56 4 */
	U32 offCodeSum; /* 60 4 */
	U32 litSumBasePrice; /* 64 4 */
	U32 litLengthSumBasePrice; /* 68 4 */
	U32 matchLengthSumBasePrice; /* 72 4 */
	U32 offCodeSumBasePrice; /* 76 4 */
	ZSTD_OptPrice_e priceType; /* 80 4 */
	const ZSTD_entropyCTables_t * symbolCosts; /* 88 8 */
	ZSTD_ParamSwitch_e literalCompressionMode; /* 96 4 */
} optState_t;

// <06F3CB51> thirdparty/zstd/zstd.c:19403
// member variables: 2
// struct size: 5,632
typedef struct {
	ZSTD_entropyCTables_t entropy; /* 0 5616 */
	U32 rep[3]; /* 5616 12 */
} ZSTD_compressedBlockState_t;

// <06F3CB94> thirdparty/zstd/zstd.c:19408
// member variables: 6
// struct size: 40
typedef struct {
	const BYTE * nextSrc; /* 0 8 */
	const BYTE * base; /* 8 8 */
	const BYTE * dictBase; /* 16 8 */
	U32 dictLimit; /* 24 4 */
	U32 lowLimit; /* 28 4 */
	U32 nbOverflowCorrections; /* 32 4 */
} ZSTD_window_t;

// <06F3CC32> thirdparty/zstd/zstd.c:19426
// member variables: 20
// struct size: 304
struct ZSTD_MatchState_t {
	ZSTD_window_t window; /* 0 40 */
	U32 loadedDictEnd; /* 40 4 */
	U32 nextToUpdate; /* 44 4 */
	U32 hashLog3; /* 48 4 */
	U32 rowHashLog; /* 52 4 */
	BYTE * tagTable; /* 56 8 */
	U32 hashCache[8]; /* 64 32 */
	U64 hashSalt; /* 96 8 */
	U32 hashSaltEntropy; /* 104 4 */
	U32 * hashTable; /* 112 8 */
	U32 * hashTable3; /* 120 8 */
	U32 * chainTable; /* 128 8 */
	int forceNonContiguous; /* 136 4 */
	int dedicatedDictSearch; /* 140 4 */
	optState_t opt; /* 144 104 */
	const class ZSTD_MatchState_t * dictMatchState; /* 248 8 */
	ZSTD_compressionParameters cParams; /* 256 28 */
	const RawSeqStore_t * ldmSeqStore; /* 288 8 */
	int prefetchCDictTables; /* 296 4 */
	int lazySkipping; /* 300 4 */
};

// <06F3CDB7> thirdparty/zstd/zstd.c:19471
// member variables: 3
// struct size: 320
typedef struct {
	ZSTD_compressedBlockState_t * prevCBlock; /* 0 8 */
	ZSTD_compressedBlockState_t * nextCBlock; /* 8 8 */
	ZSTD_MatchState_t matchState; /* 16 304 */
} ZSTD_blockState_t;

// <06F3CE50> thirdparty/zstd/zstd.c:19482
// member variables: 4
// struct size: 24
typedef struct {
	const BYTE * split; /* 0 8 */
	U32 hash; /* 8 4 */
	U32 checksum; /* 12 4 */
	ldmEntry_t * bucket; /* 16 8 */
} ldmMatchCandidate_t;

// <06F3CEB7> thirdparty/zstd/zstd.c:19491
// member variables: 6
// struct size: 2,112
typedef struct {
	ZSTD_window_t window; /* 0 40 */
	ldmEntry_t * hashTable; /* 40 8 */
	U32 loadedDictEnd; /* 48 4 */
	BYTE * bucketOffsets; /* 56 8 */
	size_t splitIndices[64]; /* 64 512 */
	ldmMatchCandidate_t matchCandidates[64]; /* 576 1536 */
} ldmState_t;

// <06F3CF5A> thirdparty/zstd/zstd.c:19500
// member variables: 6
// struct size: 24
typedef struct {
	ZSTD_ParamSwitch_e enableLdm; /* 0 4 */
	U32 hashLog; /* 4 4 */
	U32 bucketSizeLog; /* 8 4 */
	U32 minMatchLength; /* 12 4 */
	U32 hashRateLog; /* 16 4 */
	U32 windowLog; /* 20 4 */
} ldmParams_t;

// <06F3CFDB> thirdparty/zstd/zstd.c:19509
// member variables: 4
// struct size: 32
typedef struct {
	int collectSequences; /* 0 4 */
	ZSTD_Sequence * seqStart; /* 8 8 */
	size_t seqIndex; /* 16 8 */
	size_t maxSequences; /* 24 8 */
} SeqCollector;

// <06F3AE7F> thirdparty/zstd/zstd.c:19516
// member variables: 30
// struct size: 224
struct ZSTD_CCtx_params_s {
	ZSTD_format_e format; /* 0 4 */
	ZSTD_compressionParameters cParams; /* 4 28 */
	ZSTD_frameParameters fParams; /* 32 12 */
	int compressionLevel; /* 44 4 */
	int forceWindow; /* 48 4 */
	size_t targetCBlockSize; /* 56 8 */
	int srcSizeHint; /* 64 4 */
	ZSTD_dictAttachPref_e attachDictPref; /* 68 4 */
	ZSTD_ParamSwitch_e literalCompressionMode; /* 72 4 */
	int nbWorkers; /* 76 4 */
	size_t jobSize; /* 80 8 */
	int overlapLog; /* 88 4 */
	int rsyncable; /* 92 4 */
	ldmParams_t ldmParams; /* 96 24 */
	int enableDedicatedDictSearch; /* 120 4 */
	ZSTD_bufferMode_e inBufferMode; /* 124 4 */
	ZSTD_bufferMode_e outBufferMode; /* 128 4 */
	ZSTD_SequenceFormat_e blockDelimiters; /* 132 4 */
	int validateSequences; /* 136 4 */
	ZSTD_ParamSwitch_e postBlockSplitter; /* 140 4 */
	int preBlockSplitter_level; /* 144 4 */
	size_t maxBlockSize; /* 152 8 */
	ZSTD_ParamSwitch_e useRowMatchFinder; /* 160 4 */
	int deterministicRefPrefix; /* 164 4 */
	ZSTD_customMem customMem; /* 168 24 */
	ZSTD_ParamSwitch_e prefetchCDictTables; /* 192 4 */
	int enableMatchFinderFallback; /* 196 4 */
	void * extSeqProdState; /* 200 8 */
	ZSTD_sequenceProducer_F extSeqProdFunc; /* 208 8 */
	ZSTD_ParamSwitch_e searchForExternalRepcodes; /* 216 4 */
};

// <06F3D069> thirdparty/zstd/zstd.c:19615
// member variables: 7
// struct size: 1,496
typedef struct {
	SeqStore_t fullSeqStoreChunk; /* 0 80 */
	SeqStore_t firstHalfSeqStore; /* 80 80 */
	SeqStore_t secondHalfSeqStore; /* 160 80 */
	SeqStore_t currSeqStore; /* 240 80 */
	SeqStore_t nextSeqStore; /* 320 80 */
	U32 partitions[196]; /* 400 784 */
	ZSTD_entropyCTablesMetadata_t entropyMetadata; /* 1184 312 */
} ZSTD_blockSplitCtx;

// <06F3A20B> thirdparty/zstd/zstd.c:19626
// member variables: 50
// struct size: 5,280
struct ZSTD_CCtx_s {
	ZSTD_compressionStage_e stage; /* 0 4 */
	int cParamsChanged; /* 4 4 */
	int bmi2; /* 8 4 */
	ZSTD_CCtx_params requestedParams; /* 16 224 */
	ZSTD_CCtx_params appliedParams; /* 240 224 */
	ZSTD_CCtx_params simpleApiParams; /* 464 224 */
	U32 dictID; /* 688 4 */
	size_t dictContentSize; /* 696 8 */
	ZSTD_cwksp workspace; /* 704 72 */
	size_t blockSizeMax; /* 776 8 */
	long long unsigned int pledgedSrcSizePlusOne; /* 784 8 */
	long long unsigned int consumedSrcSize; /* 792 8 */
	long long unsigned int producedCSize; /* 800 8 */
	XXH_NAMESPACEXXH64_state_t xxhState; /* 808 88 */
	ZSTD_customMem customMem; /* 896 24 */
	ZSTD_threadPool * pool; /* 920 8 */
	size_t staticSize; /* 928 8 */
	SeqCollector seqCollector; /* 936 32 */
	int isFirstBlock; /* 968 4 */
	int initialized; /* 972 4 */
	SeqStore_t seqStore; /* 976 80 */
	ldmState_t ldmState; /* 1056 2112 */
	rawSeq * ldmSequences; /* 3168 8 */
	size_t maxNbLdmSequences; /* 3176 8 */
	RawSeqStore_t externSeqStore; /* 3184 40 */
	ZSTD_blockState_t blockState; /* 3224 320 */
	void * tmpWorkspace; /* 3544 8 */
	size_t tmpWkspSize; /* 3552 8 */
	ZSTD_buffered_policy_e bufferedPolicy; /* 3560 4 */
	char * inBuff; /* 3568 8 */
	size_t inBuffSize; /* 3576 8 */
	size_t inToCompress; /* 3584 8 */
	size_t inBuffPos; /* 3592 8 */
	size_t inBuffTarget; /* 3600 8 */
	char * outBuff; /* 3608 8 */
	size_t outBuffSize; /* 3616 8 */
	size_t outBuffContentSize; /* 3624 8 */
	size_t outBuffFlushedSize; /* 3632 8 */
	ZSTD_cStreamStage streamStage; /* 3640 4 */
	U32 frameEnded; /* 3644 4 */
	ZSTD_inBuffer expectedInBuffer; /* 3648 24 */
	size_t stableIn_notConsumed; /* 3672 8 */
	size_t expectedOutBufferSize; /* 3680 8 */
	ZSTD_localDict localDict; /* 3688 40 */
	const ZSTD_CDict * cdict; /* 3728 8 */
	ZSTD_prefixDict prefixDict; /* 3736 24 */
	ZSTDMT_CCtx * mtctx; /* 3760 8 */
	ZSTD_blockSplitCtx blockSplitCtx; /* 3768 1496 */
	ZSTD_Sequence * extSeqBuf; /* 5264 8 */
	size_t extSeqBufCapacity; /* 5272 8 */
};

// <06FFC048> thirdparty/zstd/zstd.c:19738
// variables: 2
inline U32 ZSTD_LLcode(U32 litLength)
{
	const BYTE   LL_Code; // 19740
	const U32  LL_deltaCode; // 19748
} /* size: 0, variables: 2 */

// <06FFBFEF> thirdparty/zstd/zstd.c:19755
// variables: 2
inline U32 ZSTD_MLcode(U32 mlBase)
{
	const BYTE   ML_Code; // 19757
	const U32  ML_deltaCode; // 19765
} /* size: 0, variables: 2 */

// <06FFBFB5> thirdparty/zstd/zstd.c:19772
// variable: 1
inline int ZSTD_cParam_withinBounds(ZSTD_cParameter cParam, int value)
{
	const ZSTD_bounds  bounds; // 19774
} /* size: 0, variables: 1 */

// <06FFBF6E> thirdparty/zstd/zstd.c:19785
inline const BYTE* ZSTD_selectAddr(U32 index, U32 lowLimit, const BYTE* candidate, const BYTE* backup)
{
} /* size: 0 */

// <06FFBF0D> thirdparty/zstd/zstd.c:19804
// variable: 1
inline size_t ZSTD_noCompressBlock(void* dst, size_t dstCapacity, const void* src, size_t srcSize, U32 lastBlock)
{
	const U32  cBlockHeader24; // 19806
} /* size: 0, variables: 1 */

// <06FFBEA0> thirdparty/zstd/zstd.c:19816
// variables: 2
inline size_t ZSTD_rleCompressBlock(void* dst, size_t dstCapacity, BYTE src, size_t srcSize, U32 lastBlock)
{
	const BYTE* op; // 19818
	const U32  cBlockHeader; // 19819
} /* size: 0, variables: 2 */

// <06FFBE66> thirdparty/zstd/zstd.c:19831
// variable: 1
inline size_t ZSTD_minGain(size_t srcSize, ZSTD_strategy strat)
{
	const U32  minlog; // 19833
} /* size: 0, variables: 1 */

// <06FFBE46> thirdparty/zstd/zstd.c:19839
inline int ZSTD_literalsCompressionIsDisabled(const ZSTD_CCtx_params* cctxParams)
{
} /* size: 0 */

// <06FFBB93> thirdparty/zstd/zstd.c:19860
// function calls: 10
void ZSTD_safecopyLiterals(BYTE* op, const BYTE* ip, const BYTE* iend, const BYTE* ilimit_w)
{
	_mm_loadu_si128(const __m128i_u* __P); // 15683
	_mm_storeu_si128(__m128i_u* __P,
			__m128i __B);  // 15683
	ZSTD_copy16(void* dst,
			const void* src);  // 15732
	_mm_loadu_si128(const __m128i_u* __P); // 15683
	_mm_storeu_si128(__m128i_u* __P,
			__m128i __B);  // 15683
	ZSTD_copy16(void* dst,
			const void* src);  // 15737
	_mm_loadu_si128(const __m128i_u* __P); // 15683
	_mm_storeu_si128(__m128i_u* __P,
			__m128i __B);  // 15683
	ZSTD_copy16(void* dst,
			const void* src);  // 15738
	ZSTD_wildcopy(void* dst,
			const void* src,
			ptrdiff_t length,
			const ZSTD_overlap_e  ovtype);  // 19864
} /* size: 129, inline expansions: 10 (128 bytes) */

// <06FFBB41> thirdparty/zstd/zstd.c:19889
// variable: 1
inline void ZSTD_storeSeqOnly(SeqStore_t* seqStorePtr, size_t litLength, U32 offBase, size_t matchLength)
{
	{
		const size_t  mlBase; // 19911
	}
} /* size: 0 */

// <06FFBACA> thirdparty/zstd/zstd.c:19930
// variables: 2
inline void ZSTD_storeSeq(SeqStore_t* seqStorePtr, size_t litLength, const BYTE* literals, const BYTE* litLimit, U32 offBase, size_t matchLength)
{
	const BYTE* litLimit_w; // 19935
	const BYTE* litEnd; // 19936
} /* size: 0, variables: 2 */

// <06FFBA76> thirdparty/zstd/zstd.c:19972
// variables: 2
inline void ZSTD_updateRep(U32* rep, const U32 offBase, const U32 ll0)
{
	{
		const U32  repCode; // 19979
		{
			const U32  currentOffset; // 19981
		}
	}
} /* size: 0 */

// <06F3D249> thirdparty/zstd/zstd.c:19991
// member variable: 1
// struct size: 12
struct repcodes_s {
	U32 rep[3]; /* 0 12 */
};

// <06FFBA2F> thirdparty/zstd/zstd.c:19996
// variable: 1
inline Repcodes_t ZSTD_newRep(const U32* rep, const U32 offBase, const U32 ll0)
{
	Repcodes_t newReps; // 19998
} /* size: 0, variables: 1 */

// <06FFB9B9> thirdparty/zstd/zstd.c:20008
// variables: 4
inline size_t ZSTD_count(const BYTE* pIn, const BYTE* pMatch, const BYTE* pInLimit)
{
	const BYTE* pStart; // 20010
	const BYTE* pInLoopLimit; // 20011
	{
		const size_t  diff; // 20014
	}
	{
		const size_t  diff; // 20018
	}
} /* size: 0, variables: 2 */

// <0703F81A> thirdparty/zstd/zstd.c:20034
// variables: 6
// function calls: 26
size_t ZSTD_count_2segments(const BYTE* ip, const BYTE* match, const BYTE* iEnd, const BYTE* mEnd, const BYTE* iStart)
{
	const BYTE* vEnd; // 20037
	const size_t  matchLength; // 20038
	{
		const size_t  diff; // 20014
		MEM_readST(const void* ptr); // 20014
		MEM_readST(const void* ptr); // 20014
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20015
	}
	{
		const size_t  diff; // 20018
		MEM_readST(const void* ptr); // 20018
		MEM_readST(const void* ptr); // 20018
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20020
	}
	MEM_read32(const void* ptr); // 20023
	MEM_read32(const void* ptr); // 20023
	MEM_read16(const void* ptr); // 20024
	MEM_read16(const void* ptr); // 20024
	ZSTD_count(const BYTE* pIn,
			const BYTE* pMatch,
			const BYTE* pInLimit);  // 20038
	{
		const size_t  diff; // 20014
		MEM_readST(const void* ptr); // 20014
		MEM_readST(const void* ptr); // 20014
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20015
	}
	{
		const size_t  diff; // 20018
		MEM_readST(const void* ptr); // 20018
		MEM_readST(const void* ptr); // 20018
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20020
	}
	MEM_read32(const void* ptr); // 20023
	MEM_read32(const void* ptr); // 20023
	MEM_read16(const void* ptr); // 20024
	MEM_read16(const void* ptr); // 20024
	ZSTD_count(const BYTE* pIn,
			const BYTE* pMatch,
			const BYTE* pInLimit);  // 20045
} /* size: 530, variables: 2, inline expansions: 10 (457 bytes) */

// <06FFB94C> thirdparty/zstd/zstd.c:20034
// variables: 2
inline size_t ZSTD_count_2segments(const BYTE* ip, const BYTE* match, const BYTE* iEnd, const BYTE* mEnd, const BYTE* iStart)
{
	const BYTE* vEnd; // 20037
	const size_t  matchLength; // 20038
} /* size: 0, variables: 2 */

// <06FFB918> thirdparty/zstd/zstd.c:20053
U32 ZSTD_hash3(U32 u, U32 h, U32 s)
{
} /* size: 0 */

// <06FFB8ED> thirdparty/zstd/zstd.c:20054
inline size_t ZSTD_hash3Ptr(const void* ptr, U32 h)
{
} /* size: 0 */

// <06FFB8B9> thirdparty/zstd/zstd.c:20058
U32 ZSTD_hash4(U32 u, U32 h, U32 s)
{
} /* size: 0 */

// <06FFB88E> thirdparty/zstd/zstd.c:20059
size_t ZSTD_hash4Ptr(const void* ptr, U32 h)
{
} /* size: 0 */

// <06FFB858> thirdparty/zstd/zstd.c:20060
size_t ZSTD_hash4PtrS(const void* ptr, U32 h, U32 s)
{
} /* size: 0 */

// <06FFB824> thirdparty/zstd/zstd.c:20063
size_t ZSTD_hash5(U64 u, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB7FB> thirdparty/zstd/zstd.c:20064
size_t ZSTD_hash5Ptr(const void* p, U32 h)
{
} /* size: 0 */

// <06FFB7C7> thirdparty/zstd/zstd.c:20065
size_t ZSTD_hash5PtrS(const void* p, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB793> thirdparty/zstd/zstd.c:20068
size_t ZSTD_hash6(U64 u, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB76A> thirdparty/zstd/zstd.c:20069
size_t ZSTD_hash6Ptr(const void* p, U32 h)
{
} /* size: 0 */

// <06FFB736> thirdparty/zstd/zstd.c:20070
size_t ZSTD_hash6PtrS(const void* p, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB702> thirdparty/zstd/zstd.c:20073
size_t ZSTD_hash7(U64 u, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB6D9> thirdparty/zstd/zstd.c:20074
size_t ZSTD_hash7Ptr(const void* p, U32 h)
{
} /* size: 0 */

// <06FFB6A5> thirdparty/zstd/zstd.c:20075
size_t ZSTD_hash7PtrS(const void* p, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB671> thirdparty/zstd/zstd.c:20078
size_t ZSTD_hash8(U64 u, U32 h, U64 s)
{
} /* size: 0 */

// <06FFB648> thirdparty/zstd/zstd.c:20079
size_t ZSTD_hash8Ptr(const void* p, U32 h)
{
} /* size: 0 */

// <06FFB5DC> thirdparty/zstd/zstd.c:20084
inline size_t ZSTD_hashPtr(const void* p, U32 hBits, U32 mls)
{
} /* size: 0 */

// <06FFB597> thirdparty/zstd/zstd.c:20102
inline size_t ZSTD_hashPtrSalted(const void* p, U32 hBits, U32 mls, const U64 hashSalt)
{
} /* size: 0 */

// <06FFB55D> thirdparty/zstd/zstd.c:20122
// variable: 1
U64 ZSTD_ipow(U64 base, U64 exponent)
{
	U64 power; // 20124
} /* size: 0, variables: 1 */

// <06FFB509> thirdparty/zstd/zstd.c:20138
// variables: 2
U64 ZSTD_rollingHash_append(U64 hash, const void* buf, size_t size)
{
	const BYTE* istart; // 20140
	size_t pos; // 20141
} /* size: 0, variables: 2 */

// <06FFB4DC> thirdparty/zstd/zstd.c:20152
inline U64 ZSTD_rollingHash_compute(const void* buf, size_t size)
{
} /* size: 0 */

// <06FFB4BC> thirdparty/zstd/zstd.c:20161
inline U64 ZSTD_rollingHash_primePower(U32 length)
{
} /* size: 0 */

// <06FFB475> thirdparty/zstd/zstd.c:20169
inline U64 ZSTD_rollingHash_rotate(U64 hash, BYTE toRemove, BYTE toAdd, U64 primePower)
{
} /* size: 0 */

// <06FFB43F> thirdparty/zstd/zstd.c:20195
// variables: 2
inline void ZSTD_window_clear(ZSTD_window_t* window)
{
	const size_t  endT; // 20197
	const U32  end; // 20198
} /* size: 0, variables: 2 */

// <06FFB41F> thirdparty/zstd/zstd.c:20215
inline U32 ZSTD_window_hasExtDict(const ZSTD_window_t window)
{
} /* size: 0 */

// <06FFB400> thirdparty/zstd/zstd.c:20225
inline ZSTD_dictMode_e ZSTD_matchState_dictMode(const ZSTD_MatchState_t* ms)
{
} /* size: 0 */

// <06FFB392> thirdparty/zstd/zstd.c:20286
// variable: 1
inline U32 ZSTD_window_needOverflowCorrection(const ZSTD_window_t window, U32 cycleLog, U32 maxDist, U32 loadedDictEnd, const void* src, const void* srcEnd)
{
	const U32  curr; // 20293
} /* size: 0, variables: 1 */

// <06FFB2F0> thirdparty/zstd/zstd.c:20313
// variables: 7
inline U32 ZSTD_window_correctOverflow(ZSTD_window_t* window, U32 cycleLog, U32 maxDist, const void* src)
{
	const U32  cycleSize; // 20335
	const U32  cycleMask; // 20336
	const U32  curr; // 20337
	const U32  currentCycle; // 20338
	const U32  currentCycleCorrection; // 20340
	const U32  newCurrent; // 20343
	const U32  correction; // 20346
} /* size: 0, variables: 7 */

// <06FFB277> thirdparty/zstd/zstd.c:20410
// variables: 3
inline void ZSTD_window_enforceMaxDist(ZSTD_window_t* window, const void* blockEnd, U32 maxDist, U32* loadedDictEndPtr, const ZSTD_MatchState_t ** dictMatchStatePtr)
{
	const U32  blockEndIdx; // 20416
	const U32  loadedDictEnd; // 20417
	{
		const U32  newLowLimit; // 20435
	}
} /* size: 0, variables: 2 */

// <06FFB1FF> thirdparty/zstd/zstd.c:20455
// variables: 2
inline void ZSTD_checkDictValidity(const ZSTD_window_t* window, const void* blockEnd, U32 maxDist, U32* loadedDictEndPtr, const ZSTD_MatchState_t ** dictMatchStatePtr)
{
	{
		const U32  blockEndIdx; // 20463
		const U32  loadedDictEnd; // 20464
	}
} /* size: 0 */

// <06FFB1E3> thirdparty/zstd/zstd.c:20488
inline void ZSTD_window_init(ZSTD_window_t* window)
{
} /* size: 0 */

// <06FFB14E> thirdparty/zstd/zstd.c:20508
// variables: 5
inline U32 ZSTD_window_update(ZSTD_window_t* window, const void* src, size_t srcSize, int forceNonContiguous)
{
	const BYTE* ip; // 20512
	U32 contiguous; // 20513
	{
		const size_t  distanceFromBase; // 20522
	}
	{
		const size_t  highInputIdx; // 20537
		const U32  lowLimitMax; // 20538
	}
} /* size: 0, variables: 2 */

// <06FFB0D4> thirdparty/zstd/zstd.c:20549
// variables: 5
inline U32 ZSTD_getLowestMatchIndex(const ZSTD_MatchState_t* ms, U32 curr, unsigned int windowLog)
{
	const U32  maxDistance; // 20551
	const U32  lowestValid; // 20552
	const U32  withinWindow; // 20553
	const U32  isDictionary; // 20554
	const U32  matchLowest; // 20559
} /* size: 0, variables: 5 */

// <06FFB05A> thirdparty/zstd/zstd.c:20566
// variables: 5
inline U32 ZSTD_getLowestPrefixIndex(const ZSTD_MatchState_t* ms, U32 curr, unsigned int windowLog)
{
	const U32  maxDistance; // 20568
	const U32  lowestValid; // 20569
	const U32  withinWindow; // 20570
	const U32  isDictionary; // 20571
	const U32  matchLowest; // 20575
} /* size: 0, variables: 5 */

// <06FFB02D> thirdparty/zstd/zstd.c:20583
inline int ZSTD_index_overlap_check(const U32 prefixLowestIndex, const U32 repIndex)
{
} /* size: 0 */

// <06FFAFDD> thirdparty/zstd/zstd.c:20641
// variables: 2
inline void ZSTD_writeTaggedIndex(const U32* hashTable, size_t hashAndTag, U32 index)
{
	const size_t  hash; // 20642
	const U32  tag; // 20643
} /* size: 0, variables: 2 */

// <06FFAF96> thirdparty/zstd/zstd.c:20650
// variables: 2
inline int ZSTD_comparePackedTags(size_t packedTag1, size_t packedTag2)
{
	const U32  tag1; // 20651
	const U32  tag2; // 20652
} /* size: 0, variables: 2 */

// <06F3D2F0> thirdparty/zstd/zstd.c:20671
// member variables: 3
// struct size: 16
typedef struct {
	U32 idx; /* 0 4 */
	U32 posInSequence; /* 4 4 */
	size_t posInSrc; /* 8 8 */
} ZSTD_SequencePosition;

// <06F3D33C> thirdparty/zstd/zstd.c:20682
// member variables: 3
// struct size: 24
typedef struct {
	size_t nbSequences; /* 0 8 */
	size_t blockSize; /* 8 8 */
	size_t litSize; /* 16 8 */
} BlockSummary;

// <06FFAF76> thirdparty/zstd/zstd.c:20767
inline int ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params)
{
} /* size: 0 */

// <06FFADCF> thirdparty/zstd/zstd.c:20842
// variables: 2
// function calls: 4
size_t ZSTD_noCompressLiterals(void* dst, size_t dstCapacity, const void* src, size_t srcSize)
{
	const BYTE* ostart; // 20844
	const U32  flSize; // 20845
	MEM_write32(void* memPtr,
			U32 value);  // 1309
	MEM_writeLE32(void* memPtr,
			U32 val32);  // 20860
	MEM_write16(void* memPtr,
			U16 value);  // 1279
	MEM_writeLE16(void* memPtr,
			U16 val);  // 20857
} /* size: 168, variables: 2, inline expansions: 4 (28 bytes) */

// <06FFAD8A> thirdparty/zstd/zstd.c:20871
// variables: 2
int allBytesIdentical(const void* src, size_t srcSize)
{
	{
		const BYTE  b; // 20875
		size_t p; // 20876
	}
} /* size: 0 */

// <06FFAC03> thirdparty/zstd/zstd.c:20884
// variables: 2
// function calls: 4
size_t ZSTD_compressRleLiteralsBlock(void* dst, size_t dstCapacity, const void* src, size_t srcSize)
{
	const BYTE* ostart; // 20886
	const U32  flSize; // 20887
	MEM_write32(void* memPtr,
			U32 value);  // 1309
	MEM_writeLE32(void* memPtr,
			U32 val32);  // 20901
	MEM_write16(void* memPtr,
			U16 value);  // 1279
	MEM_writeLE16(void* memPtr,
			U16 val);  // 20898
} /* size: 106, variables: 2, inline expansions: 4 (20 bytes) */

// <06FFABBA> thirdparty/zstd/zstd.c:20918
// variables: 2
size_t ZSTD_minLiteralsToCompress(ZSTD_strategy strategy, HUF_repeat huf_repeat)
{
	{
		const int  shift; // 20925
		const size_t  mintc; // 20926
	}
} /* size: 0 */

// <06FFA530> thirdparty/zstd/zstd.c:20932
// variables: 16
// function calls: 10
size_t ZSTD_compressLiterals(void* dst, size_t dstCapacity, const void* src, size_t srcSize, void* entropyWorkspace, size_t entropyWorkspaceSize, const ZSTD_hufCTables_t* prevHuf, ZSTD_hufCTables_t* nextHuf, ZSTD_strategy strategy, int disableLiteralCompression, int suspectUncompressible, int bmi2)
{
	const size_t  lhSize; // 20943
	const BYTE* ostart; // 20944
	U32 singleStream; // 20945
	SymbolEncodingType_e hType; // 20946
	size_t cLitSize; // 20947
	{
		HUF_repeat repeat; // 20965
		const int  flags; // 20966
		huf_compress_f huf_compress; // 20973
	}
	{
		const size_t  minGain; // 20990
		ZSTD_minGain(size_t srcSize,
				ZSTD_strategy strat);  // 20990
	}
	{
		const U32  lhc; // 21016
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 1294
		MEM_writeLE24(void* memPtr,
				U32 val);  // 21017
	}
	{
		const U32  lhc; // 21022
		MEM_write32(void* memPtr,
				U32 value);  // 1309
		MEM_writeLE32(void* memPtr,
				U32 val32);  // 21023
	}
	{
		const U32  lhc; // 21028
		MEM_write32(void* memPtr,
				U32 value);  // 1309
		MEM_writeLE32(void* memPtr,
				U32 val32);  // 21029
	}
	{
		const int  shift; // 20925
		const size_t  mintc; // 20926
	}
	ZSTD_minLiteralsToCompress(ZSTD_strategy strategy,
					HUF_repeat huf_repeat);  // 20961
	{
		const BYTE  b; // 20875
		size_t p; // 20876
	}
	allBytesIdentical(const void* src,
				size_t srcSize);  // 21001
} /* size: 875, variables: 5, inline expansions: 2 (72 bytes) */

// <06FFA4E9> thirdparty/zstd/zstd.c:21142
// variables: 3
unsigned int ZSTD_getFSEMaxSymbolValue(const FSE_CTable* ctable)
{
	const void* ptr; // 21143
	const U16* u16ptr; // 21144
	const U32  maxSymbolValue; // 21145
} /* size: 0, variables: 3 */

// <06FFA4C9> thirdparty/zstd/zstd.c:21153
unsigned int ZSTD_useLowProbCount(const size_t nbSeq)
{
} /* size: 0 */

// <06FFA0E5> thirdparty/zstd/zstd.c:21166
// variables: 4
// function calls: 10
size_t ZSTD_NCountCost(const unsigned int* count, const unsigned int max, const size_t nbSeq, const unsigned int FSELog)
{
	BYTE wksp; // 21169
	S16 norm; // 21170
	const U32  tableLog; // 21171
	{
		const size_t  err_code; // 21172
		ZSTD_useLowProbCount(const size_t nbSeq); // 21172
	}
	ZSTD_countLeadingZeros32(U32 val); // 2106
	ZSTD_highbit32(U32 val); // 16287
	ZSTD_countLeadingZeros32(U32 val); // 2106
	ZSTD_highbit32(U32 val); // 16288
	FSE_minTableLog(size_t srcSize,
			unsigned int maxSymbolValue);  // 16298
	ZSTD_countLeadingZeros32(U32 val); // 2106
	ZSTD_highbit32(U32 val); // 16296
	FSE_optimalTableLog_internal(unsigned int maxTableLog,
					size_t srcSize,
					unsigned int maxSymbolValue,
					unsigned int minus);  // 16310
	FSE_optimalTableLog(unsigned int maxTableLog,
				size_t srcSize,
				unsigned int maxSymbolValue);  // 21171
} /* size: 205, variables: 3, inline expansions: 9 (149 bytes) */

// <06FFA084> thirdparty/zstd/zstd.c:21180
// variables: 3
size_t ZSTD_entropyCost(const unsigned int* count, const unsigned int max, const size_t total)
{
	unsigned int cost; // 21182
	unsigned int s; // 21183
	{
		unsigned int norm; // 21187
	}
} /* size: 0, variables: 2 */

// <06FF9E13> thirdparty/zstd/zstd.c:21200
// variables: 11
// function calls: 5
size_t ZSTD_fseBitCost(const FSE_CTable* ctable, const unsigned int* count, const unsigned int max)
{
	const unsigned int  kAccuracyLog; // 21205
	size_t cost; // 21206
	unsigned int s; // 21207
	FSE_CState_t cstate; // 21208
	{
		const unsigned int  tableLog; // 21216
		const unsigned int  badCost; // 21217
		const unsigned int  bitCost; // 21218
		{
			const U32  tableSize; // 2823
			const U32  deltaFromThreshold; // 2824
			const U32  normalizedDeltaFromThreshold; // 2825
			const U32  bitMultiplier; // 2826
		}
		FSE_bitCost(const void* symbolTTPtr,
				U32 tableLog,
				U32 symbolValue,
				U32 accuracyLog);  // 21218
	}
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 21209
	MEM_read16(const void* ptr); // 21145
	ZSTD_getFSEMaxSymbolValue(const FSE_CTable* ctable); // 21210
} /* size: 198, variables: 4, inline expansions: 4 (34 bytes) */

// <06FF9D86> thirdparty/zstd/zstd.c:21235
// variables: 5
size_t ZSTD_crossEntropyCost(const short int* norm, unsigned int accuracyLog, const unsigned int* count, const unsigned int max)
{
	const unsigned int  shift; // 21238
	size_t cost; // 21239
	unsigned int s; // 21240
	{
		const unsigned int  normAcc; // 21243
		const unsigned int  norm256; // 21244
	}
} /* size: 0, variables: 3 */

// <06FF9A6F> thirdparty/zstd/zstd.c:21253
// variables: 11
// function calls: 2
SymbolEncodingType_e ZSTD_selectEncodingType(FSE_repeat* repeatMode, const unsigned int* count, const unsigned int max, const size_t mostFrequent, size_t nbSeq, const unsigned int FSELog, const FSE_CTable* prevCTable, const short int* defaultNorm, U32 defaultNormLog, const ZSTD_DefaultPolicy_e isDefaultAllowed, const ZSTD_strategy strategy)
{
	{
		const size_t  staticFse_nbSeq_max; // 21277
		const size_t  mult; // 21278
		const size_t  baseLog; // 21279
		const size_t  dynamicFse_nbSeq_min; // 21280
	}
	{
		const size_t  basicCost; // 21302
		const size_t  repeatCost; // 21303
		const size_t  NCountCost; // 21304
		const size_t  compressedCost; // 21305
		{
			const unsigned int  normAcc; // 21243
			const unsigned int  norm256; // 21244
		}
		ZSTD_crossEntropyCost(const short int* norm,
					unsigned int accuracyLog,
					const unsigned int* count,
					const unsigned int  max);  // 21302
		{
			unsigned int norm; // 21187
		}
		ZSTD_entropyCost(const unsigned int* count,
				const unsigned int  max,
				const size_t  total);  // 21305
	}
} /* size: 535 */

// <06F3D3EB> thirdparty/zstd/zstd.c:21333
// member variables: 2
// struct size: 1,248
typedef struct {
	S16 norm[53]; /* 0 106 */
	U32 wksp[285]; /* 108 1140 */
} ZSTD_BuildCTableWksp;

// <06FF9401> thirdparty/zstd/zstd.c:21339
// variables: 11
// function calls: 11
size_t ZSTD_buildCTable(void* dst, size_t dstCapacity, FSE_CTable* nextCTable, U32 FSELog, SymbolEncodingType_e type, unsigned int* count, U32 max, const BYTE* codeTable, size_t nbSeq, const S16* defaultNorm, U32 defaultNormLog, U32 defaultMax, const FSE_CTable* prevCTable, size_t prevCTableSize, void* entropyWorkspace, size_t entropyWorkspaceSize)
{
	BYTE* op; // 21347
	const BYTE* oend; // 21348
	{
		const size_t  err_code; // 21353
		FSE_buildCTable_rle(FSE_CTable* ct,
					BYTE symbolValue);  // 21353
	}
	{
		const size_t  err_code; // 21361
	}
	{
		ZSTD_BuildCTableWksp* wksp; // 21364
		size_t nbSeq_1; // 21365
		const U32  tableLog; // 21366
		{
			const size_t  err_code; // 21374
			ZSTD_useLowProbCount(const size_t nbSeq); // 21374
		}
		{
			const size_t  NCountSize; // 21376
			{
				const size_t  err_code; // 21377
			}
			{
				const size_t  err_code; // 21378
			}
		}
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16287
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16288
		FSE_minTableLog(size_t srcSize,
				unsigned int maxSymbolValue);  // 16298
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 16296
		FSE_optimalTableLog_internal(unsigned int maxTableLog,
						size_t srcSize,
						unsigned int maxSymbolValue,
						unsigned int minus);  // 16310
		FSE_optimalTableLog(unsigned int maxTableLog,
					size_t srcSize,
					unsigned int maxSymbolValue);  // 21366
	}
} /* size: 478, variables: 2 */

// <06FF928C> thirdparty/zstd/zstd.c:21387
// variables: 15
inline size_t ZSTD_encodeSequences_body(void* dst, size_t dstCapacity, const FSE_CTable* CTable_MatchLength, const BYTE* mlCodeTable, const FSE_CTable* CTable_OffsetBits, const BYTE* ofCodeTable, const FSE_CTable* CTable_LitLength, const BYTE* llCodeTable, const SeqDef* sequences, size_t nbSeq, int longOffsets)
{
	BIT_CStream_t blockStream; // 21394
	FSE_CState_t stateMatchLength; // 21395
	FSE_CState_t stateOffsetBits; // 21396
	FSE_CState_t stateLitLength; // 21397
	{
		const U32  ofBits; // 21415
		const unsigned int  extraBits; // 21416
	}
	{
		size_t n; // 21428
		{
			const BYTE  llCode; // 21430
			const BYTE  ofCode; // 21431
			const BYTE  mlCode; // 21432
			const U32  llBits; // 21433
			const U32  ofBits; // 21434
			const U32  mlBits; // 21435
			{
				const unsigned int  extraBits; // 21453
			}
		}
	}
	{
		const size_t  streamSize; // 21474
	}
} /* size: 0, variables: 4 */

// <06FF7AE2> thirdparty/zstd/zstd.c:21481
// variables: 20
// function calls: 91
size_t ZSTD_encodeSequences_default(void* dst, size_t dstCapacity, const FSE_CTable* CTable_MatchLength, const BYTE* mlCodeTable, const FSE_CTable* CTable_OffsetBits, const BYTE* ofCodeTable, const FSE_CTable* CTable_LitLength, const BYTE* llCodeTable, const SeqDef* sequences, size_t nbSeq, int longOffsets)
{
	BIT_initCStream(BIT_CStream_t* bitC,
			void* startPtr,
			size_t dstCapacity);  // 21399
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21407
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21408
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21409
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21412
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21410
	{
		const U32  ofBits; // 21415
		const unsigned int  extraBits; // 21416
		BIT_getLowerBits(BitContainerType bitContainer,
				const U32  nbBits);  // 2291
		BIT_addBits(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 21421
		BIT_getLowerBits(BitContainerType bitContainer,
				const U32  nbBits);  // 2291
		BIT_addBits(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 21418
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 2331
		BIT_flushBits(BIT_CStream_t* bitC); // 21419
	}
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21424
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 21426
	{
		size_t n; // 21428
		{
			const BYTE  llCode; // 21430
			const BYTE  ofCode; // 21431
			const BYTE  mlCode; // 21432
			const U32  llBits; // 21433
			const U32  ofBits; // 21434
			const U32  mlBits; // 21435
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21461
			{
				const unsigned int  extraBits; // 21453
				BIT_getLowerBits(BitContainerType bitContainer,
						const U32  nbBits);  // 2291
				BIT_addBits(BIT_CStream_t* bitC,
						BitContainerType value,
						unsigned int nbBits);  // 21458
				BIT_getLowerBits(BitContainerType bitContainer,
						const U32  nbBits);  // 2291
				BIT_addBits(BIT_CStream_t* bitC,
						BitContainerType value,
						unsigned int nbBits);  // 21455
				MEM_write64(void* memPtr,
						U64 value);  // 1325
				MEM_writeLE64(void* memPtr,
						U64 val64);  // 1343
				MEM_writeLEST(void* memPtr,
						size_t val);  // 2331
				BIT_flushBits(BIT_CStream_t* bitC); // 21456
			}
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21463
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21442
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21443
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21445
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21448
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21450
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21451
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21447
		}
	}
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21468
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21470
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21472
	{
		const size_t  streamSize; // 21474
		BIT_addBitsFast(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 2343
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 2331
		BIT_flushBits(BIT_CStream_t* bitC); // 2344
		BIT_closeCStream(BIT_CStream_t* bitC); // 21474
	}
	ZSTD_encodeSequences_body(void* dst,
					size_t dstCapacity,
					const FSE_CTable* CTable_MatchLength,
					const BYTE* mlCodeTable,
					const FSE_CTable* CTable_OffsetBits,
					const BYTE* ofCodeTable,
					const FSE_CTable* CTable_LitLength,
					const BYTE* llCodeTable,
					const SeqDef* sequences,
					size_t nbSeq,
					int longOffsets);  // 21488
} /* size: 1736, inline expansions: 42 (2748 bytes) */

// <06FF6328> thirdparty/zstd/zstd.c:21499
// variables: 20
// function calls: 91
size_t ZSTD_encodeSequences_bmi2(void* dst, size_t dstCapacity, const FSE_CTable* CTable_MatchLength, const BYTE* mlCodeTable, const FSE_CTable* CTable_OffsetBits, const BYTE* ofCodeTable, const FSE_CTable* CTable_LitLength, const BYTE* llCodeTable, const SeqDef* sequences, size_t nbSeq, int longOffsets)
{
	BIT_initCStream(BIT_CStream_t* bitC,
			void* startPtr,
			size_t dstCapacity);  // 21399
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21407
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21408
	MEM_read16(const void* ptr); // 2763
	FSE_initCState(FSE_CState_t* statePtr,
			const FSE_CTable* ct);  // 2776
	{
		const FSE_symbolCompressionTransform  symbolTT; // 2777
		const U16* stateTable; // 2778
		U32 nbBitsOut; // 2779
	}
	FSE_initCState2(FSE_CState_t* statePtr,
			const FSE_CTable* ct,
			U32 symbol);  // 21409
	{
		const U32  ofBits; // 21415
		const unsigned int  extraBits; // 21416
		BIT_getLowerBits(BitContainerType bitContainer,
				const U32  nbBits);  // 2291
		BIT_addBits(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 21421
		BIT_getLowerBits(BitContainerType bitContainer,
				const U32  nbBits);  // 2291
		BIT_addBits(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 21418
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 2331
		BIT_flushBits(BIT_CStream_t* bitC); // 21419
	}
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21424
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21412
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 21410
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 21426
	{
		size_t n; // 21428
		{
			const BYTE  llCode; // 21430
			const BYTE  ofCode; // 21431
			const BYTE  mlCode; // 21432
			const U32  llBits; // 21433
			const U32  ofBits; // 21434
			const U32  mlBits; // 21435
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21461
			{
				const unsigned int  extraBits; // 21453
				BIT_getLowerBits(BitContainerType bitContainer,
						const U32  nbBits);  // 2291
				BIT_addBits(BIT_CStream_t* bitC,
						BitContainerType value,
						unsigned int nbBits);  // 21458
				BIT_getLowerBits(BitContainerType bitContainer,
						const U32  nbBits);  // 2291
				BIT_addBits(BIT_CStream_t* bitC,
						BitContainerType value,
						unsigned int nbBits);  // 21455
				MEM_write64(void* memPtr,
						U64 value);  // 1325
				MEM_writeLE64(void* memPtr,
						U64 val64);  // 1343
				MEM_writeLEST(void* memPtr,
						size_t val);  // 2331
				BIT_flushBits(BIT_CStream_t* bitC); // 21456
			}
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21463
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21442
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21443
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 2790
			FSE_encodeSymbol(BIT_CStream_t* bitC,
					FSE_CState_t* statePtr,
					unsigned int symbol);  // 21445
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21448
			BIT_getLowerBits(BitContainerType bitContainer,
					const U32  nbBits);  // 2291
			BIT_addBits(BIT_CStream_t* bitC,
					BitContainerType value,
					unsigned int nbBits);  // 21450
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21451
			MEM_write64(void* memPtr,
					U64 value);  // 1325
			MEM_writeLE64(void* memPtr,
					U64 val64);  // 1343
			MEM_writeLEST(void* memPtr,
					size_t val);  // 2331
			BIT_flushBits(BIT_CStream_t* bitC); // 21447
		}
	}
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21468
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21470
	BIT_getLowerBits(BitContainerType bitContainer,
			const U32  nbBits);  // 2291
	BIT_addBits(BIT_CStream_t* bitC,
			BitContainerType value,
			unsigned int nbBits);  // 2796
	MEM_write64(void* memPtr,
			U64 value);  // 1325
	MEM_writeLE64(void* memPtr,
			U64 val64);  // 1343
	MEM_writeLEST(void* memPtr,
			size_t val);  // 2331
	BIT_flushBits(BIT_CStream_t* bitC); // 2797
	FSE_flushCState(BIT_CStream_t* bitC,
			const FSE_CState_t* statePtr);  // 21472
	{
		const size_t  streamSize; // 21474
		BIT_addBitsFast(BIT_CStream_t* bitC,
				BitContainerType value,
				unsigned int nbBits);  // 2343
		MEM_write64(void* memPtr,
				U64 value);  // 1325
		MEM_writeLE64(void* memPtr,
				U64 val64);  // 1343
		MEM_writeLEST(void* memPtr,
				size_t val);  // 2331
		BIT_flushBits(BIT_CStream_t* bitC); // 2344
		BIT_closeCStream(BIT_CStream_t* bitC); // 21474
	}
	ZSTD_encodeSequences_body(void* dst,
					size_t dstCapacity,
					const FSE_CTable* CTable_MatchLength,
					const BYTE* mlCodeTable,
					const FSE_CTable* CTable_OffsetBits,
					const BYTE* ofCodeTable,
					const FSE_CTable* CTable_LitLength,
					const BYTE* llCodeTable,
					const SeqDef* sequences,
					size_t nbSeq,
					int longOffsets);  // 21506
} /* size: 1714, inline expansions: 42 (2711 bytes) */

// <06FF6274> thirdparty/zstd/zstd.c:21515
size_t ZSTD_encodeSequences(void* dst, size_t dstCapacity, const FSE_CTable* CTable_MatchLength, const BYTE* mlCodeTable, const FSE_CTable* CTable_OffsetBits, const BYTE* ofCodeTable, const FSE_CTable* CTable_LitLength, const BYTE* llCodeTable, const SeqDef* sequences, size_t nbSeq, int longOffsets, int bmi2)
{
} /* size: 0 */

// <06FF6125> thirdparty/zstd/zstd.c:21615
// variables: 13
size_t ZSTD_compressSubBlock_literal(const HUF_CElt* hufTable, const ZSTD_hufCTablesMetadata_t* hufMetadata, const BYTE* literals, size_t litSize, void* dst, size_t dstSize, const int bmi2, int writeEntropy, int* entropyWritten)
{
	const size_t  header; // 21621
	const size_t  lhSize; // 21622
	const BYTE* ostart; // 21623
	const BYTE* oend; // 21624
	BYTE* op; // 21625
	const U32  singleStream; // 21626
	SymbolEncodingType_e hType; // 21627
	size_t cLitSize; // 21628
	{
		const int  flags; // 21651
		const size_t  cSize; // 21652
	}
	{
		const U32  lhc; // 21678
	}
	{
		const U32  lhc; // 21683
	}
	{
		const U32  lhc; // 21688
	}
} /* size: 0, variables: 8 */

// <06FF609D> thirdparty/zstd/zstd.c:21702
// variables: 4
size_t ZSTD_seqDecompressedSize(const SeqStore_t* seqStore, const SeqDef* sequences, size_t nbSeqs, size_t litSize, int lastSubBlock)
{
	size_t matchLengthSum; // 21706
	size_t litLengthSum; // 21707
	size_t n; // 21708
	{
		const ZSTD_SequenceLength  seqLen; // 21710
	}
} /* size: 0, variables: 3 */

// <06FF5F43> thirdparty/zstd/zstd.c:21736
// variables: 11
size_t ZSTD_compressSubBlock_sequences(const ZSTD_fseCTables_t* fseTables, const ZSTD_fseCTablesMetadata_t* fseMetadata, const SeqDef* sequences, size_t nbSeq, const BYTE* llCode, const BYTE* mlCode, const BYTE* ofCode, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, const int bmi2, int writeEntropy, int* entropyWritten)
{
	const int  longOffsets; // 21744
	const BYTE* ostart; // 21745
	const BYTE* oend; // 21746
	BYTE* op; // 21747
	BYTE* seqHead; // 21748
	{
		const U32  LLtype; // 21772
		const U32  Offtype; // 21773
		const U32  MLtype; // 21774
	}
	{
		const U32  repeat; // 21780
	}
	{
		const size_t  bitstreamSize; // 21784
		{
			const size_t  err_code; // 21791
		}
	}
} /* size: 0, variables: 5 */

// <07094D36> thirdparty/zstd/zstd.c:21836
// variables: 20
// function calls: 18
size_t ZSTD_compressSubBlock(const ZSTD_entropyCTables_t* entropy, const ZSTD_entropyCTablesMetadata_t* entropyMetadata, const SeqDef* sequences, size_t nbSeq, const BYTE* literals, size_t litSize, const BYTE* llCode, const BYTE* mlCode, const BYTE* ofCode, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, const int bmi2, int writeLitEntropy, int writeSeqEntropy, int* litEntropyWritten, int* seqEntropyWritten, U32 lastBlock)
{
	const BYTE* ostart; // 21848
	const BYTE* oend; // 21849
	BYTE* op; // 21850
	{
		size_t cLitSize; // 21853
		{
			const int  flags; // 21651
			const size_t  cSize; // 21652
			HUF_compress4X_usingCTable(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							int flags);  // 21653
			HUF_compress1X_usingCTable_internal(void* dst,
								size_t dstSize,
								const void* src,
								size_t srcSize,
								const HUF_CElt* CTable,
								const int  flags);  // 17921
			HUF_compress1X_usingCTable(void* dst,
							size_t dstSize,
							const void* src,
							size_t srcSize,
							const HUF_CElt* CTable,
							int flags);  // 21652
		}
		{
			const U32  lhc; // 21678
			MEM_write16(void* memPtr,
					U16 value);  // 1279
			MEM_writeLE16(void* memPtr,
					U16 val);  // 1294
			MEM_writeLE24(void* memPtr,
					U32 val);  // 21679
		}
		{
			const U32  lhc; // 21683
			MEM_write32(void* memPtr,
					U32 value);  // 1309
			MEM_writeLE32(void* memPtr,
					U32 val32);  // 21684
		}
		{
			const U32  lhc; // 21688
			MEM_write32(void* memPtr,
					U32 value);  // 1309
			MEM_writeLE32(void* memPtr,
					U32 val32);  // 21689
		}
		ZSTD_compressSubBlock_literal(const HUF_CElt* hufTable,
						const ZSTD_hufCTablesMetadata_t* hufMetadata,
						const BYTE* literals,
						size_t litSize,
						void* dst,
						size_t dstSize,
						const int  bmi2,
						int writeEntropy,
						int* entropyWritten);  // 21853
		{
			const size_t  err_code; // 21857
		}
	}
	{
		size_t cSeqSize; // 21861
		{
			const U32  repeat; // 21780
		}
		{
			const U32  LLtype; // 21772
			const U32  Offtype; // 21773
			const U32  MLtype; // 21774
		}
		{
			const size_t  bitstreamSize; // 21784
			ZSTD_encodeSequences(void* dst,
						size_t dstCapacity,
						const FSE_CTable* CTable_MatchLength,
						const BYTE* mlCodeTable,
						const FSE_CTable* CTable_OffsetBits,
						const BYTE* ofCodeTable,
						const FSE_CTable* CTable_LitLength,
						const BYTE* llCodeTable,
						const SeqDef* sequences,
						size_t nbSeq,
						int longOffsets,
						int bmi2);  // 21784
			{
				const size_t  err_code; // 21791
			}
		}
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 21761
		ZSTD_compressSubBlock_sequences(const ZSTD_fseCTables_t* fseTables,
						const ZSTD_fseCTablesMetadata_t* fseMetadata,
						const SeqDef* sequences,
						size_t nbSeq,
						const BYTE* llCode,
						const BYTE* mlCode,
						const BYTE* ofCode,
						const ZSTD_CCtx_params* cctxParams,
						void* dst,
						size_t dstCapacity,
						const int  bmi2,
						int writeEntropy,
						int* entropyWritten);  // 21861
		{
			const size_t  err_code; // 21868
		}
	}
	{
		size_t cSize; // 21873
		const U32  cBlockHeader24; // 21874
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 1294
		MEM_writeLE24(void* memPtr,
				U32 val);  // 21875
	}
} /* size: 1401, variables: 3 */

// <06FF5DC0> thirdparty/zstd/zstd.c:21836
// variables: 9
size_t ZSTD_compressSubBlock(const ZSTD_entropyCTables_t* entropy, const ZSTD_entropyCTablesMetadata_t* entropyMetadata, const SeqDef* sequences, size_t nbSeq, const BYTE* literals, size_t litSize, const BYTE* llCode, const BYTE* mlCode, const BYTE* ofCode, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, const int bmi2, int writeLitEntropy, int writeSeqEntropy, int* litEntropyWritten, int* seqEntropyWritten, U32 lastBlock)
{
	const BYTE* ostart; // 21848
	const BYTE* oend; // 21849
	BYTE* op; // 21850
	{
		size_t cLitSize; // 21853
		{
			const size_t  err_code; // 21857
		}
	}
	{
		size_t cSeqSize; // 21861
		{
			const size_t  err_code; // 21868
		}
	}
	{
		size_t cSize; // 21873
		const U32  cBlockHeader24; // 21874
	}
} /* size: 0, variables: 3 */

// <06FF5D0D> thirdparty/zstd/zstd.c:21880
// variables: 5
size_t ZSTD_estimateSubBlockSize_literal(const BYTE* literals, size_t litSize, const ZSTD_hufCTables_t* huf, const ZSTD_hufCTablesMetadata_t* hufMetadata, void* workspace, size_t wkspSize, int writeEntropy)
{
	const unsigned int* countWksp; // 21886
	unsigned int maxSymbolValue; // 21887
	size_t literalSectionHeaderSize; // 21888
	{
		const size_t  largest; // 21893
		{
			size_t cLitSizeEstimate; // 21895
		}
	}
} /* size: 0, variables: 3 */

// <06FF5981> thirdparty/zstd/zstd.c:21903
// variables: 8
// function calls: 3
size_t ZSTD_estimateSubBlockSize_symbolType(SymbolEncodingType_e type, const BYTE* codeTable, unsigned int maxCode, size_t nbSeq, const FSE_CTable* fseCTable, const U8* additionalBits, const short int* defaultNorm, U32 defaultNormLog, U32 defaultMax, void* workspace, size_t wkspSize)
{
	const unsigned int* countWksp; // 21910
	const BYTE* ctp; // 21911
	const BYTE* ctStart; // 21912
	const BYTE* ctEnd; // 21913
	size_t cSymbolTypeSizeEstimateInBits; // 21914
	unsigned int max; // 21915
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 16714
	HIST_countFast_wksp(unsigned int* count,
				unsigned int* maxSymbolValuePtr,
				const void* source,
				size_t sourceSize,
				void* workSpace,
				size_t workSpaceSize);  // 21917
	{
		const unsigned int  normAcc; // 21243
		const unsigned int  norm256; // 21244
	}
	ZSTD_crossEntropyCost(const short int* norm,
				unsigned int accuracyLog,
				const unsigned int* count,
				const unsigned int  max);  // 21922
} /* size: 505, variables: 6, inline expansions: 3 (206 bytes) */

// <06FF58DF> thirdparty/zstd/zstd.c:21938
// variables: 2
size_t ZSTD_estimateSubBlockSize_sequences(const BYTE* ofCodeTable, const BYTE* llCodeTable, const BYTE* mlCodeTable, size_t nbSeq, const ZSTD_fseCTables_t* fseTables, const ZSTD_fseCTablesMetadata_t* fseMetadata, void* workspace, size_t wkspSize, int writeEntropy)
{
	const size_t  sequencesSectionHeaderSize; // 21947
	size_t cSeqSizeEstimate; // 21948
} /* size: 0, variables: 2 */

// <06F3D449> thirdparty/zstd/zstd.c:21966
// member variables: 2
// struct size: 16
typedef struct {
	size_t estLitSize; /* 0 8 */
	size_t estBlockSize; /* 8 8 */
} EstimatedBlockSize;

// <06FF5823> thirdparty/zstd/zstd.c:21970
// variable: 1
EstimatedBlockSize ZSTD_estimateSubBlockSize(const BYTE* literals, size_t litSize, const BYTE* ofCodeTable, const BYTE* llCodeTable, const BYTE* mlCodeTable, size_t nbSeq, const ZSTD_entropyCTables_t* entropy, const ZSTD_entropyCTablesMetadata_t* entropyMetadata, void* workspace, size_t wkspSize, int writeLitEntropy, int writeSeqEntropy)
{
	EstimatedBlockSize ebs; // 21980
} /* size: 0, variables: 1 */

// <06FF5803> thirdparty/zstd/zstd.c:21991
int ZSTD_needSequenceEntropyTables(const ZSTD_fseCTablesMetadata_t* fseMetadata)
{
} /* size: 0 */

// <06FF57B2> thirdparty/zstd/zstd.c:22002
// variables: 2
size_t countLiterals(const SeqStore_t* seqStore, const SeqDef* sp, size_t seqCount)
{
	size_t n; // 22004
	size_t total; // 22004
} /* size: 0, variables: 2 */

// <06FF5711> thirdparty/zstd/zstd.c:22015
// variables: 5
size_t sizeBlockSequences(const SeqDef* sp, size_t nbSeqs, size_t targetBudget, size_t avgLitCost, size_t avgSeqCost, int firstSubBlock)
{
	size_t n; // 22019
	size_t budget; // 22019
	size_t inSize; // 22019
	const size_t  headerSize; // 22021
	{
		size_t currentCost; // 22032
	}
} /* size: 0, variables: 4 */

// <06FF53E1> thirdparty/zstd/zstd.c:22052
// variables: 46
size_t ZSTD_compressSubBlock_multi(const SeqStore_t* seqStorePtr, const ZSTD_compressedBlockState_t* prevCBlock, ZSTD_compressedBlockState_t* nextCBlock, const ZSTD_entropyCTablesMetadata_t* entropyMetadata, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, const void* src, size_t srcSize, const int bmi2, U32 lastBlock, void* workspace, size_t wkspSize)
{
	const SeqDef* sstart; // 22062
	const SeqDef* send; // 22063
	const SeqDef* sp; // 22064
	const size_t  nbSeqs; // 22065
	const BYTE* lstart; // 22066
	const BYTE* lend; // 22067
	const BYTE* lp; // 22068
	const size_t  nbLiterals; // 22069
	const BYTE* ip; // 22070
	const BYTE* iend; // 22071
	const BYTE* ostart; // 22072
	const BYTE* oend; // 22073
	BYTE* op; // 22074
	const BYTE* llCodePtr; // 22075
	const BYTE* mlCodePtr; // 22076
	const BYTE* ofCodePtr; // 22077
	const size_t  minTarget; // 22078
	const size_t  targetCBlockSize; // 22079
	int writeLitEntropy; // 22080
	int writeSeqEntropy; // 22081
	{
		const EstimatedBlockSize  ebs; // 22088
		const size_t  avgLitCost; // 22095
		const size_t  avgSeqCost; // 22096
		const size_t  nbSubBlocks; // 22097
		size_t n; // 22098
		size_t avgBlockBudget; // 22098
		size_t blockBudgetSupp; // 22098
		{
			const size_t  seqCount; // 22111
			{
				int litEntropyWritten; // 22118
				int seqEntropyWritten; // 22119
				size_t litSize; // 22120
				const size_t  decompressedSize; // 22121
				const size_t  cSize; // 22123
				{
					const size_t  err_code; // 22132
				}
			}
		}
	}
	{
		int litEntropyWritten; // 22161
		int seqEntropyWritten; // 22162
		size_t litSize; // 22163
		size_t seqCount; // 22164
		const size_t  decompressedSize; // 22165
		const size_t  cSize; // 22167
		{
			const size_t  err_code; // 22176
		}
	}
	{
		const size_t  rSize; // 22215
		const size_t  cSize; // 22216
		{
			const size_t  err_code; // 22218
		}
		{
			const SeqDef* seq; // 22223
			Repcodes_t rep; // 22224
		}
	}
} /* size: 0, variables: 20 */

// <06FF4478> thirdparty/zstd/zstd.c:22238
// variables: 35
// function calls: 25
size_t ZSTD_compressSuperBlock(ZSTD_CCtx* zc, void* dst, size_t dstCapacity, const void* src, size_t srcSize, unsigned int lastBlock)
{
	ZSTD_entropyCTablesMetadata_t entropyMetadata; // 22243
	{
		const size_t  err_code; // 22245
	}
	{
		const EstimatedBlockSize  ebs; // 22088
		const size_t  avgLitCost; // 22095
		const size_t  avgSeqCost; // 22096
		const size_t  nbSubBlocks; // 22097
		size_t n; // 22098
		size_t avgBlockBudget; // 22098
		size_t blockBudgetSupp; // 22098
		{
			const size_t  largest; // 21893
			HIST_countFast_wksp(unsigned int* count,
						unsigned int* maxSymbolValuePtr,
						const void* source,
						size_t sourceSize,
						void* workSpace,
						size_t workSpaceSize);  // 16714
			HIST_countFast_wksp(unsigned int* count,
						unsigned int* maxSymbolValuePtr,
						const void* source,
						size_t sourceSize,
						void* workSpace,
						size_t workSpaceSize);  // 16737
			HIST_count_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16728
			HIST_count_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 21893
			{
				size_t cLitSizeEstimate; // 21895
				HUF_getNbBits(HUF_CElt elt); // 17556
				HUF_estimateCompressedSize(const HUF_CElt* CTable,
								const unsigned int* count,
								unsigned int maxSymbolValue);  // 21895
			}
		}
		ZSTD_estimateSubBlockSize_literal(const BYTE* literals,
							size_t litSize,
							const ZSTD_hufCTables_t* huf,
							const ZSTD_hufCTablesMetadata_t* hufMetadata,
							void* workspace,
							size_t wkspSize,
							int writeEntropy);  // 21981
		ZSTD_estimateSubBlockSize_sequences(const BYTE* ofCodeTable,
							const BYTE* llCodeTable,
							const BYTE* mlCodeTable,
							size_t nbSeq,
							const ZSTD_fseCTables_t* fseTables,
							const ZSTD_fseCTablesMetadata_t* fseMetadata,
							void* workspace,
							size_t wkspSize,
							int writeEntropy);  // 21984
		ZSTD_estimateSubBlockSize(const BYTE* literals,
						size_t litSize,
						const BYTE* ofCodeTable,
						const BYTE* llCodeTable,
						const BYTE* mlCodeTable,
						size_t nbSeq,
						const ZSTD_entropyCTables_t* entropy,
						const ZSTD_entropyCTablesMetadata_t* entropyMetadata,
						void* workspace,
						size_t wkspSize,
						int writeLitEntropy,
						int writeSeqEntropy);  // 22089
		{
			const size_t  seqCount; // 22111
			{
				size_t currentCost; // 22032
			}
			sizeBlockSequences(const SeqDef* sp,
						size_t nbSeqs,
						size_t targetBudget,
						size_t avgLitCost,
						size_t avgSeqCost,
						int firstSubBlock);  // 22111
			{
				int litEntropyWritten; // 22118
				int seqEntropyWritten; // 22119
				size_t litSize; // 22120
				const size_t  decompressedSize; // 22121
				const size_t  cSize; // 22123
				ZSTD_getSequenceLength(const SeqStore_t* seqStore,
							const SeqDef* seq);  // 22007
				countLiterals(const SeqStore_t* seqStore,
						const SeqDef* sp,
						size_t seqCount);  // 22120
				{
					const ZSTD_SequenceLength  seqLen; // 21710
					ZSTD_getSequenceLength(const SeqStore_t* seqStore,
								const SeqDef* seq);  // 21710
				}
				ZSTD_seqDecompressedSize(const SeqStore_t* seqStore,
							const SeqDef* sequences,
							size_t nbSeqs,
							size_t litSize,
							int lastSubBlock);  // 22122
				{
					const size_t  err_code; // 22132
				}
			}
		}
	}
	{
		int litEntropyWritten; // 22161
		int seqEntropyWritten; // 22162
		size_t litSize; // 22163
		size_t seqCount; // 22164
		const size_t  decompressedSize; // 22165
		const size_t  cSize; // 22167
		{
			const ZSTD_SequenceLength  seqLen; // 21710
			ZSTD_getSequenceLength(const SeqStore_t* seqStore,
						const SeqDef* seq);  // 21710
		}
		ZSTD_seqDecompressedSize(const SeqStore_t* seqStore,
					const SeqDef* sequences,
					size_t nbSeqs,
					size_t litSize,
					int lastSubBlock);  // 22166
		{
			const size_t  err_code; // 22176
		}
	}
	ZSTD_needSequenceEntropyTables(const ZSTD_fseCTablesMetadata_t* fseMetadata); // 22205
	{
		const size_t  rSize; // 22215
		const size_t  cSize; // 22216
		{
			const size_t  err_code; // 22218
		}
		MEM_write16(void* memPtr,
				U16 value);  // 1279
		MEM_writeLE16(void* memPtr,
				U16 val);  // 1294
		MEM_writeLE24(void* memPtr,
				U32 val);  // 19810
		ZSTD_noCompressBlock(void* dst,
					size_t dstCapacity,
					const void* src,
					size_t srcSize,
					U32 lastBlock);  // 22216
		{
			const SeqDef* seq; // 22223
			Repcodes_t rep; // 22224
			ZSTD_getSequenceLength(const SeqStore_t* seqStore,
						const SeqDef* seq);  // 22227
			{
				const U32  repCode; // 19979
				{
					const U32  currentOffset; // 19981
				}
			}
			ZSTD_updateRep(U32* rep,
					const U32  offBase,
					const U32  ll0);  // 19972
			ZSTD_updateRep(U32* rep,
					const U32  offBase,
					const U32  ll0);  // 22227
		}
	}
	ZSTD_compressSubBlock_multi(const SeqStore_t* seqStorePtr,
					const ZSTD_compressedBlockState_t* prevCBlock,
					ZSTD_compressedBlockState_t* nextCBlock,
					const ZSTD_entropyCTablesMetadata_t* entropyMetadata,
					const ZSTD_CCtx_params* cctxParams,
					void* dst,
					size_t dstCapacity,
					const void* src,
					size_t srcSize,
					const int  bmi2,
					U32 lastBlock,
					void* workspace,
					size_t wkspSize);  // 22252
} /* size: 3231, variables: 1, inline expansions: 2 (3009 bytes) */

// <06FF444D> thirdparty/zstd/zstd.c:22296
inline unsigned int hash2(const void* p, unsigned int hashLog)
{
} /* size: 0 */

// <06F3D48A> thirdparty/zstd/zstd.c:22305
// member variables: 2
// struct size: 4,104
typedef struct {
	unsigned int events[1024]; /* 0 4096 */
	size_t nbEvents; /* 4096 8 */
} Fingerprint;

// <06F3D4DE> thirdparty/zstd/zstd.c:22309
// member variables: 2
// struct size: 8,208
typedef struct {
	Fingerprint pastEvents; /* 0 4104 */
	Fingerprint newEvents; /* 4104 4104 */
} FPStats;

// <06FF4431> thirdparty/zstd/zstd.c:22314
void initStats(FPStats* fpstats)
{
} /* size: 0 */

// <06FF43BF> thirdparty/zstd/zstd.c:22320
// variables: 3
inline void addEvents_generic(Fingerprint* fp, const void* src, size_t srcSize, size_t samplingRate, unsigned int hashLog)
{
	const char* p; // 22322
	size_t limit; // 22323
	size_t n; // 22324
} /* size: 0, variables: 3 */

// <06FF4370> thirdparty/zstd/zstd.c:22333
inline void recordFingerprint_generic(Fingerprint* fp, const void* src, size_t srcSize, size_t samplingRate, unsigned int hashLog)
{
} /* size: 0 */

// <06FF41BC> thirdparty/zstd/zstd.c:22350
// function calls: 4
void ZSTD_recordFingerprint_1(Fingerprint* fp, const void* src, size_t srcSize)
{
	MEM_read16(const void* ptr); // 22301
	hash2(const void* p,
		unsigned int hashLog);  // 22327
	addEvents_generic(Fingerprint* fp,
				const void* src,
				size_t srcSize,
				size_t samplingRate,
				unsigned int hashLog);  // 22337
	recordFingerprint_generic(Fingerprint* fp,
					const void* src,
					size_t srcSize,
					size_t samplingRate,
					unsigned int hashLog);  // 22350
} /* size: 101, inline expansions: 4 (141 bytes) */

// <06FF4008> thirdparty/zstd/zstd.c:22351
// function calls: 4
void ZSTD_recordFingerprint_5(Fingerprint* fp, const void* src, size_t srcSize)
{
	MEM_read16(const void* ptr); // 22301
	hash2(const void* p,
		unsigned int hashLog);  // 22327
	addEvents_generic(Fingerprint* fp,
				const void* src,
				size_t srcSize,
				size_t samplingRate,
				unsigned int hashLog);  // 22337
	recordFingerprint_generic(Fingerprint* fp,
					const void* src,
					size_t srcSize,
					size_t samplingRate,
					unsigned int hashLog);  // 22351
} /* size: 120, inline expansions: 4 (181 bytes) */

// <06FF3E54> thirdparty/zstd/zstd.c:22352
// function calls: 4
void ZSTD_recordFingerprint_11(Fingerprint* fp, const void* src, size_t srcSize)
{
	MEM_read16(const void* ptr); // 22301
	hash2(const void* p,
		unsigned int hashLog);  // 22327
	addEvents_generic(Fingerprint* fp,
				const void* src,
				size_t srcSize,
				size_t samplingRate,
				unsigned int hashLog);  // 22337
	recordFingerprint_generic(Fingerprint* fp,
					const void* src,
					size_t srcSize,
					size_t samplingRate,
					unsigned int hashLog);  // 22352
} /* size: 119, inline expansions: 4 (179 bytes) */

// <06FF3CC5> thirdparty/zstd/zstd.c:22353
// function calls: 3
void ZSTD_recordFingerprint_43(Fingerprint* fp, const void* src, size_t srcSize)
{
	hash2(const void* p,
		unsigned int hashLog);  // 22327
	addEvents_generic(Fingerprint* fp,
				const void* src,
				size_t srcSize,
				size_t samplingRate,
				unsigned int hashLog);  // 22337
	recordFingerprint_generic(Fingerprint* fp,
					const void* src,
					size_t srcSize,
					size_t samplingRate,
					unsigned int hashLog);  // 22353
} /* size: 111, inline expansions: 3 (152 bytes) */

// <06FF3CA5> thirdparty/zstd/zstd.c:22356
U64 abs64(S64 s64)
{
} /* size: 0 */

// <06FF3C53> thirdparty/zstd/zstd.c:22358
// variables: 2
U64 fpDistance(const Fingerprint* fp1, const Fingerprint* fp2, unsigned int hashLog)
{
	U64 distance; // 22360
	size_t n; // 22361
} /* size: 0, variables: 2 */

// <06FF3BE3> thirdparty/zstd/zstd.c:22373
// variables: 3
int compareFingerprints(const Fingerprint* ref, const Fingerprint* newfp, int penalty, unsigned int hashLog)
{
	{
		U64 p50; // 22380
		U64 deviation; // 22381
		U64 threshold; // 22382
	}
} /* size: 0 */

// <06FF3BA9> thirdparty/zstd/zstd.c:22387
// variable: 1
void mergeEvents(Fingerprint* acc, const Fingerprint* newfp)
{
	size_t n; // 22389
} /* size: 0, variables: 1 */

// <06FF3ABE> thirdparty/zstd/zstd.c:22417
// variables: 7
size_t ZSTD_splitBlock_byChunks(const void* blockStart, size_t blockSize, int level, void* workspace, size_t wkspSize)
{
	const RecordEvents_f   records_fs; // 22421
	const unsigned int   hashParams; // 22424
	const RecordEvents_f  record_f; // 22425
	const FPStats* fpstats; // 22426
	const char* p; // 22427
	int penalty; // 22428
	size_t pos; // 22429
} /* size: 0, variables: 7 */

// <06FF3A29> thirdparty/zstd/zstd.c:22461
// variables: 5
size_t ZSTD_splitBlock_fromBorders(const void* blockStart, size_t blockSize, void* workspace, size_t wkspSize)
{
	const FPStats* fpstats; // 22465
	Fingerprint* middleEvents; // 22466
	{
		const U64  distFromBegin; // 22482
		const U64  distFromEnd; // 22483
		const U64  minDistance; // 22484
	}
} /* size: 0, variables: 2 */

// <06FF39D0> thirdparty/zstd/zstd.c:22491
size_t ZSTD_splitBlock(const void* blockStart, size_t blockSize, int level, void* workspace, size_t wkspSize)
{
} /* size: 0 */

// <06F3AD10> thirdparty/zstd/zstd.c:23034
// member variables: 11
// struct size: 6,080
struct ZSTD_CDict_s {
	const void * dictContent; /* 0 8 */
	size_t dictContentSize; /* 8 8 */
	ZSTD_dictContentType_e dictContentType; /* 16 4 */
	U32 * entropyWorkspace; /* 24 8 */
	ZSTD_cwksp workspace; /* 32 72 */
	ZSTD_MatchState_t matchState; /* 104 304 */
	ZSTD_compressedBlockState_t cBlockState; /* 408 5632 */
	ZSTD_customMem customMem; /* 6040 24 */
	U32 dictID; /* 6064 4 */
	int compressionLevel; /* 6068 4 */
	ZSTD_ParamSwitch_e useRowMatchFinder; /* 6072 4 */
};

// <06FF3922> thirdparty/zstd/zstd.c:23056
// variable: 1
void ZSTD_initCCtx(ZSTD_CCtx* cctx, ZSTD_customMem memManager)
{
	{
		const size_t  err; // 23062
	}
} /* size: 0 */

// <06FF3725> thirdparty/zstd/zstd.c:23068
// variables: 4
// function calls: 4
ZSTD_CCtx* ZSTD_createCCtx_advanced(ZSTD_customMem customMem)
{
	{
		const ZSTD_CCtx* cctx; // 23073
		ZSTD_customMalloc(size_t size,
					ZSTD_customMem customMem);  // 23073
		{
			U32 f1a; // 8142
		}
		{
			U32 f7a; // 8146
		}
		ZSTD_cpuid(void); // 15816
		ZSTD_cpuSupportsBmi2(void); // 23061
		{
			const size_t  err; // 23062
		}
		ZSTD_initCCtx(ZSTD_CCtx* cctx,
				ZSTD_customMem memManager);  // 23075
	}
} /* size: 238 */

// <06FF3350> thirdparty/zstd/zstd.c:23080
// variables: 4
// function calls: 11
ZSTD_CCtx* ZSTD_initStaticCCtx(void* workspace, size_t workspaceSize)
{
	ZSTD_cwksp ws; // 23082
	ZSTD_CCtx* cctx; // 23083
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18954
	ZSTD_cwksp_init(ZSTD_cwksp* ws,
			void* start,
			size_t size,
			ZSTD_cwksp_static_alloc_e isStatic);  // 23086
	ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
					size_t bytes);  // 23088
	ZSTD_cwksp_move(ZSTD_cwksp* dst,
			ZSTD_cwksp* src);  // 23092
	ZSTD_cwksp_available_space(ZSTD_cwksp* ws); // 19016
	ZSTD_cwksp_check_available(ZSTD_cwksp* ws,
					size_t additionalNeededSpace);  // 23096
	ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
					size_t bytes);  // 23097
	ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
					size_t bytes);  // 23098
	ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
					size_t bytes);  // 23099
	{
		U32 f1a; // 8142
	}
	{
		U32 f7a; // 8146
	}
	ZSTD_cpuid(void); // 23101
	ZSTD_cpuid_bmi2(const ZSTD_cpuid_t cpuid); // 23101
} /* size: 462, variables: 2, inline expansions: 11 (305 bytes) */

// <06FF32C7> thirdparty/zstd/zstd.c:23108
// function call: 1
void ZSTD_clearAllDicts(ZSTD_CCtx* cctx)
{
	ZSTD_customFree(void* ptr,
			ZSTD_customMem customMem);  // 23110
} /* size: 189, inline expansions: 1 (43 bytes) */

// <06FF328D> thirdparty/zstd/zstd.c:23117
// variables: 2
size_t ZSTD_sizeof_localDict(ZSTD_localDict dict)
{
	const size_t  bufferSize; // 23119
	const size_t  cdictSize; // 23120
} /* size: 0, variables: 2 */

// <06FF3271> thirdparty/zstd/zstd.c:23124
void ZSTD_freeCCtxContent(ZSTD_CCtx* cctx)
{
} /* size: 0 */

// <06FF306E> thirdparty/zstd/zstd.c:23149
size_t ZSTD_sizeof_mtctx(const ZSTD_CCtx* cctx)
{
} /* size: 0 */

// <06FF2F82> thirdparty/zstd/zstd.c:23160
// function calls: 3
size_t ZSTD_sizeof_CCtx(const ZSTD_CCtx* cctx)
{
	ZSTD_cwksp_sizeof(const ZSTD_cwksp* ws); // 23165
	ZSTD_sizeof_localDict(ZSTD_localDict dict); // 23166
	ZSTD_sizeof_mtctx(const ZSTD_CCtx* cctx); // 23167
} /* size: 115, inline expansions: 3 (57 bytes) */

// <06FF2F30> thirdparty/zstd/zstd.c:23170
size_t ZSTD_sizeof_CStream(const ZSTD_CStream* zcs)
{
} /* size: 9 */

// <06FF2F0B> thirdparty/zstd/zstd.c:23176
const SeqStore_t* ZSTD_getSeqStore(const ZSTD_CCtx* ctx)
{
} /* size: 0 */

// <06FF2EEB> thirdparty/zstd/zstd.c:23179
int ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy)
{
} /* size: 0 */

// <06FF2EBE> thirdparty/zstd/zstd.c:23186
int ZSTD_rowMatchFinderUsed(const ZSTD_strategy strategy, const ZSTD_ParamSwitch_e mode)
{
} /* size: 0 */

// <06FF2E91> thirdparty/zstd/zstd.c:23192
ZSTD_ParamSwitch_e ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode, const ZSTD_compressionParameters* cParams)
{
} /* size: 0 */

// <06FF2E64> thirdparty/zstd/zstd.c:23202
ZSTD_ParamSwitch_e ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode, const ZSTD_compressionParameters* cParams)
{
} /* size: 0 */

// <06FF2E2A> thirdparty/zstd/zstd.c:23209
int ZSTD_allocateChainTable(const ZSTD_strategy strategy, const ZSTD_ParamSwitch_e useRowMatchFinder, const U32 forDDSDict)
{
} /* size: 0 */

// <06FF2DFD> thirdparty/zstd/zstd.c:23223
ZSTD_ParamSwitch_e ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode, const ZSTD_compressionParameters* cParams)
{
} /* size: 0 */

// <06FF2DDD> thirdparty/zstd/zstd.c:23229
int ZSTD_resolveExternalSequenceValidation(int mode)
{
} /* size: 0 */

// <06FF2DBD> thirdparty/zstd/zstd.c:23234
size_t ZSTD_resolveMaxBlockSize(size_t maxBlockSize)
{
} /* size: 0 */

// <06FF2D90> thirdparty/zstd/zstd.c:23242
ZSTD_ParamSwitch_e ZSTD_resolveExternalRepcodeSearch(ZSTD_ParamSwitch_e value, int cLevel)
{
} /* size: 0 */

// <06FF2D70> thirdparty/zstd/zstd.c:23253
int ZSTD_CDictIndicesAreTagged(const ZSTD_compressionParameters* cParams)
{
} /* size: 0 */

// <06FF2AE4> thirdparty/zstd/zstd.c:23257
// variable: 1
// function calls: 9
ZSTD_CCtx_params ZSTD_makeCCtxParamsFromCParams(ZSTD_compressionParameters cParams)
{
	ZSTD_CCtx_params cctxParams; // 23260
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23223
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23266
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23202
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23272
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23196
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23192
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23273
	ZSTD_resolveMaxBlockSize(size_t maxBlockSize); // 23275
	ZSTD_resolveExternalRepcodeSearch(ZSTD_ParamSwitch_e value,
						int cLevel);  // 23276
} /* size: 302, variables: 1, inline expansions: 9 (196 bytes) */

// <06FF2AB7> thirdparty/zstd/zstd.c:23282
// variable: 1
ZSTD_CCtx_params* ZSTD_createCCtxParams_advanced(ZSTD_customMem customMem)
{
	ZSTD_CCtx_params* params; // 23285
} /* size: 0, variables: 1 */

// <06FF29CA> thirdparty/zstd/zstd.c:23295
// function calls: 3
ZSTD_CCtx_params* ZSTD_createCCtxParams(void)
{
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 7511
	ZSTD_customCalloc(size_t size,
				ZSTD_customMem customMem);  // 23287
	ZSTD_createCCtxParams_advanced(ZSTD_customMem customMem); // 23297
} /* size: 83, inline expansions: 3 (102 bytes) */

// <06FF2939> thirdparty/zstd/zstd.c:23300
// function call: 1
size_t ZSTD_freeCCtxParams(ZSTD_CCtx_params* params)
{
	ZSTD_customFree(void* ptr,
			ZSTD_customMem customMem);  // 23303
} /* size: 63, inline expansions: 1 (27 bytes) */

// <06FF28E2> thirdparty/zstd/zstd.c:23307
size_t ZSTD_CCtxParams_reset(ZSTD_CCtx_params* params)
{
} /* size: 14 */

// <06FF2897> thirdparty/zstd/zstd.c:23312
size_t ZSTD_CCtxParams_init(ZSTD_CCtx_params* cctxParams, int compressionLevel)
{
} /* size: 48 */

// <07019B6B> thirdparty/zstd/zstd.c:23327
// function calls: 8
void ZSTD_CCtxParams_init_internal(ZSTD_CCtx_params* cctxParams, const ZSTD_parameters* params, int compressionLevel)
{
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23196
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23192
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23339
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23202
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23340
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23223
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23341
	ZSTD_resolveExternalRepcodeSearch(ZSTD_ParamSwitch_e value,
						int cLevel);  // 23344
} /* size: 185, inline expansions: 8 (196 bytes) */

// <06FF2861> thirdparty/zstd/zstd.c:23327
void ZSTD_CCtxParams_init_internal(ZSTD_CCtx_params* cctxParams, const ZSTD_parameters* params, int compressionLevel)
{
} /* size: 0 */

// <06FF2668> thirdparty/zstd/zstd.c:23349
// variable: 1
// function calls: 8
size_t ZSTD_CCtxParams_init_advanced(ZSTD_CCtx_params* cctxParams, ZSTD_parameters params)
{
	{
		const size_t  err_code; // 23352
	}
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23196
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23192
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23339
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23202
	ZSTD_resolveBlockSplitterMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23340
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23223
	ZSTD_resolveEnableLdm(ZSTD_ParamSwitch_e mode,
				const ZSTD_compressionParameters* cParams);  // 23341
	ZSTD_CCtxParams_init_internal(ZSTD_CCtx_params* cctxParams,
					const ZSTD_parameters* params,
					int compressionLevel);  // 23353
} /* size: 298, inline expansions: 8 (323 bytes) */

// <06FF263F> thirdparty/zstd/zstd.c:23361
void ZSTD_CCtxParams_setZstdParams(ZSTD_CCtx_params* cctxParams, const ZSTD_parameters* params)
{
} /* size: 0 */

// <06FF25D3> thirdparty/zstd/zstd.c:23373
// variable: 1
ZSTD_bounds ZSTD_cParam_getBounds(ZSTD_cParameter param)
{
	ZSTD_bounds bounds; // 23375
} /* size: 606, variables: 1 */

// <06FF2599> thirdparty/zstd/zstd.c:23596
// variable: 1
size_t ZSTD_cParam_clampBounds(ZSTD_cParameter cParam, int* value)
{
	const ZSTD_bounds  bounds; // 23598
} /* size: 0, variables: 1 */

// <06FF2579> thirdparty/zstd/zstd.c:23612
int ZSTD_isUpdateAuthorized(ZSTD_cParameter param)
{
} /* size: 0 */

// <06FF24D2> thirdparty/zstd/zstd.c:23662
// function call: 1
size_t ZSTD_CCtx_setParameter(ZSTD_CCtx* cctx, ZSTD_cParameter param, int value)
{
	ZSTD_isUpdateAuthorized(ZSTD_cParameter param); // 23666
} /* size: 311, inline expansions: 1 (63 bytes) */

// <06FF143F> thirdparty/zstd/zstd.c:23724
// variables: 7
// function calls: 34
size_t ZSTD_CCtxParams_setParameter(ZSTD_CCtx_params* CCtxParams, ZSTD_cParameter param, int value)
{
	{
		const size_t  err_code; // 23736
		ZSTD_cParam_clampBounds(ZSTD_cParameter cParam,
					int* value);  // 23736
	}
	{
		const ZSTD_dictAttachPref_e  pref; // 23807
		ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
					int value);  // 23808
	}
	{
		const ZSTD_ParamSwitch_e  lcm; // 23814
		ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
					int value);  // 23815
	}
	{
		const size_t  err_code; // 23825
		ZSTD_cParam_clampBounds(ZSTD_cParameter cParam,
					int* value);  // 23825
	}
	{
		const size_t  err_code; // 23838
		ZSTD_cParam_clampBounds(ZSTD_cParameter cParam,
					int* value);  // 23838
	}
	{
		const size_t  err_code; // 23849
		ZSTD_cParam_clampBounds(ZSTD_cParameter cParam,
					int* value);  // 23849
	}
	{
		const size_t  err_code; // 23859
		ZSTD_cParam_clampBounds(ZSTD_cParameter cParam,
					int* value);  // 23859
	}
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23912
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23917
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23922
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23927
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23932
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23942
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23947
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23952
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23957
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23969
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23937
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23776
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23869
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23907
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23731
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23747
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23771
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23963
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23893
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23765
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23900
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23759
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23782
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23753
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23887
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23875
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 23881
} /* size: 2986, inline expansions: 27 (1501 bytes) */

// <06FF13B3> thirdparty/zstd/zstd.c:23977
size_t ZSTD_CCtx_getParameter(const ZSTD_CCtx* cctx, ZSTD_cParameter param, int* value)
{
} /* size: 13 */

// <06FF1359> thirdparty/zstd/zstd.c:23982
size_t ZSTD_CCtxParams_getParameter(const ZSTD_CCtx_params* CCtxParams, ZSTD_cParameter param, int* value)
{
} /* size: 683 */

// <06FF12E3> thirdparty/zstd/zstd.c:24132
size_t ZSTD_CCtx_setParametersUsingCCtxParams(ZSTD_CCtx* cctx, const ZSTD_CCtx_params* params)
{
} /* size: 57 */

// <06FF105F> thirdparty/zstd/zstd.c:24146
// variables: 8
size_t ZSTD_CCtx_setCParams(ZSTD_CCtx* cctx, ZSTD_compressionParameters cparams)
{
	{
		const size_t  err_code; // 24151
	}
	{
		const size_t  err_code; // 24152
	}
	{
		const size_t  err_code; // 24153
	}
	{
		const size_t  err_code; // 24154
	}
	{
		const size_t  err_code; // 24155
	}
	{
		const size_t  err_code; // 24156
	}
	{
		const size_t  err_code; // 24157
	}
	{
		const size_t  err_code; // 24158
	}
} /* size: 247 */

// <06FF0F2C> thirdparty/zstd/zstd.c:24162
// variables: 3
size_t ZSTD_CCtx_setFParams(ZSTD_CCtx* cctx, ZSTD_frameParameters fparams)
{
	{
		const size_t  err_code; // 24166
	}
	{
		const size_t  err_code; // 24167
	}
	{
		const size_t  err_code; // 24168
	}
} /* size: 124 */

// <06FF0E39> thirdparty/zstd/zstd.c:24172
// variables: 3
size_t ZSTD_CCtx_setParams(ZSTD_CCtx* cctx, ZSTD_parameters params)
{
	{
		const size_t  err_code; // 24176
	}
	{
		const size_t  err_code; // 24178
	}
	{
		const size_t  err_code; // 24180
	}
} /* size: 166 */

// <06FF0DEE> thirdparty/zstd/zstd.c:24184
size_t ZSTD_CCtx_setPledgedSrcSize(ZSTD_CCtx* cctx, long long unsigned int pledgedSrcSize)
{
} /* size: 35 */

// <06FF0DB7> thirdparty/zstd/zstd.c:24206
// variable: 1
size_t ZSTD_initLocalDict(ZSTD_CCtx* cctx)
{
	const ZSTD_localDict* dl; // 24208
} /* size: 0, variables: 1 */

// <06FF0D53> thirdparty/zstd/zstd.c:24237
// variable: 1
size_t ZSTD_CCtx_loadDictionary_advanced(ZSTD_CCtx* cctx, const void* dict, size_t dictSize, ZSTD_dictLoadMethod_e dictLoadMethod, ZSTD_dictContentType_e dictContentType)
{
	{
		void* dictBuffer; // 24253
	}
} /* size: 0 */

// <06FF0CBF> thirdparty/zstd/zstd.c:24268
size_t ZSTD_CCtx_loadDictionary_byReference(ZSTD_CCtx* cctx, const void* dict, size_t dictSize)
{
} /* size: 17 */

// <06FF0C2B> thirdparty/zstd/zstd.c:24275
size_t ZSTD_CCtx_loadDictionary(ZSTD_CCtx* cctx, const void* dict, size_t dictSize)
{
} /* size: 14 */

// <06FF0BC4> thirdparty/zstd/zstd.c:24282
size_t ZSTD_CCtx_refCDict(ZSTD_CCtx* cctx, const ZSTD_CDict* cdict)
{
} /* size: 72 */

// <06FF0B7F> thirdparty/zstd/zstd.c:24292
size_t ZSTD_CCtx_refThreadPool(ZSTD_CCtx* cctx, ZSTD_threadPool* pool)
{
} /* size: 31 */

// <06FF0AF0> thirdparty/zstd/zstd.c:24300
size_t ZSTD_CCtx_refPrefix(ZSTD_CCtx* cctx, const void* prefix, size_t prefixSize)
{
} /* size: 14 */

// <06FF0AA8> thirdparty/zstd/zstd.c:24305
size_t ZSTD_CCtx_refPrefix_advanced(ZSTD_CCtx* cctx, const void* prefix, size_t prefixSize, ZSTD_dictContentType_e dictContentType)
{
} /* size: 0 */

// <06FF0A7A> thirdparty/zstd/zstd.c:24321
size_t ZSTD_CCtx_reset(ZSTD_CCtx* cctx, ZSTD_ResetDirective reset)
{
} /* size: 0 */

// <06FF07A6> thirdparty/zstd/zstd.c:24342
// function calls: 7
size_t ZSTD_checkCParams(ZSTD_compressionParameters cParams)
{
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24344
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24345
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24346
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24347
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24348
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24349
	ZSTD_cParam_withinBounds(ZSTD_cParameter cParam,
				int value);  // 24350
} /* size: 380, inline expansions: 7 (327 bytes) */

// <06FF0705> thirdparty/zstd/zstd.c:24358
// variables: 7
ZSTD_compressionParameters ZSTD_clampCParams(ZSTD_compressionParameters cParams)
{
	{
		const ZSTD_bounds  bounds; // 24367
	}
	{
		const ZSTD_bounds  bounds; // 24368
	}
	{
		const ZSTD_bounds  bounds; // 24369
	}
	{
		const ZSTD_bounds  bounds; // 24370
	}
	{
		const ZSTD_bounds  bounds; // 24371
	}
	{
		const ZSTD_bounds  bounds; // 24372
	}
	{
		const ZSTD_bounds  bounds; // 24373
	}
} /* size: 0 */

// <06FF06C6> thirdparty/zstd/zstd.c:24379
// variable: 1
U32 ZSTD_cycleLog(U32 hashLog, ZSTD_strategy strat)
{
	const U32  btScale; // 24381
} /* size: 0, variables: 1 */

// <06FF0663> thirdparty/zstd/zstd.c:24393
// variables: 3
U32 ZSTD_dictAndWindowLog(U32 windowLog, U64 srcSize, U64 dictSize)
{
	const U64  maxWindowSize; // 24395
	{
		const U64  windowSize; // 24403
		const U64  dictAndWindowSize; // 24404
	}
} /* size: 0, variables: 1 */

// <06FF02EA> thirdparty/zstd/zstd.c:24427
// variables: 13
// function calls: 9
ZSTD_compressionParameters ZSTD_adjustCParams_internal(ZSTD_compressionParameters cPar, long long unsigned int srcSize, size_t dictSize, ZSTD_CParamMode_e mode, ZSTD_ParamSwitch_e useRowMatchFinder)
{
	const U64  minSrcSize; // 24433
	const U64  maxWindowResize; // 24434
	{
		const U32  tSize; // 24509
		const U32  hashSizeMin; // 24510
		const U32  srcLog; // 24511
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 24512
	}
	{
		const U32  dictAndWindowLog; // 24516
		const U32  cycleLog; // 24517
		{
			const U64  windowSize; // 24403
			const U64  dictAndWindowSize; // 24404
			ZSTD_countLeadingZeros32(U32 val); // 2106
			ZSTD_highbit32(U32 val); // 24414
		}
		ZSTD_dictAndWindowLog(U32 windowLog,
					U64 srcSize,
					U64 dictSize);  // 24516
		ZSTD_cycleLog(U32 hashLog,
				ZSTD_strategy strat);  // 24517
	}
	{
		const U32  maxShortCacheHashLog; // 24530
	}
	{
		const U32  rowLog; // 24553
		const U32  maxRowHashLog; // 24554
		const U32  maxHashLog; // 24555
	}
	ZSTD_CDictIndicesAreTagged(const ZSTD_compressionParameters* cParams); // 24529
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
	ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  mode);  // 24551
} /* size: 627, variables: 2, inline expansions: 3 (42 bytes) */

// <06FF0100> thirdparty/zstd/zstd.c:24566
// variables: 7
// function call: 1
ZSTD_compressionParameters ZSTD_adjustCParams(ZSTD_compressionParameters cPar, long long unsigned int srcSize, size_t dictSize)
{
	{
		const ZSTD_bounds  bounds; // 24367
	}
	{
		const ZSTD_bounds  bounds; // 24368
	}
	{
		const ZSTD_bounds  bounds; // 24369
	}
	{
		const ZSTD_bounds  bounds; // 24370
	}
	{
		const ZSTD_bounds  bounds; // 24371
	}
	{
		const ZSTD_bounds  bounds; // 24372
	}
	{
		const ZSTD_bounds  bounds; // 24373
	}
	ZSTD_clampCParams(ZSTD_compressionParameters cParams); // 24570
} /* size: 503, inline expansions: 1 (299 bytes) */

// <06FF00D7> thirdparty/zstd/zstd.c:24578
void ZSTD_overrideCParams(ZSTD_compressionParameters* cParams, const ZSTD_compressionParameters* overrides)
{
} /* size: 0 */

// <06FEFFA4> thirdparty/zstd/zstd.c:24591
// variable: 1
// function call: 1
ZSTD_compressionParameters ZSTD_getCParamsFromCCtxParams(const ZSTD_CCtx_params* CCtxParams, U64 srcSizeHint, size_t dictSize, ZSTD_CParamMode_e mode)
{
	ZSTD_compressionParameters cParams; // 24594
	ZSTD_overrideCParams(ZSTD_compressionParameters* cParams,
				const ZSTD_compressionParameters* overrides);  // 24601
} /* size: 303, variables: 1, inline expansions: 1 (34 bytes) */

// <06FEFEE8> thirdparty/zstd/zstd.c:24608
// variables: 9
size_t ZSTD_sizeof_matchState(const ZSTD_compressionParameters* cParams, const ZSTD_ParamSwitch_e useRowMatchFinder, const int enableDedicatedDictSearch, const U32 forCCtx)
{
	const size_t  chainSize; // 24614
	const size_t  hSize; // 24617
	const U32  hashLog3; // 24618
	const size_t  h3Size; // 24619
	const size_t  tableSpace; // 24622
	const size_t  optPotentialSpace; // 24625
	const size_t  lazyAdditionalSpace; // 24632
	const size_t  optSpace; // 24635
	const size_t  slackSpace; // 24638
} /* size: 0, variables: 9 */

// <06FEFEA1> thirdparty/zstd/zstd.c:24651
// variable: 1
size_t ZSTD_maxNbSeq(size_t blockSize, unsigned int minMatch, int useSequenceProducer)
{
	const U32  divider; // 24652
} /* size: 0, variables: 1 */

// <06FEF7B6> thirdparty/zstd/zstd.c:24656
// variables: 15
// function calls: 21
size_t ZSTD_estimateCCtxSize_usingCCtxParams_internal(const ZSTD_compressionParameters* cParams, const ldmParams_t* ldmParams, const int isStatic, const ZSTD_ParamSwitch_e useRowMatchFinder, const size_t buffInSize, const size_t buffOutSize, const U64 pledgedSrcSize, int useSequenceProducer, size_t maxBlockSize)
{
	const size_t  windowSize; // 24667
	const size_t  blockSize; // 24668
	const size_t  maxNbSeq; // 24669
	const size_t  tokenSpace; // 24670
	const size_t  tmpWorkSpace; // 24673
	const size_t  blockStateSpace; // 24674
	const size_t  matchStateSize; // 24675
	const size_t  ldmSpace; // 24677
	const size_t  maxNbLdmSeq; // 24678
	const size_t  ldmSeqSpace; // 24679
	const size_t  bufferSpace; // 24683
	const size_t  cctxSpace; // 24686
	const size_t  maxNbExternalSeq; // 24688
	const size_t  externalSeqSpace; // 24689
	const size_t  neededSpace; // 24693
	ZSTD_maxNbSeq(size_t blockSize,
			unsigned int minMatch,
			int useSequenceProducer);  // 24669
	ZSTD_resolveMaxBlockSize(size_t maxBlockSize); // 24668
	ZSTD_cwksp_align(size_t size,
			size_t align);  // 18508
	ZSTD_cwksp_aligned_alloc_size(size_t size,
					size_t alignment);  // 18516
	ZSTD_cwksp_aligned64_alloc_size(size_t size); // 24671
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
	ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  mode);  // 23216
	ZSTD_allocateChainTable(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  useRowMatchFinder,
				const U32  forDDSDict);  // 24614
	ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  mode);  // 24632
	ZSTD_cwksp_align(size_t size,
			size_t align);  // 18508
	ZSTD_cwksp_aligned_alloc_size(size_t size,
					size_t alignment);  // 18516
	ZSTD_cwksp_aligned64_alloc_size(size_t size); // 24633
	ZSTD_sizeof_matchState(const ZSTD_compressionParameters* cParams,
				const ZSTD_ParamSwitch_e  useRowMatchFinder,
				const int  enableDedicatedDictSearch,
				const U32  forCCtx);  // 24675
	ZSTD_ldm_getTableSize(ldmParams_t params); // 24677
	ZSTD_ldm_getMaxNbSeq(ldmParams_t params,
				size_t maxChunkSize);  // 24678
	ZSTD_cwksp_align(size_t size,
			size_t align);  // 18508
	ZSTD_cwksp_aligned_alloc_size(size_t size,
					size_t alignment);  // 18516
	ZSTD_cwksp_aligned64_alloc_size(size_t size); // 24680
	ZSTD_cwksp_align(size_t size,
			size_t align);  // 18508
	ZSTD_cwksp_aligned_alloc_size(size_t size,
					size_t alignment);  // 18516
	ZSTD_cwksp_aligned64_alloc_size(size_t size); // 24690
} /* size: 751, variables: 15, inline expansions: 21 (778 bytes) */

// <06FEF622> thirdparty/zstd/zstd.c:24708
// variables: 2
// function calls: 4
size_t ZSTD_estimateCCtxSize_usingCCtxParams(const ZSTD_CCtx_params* params)
{
	const ZSTD_compressionParameters  cParams; // 24710
	const ZSTD_ParamSwitch_e  useRowMatchFinder; // 24712
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23196
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 23192
	ZSTD_resolveRowMatchFinderMode(ZSTD_ParamSwitch_e mode,
					const ZSTD_compressionParameters* cParams);  // 24712
	ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params); // 24719
} /* size: 192, variables: 2, inline expansions: 4 (83 bytes) */

// <06FEF503> thirdparty/zstd/zstd.c:24723
// variables: 3
// function call: 1
size_t ZSTD_estimateCCtxSize_usingCParams(ZSTD_compressionParameters cParams)
{
	ZSTD_CCtx_params initialParams; // 24725
	{
		size_t noRowCCtxSize; // 24728
		size_t rowCCtxSize; // 24729
	}
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 24726
} /* size: 194, variables: 1, inline expansions: 1 (6 bytes) */

// <06FEF48E> thirdparty/zstd/zstd.c:24740
// variables: 4
size_t ZSTD_estimateCCtxSize_internal(int compressionLevel)
{
	int tier; // 24742
	size_t largestSize; // 24743
	const long long unsigned int   srcSizeTiers; // 24744
	{
		const ZSTD_compressionParameters  cParams; // 24747
	}
} /* size: 0, variables: 3 */

// <06FEF377> thirdparty/zstd/zstd.c:24753
// variables: 4
// function call: 1
size_t ZSTD_estimateCCtxSize(int compressionLevel)
{
	int level; // 24755
	size_t memBudget; // 24756
	{
		const size_t  newMB; // 24759
		{
			const ZSTD_compressionParameters  cParams; // 24747
		}
		ZSTD_estimateCCtxSize_internal(int compressionLevel); // 24759
	}
} /* size: 272, variables: 2 */

// <06FEF313> thirdparty/zstd/zstd.c:24765
// variables: 5
size_t ZSTD_estimateCStreamSize_usingCCtxParams(const ZSTD_CCtx_params* params)
{
	{
		const ZSTD_compressionParameters  cParams; // 24768
		const size_t  blockSize; // 24770
		const size_t  inBuffSize; // 24771
		const size_t  outBuffSize; // 24774
		const ZSTD_ParamSwitch_e  useRowMatchFinder; // 24777
	}
} /* size: 0 */

// <06FEF1F4> thirdparty/zstd/zstd.c:24785
// variables: 3
// function call: 1
size_t ZSTD_estimateCStreamSize_usingCParams(ZSTD_compressionParameters cParams)
{
	ZSTD_CCtx_params initialParams; // 24787
	{
		size_t noRowCCtxSize; // 24790
		size_t rowCCtxSize; // 24791
	}
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 24788
} /* size: 194, variables: 1, inline expansions: 1 (6 bytes) */

// <06FEF1C7> thirdparty/zstd/zstd.c:24802
// variable: 1
size_t ZSTD_estimateCStreamSize_internal(int compressionLevel)
{
	const ZSTD_compressionParameters  cParams; // 24804
} /* size: 0, variables: 1 */

// <06FEF0B2> thirdparty/zstd/zstd.c:24808
// variables: 3
// function call: 1
size_t ZSTD_estimateCStreamSize(int compressionLevel)
{
	int level; // 24810
	size_t memBudget; // 24811
	{
		const size_t  newMB; // 24813
		ZSTD_estimateCStreamSize_internal(int compressionLevel); // 24813
	}
} /* size: 176, variables: 2 */

// <06FEF010> thirdparty/zstd/zstd.c:24823
// variables: 2
ZSTD_frameProgression ZSTD_getFrameProgression(const ZSTD_CCtx* cctx)
{
	{
		ZSTD_frameProgression fp; // 24830
		const size_t  buffered; // 24831
	}
} /* size: 155 */

// <06FEEFC6> thirdparty/zstd/zstd.c:24847
size_t ZSTD_toFlushNow(ZSTD_CCtx* cctx)
{
} /* size: 36 */

// <06FEEF9D> thirdparty/zstd/zstd.c:24858
void ZSTD_assertEqualCParams(ZSTD_compressionParameters cParams1, ZSTD_compressionParameters cParams2)
{
} /* size: 0 */

// <06FEEF72> thirdparty/zstd/zstd.c:24872
// variable: 1
void ZSTD_reset_compressedBlockState(ZSTD_compressedBlockState_t* bs)
{
	int i; // 24874
} /* size: 0, variables: 1 */

// <06FEEF57> thirdparty/zstd/zstd.c:24887
void ZSTD_invalidateMatchState(ZSTD_MatchState_t* ms)
{
} /* size: 0 */

// <06FEEF2A> thirdparty/zstd/zstd.c:24925
U64 ZSTD_bitmix(U64 val, U64 len)
{
} /* size: 0 */

// <06FEEF0F> thirdparty/zstd/zstd.c:24934
void ZSTD_advanceHashSalt(ZSTD_MatchState_t* ms)
{
} /* size: 0 */

// <06FED522> thirdparty/zstd/zstd.c:24939
// variables: 39
// function calls: 90
size_t ZSTD_reset_matchState(ZSTD_MatchState_t* ms, ZSTD_cwksp* ws, const ZSTD_compressionParameters* cParams, const ZSTD_ParamSwitch_e useRowMatchFinder, const ZSTD_compResetPolicy_e crp, const ZSTD_indexResetPolicy_e forceResetIndex, const ZSTD_resetTarget_e forWho)
{
	const size_t  chainSize; // 24948
	const size_t  hSize; // 24952
	const U32  hashLog3; // 24953
	const size_t  h3Size; // 24954
	{
		const size_t  tagTableSize; // 24988
		{
			const U32  rowLog; // 25001
		}
		ZSTD_cwksp_align(size_t size,
				size_t align);  // 18683
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18684
		ZSTD_cwksp_reserve_aligned_init_once(ZSTD_cwksp* ws,
							size_t bytes);  // 24992
		ZSTD_rotateRight_U64(const U64  value,
					U32 count);  // 24926
		ZSTD_rotateRight_U64(const U64  value,
					U32 count);  // 24926
		ZSTD_bitmix(U64 val,
				U64 len);  // 24935
		ZSTD_rotateRight_U64(const U64  value,
					U32 count);  // 24926
		ZSTD_rotateRight_U64(const U64  value,
					U32 count);  // 24926
		ZSTD_bitmix(U64 val,
				U64 len);  // 24935
		ZSTD_advanceHashSalt(ZSTD_MatchState_t* ms); // 24993
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18707
		ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
						size_t bytes);  // 24996
	}
	ZSTD_window_clear(ZSTD_window_t* window); // 24889
	ZSTD_invalidateMatchState(ZSTD_MatchState_t* ms); // 24966
	ZSTD_cwksp_clear_tables(ZSTD_cwksp* ws); // 24970
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18729
	ZSTD_cwksp_reserve_table(ZSTD_cwksp* ws,
				size_t bytes);  // 24974
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18729
	ZSTD_cwksp_reserve_table(ZSTD_cwksp* ws,
				size_t bytes);  // 24975
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18729
	ZSTD_cwksp_reserve_table(ZSTD_cwksp* ws,
				size_t bytes);  // 24976
	ZSTD_cwksp_reserve_failed(const ZSTD_cwksp* ws); // 24977
	ZSTD_cwksp_mark_tables_clean(ZSTD_cwksp* ws); // 18866
	ZSTD_cwksp_clean_tables(ZSTD_cwksp* ws); // 24983
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
	ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  mode);  // 24986
	ZSTD_cwksp_reserve_failed(const ZSTD_cwksp* ws); // 25020
	ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
	ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  mode);  // 23216
	ZSTD_allocateChainTable(const ZSTD_strategy  strategy,
				const ZSTD_ParamSwitch_e  useRowMatchFinder,
				const U32  forDDSDict);  // 24948
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25010
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25011
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25012
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25013
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25014
	ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
	{
		const void* alloc; // 18603
		const size_t  bytesToAlign; // 18604
		const void* objectEnd; // 18605
		ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
						const size_t  alignBytes);  // 18604
	}
	ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
	ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
						ZSTD_cwksp_alloc_phase_e phase);  // 18637
	ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
						const size_t  bytes);  // 18646
	ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
					size_t bytes,
					ZSTD_cwksp_alloc_phase_e phase);  // 18707
	ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
					size_t bytes);  // 25015
	ZSTD_window_init(ZSTD_window_t* window); // 24959
	ZSTD_cwksp_mark_tables_dirty(ZSTD_cwksp* ws); // 24960
} /* size: 2926, variables: 4, inline expansions: 59 (4237 bytes) */

// <06FED504> thirdparty/zstd/zstd.c:25033
int ZSTD_indexTooCloseToMax(ZSTD_window_t w)
{
} /* size: 0 */

// <06FED4E4> thirdparty/zstd/zstd.c:25043
int ZSTD_dictTooBig(const size_t loadedDictSize)
{
} /* size: 0 */

// <06FEB419> thirdparty/zstd/zstd.c:25054
// variables: 53
// function calls: 110
size_t ZSTD_resetCCtx_internal(ZSTD_CCtx* zc, const ZSTD_CCtx_params* params, const U64 pledgedSrcSize, const size_t loadedDictSize, const ZSTD_compResetPolicy_e crp, const ZSTD_buffered_policy_e zbuff)
{
	const ZSTD_cwksp* ws; // 25061
	{
		const size_t  windowSize; // 25085
		const size_t  blockSize; // 25086
		const size_t  maxNbSeq; // 25087
		const size_t  buffOutSize; // 25088
		const size_t  buffInSize; // 25091
		const size_t  maxNbLdmSeq; // 25094
		const int  indexTooClose; // 25096
		const int  dictTooBig; // 25097
		ZSTD_indexResetPolicy_e needsIndexReset; // 25098
		const size_t  neededSpace; // 25101
		{
			const size_t  err_code; // 25106
		}
		{
			const int  workspaceTooSmall; // 25111
			const int  workspaceWasteful; // 25112
			int resizeWorkspace; // 25113
			{
				const size_t  err_code; // 25127
				ZSTD_customMalloc(size_t size,
							ZSTD_customMem customMem);  // 18963
				ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18954
				ZSTD_cwksp_init(ZSTD_cwksp* ws,
						void* start,
						size_t size,
						ZSTD_cwksp_static_alloc_e isStatic);  // 18966
				ZSTD_cwksp_create(ZSTD_cwksp* ws,
							size_t size,
							ZSTD_customMem customMem);  // 25127
			}
			ZSTD_cwksp_sizeof(const ZSTD_cwksp* ws); // 25111
			ZSTD_cwksp_available_space(ZSTD_cwksp* ws); // 19016
			ZSTD_cwksp_check_available(ZSTD_cwksp* ws,
							size_t additionalNeededSpace);  // 19020
			ZSTD_cwksp_check_too_large(ZSTD_cwksp* ws,
							size_t additionalNeededSpace);  // 19025
			ZSTD_cwksp_check_wasteful(ZSTD_cwksp* ws,
							size_t additionalNeededSpace);  // 25112
			ZSTD_customFree(void* ptr,
					ZSTD_customMem customMem);  // 18979
			ZSTD_cwksp_free(ZSTD_cwksp* ws,
					ZSTD_customMem customMem);  // 25126
			ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
							size_t bytes);  // 25134
			ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
							size_t bytes);  // 25136
			ZSTD_cwksp_reserve_object(ZSTD_cwksp* ws,
							size_t bytes);  // 25138
		}
		{
			const size_t  err_code; // 25164
		}
		{
			const size_t  ldmHSize; // 25178
			ZSTD_cwksp_align(size_t size,
					size_t align);  // 18707
			ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
			{
				const void* alloc; // 18603
				const size_t  bytesToAlign; // 18604
				const void* objectEnd; // 18605
				ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
								const size_t  alignBytes);  // 18604
			}
			ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
			ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
								ZSTD_cwksp_alloc_phase_e phase);  // 18637
			ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
								const size_t  bytes);  // 18646
			ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
							size_t bytes,
							ZSTD_cwksp_alloc_phase_e phase);  // 18707
			ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
							size_t bytes);  // 25179
			ZSTD_cwksp_align(size_t size,
					size_t align);  // 18707
			ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
			{
				const void* alloc; // 18603
				const size_t  bytesToAlign; // 18604
				const void* objectEnd; // 18605
				ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
								const size_t  alignBytes);  // 18604
			}
			ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
			ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
								ZSTD_cwksp_alloc_phase_e phase);  // 18637
			ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
								const size_t  bytes);  // 18646
			ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
							size_t bytes,
							ZSTD_cwksp_alloc_phase_e phase);  // 18707
			ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
							size_t bytes);  // 25181
			ZSTD_window_init(ZSTD_window_t* window); // 25184
		}
		{
			const size_t  maxNbExternalSeq; // 25190
			ZSTD_cwksp_align(size_t size,
					size_t align);  // 18707
			ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
			{
				const void* alloc; // 18603
				const size_t  bytesToAlign; // 18604
				const void* objectEnd; // 18605
				ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
								const size_t  alignBytes);  // 18604
			}
			ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
			ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
								ZSTD_cwksp_alloc_phase_e phase);  // 18637
			ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
								const size_t  bytes);  // 18646
			ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
							size_t bytes,
							ZSTD_cwksp_alloc_phase_e phase);  // 18707
			ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
							size_t bytes);  // 25193
		}
		{
			const size_t  numBuckets; // 25213
			ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
			{
				const void* alloc; // 18603
				const size_t  bytesToAlign; // 18604
				const void* objectEnd; // 18605
				ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
								const size_t  alignBytes);  // 18604
			}
			ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
			ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
								ZSTD_cwksp_alloc_phase_e phase);  // 18637
			ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
								const size_t  bytes);  // 18646
			ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
							size_t bytes,
							ZSTD_cwksp_alloc_phase_e phase);  // 18669
			ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
							size_t bytes);  // 25216
		}
		ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params); // 25087
		ZSTD_maxNbSeq(size_t blockSize,
				unsigned int minMatch,
				int useSequenceProducer);  // 25087
		ZSTD_ldm_getMaxNbSeq(ldmParams_t params,
					size_t maxChunkSize);  // 25094
		ZSTD_indexTooCloseToMax(ZSTD_window_t w); // 25096
		ZSTD_dictTooBig(const size_t loadedDictSize); // 25097
		ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params); // 25102
		ZSTD_cwksp_bump_oversized_duration(ZSTD_cwksp* ws,
							size_t additionalNeededSpace);  // 25108
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18925
		ZSTD_cwksp_clear(ZSTD_cwksp* ws); // 25143
		memset(void* __dest,
			int __ch,
			size_t __len);  // 11842
		XXH_INLINE_XXH64_reset(XXH_NAMESPACEXXH64_state_t* statePtr,
					XXH64_hash_t seed);  // 25157
		ZSTD_reset_compressedBlockState(ZSTD_compressedBlockState_t* bs); // 25162
		ZSTD_cwksp_align(size_t size,
				size_t align);  // 18707
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18707
		ZSTD_cwksp_reserve_aligned64(ZSTD_cwksp* ws,
						size_t bytes);  // 25173
		ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params); // 25189
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25201
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25206
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25208
		ZSTD_referenceExternalSequences(ZSTD_CCtx* cctx,
						rawSeq* seq,
						size_t nbSeq);  // 25221
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25223
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25224
		ZSTD_cwksp_initialAllocStart(ZSTD_cwksp* ws); // 18600
		{
			const void* alloc; // 18603
			const size_t  bytesToAlign; // 18604
			const void* objectEnd; // 18605
			ZSTD_cwksp_bytes_to_align_ptr(void* ptr,
							const size_t  alignBytes);  // 18604
		}
		ZSTD_cwksp_assert_internal_consistency(ZSTD_cwksp* ws); // 18617
		ZSTD_cwksp_internal_advance_phase(ZSTD_cwksp* ws,
							ZSTD_cwksp_alloc_phase_e phase);  // 18637
		ZSTD_cwksp_reserve_internal_buffer_space(ZSTD_cwksp* ws,
							const size_t  bytes);  // 18646
		ZSTD_cwksp_reserve_internal(ZSTD_cwksp* ws,
						size_t bytes,
						ZSTD_cwksp_alloc_phase_e phase);  // 18669
		ZSTD_cwksp_reserve_buffer(ZSTD_cwksp* ws,
						size_t bytes);  // 25225
	}
} /* size: 4530, variables: 1 */

// <06FEB3ED> thirdparty/zstd/zstd.c:25240
// variable: 1
void ZSTD_invalidateRepCodes(ZSTD_CCtx* cctx)
{
	int i; // 25241
} /* size: 0, variables: 1 */

// <06FEB399> thirdparty/zstd/zstd.c:25263
// variables: 2
int ZSTD_shouldAttachDict(const ZSTD_CDict* cdict, const ZSTD_CCtx_params* params, U64 pledgedSrcSize)
{
	size_t cutoff; // 25267
	const int  dedicatedDictSearch; // 25268
} /* size: 0, variables: 2 */

// <06FEB2FA> thirdparty/zstd/zstd.c:25279
// variables: 5
size_t ZSTD_resetCCtx_byAttachingCDict(ZSTD_CCtx* cctx, const ZSTD_CDict* cdict, ZSTD_CCtx_params params, U64 pledgedSrcSize, ZSTD_buffered_policy_e zbuff)
{
	{
		ZSTD_compressionParameters adjusted_cdict_cParams; // 25288
		const unsigned int  windowLog; // 25289
		{
			const size_t  err_code; // 25304
		}
	}
	{
		const U32  cdictEnd; // 25310
		const U32  cdictLen; // 25312
	}
} /* size: 0 */

// <06FEB28E> thirdparty/zstd/zstd.c:25340
// variables: 3
void ZSTD_copyCDictTableIntoCCtx(U32* dst, const U32* src, size_t tableSize, const ZSTD_compressionParameters* cParams)
{
	{
		size_t i; // 25345
		{
			const U32  taggedIndex; // 25347
			const U32  index; // 25348
		}
	}
} /* size: 0 */

// <06FEB1A0> thirdparty/zstd/zstd.c:25356
// variables: 10
size_t ZSTD_resetCCtx_byCopyingCDict(ZSTD_CCtx* cctx, const ZSTD_CDict* cdict, ZSTD_CCtx_params params, U64 pledgedSrcSize, ZSTD_buffered_policy_e zbuff)
{
	const ZSTD_compressionParameters* cdict_cParams; // 25362
	{
		const unsigned int  windowLog; // 25368
		{
			const size_t  err_code; // 25374
		}
	}
	{
		const size_t  chainSize; // 25386
		const size_t  hSize; // 25389
		{
			const size_t  tagTableSize; // 25403
		}
	}
	{
		const U32  h3log; // 25413
		const size_t  h3Size; // 25414
	}
	{
		const ZSTD_MatchState_t* srcMatchState; // 25422
		ZSTD_MatchState_t* dstMatchState; // 25423
	}
} /* size: 0, variables: 1 */

// <06FEB14C> thirdparty/zstd/zstd.c:25441
size_t ZSTD_resetCCtx_usingCDict(ZSTD_CCtx* cctx, const ZSTD_CDict* cdict, const ZSTD_CCtx_params* params, U64 pledgedSrcSize, ZSTD_buffered_policy_e zbuff)
{
} /* size: 0 */

// <06FEB08F> thirdparty/zstd/zstd.c:25467
// variables: 7
size_t ZSTD_copyCCtx_internal(ZSTD_CCtx* dstCCtx, const ZSTD_CCtx* srcCCtx, ZSTD_frameParameters fParams, U64 pledgedSrcSize, ZSTD_buffered_policy_e zbuff)
{
	{
		ZSTD_CCtx_params params; // 25477
	}
	{
		const size_t  chainSize; // 25501
		const size_t  hSize; // 25506
		const U32  h3log; // 25507
		const size_t  h3Size; // 25508
	}
	{
		const ZSTD_MatchState_t* srcMatchState; // 25525
		ZSTD_MatchState_t* dstMatchState; // 25526
	}
} /* size: 0 */

// <06FEAD5C> thirdparty/zstd/zstd.c:25545
// variables: 9
// function calls: 6
size_t ZSTD_copyCCtx(ZSTD_CCtx* dstCCtx, const ZSTD_CCtx* srcCCtx, long long unsigned int pledgedSrcSize)
{
	ZSTD_frameParameters fParams; // 25547
	const ZSTD_buffered_policy_e  zbuff; // 25548
	{
		ZSTD_CCtx_params params; // 25477
	}
	{
		const size_t  chainSize; // 25501
		const size_t  hSize; // 25506
		const U32  h3log; // 25507
		const size_t  h3Size; // 25508
		ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
		ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
					const ZSTD_ParamSwitch_e  mode);  // 23216
		ZSTD_allocateChainTable(const ZSTD_strategy  strategy,
					const ZSTD_ParamSwitch_e  useRowMatchFinder,
					const U32  forDDSDict);  // 25501
	}
	ZSTD_cwksp_mark_tables_dirty(ZSTD_cwksp* ws); // 25498
	ZSTD_cwksp_mark_tables_clean(ZSTD_cwksp* ws); // 25521
	{
		const ZSTD_MatchState_t* srcMatchState; // 25525
		ZSTD_MatchState_t* dstMatchState; // 25526
	}
	ZSTD_copyCCtx_internal(ZSTD_CCtx* dstCCtx,
				const ZSTD_CCtx* srcCCtx,
				ZSTD_frameParameters fParams,
				U64 pledgedSrcSize,
				ZSTD_buffered_policy_e zbuff);  // 25553
} /* size: 777, variables: 2, inline expansions: 3 (691 bytes) */

// <06FEACC7> thirdparty/zstd/zstd.c:25567
// variables: 6
inline void ZSTD_reduceTable_internal(const U32* table, const U32 size, const U32 reducerValue, const int preserveMark)
{
	const int  nbRows; // 25569
	int cellNb; // 25570
	int rowNb; // 25571
	const U32  reducerThreshold; // 25573
	{
		int column; // 25591
		{
			U32 newVal; // 25593
		}
	}
} /* size: 0, variables: 4 */

// <06FEAC91> thirdparty/zstd/zstd.c:25608
void ZSTD_reduceTable(const U32* table, const U32 size, const U32 reducerValue)
{
} /* size: 0 */

// <06FEAC5B> thirdparty/zstd/zstd.c:25613
void ZSTD_reduceTable_btlazy2(const U32* table, const U32 size, const U32 reducerValue)
{
} /* size: 0 */

// <06FEABF1> thirdparty/zstd/zstd.c:25620
// variables: 3
void ZSTD_reduceIndex(ZSTD_MatchState_t* ms, const ZSTD_CCtx_params* params, const U32 reducerValue)
{
	{
		const U32  hSize; // 25622
	}
	{
		const U32  chainSize; // 25627
	}
	{
		const U32  h3Size; // 25635
	}
} /* size: 0 */

// <06FEA9B1> thirdparty/zstd/zstd.c:25647
// variables: 10
// function calls: 8
int ZSTD_seqToCodes(const SeqStore_t* seqStorePtr)
{
	const SeqDef* sequences; // 25649
	const BYTE* llCodeTable; // 25650
	const BYTE* ofCodeTable; // 25651
	const BYTE* mlCodeTable; // 25652
	const U32  nbSeq; // 25653
	U32 u; // 25654
	int longOffsets; // 25655
	{
		const U32  llv; // 25658
		const U32  ofCode; // 25659
		const U32  mlv; // 25660
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 19749
		ZSTD_LLcode(U32 litLength); // 25661
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 19766
		ZSTD_MLcode(U32 mlBase); // 25663
		ZSTD_countLeadingZeros32(U32 val); // 2106
		ZSTD_highbit32(U32 val); // 25659
	}
} /* size: 291, variables: 7 */

// <06FEA991> thirdparty/zstd/zstd.c:25679
int ZSTD_useTargetCBlockSize(const ZSTD_CCtx_params* cctxParams)
{
} /* size: 0 */

// <06FEA971> thirdparty/zstd/zstd.c:25690
int ZSTD_blockSplitterEnabled(ZSTD_CCtx_params* cctxParams)
{
} /* size: 0 */

// <06F3D611> thirdparty/zstd/zstd.c:25700
// member variables: 6
// struct size: 40
typedef struct {
	U32 LLtype; /* 0 4 */
	U32 Offtype; /* 4 4 */
	U32 MLtype; /* 8 4 */
	size_t size; /* 16 8 */
	size_t lastCountSize; /* 24 8 */
	int longOffsets; /* 32 4 */
} ZSTD_symbolEncodingTypeStats_t;

// <06FEA160> thirdparty/zstd/zstd.c:25717
// variables: 20
// function calls: 6
ZSTD_symbolEncodingTypeStats_t ZSTD_buildSequencesStatistics(const SeqStore_t* seqStorePtr, size_t nbSeq, const ZSTD_fseCTables_t* prevEntropy, ZSTD_fseCTables_t* nextEntropy, BYTE* dst, const BYTE* dstEnd, ZSTD_strategy strategy, unsigned int* countWorkspace, void* entropyWorkspace, size_t entropyWkspSize)
{
	const BYTE* ostart; // 25724
	const BYTE* oend; // 25725
	BYTE* op; // 25726
	FSE_CTable* CTable_LitLength; // 25727
	FSE_CTable* CTable_OffsetBits; // 25728
	FSE_CTable* CTable_MatchLength; // 25729
	const BYTE* ofCodeTable; // 25730
	const BYTE* llCodeTable; // 25731
	const BYTE* mlCodeTable; // 25732
	ZSTD_symbolEncodingTypeStats_t stats; // 25733
	{
		unsigned int max; // 25741
		const size_t  mostFrequent; // 25742
		{
			const size_t  countSize; // 25752
		}
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16714
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 25742
	}
	{
		unsigned int max; // 25771
		const size_t  mostFrequent; // 25772
		const ZSTD_DefaultPolicy_e  defaultPolicy; // 25775
		{
			const size_t  countSize; // 25784
		}
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16714
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 25772
	}
	{
		unsigned int max; // 25803
		const size_t  mostFrequent; // 25804
		{
			const size_t  countSize; // 25814
		}
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 16714
		HIST_countFast_wksp(unsigned int* count,
					unsigned int* maxSymbolValuePtr,
					const void* source,
					size_t sourceSize,
					void* workSpace,
					size_t workSpaceSize);  // 25804
	}
} /* size: 1302, variables: 10 */

// <06FE9B87> thirdparty/zstd/zstd.c:25842
// variables: 24
// function calls: 5
size_t ZSTD_entropyCompressSeqStore_internal(void* dst, size_t dstCapacity, const void* literals, size_t litSize, const SeqStore_t* seqStorePtr, const ZSTD_entropyCTables_t* prevEntropy, ZSTD_entropyCTables_t* nextEntropy, const ZSTD_CCtx_params* cctxParams, void* entropyWorkspace, size_t entropyWkspSize, const int bmi2)
{
	const ZSTD_strategy  strategy; // 25852
	unsigned int* count; // 25853
	FSE_CTable* CTable_LitLength; // 25854
	FSE_CTable* CTable_OffsetBits; // 25855
	FSE_CTable* CTable_MatchLength; // 25856
	const SeqDef* sequences; // 25857
	const size_t  nbSeq; // 25858
	const BYTE* ofCodeTable; // 25859
	const BYTE* llCodeTable; // 25860
	const BYTE* mlCodeTable; // 25861
	const BYTE* ostart; // 25862
	const BYTE* oend; // 25863
	BYTE* op; // 25864
	size_t lastCountSize; // 25865
	int longOffsets; // 25866
	{
		const size_t  numSequences; // 25876
		const int  suspectUncompressible; // 25878
		const size_t  cSize; // 25880
		{
			const size_t  err_code; // 25888
		}
		ZSTD_literalsCompressionIsDisabled(const ZSTD_CCtx_params* cctxParams); // 19839
		ZSTD_literalsCompressionIsDisabled(const ZSTD_CCtx_params* cctxParams); // 25880
	}
	{
		const BYTE* seqHead; // 25913
		const ZSTD_symbolEncodingTypeStats_t  stats; // 25915
		{
			const size_t  err_code; // 25921
		}
	}
	{
		const size_t  bitstreamSize; // 25928
		{
			const size_t  err_code; // 25935
		}
		ZSTD_encodeSequences(void* dst,
					size_t dstCapacity,
					const FSE_CTable* CTable_MatchLength,
					const BYTE* mlCodeTable,
					const FSE_CTable* CTable_OffsetBits,
					const BYTE* ofCodeTable,
					const FSE_CTable* CTable_LitLength,
					const BYTE* llCodeTable,
					const SeqDef* sequences,
					size_t nbSeq,
					int longOffsets,
					int bmi2);  // 25928
	}
	MEM_write16(void* memPtr,
			U16 value);  // 1279
	MEM_writeLE16(void* memPtr,
			U16 val);  // 25904
} /* size: 844, variables: 15, inline expansions: 2 (0 bytes) */

// <06FE9AA9> thirdparty/zstd/zstd.c:25960
// variables: 3
size_t ZSTD_entropyCompressSeqStore_wExtLitBuffer(void* dst, size_t dstCapacity, const void* literals, size_t litSize, size_t blockSize, const SeqStore_t* seqStorePtr, const ZSTD_entropyCTables_t* prevEntropy, ZSTD_entropyCTables_t* nextEntropy, const ZSTD_CCtx_params* cctxParams, void* entropyWorkspace, size_t entropyWkspSize, int bmi2)
{
	const size_t  cSize; // 25971
	{
		const size_t  err_code; // 25984
	}
	{
		const size_t  maxCSize; // 25987
	}
} /* size: 0, variables: 1 */

// <07096506> thirdparty/zstd/zstd.c:25999
// variables: 2
// function calls: 2
size_t ZSTD_entropyCompressSeqStore(const SeqStore_t* seqStorePtr, const ZSTD_entropyCTables_t* prevEntropy, ZSTD_entropyCTables_t* nextEntropy, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, size_t srcSize, void* entropyWorkspace, size_t entropyWkspSize, int bmi2)
{
	{
		const size_t  err_code; // 25984
	}
	{
		const size_t  maxCSize; // 25987
		ZSTD_minGain(size_t srcSize,
				ZSTD_strategy strat);  // 25987
	}
	ZSTD_entropyCompressSeqStore_wExtLitBuffer(void* dst,
							size_t dstCapacity,
							const void* literals,
							size_t litSize,
							size_t blockSize,
							const SeqStore_t* seqStorePtr,
							const ZSTD_entropyCTables_t* prevEntropy,
							ZSTD_entropyCTables_t* nextEntropy,
							const ZSTD_CCtx_params* cctxParams,
							void* entropyWorkspace,
							size_t entropyWkspSize,
							int bmi2);  // 26009
} /* size: 162, inline expansions: 1 (108 bytes) */

// <06FE9A14> thirdparty/zstd/zstd.c:25999
size_t ZSTD_entropyCompressSeqStore(const SeqStore_t* seqStorePtr, const ZSTD_entropyCTables_t* prevEntropy, ZSTD_entropyCTables_t* nextEntropy, const ZSTD_CCtx_params* cctxParams, void* dst, size_t dstCapacity, size_t srcSize, void* entropyWorkspace, size_t entropyWkspSize, int bmi2)
{
} /* size: 0 */

// <06FE9962> thirdparty/zstd/zstd.c:26023
// variables: 3
ZSTD_BlockCompressor_f ZSTD_selectBlockCompressor(ZSTD_strategy strat, ZSTD_ParamSwitch_e useRowMatchFinder, ZSTD_dictMode_e dictMode)
{
	const ZSTD_BlockCompressor_f   blockCompressor; // 26025
	ZSTD_BlockCompressor_f selectedCompressor; // 26070
	{
		const ZSTD_BlockCompressor_f   rowBasedBlockCompressors; // 26076
	}
} /* size: 0, variables: 2 */

// <06FE992C> thirdparty/zstd/zstd.c:26108
void ZSTD_storeLastLiterals(SeqStore_t* seqStorePtr, const BYTE* anchor, size_t lastLLSize)
{
} /* size: 0 */

// <06FE990B> thirdparty/zstd/zstd.c:26115
void ZSTD_resetSeqStore(SeqStore_t* ssPtr)
{
} /* size: 0 */

// <06FE98B5> thirdparty/zstd/zstd.c:26128
// variable: 1
size_t ZSTD_postProcessSequenceProducerResult(ZSTD_Sequence* outSeqs, size_t nbExternalSeqs, size_t outSeqsCapacity, size_t srcSize)
{
	{
		const ZSTD_Sequence  lastSeq; // 26150
	}
} /* size: 0 */

// <06FE9863> thirdparty/zstd/zstd.c:26177
// variables: 3
size_t ZSTD_fastSequenceLengthSum(const ZSTD_Sequence* seqBuf, size_t seqBufSize)
{
	size_t matchLenSum; // 26178
	size_t litLenSum; // 26178
	size_t i; // 26178
} /* size: 0, variables: 3 */

// <06FE983A> thirdparty/zstd/zstd.c:26191
void ZSTD_validateSeqStore(const SeqStore_t* seqStore, const ZSTD_compressionParameters* cParams)
{
} /* size: 0 */

// <06FE90DA> thirdparty/zstd/zstd.c:26218
// variables: 19
// function calls: 14
size_t ZSTD_buildSeqStore(ZSTD_CCtx* zc, const void* src, size_t srcSize)
{
	const ZSTD_MatchState_t* ms; // 26220
	{
		const BYTE* base; // 26246
		const BYTE* istart; // 26247
		const U32  curr; // 26248
	}
	{
		const ZSTD_dictMode_e  dictMode; // 26255
		size_t lastLLSize; // 26256
		{
			int i; // 26257
		}
		{
			RawSeqStore_t ldmSeqStore; // 26281
			{
				const size_t  err_code; // 26294
			}
		}
		{
			const U32  windowSize; // 26311
			const size_t  nbExternalSeqs; // 26313
			const size_t  nbPostProcessedSeqs; // 26323
			{
				ZSTD_SequencePosition seqPos; // 26332
				const size_t  seqLenSum; // 26333
				{
					const size_t  err_code; // 26335
				}
				ZSTD_fastSequenceLengthSum(const ZSTD_Sequence* seqBuf,
								size_t seqBufSize);  // 26333
			}
			{
				const ZSTD_BlockCompressor_f  blockCompressor; // 26355
				ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
				ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
							const ZSTD_ParamSwitch_e  mode);  // 26075
				{
				}
				ZSTD_selectBlockCompressor(ZSTD_strategy strat,
								ZSTD_ParamSwitch_e useRowMatchFinder,
								ZSTD_dictMode_e dictMode);  // 26356
			}
			{
				const ZSTD_Sequence  lastSeq; // 26150
			}
			ZSTD_postProcessSequenceProducerResult(ZSTD_Sequence* outSeqs,
								size_t nbExternalSeqs,
								size_t outSeqsCapacity,
								size_t srcSize);  // 26323
		}
		{
			const ZSTD_BlockCompressor_f  blockCompressor; // 26369
			ZSTD_rowMatchFinderSupported(const ZSTD_strategy strategy); // 23188
			ZSTD_rowMatchFinderUsed(const ZSTD_strategy  strategy,
						const ZSTD_ParamSwitch_e  mode);  // 26075
			{
			}
			ZSTD_selectBlockCompressor(ZSTD_strategy strat,
							ZSTD_ParamSwitch_e useRowMatchFinder,
							ZSTD_dictMode_e dictMode);  // 26369
		}
		{
			const BYTE* lastLiterals; // 26376
			ZSTD_storeLastLiterals(SeqStore_t* seqStorePtr,
						const BYTE* anchor,
						size_t lastLLSize);  // 26377
		}
		ZSTD_window_hasExtDict(const ZSTD_window_t window); // 20227
		ZSTD_matchState_dictMode(const ZSTD_MatchState_t* ms); // 20225
		ZSTD_matchState_dictMode(const ZSTD_MatchState_t* ms); // 26255
		ZSTD_hasExtSeqProd(const ZSTD_CCtx_params* params); // 26266
	}
	ZSTD_resetSeqStore(SeqStore_t* ssPtr); // 26235
} /* size: 1446, variables: 1, inline expansions: 1 (41 bytes) */

// <06FE8EBE> thirdparty/zstd/zstd.c:26383
// variables: 13
// function calls: 2
size_t ZSTD_copyBlockSequences(SeqCollector* seqCollector, const SeqStore_t* seqStore, const U32* prevRepcodes)
{
	const SeqDef* inSeqs; // 26385
	const size_t  nbInSequences; // 26386
	const size_t  nbInLiterals; // 26387
	ZSTD_Sequence* outSeqs; // 26389
	const size_t  nbOutSequences; // 26390
	size_t nbOutLiterals; // 26391
	Repcodes_t repcodes; // 26392
	size_t i; // 26393
	{
		U32 rawOffset; // 26406
		{
			const U32  repcode; // 26425
		}
		{
			const U32  repCode; // 19979
			{
				const U32  currentOffset; // 19981
			}
		}
		ZSTD_updateRep(U32* rep,
				const U32  offBase,
				const U32  ll0);  // 19972
		ZSTD_updateRep(U32* rep,
				const U32  offBase,
				const U32  ll0);  // 26444
	}
	{
		const size_t  lastLLSize; // 26456
	}
} /* size: 607, variables: 8 */

// <06FE8E58> thirdparty/zstd/zstd.c:26468
// variables: 2
size_t ZSTD_sequenceBound(size_t srcSize)
{
	const size_t  maxNbSeq; // 26469
	const size_t  maxNbDelims; // 26470
} /* size: 30, variables: 2 */

// <06FE8B91> thirdparty/zstd/zstd.c:26474
// variables: 9
// function calls: 2
size_t ZSTD_generateSequences(ZSTD_CCtx* zc, ZSTD_Sequence* outSeqs, size_t outSeqsSize, const void* src, size_t srcSize)
{
	const size_t  dstCapacity; // 26477
	void* dst; // 26478
	SeqCollector seqCollector; // 26479
	{
		int targetCBlockSize; // 26481
		{
			const size_t  err_code; // 26482
		}
	}
	{
		int nbWorkers; // 26486
		{
			const size_t  err_code; // 26487
		}
	}
	{
		const size_t  ret; // 26501
		{
			const size_t  err_code; // 26503
		}
		ZSTD_customFree(void* ptr,
				ZSTD_customMem customMem);  // 26502
	}
	ZSTD_customMalloc(size_t size,
				ZSTD_customMem customMem);  // 26491
} /* size: 313, variables: 3, inline expansions: 1 (11 bytes) */

// <06FE8B17> thirdparty/zstd/zstd.c:26509
// variables: 2
size_t ZSTD_mergeBlockDelimiters(ZSTD_Sequence* sequences, size_t seqsSize)
{
	size_t in; // 26510
	size_t out; // 26511
} /* size: 126, variables: 2 */

// <06FE8725> thirdparty/zstd/zstd.c:26526
// variables: 10
// function calls: 14
int ZSTD_isRLE(const BYTE* src, size_t length)
{
	const BYTE* ip; // 26527
	const BYTE  value; // 26528
	const size_t  valueST; // 26529
	const size_t  unrollSize; // 26530
	const size_t  unrollMask; // 26531
	const size_t  prefixLength; // 26532
	size_t i; // 26533
	{
		size_t u; // 26540
		MEM_readST(const void* ptr); // 26542
	}
	{
		const size_t  diff; // 20014
		MEM_readST(const void* ptr); // 20014
		MEM_readST(const void* ptr); // 20014
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20015
	}
	{
		const size_t  diff; // 20018
		MEM_readST(const void* ptr); // 20018
		MEM_readST(const void* ptr); // 20018
		ZSTD_countTrailingZeros64(U64 val); // 2090
		ZSTD_NbCommonBytes(size_t val); // 20020
	}
	MEM_read32(const void* ptr); // 20023
	MEM_read32(const void* ptr); // 20023
	MEM_read16(const void* ptr); // 20024
	MEM_read16(const void* ptr); // 20024
	ZSTD_count(const BYTE* pIn,
			const BYTE* pMatch,
			const BYTE* pInLimit);  // 26536
} /* size: 322, variables: 7, inline expansions: 5 (192 bytes) */

// <06FE86EB> thirdparty/zstd/zstd.c:26552
// variables: 2
int ZSTD_maybeRLE(const SeqStore_t* seqStore)
{
	const size_t  nbSeqs; // 26554
	const size_t  nbLits; // 26555
} /* size: 0, variables: 2 */

// <06FE86B8> thirdparty/zstd/zstd.c:26561
// variable: 1
void ZSTD_blockState_confirmRepcodesAndEntropyTables(const ZSTD_blockState_t* bs)
{
	const ZSTD_compressedBlockState_t* tmp; // 26563
} /* size: 0, variables: 1 */

// <06FE8669> thirdparty/zstd/zstd.c:26570
// variable: 1
void writeBlockHeader(void* op, size_t cSize, size_t blockSize, U32 lastBlock)
{
	const U32  cBlockHeader; // 26572
} /* size: 0, variables: 1 */

// <06FE84D1> thirdparty/zstd/zstd.c:26587
// variables: 18
size_t ZSTD_buildBlockEntropyStats_literals(const void* src, size_t srcSize, const ZSTD_hufCTables_t* prevHuf, ZSTD_hufCTables_t* nextHuf, ZSTD_hufCTablesMetadata_t* hufMetadata, const int literalsCompressionIsDisabled, void* workspace, size_t wkspSize, int hufFlags)
{
	const BYTE* wkspStart; // 26595
	const BYTE* wkspEnd; // 26596
	const BYTE* countWkspStart; // 26597
	const unsigned int* countWksp; // 26598
