
//
// public/schemasystem/schematypeexpr.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//
//	functions: 140
//	classes: 46
//

// <06E486A3> ../../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<vmix_filter_type_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <053874AD> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimVRFinger_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <05386E2E> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimVRHand_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <052DA1AC> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<FlexOpCode_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <052D9B50> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MorphLookupType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <052D9B16> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MorphEncodingType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <052D8565> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MorphBundleType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <05214B96> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CBaseConstraint>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0520A83C> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<RenderPrimitiveType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0515C573> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ModelBoneFlexComponent_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0437EF4F> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimationProcessingType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0437ED9B> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimationSnapshotType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <04232523> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<RenderSlotType_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <042320C7> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ObjectTypeFlags_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0423208D> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MeshDrawPrimitiveFlags_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <041AD4AA> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<EntityLumpFlags_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <010F7997> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<WorldNode_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00F29F8F> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<World_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00E71BEE> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<PermEntityLumpData_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <009F16A9> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<VPhysXAggregateData_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <017EC876> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<FootLockSubVisualization>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0126AF09> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimStateList>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00F5385D> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimNodeList>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00C65B36> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<CAnimData>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00C65A77> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<CSequenceGroupData>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00C659C7> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<CAnimationGroup>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00C64748> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimationSubGraph>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00C646E8> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimGraphDebugReplay>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00A9B7A7> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<CAnimationGraphVisualizerPrimitiveType>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <008989D8> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ControlValue>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0089899E> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<FinishedConditionOption>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00898964> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<PathStatusOptions>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0084666A> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimStateConditionBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0084663B> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimStateTransition>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00841146> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ResetCycleOption>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00785707> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimParamButton_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0074DF28> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimMotorBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <006B03ED> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CMotionClip>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00676EA4> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimTagBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0062F6B7> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<IkEndEffectorType>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0062F67D> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<IkTargetType>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <005A67AB> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CMotionClipGroup>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <005A677B> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CMotionMetricBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00597893> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<JiggleBoneSimSpace>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00597472> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MotionSamplingMethod>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00597053> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<SelectionSource_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00597019> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<SelectorTagBehavior_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00596B83> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<FacingMode>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <005964F1> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimVrBoneTransformSource_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <005964B7> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimVRHandMotionRange_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0059647D> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<SolveIKChainAnimNodeSettingSource>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00596443> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<SolveIKChainAnimNodeDebugSetting>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004C23B4> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimTagSpan>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6EBF> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<BinaryNodeTiming>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6E85> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<BinaryNodeChildOption>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6E4B> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimVectorSource>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6E11> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AimMatrixBlendMode>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6B37> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<AnimValueSource>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B697A> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<BlendKeyType>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B689B> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<BoneMaskBlendSpace>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6783> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ChoiceMethod>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6749> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ChoiceChangeMethod>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B670F> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<ChoiceBlendMethod>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B6552> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<IKSolverType>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <004B63D3> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<StepPhase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041BE21> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimParameterBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041BDF2> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimParameterList>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041BDC3> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CParameterValue>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041BD94> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CActivityValues>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041BD65> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CActivityValueList>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B988> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimNodeBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B959> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimNodeManager>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B92A> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimTagManager>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B8FB> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimMovementManager>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B8CC> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimGraphSettingsGroup>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B89D> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimGraphSettingsManager>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041B86E> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CClipProperties>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0041A2B1> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimState>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0040B7F5> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<DampingSpeedFunction>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0039B0DB> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimationGraph>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0039B0AB> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CAnimReplayFrame>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0043D0BB> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<CMorphSetData>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <003536A0> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
CSchemaType* SchemaTypeOf<CBoneConstraintBase>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <0016C312> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<PermModelData_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <00346D49> ../public/schemasystem/schematypeexpr.h:18
// variable: 1
inline CSchemaType* SchemaTypeOf<MaterialResourceData_t>(void)
{
	CSchemaType* s_pTypeOf; // 20
} /* size: 0, variables: 1 */

// <06E4979C> ../../public/schemasystem/schematypeexpr.h:56
inline CSchemaType* SchemaBinding_SchemaTypeOfMemberVarByAddr<vmix_filter_desc_t, vmix_filter_type_t>(ISchemaSystemTypeScope* pTypeScope, const vmix_filter_type_t vmix_filter_desc_t::* var)
{
} /* size: 0 */

// <06E4955E> ../../public/schemasystem/schematypeexpr.h:56
inline CSchemaType* SchemaBinding_SchemaTypeOfMemberVarByAddr<vmix_eq8_desc_t, vmix_filter_desc_t [8]>(ISchemaSystemTypeScope* pTypeScope, const vmix_filter_desc_t vmix_eq8_desc_t::* var)
{
} /* size: 0 */

// <06E4946E> ../../public/schemasystem/schematypeexpr.h:56
inline CSchemaType* SchemaBinding_SchemaTypeOfMemberVarByAddr<vmix_delay_desc_t, vmix_filter_desc_t>(ISchemaSystemTypeScope* pTypeScope, const vmix_filter_desc_t vmix_delay_desc_t::* var)
{
} /* size: 0 */

// <054DC8FD> ../public/schemasystem/schematypeexpr.h:56
