
//
// vulkan/rendercontextvulkan.h
//
//	referenced by: librendersystemvulkan.so
//
//	functions: 15
//	classes: 2
//	structs: 4
//

// <0047214D> vulkan/rendercontextvulkan.h:38
// member variables: 6
// struct size: 48
struct VulkanQueryPool_t {
	VkQueryPool m_pPoolVulkan; /* 0 8 */
	VmaAllocation m_pVmaAllocation; /* 8 8 */
	VkBuffer m_pResultsBuffer; /* 16 8 */
	VkDeviceSize m_nResultsBufferSizePerSubmit; /* 24 8 */
	VkDeviceSize m_nResultsBufferSizeTotal; /* 32 8 */
	VkDeviceSize m_nQuerySizeInBytes; /* 40 8 */
};

// <004721B5> vulkan/rendercontextvulkan.h:50
// member variables: 3
// struct size: 16
struct VulkanQuery_t {
	VulkanQueryPool_t * m_pQueryPool; /* 0 8 */
	uint32_t m_nSlot; /* 8 4 */
	int32_t m_nSubmitCount; /* 12 4 */
};

// <0047135B> vulkan/rendercontextvulkan.h:57
// member variables: 3
// struct size: 24
struct VulkanCommandBufferAndPool_t {
	VkCommandBuffer m_pCmdBuffer; /* 0 8 */
	CommandBufferPool_t * m_pCmdBufferPool; /* 8 8 */
	VulkanCommandBufferType_t m_nCommandBufferType; /* 16 1 */
};

// <00B82AFE> vulkan/rendercontextvulkan.h:67
void VulkanCommandBuffer_t::VulkanCommandBuffer_t()
{
} /* size: 0 */

// <00B82AE1> vulkan/rendercontextvulkan.h:67
inline void VulkanCommandBuffer_t::VulkanCommandBuffer_t()
{
} /* size: 0 */

// <00B73A0F> vulkan/rendercontextvulkan.h:67
void VulkanCommandBuffer_t::~VulkanCommandBuffer_t()
{
} /* size: 0 */

// <00B739F2> vulkan/rendercontextvulkan.h:67
inline void VulkanCommandBuffer_t::~VulkanCommandBuffer_t()
{
} /* size: 0 */

// <00472088> vulkan/rendercontextvulkan.h:67
// member variables: 11
// struct size: 216
struct VulkanCommandBuffer_t {
	VkCommandBuffer m_pCmdBuffer; /* 0 8 */
	VulkanCommandBufferType_t m_nCommandBufferType; /* 8 1 */
	bool m_bIsIntermediateSwapchainBlt; /* 9 1 */
	CUtlFixedLinkedList<VulkanCommandBufferAndPool_t> m_additionalCmdBuffers; /* 16 80 */
	CUtlLinkedList<QueryObjectInternalVulkan_t*, short unsigned int, false, short unsigned int, CUtlMemory<UtlLinkedListElem_t<QueryObjectInternalVulkan_t*, short unsigned int>, short unsigned int> > m_queriesToReset; /* 96 40 */
	CImageLayoutTracker m_imageLayouts; /* 136 0 */
	CommandBufferPool_t * m_pCmdBufferPool; /* 176 8 */
	RenderSemaphoreHandle_t m_hSignalSemaphore; /* 184 8 */
	RenderSemaphoreHandle_t m_hWaitSemaphore; /* 192 8 */
	VulkanQuery_t * m_pPipelineStatsQuery; /* 200 8 */
	uint32_t m_nSubmitCount; /* 208 4 */
};

// <0080C74A> vulkan/rendercontextvulkan.h:111
// member functions: 320
// member variables: 54
// vtable entries: 115
// class size: 28,432
class CRenderContextVulkan : public CRenderContextBase {
public:
	/* class CRenderContextBase <ancestor>; */ /* 0 0 */
	void CRenderContextVulkan(CRenderContextVulkan* , const CRenderContextVulkan& );
	/* vulkan/rendercontextvulkan.cpp:2370 */
	ClearSubrectResult_t ClearImpl(CRenderContextVulkan* , const RenderClearInfo_t& );
	/* vulkan/rendercontextvulkan.cpp:2652 */
	virtual void Clear(CRenderContextVulkan* , const RenderClearInfo_t& );
	/* vulkan/rendercontextvulkan.cpp:2733 */
	virtual void DiscardRenderTarget(CRenderContextVulkan* , RenderClearFlags_t, uint);
	/* vulkan/rendercontextvulkan.cpp:2657 */
	virtual ClearSubrectResult_t ClearSubrect(CRenderContextVulkan* , const RenderClearInfo_t& , int, int, int, int, bool);
	/* vulkan/rendercontextvulkan.cpp:2674 */
	virtual void ClearUnorderedAccessViewUint(CRenderContextVulkan* , HRenderTexture, int, const uint32* );
	/* vulkan/rendercontextvulkan.cpp:4245 */
	virtual void SetViewports(CRenderContextVulkan* , int, const RenderViewport_t* );
	/* vulkan/rendercontextvulkan.cpp:1324 */
	virtual void ResolveDepthStencilTarget(CRenderContextVulkan* , Rect_t* , int, int, HRenderTexture);
	/* vulkan/rendercontextvulkan.cpp:1450 */
	virtual void ResolveRenderTarget(CRenderContextVulkan* , int, Rect_t* , int, int, HRenderTexture);
	/* vulkan/rendercontextvulkan.cpp:2066 */
	virtual CDisplayList* DetachCommandList(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:1970 */
	virtual void SubmitSecondaryDisplayList(CRenderContextVulkan* , CDisplayList* , bool);
	/* vulkan/rendercontextvulkan.cpp:2785 */
	virtual DynamicVertexBufferHandle_t LockDynamicVertexBuffer(CRenderContextVulkan* , const BufferDesc_t& , DynamicLockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2803 */
	virtual void UnlockDynamicVertexBuffer(CRenderContextVulkan* , DynamicVertexBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:3077 */
	virtual DynamicIndexBufferHandle_t LockDynamicIndexBuffer(CRenderContextVulkan* , const BufferDesc_t& , DynamicLockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:3095 */
	virtual void UnlockDynamicIndexBuffer(CRenderContextVulkan* , DynamicIndexBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:2946 */
	virtual RenderBufferHandle_t LockDynamicGPUBuffer(CRenderContextVulkan* , const BufferDesc_t& , RenderBufferFlags_t, ImageFormat, DynamicLockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2965 */
	virtual void UnlockDynamicGPUBuffer(CRenderContextVulkan* , RenderBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:3114 */
	virtual bool LockIndexBuffer(CRenderContextVulkan* , IndexBufferHandle_t, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:3133 */
	virtual void UnlockIndexBuffer(CRenderContextVulkan* , IndexBufferHandle_t, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2821 */
	virtual bool LockVertexBuffer(CRenderContextVulkan* , VertexBufferHandle_t, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2839 */
	virtual void UnlockVertexBuffer(CRenderContextVulkan* , VertexBufferHandle_t, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2855 */
	virtual bool LockVertexBufferRegion(CRenderContextVulkan* , VertexBufferHandle_t, int32, int32, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2874 */
	virtual void UnlockVertexBufferRegion(CRenderContextVulkan* , VertexBufferHandle_t, int32, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:3149 */
	virtual bool LockIndexBufferRegion(CRenderContextVulkan* , IndexBufferHandle_t, int32, int32, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:3169 */
	virtual void UnlockIndexBufferRegion(CRenderContextVulkan* , IndexBufferHandle_t, int32, int, LockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:2889 */
	virtual void SetVertexData(CRenderContextVulkan* , VertexBufferHandle_t, const void* , int, int);
	/* vulkan/rendercontextvulkan.cpp:2906 */
	virtual void SetIndexData(CRenderContextVulkan* , IndexBufferHandle_t, const void* , int, int);
	/* vulkan/rendercontextvulkan.cpp:3188 */
	virtual bool BindIndexBuffer(CRenderContextVulkan* , IndexBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:3209 */
	virtual bool BindIndexBuffer(CRenderContextVulkan* , DynamicIndexBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:3214 */
	virtual bool BindIndexBuffer(CRenderContextVulkan* , RenderBufferHandle_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:3231 */
	virtual bool BindVertexBuffer(CRenderContextVulkan* , int, VertexBufferHandle_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:3262 */
	virtual bool BindVertexBuffer(CRenderContextVulkan* , int, DynamicVertexBufferHandle_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:3267 */
	virtual bool BindVertexBuffer(CRenderContextVulkan* , int, RenderBufferHandle_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:3298 */
	virtual void BindVertexShader(CRenderContextVulkan* , RenderShaderHandle_t, RenderInputLayout_t, const CVsInputSignatureVector* );
	/* vulkan/rendercontextvulkan.cpp:3317 */
	virtual void BindShader(CRenderContextVulkan* , RenderShaderType_t, RenderShaderHandle_t);
	/* vulkan/rendercontextvulkan.cpp:4799 */
	virtual void BindTexture(CRenderContextVulkan* , int, HRenderTexture, RenderTextureDimension_t, RenderShaderType_t, RenderColorSpace_t, int);
	/* vulkan/rendercontextvulkan.cpp:4805 */
	virtual void BindMipLevelOfTexture(CRenderContextVulkan* , int, HRenderTexture, int, RenderTextureDimension_t, RenderShaderType_t, RenderColorSpace_t, int);
	/* vulkan/rendercontextvulkan.cpp:4791 */
	virtual void PrepareTextureForUse(CRenderContextVulkan* , HRenderTexture, RenderColorSpace_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:4354 */
	virtual void SetSamplerStatePS(CRenderContextVulkan* , int, RsFilter_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsComparison_t);
	/* vulkan/rendercontextvulkan.cpp:4371 */
	virtual void SetSamplerStateVS(CRenderContextVulkan* , int, RsFilter_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsComparison_t);
	/* vulkan/rendercontextvulkan.cpp:4388 */
	virtual void SetSamplerState(CRenderContextVulkan* , int32, const CSamplerStateDesc* , RenderShaderType_t);
	/* vulkan/rendercontextvulkan.cpp:5577 */
	virtual void SetTextureData(CRenderContextVulkan* , HRenderTexture, const CTextureDesc* , const void* , int, int, const Rect3D_t* , uint, const DataRecycleDelegate_t* );
	/* vulkan/rendercontextvulkan.cpp:6093 */
	virtual void LockDynamicTexture(CRenderContextVulkan* , HRenderTexture, LockedDynamicTexture_t& );
	/* vulkan/rendercontextvulkan.cpp:6100 */
	virtual void UnlockDynamicTexture(CRenderContextVulkan* , HRenderTexture);
	/* vulkan/rendercontextvulkan.cpp:6105 */
	virtual void ReadTexturePixels(CRenderContextVulkan* , HRenderTexture, IReadTexturePixelsCallback* , Rect_t* , int, int, bool);
	/* vulkan/rendercontextvulkan.cpp:6146 */
	virtual void ReadBuffer(CRenderContextVulkan* , RenderBufferHandle_t, IReadBufferCallback* , int32, int32, bool);
	/* vulkan/rendercontextvulkan.cpp:6270 */
	virtual void GenerateMipMaps(CRenderContextVulkan* , HRenderTexture);
	/* vulkan/rendercontextvulkan.cpp:3367 */
	virtual void Draw(CRenderContextVulkan* , RenderPrimitiveType_t, int, int);
	/* vulkan/rendercontextvulkan.cpp:3401 */
	virtual void DrawInstanced(CRenderContextVulkan* , RenderPrimitiveType_t, int, int, int);
	/* vulkan/rendercontextvulkan.cpp:3437 */
	virtual void DrawIndexed(CRenderContextVulkan* , RenderPrimitiveType_t, int, int, int, int);
	/* vulkan/rendercontextvulkan.cpp:3474 */
	virtual void DrawIndexedInstanced(CRenderContextVulkan* , RenderPrimitiveType_t, int, int, int, int, int, uint);
	/* vulkan/rendercontextvulkan.cpp:3510 */
	virtual void MultiDrawIndexed(CRenderContextVulkan* , RenderPrimitiveType_t, int, const RenderMultiDrawIndexedInfo_t* , uint32, uint32, int);
	/* vulkan/rendercontextvulkan.cpp:3554 */
	virtual void DrawInstancedIndirect(CRenderContextVulkan* , RenderPrimitiveType_t, RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3578 */
	virtual void DrawIndexedInstancedIndirect(CRenderContextVulkan* , RenderPrimitiveType_t, RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3602 */
	virtual void MultiDrawIndexedInstancedIndirect(CRenderContextVulkan* , RenderPrimitiveType_t, uint32, RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3627 */
	virtual void MultiDrawIndexedInstancedIndirectCount(CRenderContextVulkan* , RenderPrimitiveType_t, RenderBufferHandle_t, uint32, uint32, RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3672 */
	virtual void DispatchComputeShader(CRenderContextVulkan* , uint32, uint32, uint32);
	/* vulkan/rendercontextvulkan.cpp:3749 */
	virtual void DispatchComputeShaderIndirect(CRenderContextVulkan* , RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3801 */
	virtual void BuildBLAS(CRenderContextVulkan* , RenderBLASHandle_t, BLASTriangleData_t* , int);
	/* vulkan/rendercontextvulkan.cpp:3814 */
	virtual void CompactBLAS(CRenderContextVulkan* , RenderBLASHandle_t, RenderBLASHandle_t);
	/* vulkan/rendercontextvulkan.cpp:3826 */
	virtual void BuildTLAS(CRenderContextVulkan* , RenderTLASHandle_t, TLASInstance_t* , int);
	/* vulkan/rendercontextvulkan.cpp:3839 */
	virtual void BindRayTracingPipeline(CRenderContextVulkan* , RenderRayTracePipelineHandle_t);
	/* vulkan/rendercontextvulkan.cpp:3863 */
	virtual void UpdateRayTraceShaderBindingTable(CRenderContextVulkan* , IRaytraceShaderBindingTable* );
	/* vulkan/rendercontextvulkan.cpp:3876 */
	virtual void TraceRays(CRenderContextVulkan* , IRaytraceShaderBindingTable* , uint32, uint32, uint32);
	/* vulkan/rendercontextvulkan.cpp:3936 */
	virtual void TraceRaysIndirect(CRenderContextVulkan* , IRaytraceShaderBindingTable* , RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:4021 */
	virtual void CopyGPUBufferHiddenStructureCount(CRenderContextVulkan* , RenderBufferHandle_t, RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:3996 */
	virtual void SetGPUBufferHiddenStructureCount(CRenderContextVulkan* , RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:4065 */
	virtual void FillGPUBuffer(CRenderContextVulkan* , RenderBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:4084 */
	virtual void SetGPUBufferData(CRenderContextVulkan* , RenderBufferHandle_t, const void* , uint32, uint32);
	/* vulkan/rendercontextvulkan.cpp:5204 */
	void SetConstantBufferDataInternal(CRenderContextVulkan* , ConstantBufferHandle_t, uint32, uint32, const void* const* , uint32);
	/* vulkan/rendercontextvulkan.cpp:5259 */
	virtual void SetConstantBufferData(CRenderContextVulkan* , ConstantBufferHandle_t, const void* , uint32);
	/* vulkan/rendercontextvulkan.cpp:5264 */
	virtual void SetConstantBufferViewsData(CRenderContextVulkan* , ConstantBufferHandle_t, uint32, uint32, const void* const* , uint32);
	/* vulkan/rendercontextvulkan.cpp:5309 */
	virtual void BindConstantBuffer(CRenderContextVulkan* , RenderShaderType_t, ConstantBufferHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:5314 */
	virtual void BindConstantBufferView(CRenderContextVulkan* , RenderShaderType_t, ConstantBufferHandle_t, uint32, int);
	/* vulkan/rendercontextvulkan.cpp:5322 */
	virtual void PushConstants(CRenderContextVulkan* , const void* , uint32);
	/* vulkan/rendercontextvulkan.cpp:5341 */
	virtual RenderInputLayout_t GetInputLayoutForVertexBuffer(CRenderContextVulkan* , VertexBufferHandle_t);
	/* vulkan/rendercontextvulkan.cpp:6349 */
	virtual void ForceFlushGPU(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.h:198 */
	virtual void ForceDeviceLost(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:490 */
	virtual void BindRenderTargets(CRenderContextVulkan* , const RenderTargetDesc_t& );
	/* vulkan/rendercontextvulkan.cpp:1650 */
	virtual void CopyTexture(CRenderContextVulkan* , HRenderTexture, HRenderTexture, Rect_t* , int, int, uint, uint, uint, uint, CopyTextureFlags_t);
	/* vulkan/rendercontextvulkan.cpp:1824 */
	virtual void CopyFromVolumeTexture(CRenderContextVulkan* , HRenderTexture, HRenderTexture, Rect3D_t* , int, int, int, uint, uint, uint, uint, CopyTextureFlags_t);
	/* vulkan/rendercontextvulkan.cpp:298 */
	virtual void BeginPixEvent(CRenderContextVulkan* , Color, const char* );
	/* vulkan/rendercontextvulkan.cpp:311 */
	virtual void EndPixEvent(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:322 */
	virtual void PixSetMarker(CRenderContextVulkan* , Color, const char* );
	/* vulkan/rendercontextvulkan.cpp:5180 */
	virtual ConstantBufferHandle_t LockDynamicConstantBuffer(CRenderContextVulkan* , uint32, DynamicLockDesc_t* );
	/* vulkan/rendercontextvulkan.cpp:5199 */
	virtual void UnlockDynamicConstantBuffer(CRenderContextVulkan* , ConstantBufferHandle_t, uint32);
	/* vulkan/rendercontextvulkan.cpp:2976 */
	virtual void BeginQuery(CRenderContextVulkan* , RenderQueryHandle_t);
	/* vulkan/rendercontextvulkan.cpp:3027 */
	virtual void EndQuery(CRenderContextVulkan* , RenderQueryHandle_t);
	/* vulkan/rendercontextvulkan.h:214 */
	virtual void SetDebugFlag(CRenderContextVulkan* , RenderDebugFlag_t, bool);
	/* vulkan/rendercontextvulkan.cpp:4299 */
	virtual void SetScissorRects(CRenderContextVulkan* , int, const Rect_t* );
	/* vulkan/rendercontextvulkan.cpp:6087 */
	virtual void CopyFallbackTextureData(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6339 */
	virtual void QueueDeviceThreadCallback(CRenderContextVulkan* , IDeviceThreadCallback* );
	/* vulkan/rendercontextvulkan.cpp:4841 */
	virtual void BindMipLevelOfTextures(CRenderContextVulkan* , int, int, bind_resource_list_t* , RenderShaderType_t);
	/* vulkan/rendercontextvulkan.cpp:4923 */
	virtual void BindUnordedAccessViews(CRenderContextVulkan* , int, int, bind_resource_list_t* , RenderShaderType_t);
	/* vulkan/rendercontextvulkan.cpp:4402 */
	virtual void SetSamplerStates(CRenderContextVulkan* , int, int, const CSamplerStateDesc* , RenderShaderType_t);
	/* vulkan/rendercontextvulkan.cpp:5029 */
	virtual void BindDescriptorSets(CRenderContextVulkan* , int32, int32, const RenderDescriptorSetHandle_t* , const int32* , const uint32** );
	/* vulkan/rendercontextvulkan.cpp:5093 */
	virtual void FillAndBindDynamicDescriptorSet(CRenderContextVulkan* , RenderDescriptorSetHandle_t, int32, int32, const RenderDescriptorBinding_t* , bool, const int32* , const uint32** );
	/* vulkan/rendercontextvulkan.cpp:5141 */
	virtual RenderDescriptorSetHandle_t FillDynamicDescriptorSet(CRenderContextVulkan* , RenderDescriptorSetHandle_t, int32, const RenderDescriptorBinding_t* , bool);
	/* vulkan/rendercontextvulkan.cpp:6509 */
	virtual void BeginRenderPass(CRenderContextVulkan* , RenderPassHandle_t, int32, const union RenderPassClearValue_t* , const Rect_t& );
	/* vulkan/rendercontextvulkan.cpp:6612 */
	virtual void NextSubPass(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6642 */
	virtual void EndRenderPass(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6724 */
	virtual void TextureBarrier(CRenderContextVulkan* , int32, const HRenderTexture* , const RenderImageLayout_t* , bool);
	/* vulkan/rendercontextvulkan.cpp:6907 */
	virtual void UAVBarrier(CRenderContextVulkan* , int32, const RenderUAVBarrier_t* );
	/* vulkan/rendercontextvulkan.cpp:6913 */
	virtual void BufferBarrier(CRenderContextVulkan* , int32, const RenderBufferBarrier_t* );
	/* vulkan/rendercontextvulkan.cpp:6718 */
	virtual unique_ptr<IBarrierHelper, std::default_delete<IBarrierHelper> > GetBarrierHelper(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6422 */
	virtual void SetSteamVrCompositorTexture(CRenderContextVulkan* , HRenderTexture, HRenderTexture);
	/* vulkan/rendercontextvulkan.cpp:6475 */
	virtual RenderSemaphoreHandle_t SemaphoreSignalAtEnd(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6491 */
	virtual void SemaphoreWaitAtBegin(CRenderContextVulkan* , RenderSemaphoreHandle_t);
	/* vulkan/rendercontextvulkan.cpp:134 */
	virtual void SetStatesToDefault(CRenderContextVulkan* , uint32, uint32);
	/* vulkan/rendercontextvulkan.cpp:6919 */
	virtual void SetDepthBoundsTestEnabled(CRenderContextVulkan* , bool);
	/* vulkan/rendercontextvulkan.cpp:6931 */
	virtual void SetDepthBounds(CRenderContextVulkan* , float, float);
	/* vulkan/rendercontextvulkan.cpp:117 */
	virtual void OnReleaseRenderContext(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:154 */
	virtual void SetDefaultState(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:5356 */
	virtual void QueuePresent(CRenderContextVulkan* , SwapChainHandle_t, int);
	/* vulkan/rendercontextvulkan.cpp:5557 */
	virtual void SetIsSecondaryContext(CRenderContextVulkan* , RenderContextCreationInfo_t* , bool);
	/* vulkan/rendercontextvulkan.cpp:6375 */
	virtual void CopyBuffer(CRenderContextVulkan* , IndexBufferHandle_t, IndexBufferHandle_t);
	/* vulkan/rendercontextvulkan.cpp:56 */
	void CRenderContextVulkan(CRenderContextVulkan* , VkDevice, const VulkanPhysicalDeviceInfo_t* );
	/* vulkan/rendercontextvulkan.cpp:87 */
	virtual void ~CRenderContextVulkan(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:101 */
	void SetPerThreadData(CRenderContextVulkan* , PerThreadDataVulkan_t* );
	/* vulkan/rendercontextvulkan.cpp:112 */
	virtual bool IsOwnedByCurrentThread(const CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:5849 */
	void SetTextureDataFromResource(CRenderContextVulkan* , CVulkanImage* , const TextureSpecification_t* , const TextureSpecification_t* , const void* , int);
	/* vulkan/rendercontextvulkan.cpp:5617 */
	void SetTextureDataInternal(CRenderContextVulkan* , HRenderTexture, const TextureSpecification_t* , const CTextureDesc* , const void* , int, int, int, const Rect3D_t* , uint, const DataRecycleDelegate_t* , const char* );
	/* vulkan/rendercontextvulkan.cpp:6040 */
	void CopyTextureData(CRenderContextVulkan* , CVulkanImage* , CVulkanImage* , int, int, int, int);
	/* vulkan/rendercontextvulkan.cpp:5752 */
	void WriteDataIntoTexture(CRenderContextVulkan* , CVulkanImage* , int, int, int, int, int, int, int, int, int, int, ImageFormat, VkDeviceMemory, VkBuffer, VkDeviceSize, int, const ImageFormatInfo_t& );
	/* vulkan/rendercontextvulkan.cpp:479 */
	void PrepareImage(CRenderContextVulkan* , CVulkanImage* , VkImageLayout, RenderMultisampleType_t, VkImageAspectFlags);
	/* vulkan/rendercontextvulkan.cpp:894 */
	void StopCurrentRenderPass(CRenderContextVulkan* , VkCommandBuffer);
	/* vulkan/rendercontextvulkan.cpp:4422 */
	bool AllocatePerFrameDynamicPooled(CRenderContextVulkan* , VulkanMemoryPoolType_t, size_t, size_t, const void* , VkDeviceMemory* , VkDeviceSize* , VkBuffer* , void** );
	/* vulkan/rendercontextvulkan.cpp:4489 */
	void DestroyDynamicMemoryPools(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:284 */
	void SetRenderContextFlags(CRenderContextVulkan* , uint32);
	/* vulkan/rendercontextvulkan.cpp:261 */
	void ResetDefaultSamplerStateIfRequired(CRenderContextVulkan* , uint32_t);
	/* vulkan/rendercontextvulkan.h:284 */
	bool IsAsyncComputeCommandBuffer(const CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6756 */
	void PerformBarriers(CRenderContextVulkan* , int32, const RenderUAVBarrier_t* , int32, const RenderBufferBarrier_t* );
	/* vulkan/rendercontextvulkan.cpp:2927 */
	void FillGPUBufferFormatted(CRenderContextVulkan* , RenderBufferHandle_t, uint32, const void* );
	/* vulkan/rendercontextvulkan.h:472 */
	VulkanCommandBuffer_t* GetVulkanCommandBuffer(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:328 */
	void MarkIssuesCommands(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:6947 */
	void CopyVulkanBuffer(CRenderContextVulkan* , VkBuffer, VkBuffer, VkDeviceSize, VkDeviceSize, VkDeviceSize);
	/* vulkan/rendercontextvulkan.cpp:6975 */
	void CopyVulkanImage(CRenderContextVulkan* , CVulkanImage* , VkImage, uint32, uint32, uint32, uint32, uint32, RenderMultisampleType_t, VkImageAspectFlags);
	/* vulkan/rendercontextvulkan.cpp:7048 */
	void UpdateSwappedImageLayout(CRenderContextVulkan* , CVulkanImage* , VkImageLayout, VkImageAspectFlags);
protected:
	/* vulkan/rendercontextvulkan.cpp:2203 */
	void ClearColorUsingShaders(CRenderContextVulkan* , int, const Vector4D& , int, int);
	/* vulkan/rendercontextvulkan.cpp:2308 */
	void ClearDepthUsingShaders(CRenderContextVulkan* , int, float32, uint8);
	/* vulkan/rendercontextvulkan.cpp:1033 */
	void ResolveUsingShaders(CRenderContextVulkan* , CVulkanImage* , CVulkanImage* , const TextureSpecification_t* , const TextureSpecification_t* , Rect_t* , int, int, HRenderTexture, bool, RenderColorSpace_t, VkSurfaceTransformFlagsKHR);
	/* vulkan/rendercontextvulkan.cpp:4695 */
	VkImageLayout AddImageBarrier(CRenderContextVulkan* , VulkanCommandBuffer_t* , HRenderTexture, RenderColorSpace_t, int, const char* );
	/* vulkan/rendercontextvulkan.cpp:2812 */
	void DestroyAllDynamicVertexBuffers(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:3104 */
	void DestroyAllDynamicIndexBuffers(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:4499 */
	void ApplyDelayedChanges(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:4146 */
	bool SetupForDraw(CRenderContextVulkan* , RenderPrimitiveType_t);
	/* vulkan/rendercontextvulkan.cpp:5271 */
	void BindConstantBufferInternal(CRenderContextVulkan* , RenderShaderType_t, ConstantBufferHandle_t, uint32, int);
	/* vulkan/rendercontextvulkan.h:324 */
	void ResolveTargetVulkan(CRenderContextVulkan* , CVulkanImage* , CVulkanImage* , Rect_t* , int, int, HRenderTexture, bool);
	/* vulkan/rendercontextvulkan.cpp:4336 */
	VkSampler GetSamplerState(CRenderContextVulkan* , RsFilter_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsTextureAddressMode_t, RsComparison_t);
	/* vulkan/rendercontextvulkan.cpp:4347 */
	VkSampler GetSamplerState(CRenderContextVulkan* , const CSamplerStateDesc* );
	/* vulkan/rendercontextvulkan.cpp:710 */
	void UpdateImplicitRenderPass(CRenderContextVulkan* , VulkanCommandBuffer_t* , VulkanFramebufferState_t& );
	/* vulkan/rendercontextvulkan.cpp:869 */
	void BeginImplicitRenderPass(CRenderContextVulkan* , VulkanCommandBuffer_t* , VkFramebuffer, VkRenderPass, const VulkanFramebufferState_t& );
	/* vulkan/rendercontextvulkan.cpp:805 */
	void TransitionRenderTargetImageLayouts(CRenderContextVulkan* , VulkanCommandBuffer_t* , const VulkanFramebufferState_t& );
	/* vulkan/rendercontextvulkan.cpp:693 */
	void ResetLoadStoreOps(CRenderContextVulkan* );
	/* vulkan/rendercontextvulkan.cpp:926 */
	void UpdateDynamicRendering(CRenderContextVulkan* , VulkanCommandBuffer_t* , VulkanFramebufferState_t& );
	/* vulkan/rendercontextvulkan.cpp:6695 */
	void SetViewportForSubPass(CRenderContextVulkan* , const CRenderPassVulkan* , uint32_t, const Rect_t& );
	/* vulkan/rendercontextvulkan.cpp:4092 */
	void SetupHiddenUAVCounters(CRenderContextVulkan* , VulkanCommandBuffer_t* , RenderShaderType_t);
	/* vulkan/rendercontextvulkan.cpp:835 */
	void ClampRenderArea(CRenderContextVulkan* , VkRect2D& , uint32, uint32);
	bool m_bCommandsQueueToCommandBuffer; /* 5672 1 */
	RenderTargetDesc_t m_RenderTargetDesc; /* 5680 120 */
	VulkanFramebufferState_t m_FBState; /* 5800 368 */
	VkRenderPass m_pCurrentRenderPass; /* 6168 8 */
	uint32_t m_nCurrentRenderPassSubPass; /* 6176 4 */
	uint32_t m_nCurrentRenderPassSubPassCount; /* 6180 4 */
	CRenderPassVulkan * m_pCurrentExplicitRenderPass; /* 6184 8 */
	VkFramebuffer m_pCurrentFramebuffer; /* 6192 8 */
	bool m_bBeganDynamicRendering; /* 6200 1 */
	VkRect2D m_lastRenderArea; /* 6204 16 */
	VkSampler m_pLastDefaultSamplerState; /* 6224 8 */
	uint32_t m_nDefaultSamplerId; /* 6232 4 */
	RenderPassHandle_t m_hCreationRenderPass; /* 6236 4 */
	int m_nCreationSubPass; /* 6240 4 */
	uint32 m_nUAVInitialCounts[4][8]; /* 6244 128 */
	CVertexBufferVulkan * m_pBoundUAVs[4][8]; /* 6376 256 */
	uint8 * m_pPushConstantMem; /* 6632 8 */
	uint32_t m_nPushConstantUpdateSize; /* 6640 4 */
	uint32_t m_nDescriptorSetDirtyMask; /* 6644 4 */
	int32_t m_nMaxDescriptorSetBound; /* 6648 4 */
	int m_nScissorCount; /* 6652 4 */
	Rect_t m_pScissor[16]; /* 6656 256 */
	CRenderAttributes m_attributes; /* 6912 1184 */
	uint m_nVulkanChangeFlags; /* 8096 4 */
	VkDevice m_pDeviceVulkan; /* 8104 8 */
	CPipelineVulkan m_Pipeline; /* 8112 0 */
	CRayTracePipelineVulkan * m_pRayTracePipeline; /* 27816 8 */
	CUtlVector<DynamicVertexBufferHandle_t__*, CUtlMemory<DynamicVertexBufferHandle_t__*, int> > m_DynamicVBs; /* 27824 32 */
	CUtlVector<DynamicIndexBufferHandle_t__*, CUtlMemory<DynamicIndexBufferHandle_t__*, int> > m_DynamicIBs; /* 27856 32 */
	bool m_bViewportSet; /* 27888 1 */
	bool m_bScissorSet; /* 27889 1 */
	bool m_bMultiSubmit; /* 27890 1 */
	VkPrimitiveTopology m_nLastDynamicStatePrimitiveTopology; /* 27892 4 */
	VkPolygonMode m_nLastDynamicStatePolygonMode; /* 27896 4 */
	bool m_bBoundDefaultVB; /* 27900 1 */
	bool m_bRenderInSecondaryCommandBuffers; /* 27901 1 */
	bool m_bAsyncComputeCommandBuffer; /* 27902 1 */
	bool m_bExplicitRenderPasses; /* 27903 1 */
	bool m_bAcquireDescriptorPool; /* 27904 1 */
	VulkanDescriptorSetPool_t * m_pCurrentDescriptorSetPool; /* 27912 8 */
	PerThreadDataVulkan_t * m_pPerThreadData; /* 27920 8 */
	VulkanMemoryPool_t * m_pMemoryPoolPMB[9]; /* 27928 72 */
	InputLayoutVulkan_t * m_pInputLayout; /* 28000 8 */
	/* vulkan/rendercontextvulkan.cpp:769 */
	void UpdateRenderTargetChangeStats(CRenderContextVulkan* );
	CRenderPipelineStats m_Stats; /* 28008 120 */
	uint m_nTotalDraws; /* 28128 4 */
	uint m_nTotalInstances; /* 28132 4 */
	uint m_nTotalVertices; /* 28136 4 */
	uint m_nTotalPrims; /* 28140 4 */
	char m_szCombinedSecondaryNames[255]; /* 28144 255 */
	uint32 m_nSecondaryCommandBufferCount; /* 28400 4 */
	uint32 m_nRenderPassSubPassCount; /* 28404 4 */
	RenderPipelineStatsCommandListQueries_t m_CommandListQueries; /* 28408 16 */
	const class VulkanPhysicalDeviceInfo_t * m_pPhysicalDeviceInfo; /* 28424 8 */
	/* vulkan/rendercontextvulkan.cpp:6208 */
	virtual void ReadBuffer(CRenderContextVulkan* , IndexBufferHandle_t, IReadBufferCallback* , int32, int32, bool);
	bool AllocatePerFrameDynamicPooled(class CRenderContextVulkan *, enum VulkanMemoryPoolType_t, size_t, size_t, const void  *, VkDeviceMemory *, VkDeviceSize *, VkBuffer *, void * *); /* linkage=_ZN20CRenderContextVulkan29AllocatePerFrameDynamicPooledE22VulkanMemoryPoolType_tmmPKvPP16VkDeviceMemory_TPmPP10VkBuffer_TPPv */
	void StopCurrentRenderPass(class CRenderContextVulkan *, VkCommandBuffer); /* linkage=_ZN20CRenderContextVulkan21StopCurrentRenderPassEP17VkCommandBuffer_T */
	bool IsAsyncComputeCommandBuffer(const class CRenderContextVulkan  *); /* linkage=_ZNK20CRenderContextVulkan27IsAsyncComputeCommandBufferEv */
	virtual class CDisplayList * DetachCommandList(class CRenderContextVulkan *); /* linkage=_ZN20CRenderContextVulkan17DetachCommandListEv */
