
//
// thirdparty/minivorbis/minivorbis.h
//
//	referenced by: libengine2.so
//
//	functions: 378
//	structs: 44
//

// <020C9599> ../thirdparty/minivorbis/minivorbis.h:47
// member functions: 35
// member variable: 1
// struct size: 8
struct _OggAutocastPtr {
	void * p; /* 0 8 */
	/* ../thirdparty/minivorbis/minivorbis.h:49 */
	void _OggAutocastPtr(_OggAutocastPtr* , void* );
	/* ../thirdparty/minivorbis/minivorbis.h:51 */
	void* operator void*(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_comment* operator vorbis_comment*<vorbis_comment>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info* operator vorbis_info*<vorbis_info>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	unsigned int* operator unsigned int*<unsigned int>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	static_codebook* operator static_codebook*<static_codebook>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	int*** operator int***<int**>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info_mapping0* operator vorbis_info_mapping0*<vorbis_info_mapping0>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	long int** operator long int**<long int*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	codebook** operator codebook**<codebook*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	codebook*** operator codebook***<codebook**>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_look_residue0* operator vorbis_look_residue0*<vorbis_look_residue0>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info_residue0* operator vorbis_info_residue0*<vorbis_info_residue0>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	int** operator int**<int*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_look_floor0* operator vorbis_look_floor0*<vorbis_look_floor0>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info_floor0* operator vorbis_info_floor0*<vorbis_info_floor0>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_look_floor1* operator vorbis_look_floor1*<vorbis_look_floor1>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info_floor1* operator vorbis_info_floor1*<vorbis_info_floor1>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_info_mode* operator vorbis_info_mode*<vorbis_info_mode>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	char* operator char*<char>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	char** operator char**<char*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	float*** operator float***<float**>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_look_psy_global* operator vorbis_look_psy_global*<vorbis_look_psy_global>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	envelope_filter_state* operator envelope_filter_state*<envelope_filter_state>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	envelope_lookup* operator envelope_lookup*<envelope_lookup>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	float** operator float**<float*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	vorbis_look_psy* operator vorbis_look_psy*<vorbis_look_psy>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	codebook* operator codebook*<codebook>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	void** operator void**<void*>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	alloc_chain* operator alloc_chain*<alloc_chain>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	oggpack_buffer* operator oggpack_buffer*<oggpack_buffer>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	float* operator float*<float>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	long int* operator long int*<long int>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	int* operator int*<int>(const _OggAutocastPtr* );
	/* ../thirdparty/minivorbis/minivorbis.h:50 */
	unsigned char* operator unsigned char*<unsigned char>(const _OggAutocastPtr* );
};

// <020EAD8F> ../thirdparty/minivorbis/minivorbis.h:49
void _OggAutocastPtr::_OggAutocastPtr(void* pp)
{
} /* size: 0 */

// <020EAD6B> ../thirdparty/minivorbis/minivorbis.h:49
inline void _OggAutocastPtr::_OggAutocastPtr(void* pp)
{
} /* size: 0 */

// <020CD68F> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator unsigned char*<unsigned _OggAutocastPtr::char>()
{
} /* size: 0 */

// <020CD66F> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::int*<int>()
{
} /* size: 0 */

// <020CD64F> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator long int*<long _OggAutocastPtr::int>()
{
} /* size: 0 */

// <020CD62F> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::float*<float>()
{
} /* size: 0 */

// <020CD60F> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::oggpack_buffer*<oggpack_buffer>()
{
} /* size: 0 */

// <020CD5EF> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::alloc_chain*<alloc_chain>()
{
} /* size: 0 */

// <020CD5CA> ../thirdparty/minivorbis/minivorbis.h:50
inline void** operator _OggAutocastPtr::void**<void*>()
{
} /* size: 0 */

// <020CD5AA> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::codebook*<codebook>()
{
} /* size: 0 */

// <020CD58A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_look_psy*<vorbis_look_psy>()
{
} /* size: 0 */

// <020CD56A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::float**<float*>()
{
} /* size: 0 */

// <020CD54A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::envelope_lookup*<envelope_lookup>()
{
} /* size: 0 */

// <020CD52A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::envelope_filter_state*<envelope_filter_state>()
{
} /* size: 0 */

// <020CD50A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_look_psy_global*<vorbis_look_psy_global>()
{
} /* size: 0 */

// <020CD4EA> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::float***<float**>()
{
} /* size: 0 */

// <020CD4CA> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::char**<char*>()
{
} /* size: 0 */

// <020CD4AA> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::char*<char>()
{
} /* size: 0 */

// <020CD48A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info_mode*<vorbis_info_mode>()
{
} /* size: 0 */

// <020CD46A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info_floor1*<vorbis_info_floor1>()
{
} /* size: 0 */

// <020CD44A> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_look_floor1*<vorbis_look_floor1>()
{
} /* size: 0 */

// <020CD424> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info_floor0*<vorbis_info_floor0>()
{
} /* size: 0 */

// <020CD404> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_look_floor0*<vorbis_look_floor0>()
{
} /* size: 0 */

// <020CD3DE> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::int**<int*>()
{
} /* size: 0 */

// <020CD3BE> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info_residue0*<vorbis_info_residue0>()
{
} /* size: 0 */

// <020CD398> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_look_residue0*<vorbis_look_residue0>()
{
} /* size: 0 */

// <020CD372> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::codebook***<codebook**>()
{
} /* size: 0 */

// <020CD34C> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::codebook**<codebook*>()
{
} /* size: 0 */

// <020CD320> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator long int**<long _OggAutocastPtr::int*>()
{
} /* size: 0 */

// <020CD300> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info_mapping0*<vorbis_info_mapping0>()
{
} /* size: 0 */

// <020CD2DA> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::int***<int**>()
{
} /* size: 0 */

// <020CD2B4> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::static_codebook*<static_codebook>()
{
} /* size: 0 */

// <020CD28E> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator unsigned int*<unsigned _OggAutocastPtr::int>()
{
} /* size: 0 */

// <020CD26E> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_info*<vorbis_info>()
{
} /* size: 0 */

// <020CD248> ../thirdparty/minivorbis/minivorbis.h:50
inline void operator _OggAutocastPtr::vorbis_comment*<vorbis_comment>()
{
} /* size: 0 */

// <020EAD4D> ../thirdparty/minivorbis/minivorbis.h:51
inline void* operator _OggAutocastPtr::void*()
{
} /* size: 0 */

// <020C9B78> ../thirdparty/minivorbis/minivorbis.h:229
// member variables: 2
// struct size: 16
typedef struct {
	void * iov_base; /* 0 8 */
	size_t iov_len; /* 8 8 */
} ogg_iovec_t;

// <020BFD40> ../thirdparty/minivorbis/minivorbis.h:234
// member variables: 5
// struct size: 40
typedef struct {
	long int endbyte; /* 0 8 */
	int endbit; /* 8 4 */
	unsigned char * buffer; /* 16 8 */
	unsigned char * ptr; /* 24 8 */
	long int storage; /* 32 8 */
} oggpack_buffer;

// <020C9C15> ../thirdparty/minivorbis/minivorbis.h:245
// member variables: 4
// struct size: 32
typedef struct {
	unsigned char * header; /* 0 8 */
	long int header_len; /* 8 8 */
	unsigned char * body; /* 16 8 */
	long int body_len; /* 24 8 */
} ogg_page;

// <020BFDA5> ../thirdparty/minivorbis/minivorbis.h:255
// member variables: 18
// struct size: 408
typedef struct {
	unsigned char * body_data; /* 0 8 */
	long int body_storage; /* 8 8 */
	long int body_fill; /* 16 8 */
	long int body_returned; /* 24 8 */
	int * lacing_vals; /* 32 8 */
	ogg_int64_t * granule_vals; /* 40 8 */
	long int lacing_storage; /* 48 8 */
	long int lacing_fill; /* 56 8 */
	long int lacing_packet; /* 64 8 */
	long int lacing_returned; /* 72 8 */
	unsigned char header[282]; /* 80 282 */
	int header_fill; /* 364 4 */
	int e_o_s; /* 368 4 */
	int b_o_s; /* 372 4 */
	long int serialno; /* 376 8 */
	long int pageno; /* 384 8 */
	ogg_int64_t packetno; /* 392 8 */
	ogg_int64_t granulepos; /* 400 8 */
} ogg_stream_state;

// <020C9DCB> ../thirdparty/minivorbis/minivorbis.h:292
// member variables: 6
// struct size: 48
typedef struct {
	unsigned char * packet; /* 0 8 */
	long int bytes; /* 8 8 */
	long int b_o_s; /* 16 8 */
	long int e_o_s; /* 24 8 */
	ogg_int64_t granulepos; /* 32 8 */
	ogg_int64_t packetno; /* 40 8 */
} ogg_packet;

// <020BFF00> ../thirdparty/minivorbis/minivorbis.h:307
// member variables: 7
// struct size: 32
typedef struct {
	unsigned char * data; /* 0 8 */
	int storage; /* 8 4 */
	int fill; /* 12 4 */
	int returned; /* 16 4 */
	int unsynced; /* 20 4 */
	int headerbytes; /* 24 4 */
	int bodybytes; /* 28 4 */
} ogg_sync_state;

// <020BFF8C> ../thirdparty/minivorbis/minivorbis.h:439
// member variables: 8
// struct size: 56
struct vorbis_info {
	int version; /* 0 4 */
	int channels; /* 4 4 */
	long int rate; /* 8 8 */
	long int bitrate_upper; /* 16 8 */
	long int bitrate_nominal; /* 24 8 */
	long int bitrate_lower; /* 32 8 */
	long int bitrate_window; /* 40 8 */
	void * codec_setup; /* 48 8 */
};

// <020C0028> ../thirdparty/minivorbis/minivorbis.h:470
// member variables: 20
// struct size: 144
struct vorbis_dsp_state {
	int analysisp; /* 0 4 */
	vorbis_info * vi; /* 8 8 */
	float * * pcm; /* 16 8 */
	float * * pcmret; /* 24 8 */
	int pcm_storage; /* 32 4 */
	int pcm_current; /* 36 4 */
	int pcm_returned; /* 40 4 */
	int preextrapolate; /* 44 4 */
	int eofflag; /* 48 4 */
	long int lW; /* 56 8 */
	long int W; /* 64 8 */
	long int nW; /* 72 8 */
	long int centerW; /* 80 8 */
	ogg_int64_t granulepos; /* 88 8 */
	ogg_int64_t sequence; /* 96 8 */
	ogg_int64_t glue_bits; /* 104 8 */
	ogg_int64_t time_bits; /* 112 8 */
	ogg_int64_t floor_bits; /* 120 8 */
	ogg_int64_t res_bits; /* 128 8 */
	void * backend_state; /* 136 8 */
};

// <020C018D> ../thirdparty/minivorbis/minivorbis.h:499
// member variables: 21
// struct size: 192
struct vorbis_block {
	float * * pcm; /* 0 8 */
	oggpack_buffer opb; /* 8 40 */
	long int lW; /* 48 8 */
	long int W; /* 56 8 */
	long int nW; /* 64 8 */
	int pcmend; /* 72 4 */
	int mode; /* 76 4 */
	int eofflag; /* 80 4 */
	ogg_int64_t granulepos; /* 88 8 */
	ogg_int64_t sequence; /* 96 8 */
	vorbis_dsp_state * vd; /* 104 8 */
	void * localstore; /* 112 8 */
	long int localtop; /* 120 8 */
	long int localalloc; /* 128 8 */
	long int totaluse; /* 136 8 */
	alloc_chain * reap; /* 144 8 */
	long int glue_bits; /* 152 8 */
	long int time_bits; /* 160 8 */
	long int floor_bits; /* 168 8 */
	long int res_bits; /* 176 8 */
	void * internal; /* 184 8 */
};

// <020C02F5> ../thirdparty/minivorbis/minivorbis.h:538
// member variables: 2
// struct size: 16
struct alloc_chain {
	void * ptr; /* 0 8 */
	alloc_chain * next; /* 8 8 */
};

// <020C0337> ../thirdparty/minivorbis/minivorbis.h:551
// member variables: 4
// struct size: 32
struct vorbis_comment {
	char * * user_comments; /* 0 8 */
	int * comment_lengths; /* 8 8 */
	int comments; /* 16 4 */
	char * vendor; /* 24 8 */
};

// <020C0393> ../thirdparty/minivorbis/minivorbis.h:692
// member functions: 4
// member variables: 4
// struct size: 32
typedef struct {
	size_t (*read_func)(void* , size_t, size_t, void* ); /* 0 8* /
	int (*seek_func)(void* , ogg_int64_t, int); /* 8 8* /
	int (*close_func)(void* ); /* 16 8* /
	long int (*tell_func)(void* ); /* 24 8* /
} ov_callbacks;

// <020C0481> ../thirdparty/minivorbis/minivorbis.h:764
// member variables: 22
// struct size: 944
struct OggVorbis_File {
	void * datasource; /* 0 8 */
	int seekable; /* 8 4 */
	ogg_int64_t offset; /* 16 8 */
	ogg_int64_t end; /* 24 8 */
	ogg_sync_state oy; /* 32 32 */
	int links; /* 64 4 */
	ogg_int64_t * offsets; /* 72 8 */
	ogg_int64_t * dataoffsets; /* 80 8 */
	long int * serialnos; /* 88 8 */
	ogg_int64_t * pcmlengths; /* 96 8 */
	vorbis_info * vi; /* 104 8 */
	vorbis_comment * vc; /* 112 8 */
	ogg_int64_t pcm_offset; /* 120 8 */
	int ready_state; /* 128 4 */
	long int current_serialno; /* 136 8 */
	int current_link; /* 144 4 */
	double bittrack; /* 152 8 */
	double samptrack; /* 160 8 */
	ogg_stream_state os; /* 168 408 */
	vorbis_dsp_state vd; /* 576 144 */
	vorbis_block vb; /* 720 192 */
	ov_callbacks callbacks; /* 912 32 */
};

// <020C164A> ../thirdparty/minivorbis/minivorbis.h:802
int ov_clear(OggVorbis_File *)
{
} /* size: 0 */

// <020C1690> ../thirdparty/minivorbis/minivorbis.h:805
int ov_open_callbacks(void *, OggVorbis_File *, const char *, long int, ov_callbacks)
{
} /* size: 0 */

// <020C15AD> ../thirdparty/minivorbis/minivorbis.h:820
ogg_int64_t ov_pcm_total(OggVorbis_File *, int)
{
} /* size: 0 */

// <020C158F> ../thirdparty/minivorbis/minivorbis.h:821
double ov_time_total(OggVorbis_File *, int)
{
} /* size: 0 */

// <020C1503> ../thirdparty/minivorbis/minivorbis.h:826
int ov_time_seek(OggVorbis_File *, double)
{
} /* size: 0 */

// <020C1576> ../thirdparty/minivorbis/minivorbis.h:836
ogg_int64_t ov_pcm_tell(OggVorbis_File *)
{
} /* size: 0 */

// <020C15CB> ../thirdparty/minivorbis/minivorbis.h:839
vorbis_info* ov_info(OggVorbis_File *, int)
{
} /* size: 0 */

// <020C1527> ../thirdparty/minivorbis/minivorbis.h:847
long int ov_read(OggVorbis_File *, char *, int, int, int, int, int *)
{
} /* size: 0 */

// <020EAD32> ../thirdparty/minivorbis/minivorbis.h:902
void oggpack_writeinit(oggpack_buffer* b)
{
} /* size: 0 */

// <020EAC44> ../thirdparty/minivorbis/minivorbis.h:909
// function calls: 3
void oggpackB_writeinit(oggpack_buffer* b)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 903
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 904
	oggpack_writeinit(oggpack_buffer* b); // 910
} /* size: 0, inline expansions: 3 (0 bytes) */

// <020EAC25> ../thirdparty/minivorbis/minivorbis.h:913
int oggpack_writecheck(oggpack_buffer* b)
{
} /* size: 0 */

// <020EABC0> ../thirdparty/minivorbis/minivorbis.h:918
// function call: 1
int oggpackB_writecheck(oggpack_buffer* b)
{
	oggpack_writecheck(oggpack_buffer* b); // 919
} /* size: 0, inline expansions: 1 (0 bytes) */

// <020EAB8B> ../thirdparty/minivorbis/minivorbis.h:922
// variable: 1
void oggpack_writetrunc(oggpack_buffer* b, long int bits)
{
	long int bytes; // 923
} /* size: 0, variables: 1 */

// <020EAB31> ../thirdparty/minivorbis/minivorbis.h:933
// variable: 1
void oggpackB_writetrunc(oggpack_buffer* b, long int bits)
{
	long int bytes; // 934
} /* size: 0, variables: 1 */

// <020EA9CB> ../thirdparty/minivorbis/minivorbis.h:945
// variable: 1
// function calls: 3
void oggpack_write(oggpack_buffer* b, long unsigned int value, int bits)
{

err: // 983
	{
		void* ret; // 948
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 951
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1114
	oggpack_writeclear(oggpack_buffer* b); // 984
} /* size: 388, goto labels: 1, inline expansions: 2 (100 bytes) */

// <020EA865> ../thirdparty/minivorbis/minivorbis.h:988
// variable: 1
// function calls: 3
void oggpackB_write(oggpack_buffer* b, long unsigned int value, int bits)
{

err: // 1026
	{
		void* ret; // 991
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 994
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1114
	oggpack_writeclear(oggpack_buffer* b); // 1027
} /* size: 0, goto labels: 1, inline expansions: 2 (0 bytes) */

// <020EA806> ../thirdparty/minivorbis/minivorbis.h:1030
// variable: 1
void oggpack_writealign(oggpack_buffer* b)
{
	int bits; // 1031
} /* size: 0, variables: 1 */

// <020EA7A7> ../thirdparty/minivorbis/minivorbis.h:1036
// variable: 1
void oggpackB_writealign(oggpack_buffer* b)
{
	int bits; // 1037
} /* size: 0, variables: 1 */

// <020EA4FE> ../thirdparty/minivorbis/minivorbis.h:1042
// variables: 5
// function calls: 4
void oggpack_writecopy_helper(oggpack_buffer* b, void* source, long int bits, void (*w)(oggpack_buffer *, long unsigned int, int), int msb)
{

err: // 1089
	unsigned char* ptr; // 1049
	long int bytes; // 1051
	long int pbytes; // 1052
	{
		void* ret; // 1057
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 1061
	}
	{
		int i; // 1069
	}
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 1075
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1114
	oggpack_writeclear(oggpack_buffer* b); // 1090
} /* size: 0, variables: 3, goto labels: 1, inline expansions: 3 (0 bytes) */

// <020EA468> ../thirdparty/minivorbis/minivorbis.h:1093
void oggpack_writecopy(oggpack_buffer* b, void* source, long int bits)
{
} /* size: 0 */

// <020EA3D2> ../thirdparty/minivorbis/minivorbis.h:1097
void oggpackB_writecopy(oggpack_buffer* b, void* source, long int bits)
{
} /* size: 0 */

// <020EA3B7> ../thirdparty/minivorbis/minivorbis.h:1101
void oggpack_reset(oggpack_buffer* b)
{
} /* size: 0 */

// <020EA39C> ../thirdparty/minivorbis/minivorbis.h:1108
void oggpackB_reset(oggpack_buffer* b)
{
} /* size: 0 */

// <020EA381> ../thirdparty/minivorbis/minivorbis.h:1112
void oggpack_writeclear(oggpack_buffer* b)
{
} /* size: 0 */

// <020EA2C9> ../thirdparty/minivorbis/minivorbis.h:1117
// function calls: 2
void oggpackB_writeclear(oggpack_buffer* b)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1114
	oggpack_writeclear(oggpack_buffer* b); // 1118
} /* size: 0, inline expansions: 2 (0 bytes) */

// <020EA294> ../thirdparty/minivorbis/minivorbis.h:1121
void oggpack_readinit(oggpack_buffer* b, unsigned char* buf, int bytes)
{
} /* size: 0 */

// <020EA1BC> ../thirdparty/minivorbis/minivorbis.h:1127
// function calls: 2
void oggpackB_readinit(oggpack_buffer* b, unsigned char* buf, int bytes)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1122
	oggpack_readinit(oggpack_buffer* b,
			unsigned char* buf,
			int bytes);  // 1128
} /* size: 0, inline expansions: 2 (0 bytes) */

// <020EA145> ../thirdparty/minivorbis/minivorbis.h:1132
// variables: 2
long int oggpack_look(oggpack_buffer* b, int bits)
{
	long unsigned int ret; // 1133
	long unsigned int m; // 1134
} /* size: 224, variables: 2 */

// <020EA0CE> ../thirdparty/minivorbis/minivorbis.h:1164
// variables: 2
long int oggpackB_look(oggpack_buffer* b, int bits)
{
	long unsigned int ret; // 1165
	int m; // 1166
} /* size: 0, variables: 2 */

// <020EA09A> ../thirdparty/minivorbis/minivorbis.h:1194
long int oggpack_look1(oggpack_buffer* b)
{
} /* size: 0 */

// <020EA066> ../thirdparty/minivorbis/minivorbis.h:1199
long int oggpackB_look1(oggpack_buffer* b)
{
} /* size: 0 */

// <020EA02D> ../thirdparty/minivorbis/minivorbis.h:1204
void oggpack_adv(oggpack_buffer* b, int bits)
{

overflow: // 1214
} /* size: 0, goto labels: 1 */

// <020E9FA9> ../thirdparty/minivorbis/minivorbis.h:1220
// function call: 1
void oggpackB_adv(oggpack_buffer* b, int bits)
{

overflow: // 1214
	oggpack_adv(oggpack_buffer* b,
			int bits);  // 1221
} /* size: 0, goto labels: 1, inline expansions: 1 (0 bytes) */

// <020E9F8E> ../thirdparty/minivorbis/minivorbis.h:1224
void oggpack_adv1(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9EFC> ../thirdparty/minivorbis/minivorbis.h:1232
// function calls: 2
void oggpackB_adv1(oggpack_buffer* b)
{
	oggpack_adv1(oggpack_buffer* b); // 1224
	oggpack_adv1(oggpack_buffer* b); // 1233
} /* size: 0, inline expansions: 2 (0 bytes) */

// <020E9E61> ../thirdparty/minivorbis/minivorbis.h:1237
// variables: 2
long int oggpack_read(oggpack_buffer* b, int bits)
{

overflow: // 1272

err: // 1273
	long int ret; // 1238
	long unsigned int m; // 1239
} /* size: 291, variables: 2, goto labels: 2 */

// <020E9DC6> ../thirdparty/minivorbis/minivorbis.h:1281
// variables: 2
long int oggpackB_read(oggpack_buffer* b, int bits)
{

overflow: // 1315

err: // 1316
	long int ret; // 1282
	long int m; // 1283
} /* size: 0, variables: 2, goto labels: 2 */

// <020E9D6C> ../thirdparty/minivorbis/minivorbis.h:1323
// variable: 1
long int oggpack_read1(oggpack_buffer* b)
{

overflow: // 1337
	long int ret; // 1324
} /* size: 0, variables: 1, goto labels: 1 */

// <020E9D12> ../thirdparty/minivorbis/minivorbis.h:1344
// variable: 1
long int oggpackB_read1(oggpack_buffer* b)
{

overflow: // 1358
	long int ret; // 1345
} /* size: 0, variables: 1, goto labels: 1 */

// <020E9CF3> ../thirdparty/minivorbis/minivorbis.h:1365
long int oggpack_bytes(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9CD4> ../thirdparty/minivorbis/minivorbis.h:1369
long int oggpack_bits(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9CB5> ../thirdparty/minivorbis/minivorbis.h:1373
long int oggpackB_bytes(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9C96> ../thirdparty/minivorbis/minivorbis.h:1377
long int oggpackB_bits(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9C77> ../thirdparty/minivorbis/minivorbis.h:1381
unsigned char* oggpack_get_buffer(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9C58> ../thirdparty/minivorbis/minivorbis.h:1385
unsigned char* oggpackB_get_buffer(oggpack_buffer* b)
{
} /* size: 0 */

// <020E9C38> ../thirdparty/minivorbis/minivorbis.h:1983
int ogg_page_version(const ogg_page* og)
{
} /* size: 0 */

// <020E9C18> ../thirdparty/minivorbis/minivorbis.h:1987
int ogg_page_continued(const ogg_page* og)
{
} /* size: 0 */

// <020E9BF8> ../thirdparty/minivorbis/minivorbis.h:1991
int ogg_page_bos(const ogg_page* og)
{
} /* size: 0 */

// <020E9BD8> ../thirdparty/minivorbis/minivorbis.h:1995
int ogg_page_eos(const ogg_page* og)
{
} /* size: 0 */

// <020E9B79> ../thirdparty/minivorbis/minivorbis.h:1999
// variables: 2
ogg_int64_t ogg_page_granulepos(const ogg_page* og)
{
	unsigned char* page; // 2000
	ogg_uint64_t granulepos; // 2001
} /* size: 12, variables: 2 */

// <020E9B59> ../thirdparty/minivorbis/minivorbis.h:2012
int ogg_page_serialno(const ogg_page* og)
{
} /* size: 0 */

// <020E9B39> ../thirdparty/minivorbis/minivorbis.h:2019
long int ogg_page_pageno(const ogg_page* og)
{
} /* size: 0 */

// <020E9ABD> ../thirdparty/minivorbis/minivorbis.h:2045
// variables: 3
int ogg_page_packets(const ogg_page* og)
{
	int i; // 2046
	int n; // 2046
	int count; // 2046
} /* size: 0, variables: 3 */

// <020E991C> ../thirdparty/minivorbis/minivorbis.h:2361
// function calls: 4
int ogg_stream_init(ogg_stream_state* os, int serialno)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 2363
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 2367
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 2368
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 2369
} /* size: 163, inline expansions: 4 (10 bytes) */

// <020E98FC> ../thirdparty/minivorbis/minivorbis.h:2384
int ogg_stream_check(ogg_stream_state* os)
{
} /* size: 0 */

// <020E984A> ../thirdparty/minivorbis/minivorbis.h:2390
// function call: 1
int ogg_stream_clear(ogg_stream_state* os)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 2396
} /* size: 91, inline expansions: 1 (13 bytes) */

// <020E97E0> ../thirdparty/minivorbis/minivorbis.h:2401
int ogg_stream_destroy(ogg_stream_state* os)
{
} /* size: 0 */

// <020E9700> ../thirdparty/minivorbis/minivorbis.h:2412
// variables: 2
// function call: 1
int _os_body_expand(ogg_stream_state* os, long int needed)
{
	{
		long int body_storage; // 2414
		void* ret; // 2415
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 2422
	}
} /* size: 135 */

// <020E95C4> ../thirdparty/minivorbis/minivorbis.h:2433
// variables: 2
// function calls: 2
int _os_lacing_expand(ogg_stream_state* os, long int needed)
{
	{
		long int lacing_storage; // 2435
		void* ret; // 2436
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 2443
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 2449
	}
} /* size: 157 */

// <020E955E> ../thirdparty/minivorbis/minivorbis.h:2465
ogg_uint32_t _os_update_crc(ogg_uint32_t crc, unsigned char* buffer, int size)
{
} /* size: 257 */

// <020E94D5> ../thirdparty/minivorbis/minivorbis.h:2483
// variable: 1
void ogg_page_checksum_set(ogg_page* og)
{
	{
		ogg_uint32_t crc_reg; // 2485
	}
} /* size: 121 */

// <020E92F3> ../thirdparty/minivorbis/minivorbis.h:2504
// variables: 3
// function calls: 3
int ogg_stream_iovecin(ogg_stream_state* os, ogg_iovec_t* iov, int count, long int e_o_s, ogg_int64_t granulepos)
{
	long int bytes; // 2507
	long int lacing_vals; // 2507
	int i; // 2508
	ogg_stream_check(ogg_stream_state* os); // 2510
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 2542
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 2527
} /* size: 0, variables: 3, inline expansions: 3 (0 bytes) */

// <020E9262> ../thirdparty/minivorbis/minivorbis.h:2567
// variable: 1
int ogg_stream_packetin(ogg_stream_state* os, ogg_packet* op)
{
	ogg_iovec_t iov; // 2568
} /* size: 0, variables: 1 */

// <020E8FCB> ../thirdparty/minivorbis/minivorbis.h:2577
// variables: 10
// function calls: 4
int ogg_stream_flush_i(ogg_stream_state* os, ogg_page* og, int force, int nfill)
{
	int i; // 2578
	int vals; // 2579
	int maxvals; // 2580
	int bytes; // 2581
	long int acc; // 2582
	ogg_int64_t granule_pos; // 2583
	{
		int packets_done; // 2612
		int packet_just_done; // 2613
	}
	{
		long int serialno; // 2654
	}
	{
		long int pageno; // 2669
	}
	ogg_stream_check(ogg_stream_state* os); // 2585
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 2632
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 2696
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 2697
} /* size: 0, variables: 6, inline expansions: 4 (0 bytes) */

// <020E8F53> ../thirdparty/minivorbis/minivorbis.h:2722
int ogg_stream_flush(ogg_stream_state* os, ogg_page* og)
{
} /* size: 0 */

// <020E8EC6> ../thirdparty/minivorbis/minivorbis.h:2730
int ogg_stream_flush_fill(ogg_stream_state* os, ogg_page* og, int nfill)
{
} /* size: 0 */

// <020E8DFC> ../thirdparty/minivorbis/minivorbis.h:2738
// variable: 1
// function call: 1
int ogg_stream_pageout(ogg_stream_state* os, ogg_page* og)
{
	int force; // 2739
	ogg_stream_check(ogg_stream_state* os); // 2740
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <020E8D3C> ../thirdparty/minivorbis/minivorbis.h:2753
// variable: 1
// function call: 1
int ogg_stream_pageout_fill(ogg_stream_state* os, ogg_page* og, int nfill)
{
	int force; // 2754
	ogg_stream_check(ogg_stream_state* os); // 2755
} /* size: 0, variables: 1, inline expansions: 1 (0 bytes) */

// <020E8CD6> ../thirdparty/minivorbis/minivorbis.h:2764
// function call: 1
int ogg_stream_eos(ogg_stream_state* os)
{
	ogg_stream_check(ogg_stream_state* os); // 2765
} /* size: 0, inline expansions: 1 (0 bytes) */

// <020E8CB6> ../thirdparty/minivorbis/minivorbis.h:2785
int ogg_sync_init(ogg_sync_state* oy)
{
} /* size: 0 */

// <020E8C96> ../thirdparty/minivorbis/minivorbis.h:2794
int ogg_sync_clear(ogg_sync_state* oy)
{
} /* size: 0 */

// <020E8C17> ../thirdparty/minivorbis/minivorbis.h:2802
// function call: 1
int ogg_sync_destroy(ogg_sync_state* oy)
{
	ogg_sync_clear(ogg_sync_state* oy); // 2804
} /* size: 0, inline expansions: 1 (0 bytes) */

// <020E8BF7> ../thirdparty/minivorbis/minivorbis.h:2810
int ogg_sync_check(ogg_sync_state* oy)
{
} /* size: 0 */

// <020E8A3B> ../thirdparty/minivorbis/minivorbis.h:2815
// variables: 2
// function calls: 4
char* ogg_sync_buffer(ogg_sync_state* oy, long int size)
{
	{
		long int newsize; // 2828
		void* ret; // 2829
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 2832
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 2834
	}
	ogg_sync_check(ogg_sync_state* oy); // 2816
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 2822
} /* size: 196, inline expansions: 2 (16 bytes) */

// <020E8A0E> ../thirdparty/minivorbis/minivorbis.h:2847
int ogg_sync_wrote(ogg_sync_state* oy, long int bytes)
{
} /* size: 0 */

// <020E8799> ../thirdparty/minivorbis/minivorbis.h:2864
// variables: 7
// function calls: 5
long int ogg_sync_pageseek(ogg_sync_state* oy, ogg_page* og)
{

sync_fail: // 2936
	unsigned char* page; // 2865
	unsigned char* next; // 2866
	long int bytes; // 2867
	{
		int headerbytes; // 2872
		int i; // 2872
	}
	{
		char chksum; // 2893
		ogg_page log; // 2894
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 2896
		memset(void* __dest,
			int __ch,
			size_t __len);  // 2897
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 2911
	}
	ogg_sync_check(ogg_sync_state* oy); // 2869
	memchr(void* __s,
		int __c,
		size_t __n);  // 2942
} /* size: 494, variables: 3, goto labels: 1, inline expansions: 2 (28 bytes) */

// <020E86DF> ../thirdparty/minivorbis/minivorbis.h:2961
// variable: 1
// function call: 1
int ogg_sync_pageout(ogg_sync_state* oy, ogg_page* og)
{
	{
		long int ret; // 2970
	}
	ogg_sync_check(ogg_sync_state* oy); // 2963
} /* size: 0, inline expansions: 1 (0 bytes) */

// <020E8264> ../thirdparty/minivorbis/minivorbis.h:2994
// variables: 18
// function calls: 10
int ogg_stream_pagein(ogg_stream_state* os, ogg_page* og)
{
	unsigned char* header; // 2995
	unsigned char* body; // 2996
	long int bodysize; // 2997
	int segptr; // 2998
	int version; // 3000
	int continued; // 3001
	int bos; // 3002
	int eos; // 3003
	ogg_int64_t granulepos; // 3004
	int serialno; // 3005
	long int pageno; // 3006
	int segments; // 3007
	{
		long int lr; // 3013
		long int br; // 3014
		memmove(void* __dest,
			const void* __src,
			size_t __len);  // 3027
		memmove(void* __dest,
			const void* __src,
			size_t __len);  // 3029
		memmove(void* __dest,
			const void* __src,
			size_t __len);  // 3020
	}
	{
		int i; // 3046
	}
	{
		int val; // 3068
	}
	{
		int saved; // 3086
		{
			int val; // 3088
		}
	}
	ogg_page_version(const ogg_page* og); // 3000
	ogg_page_continued(const ogg_page* og); // 3001
	ogg_page_bos(const ogg_page* og); // 3002
	ogg_page_serialno(const ogg_page* og); // 3005
	ogg_page_pageno(const ogg_page* og); // 3006
	ogg_stream_check(ogg_stream_state* os); // 3009
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 3081
} /* size: 1000, variables: 12, inline expansions: 7 (67 bytes) */

// <020E823E> ../thirdparty/minivorbis/minivorbis.h:3124
int ogg_sync_reset(ogg_sync_state* oy)
{
} /* size: 0 */

// <020E821E> ../thirdparty/minivorbis/minivorbis.h:3135
int ogg_stream_reset(ogg_stream_state* os)
{
} /* size: 0 */

// <020E81F1> ../thirdparty/minivorbis/minivorbis.h:3156
int ogg_stream_reset_serialno(ogg_stream_state* os, int serialno)
{
} /* size: 0 */

// <020E8109> ../thirdparty/minivorbis/minivorbis.h:3163
// variables: 6
int _packetout(ogg_stream_state* os, ogg_packet* op, int adv)
{
	int ptr; // 3169
	{
		int size; // 3187
		long int bytes; // 3188
		int eos; // 3189
		int bos; // 3190
		{
			int val; // 3193
		}
	}
} /* size: 332, variables: 1 */

// <020E80DD> ../thirdparty/minivorbis/minivorbis.h:3217
int ogg_stream_packetout(ogg_stream_state* os, ogg_packet* op)
{
} /* size: 0 */

// <020E80AB> ../thirdparty/minivorbis/minivorbis.h:3222
int ogg_stream_packetpeek(ogg_stream_state* os, ogg_packet* op)
{
} /* size: 0 */

// <020E8017> ../thirdparty/minivorbis/minivorbis.h:3227
// function call: 1
void ogg_packet_clear(ogg_packet* op)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 3229
} /* size: 0, inline expansions: 1 (0 bytes) */

// <020E7FF9> ../thirdparty/minivorbis/minivorbis.h:4561
inline int vorbis_ftoi(double f)
{
} /* size: 0 */

// <020E7FD7> ../thirdparty/minivorbis/minivorbis.h:4565
inline void vorbis_fpu_setround(vorbis_fpu_control* fpu)
{
} /* size: 0 */

// <020E7FBB> ../thirdparty/minivorbis/minivorbis.h:4569
inline void vorbis_fpu_restore(vorbis_fpu_control fpu)
{
} /* size: 0 */

// <020CA5B7> ../thirdparty/minivorbis/minivorbis.h:4650
// member variables: 5
// struct size: 32
typedef struct {
	int n; /* 0 4 */
	int log2n; /* 4 4 */
	float * trig; /* 8 8 */
	int * bitrev; /* 16 8 */
	float scale; /* 24 4 */
} mdct_lookup;

// <020CA621> ../thirdparty/minivorbis/minivorbis.h:4698
// member variables: 6
// struct size: 144
typedef struct {
	float ampbuf[17]; /* 0 68 */
	int ampptr; /* 68 4 */
	float nearDC[15]; /* 72 60 */
	float nearDC_acc; /* 132 4 */
	float nearDC_partialacc; /* 136 4 */
	int nearptr; /* 140 4 */
} envelope_filter_state;

// <020CA6C0> ../thirdparty/minivorbis/minivorbis.h:4709
// member variables: 4
// struct size: 24
typedef struct {
	int begin; /* 0 4 */
	int end; /* 4 4 */
	float * window; /* 8 8 */
	float total; /* 16 4 */
} envelope_band;

// <020CA71C> ../thirdparty/minivorbis/minivorbis.h:4716
// member variables: 14
// struct size: 280
typedef struct {
	int ch; /* 0 4 */
	int winlength; /* 4 4 */
	int searchstep; /* 8 4 */
	float minenergy; /* 12 4 */
	mdct_lookup mdct; /* 16 32 */
	float * mdct_win; /* 48 8 */
	envelope_band band[7]; /* 56 168 */
	envelope_filter_state * filter; /* 224 8 */
	int stretch; /* 232 4 */
	int * mark; /* 240 8 */
	long int storage; /* 248 8 */
	long int current; /* 256 8 */
	long int curmark; /* 264 8 */
	long int cursor; /* 272 8 */
} envelope_lookup;

// <020CA836> ../thirdparty/minivorbis/minivorbis.h:4779
// member variables: 10
// struct size: 72
struct static_codebook {
	long int dim; /* 0 8 */
	long int entries; /* 8 8 */
	char * lengthlist; /* 16 8 */
	int maptype; /* 24 4 */
	long int q_min; /* 32 8 */
	long int q_delta; /* 40 8 */
	int q_quant; /* 48 4 */
	int q_sequencep; /* 52 4 */
	long int * quantlist; /* 56 8 */
	int allocedp; /* 64 4 */
};

// <020CA8F7> ../thirdparty/minivorbis/minivorbis.h:4801
// member variables: 14
// struct size: 96
struct codebook {
	long int dim; /* 0 8 */
	long int entries; /* 8 8 */
	long int used_entries; /* 16 8 */
	const static_codebook * c; /* 24 8 */
	float * valuelist; /* 32 8 */
	ogg_uint32_t * codelist; /* 40 8 */
	int * dec_index; /* 48 8 */
	char * dec_codelengths; /* 56 8 */
	ogg_uint32_t * dec_firsttable; /* 64 8 */
	int dec_firsttablen; /* 72 4 */
	int dec_maxlength; /* 76 4 */
	int quantvals; /* 80 4 */
	int minval; /* 84 4 */
	int delta; /* 88 4 */
};

// <020CA9FD> ../thirdparty/minivorbis/minivorbis.h:4883
// member variables: 3
// struct size: 24
typedef struct {
	int n; /* 0 4 */
	float * trigcache; /* 8 8 */
	int * splitcache; /* 16 8 */
} drft_lookup;

// <020CAA47> ../thirdparty/minivorbis/minivorbis.h:4924
// member variables: 4
// struct size: 136
struct vorbis_block_internal {
	float * * pcmdelay; /* 0 8 */
	float ampmax; /* 8 4 */
	int blocktype; /* 12 4 */
	oggpack_buffer * packetblob[15]; /* 16 120 */
};

// <020CAAD4> ../thirdparty/minivorbis/minivorbis.h:4940
// member variables: 4
// struct size: 16
typedef struct {
	int blockflag; /* 0 4 */
	int windowtype; /* 4 4 */
	int transformtype; /* 8 4 */
	int mapping; /* 12 4 */
} vorbis_info_mode;

// <020CAB4B> ../thirdparty/minivorbis/minivorbis.h:5001
// member functions: 7
// member variables: 7
// struct size: 56
typedef struct {
	void (*pack)(vorbis_info_floor* , oggpack_buffer* ); /* 0 8* /
	vorbis_info_floor* (*unpack)(vorbis_info* , oggpack_buffer* ); /* 8 8* /
	vorbis_look_floor* (*look)(vorbis_dsp_state* , vorbis_info_floor* ); /* 16 8* /
	void (*free_info)(vorbis_info_floor* ); /* 24 8* /
	void (*free_look)(vorbis_look_floor* ); /* 32 8* /
	void* (*inverse1)(vorbis_block* , vorbis_look_floor* ); /* 40 8* /
	int (*inverse2)(vorbis_block* , vorbis_look_floor* , void* , float* ); /* 48 8* /
} vorbis_func_floor;

// <020CAC98> ../thirdparty/minivorbis/minivorbis.h:5012
// member variables: 9
// struct size: 112
typedef struct {
	int order; /* 0 4 */
	long int rate; /* 8 8 */
	long int barkmap; /* 16 8 */
	int ampbits; /* 24 4 */
	int ampdB; /* 28 4 */
	int numbooks; /* 32 4 */
	int books[16]; /* 36 64 */
	float lessthan; /* 100 4 */
	float greaterthan; /* 104 4 */
} vorbis_info_floor0;

// <020CAD44> ../thirdparty/minivorbis/minivorbis.h:5032
// member variables: 14
// struct size: 1,120
typedef struct {
	int partitions; /* 0 4 */
	int partitionclass[31]; /* 4 124 */
	int class_dim[16]; /* 128 64 */
	int class_subs[16]; /* 192 64 */
	int class_book[16]; /* 256 64 */
	int class_subbook[16][8]; /* 320 512 */
	int mult; /* 832 4 */
	int postlist[65]; /* 836 260 */
	float maxover; /* 1096 4 */
	float maxunder; /* 1100 4 */
	float maxerr; /* 1104 4 */
	float twofitweight; /* 1108 4 */
	float twofitatten; /* 1112 4 */
	int n; /* 1116 4 */
} vorbis_info_floor1;

// <020CAE82> ../thirdparty/minivorbis/minivorbis.h:5059
// member functions: 8
// member variables: 8
// struct size: 64
typedef struct {
	void (*pack)(vorbis_info_residue* , oggpack_buffer* ); /* 0 8* /
	vorbis_info_residue* (*unpack)(vorbis_info* , oggpack_buffer* ); /* 8 8* /
	vorbis_look_residue* (*look)(vorbis_dsp_state* , vorbis_info_residue* ); /* 16 8* /
	void (*free_info)(vorbis_info_residue* ); /* 24 8* /
	void (*free_look)(vorbis_look_residue* ); /* 32 8* /
	long int** (*_vorbis_class_)(vorbis_block* , vorbis_look_residue* , int** , int* , int); /* 40 8* /
	int (*forward)(oggpack_buffer* , vorbis_block* , vorbis_look_residue* , int** , int* , int, long int** , int); /* 48 8* /
	int (*inverse)(vorbis_block* , vorbis_look_residue* , float** , int* , int); /* 56 8* /
} vorbis_func_residue;

// <020CB02B> ../thirdparty/minivorbis/minivorbis.h:5075
// member variables: 10
// struct size: 2,848
struct vorbis_info_residue0 {
	long int begin; /* 0 8 */
	long int end; /* 8 8 */
	int grouping; /* 16 4 */
	int partitions; /* 20 4 */
	int partvals; /* 24 4 */
	int groupbook; /* 28 4 */
	int secondstages[64]; /* 32 256 */
	int booklist[512]; /* 288 2048 */
	const const int classmetric1[64]; /* 2336 256 */
	const const int classmetric2[64]; /* 2592 256 */
};

// <020CB121> ../thirdparty/minivorbis/minivorbis.h:5093
// member functions: 5
// member variables: 5
// struct size: 40
typedef struct {
	void (*pack)(vorbis_info* , vorbis_info_mapping* , oggpack_buffer* ); /* 0 8* /
	vorbis_info_mapping* (*unpack)(vorbis_info* , oggpack_buffer* ); /* 8 8* /
	void (*free_info)(vorbis_info_mapping* ); /* 16 8* /
	int (*forward)(vorbis_block* ); /* 24 8* /
	int (*inverse)(vorbis_block* , vorbis_info_mapping* ); /* 32 8* /
} vorbis_func_mapping;

// <020CB20D> ../thirdparty/minivorbis/minivorbis.h:5102
// member variables: 7
// struct size: 3,208
struct vorbis_info_mapping0 {
	int submaps; /* 0 4 */
	int chmuxlist[256]; /* 4 1024 */
	int floorsubmap[16]; /* 1028 64 */
	int residuesubmap[16]; /* 1092 64 */
	int coupling_steps; /* 1156 4 */
	int coupling_mag[256]; /* 1160 1024 */
	int coupling_ang[256]; /* 2184 1024 */
};

// <020CB2AF> ../thirdparty/minivorbis/minivorbis.h:5129
// member variables: 22
// struct size: 520
struct vorbis_info_psy {
	int blockflag; /* 0 4 */
	float ath_adjatt; /* 4 4 */
	float ath_maxatt; /* 8 4 */
	float tone_masteratt[3]; /* 12 12 */
	float tone_centerboost; /* 24 4 */
	float tone_decay; /* 28 4 */
	float tone_abs_limit; /* 32 4 */
	float toneatt[17]; /* 36 68 */
	int noisemaskp; /* 104 4 */
	float noisemaxsupp; /* 108 4 */
	float noisewindowlo; /* 112 4 */
	float noisewindowhi; /* 116 4 */
	int noisewindowlomin; /* 120 4 */
	int noisewindowhimin; /* 124 4 */
	int noisewindowfixed; /* 128 4 */
	float noiseoff[3][17]; /* 132 204 */
	float noisecompand[40]; /* 336 160 */
	float max_curve_dB; /* 496 4 */
	int normal_p; /* 500 4 */
	int normal_start; /* 504 4 */
	int normal_partition; /* 508 4 */
	double normal_thresh; /* 512 8 */
};

// <020CB45A> ../thirdparty/minivorbis/minivorbis.h:5159
// member variables: 11
// struct size: 492
typedef struct {
	int eighth_octave_lines; /* 0 4 */
	float preecho_thresh[7]; /* 4 28 */
	float postecho_thresh[7]; /* 32 28 */
	float stretch_penalty; /* 60 4 */
	float preecho_minenergy; /* 64 4 */
	float ampmax_att_per_sec; /* 68 4 */
	int coupling_pkHz[15]; /* 72 60 */
	int coupling_pointlimit[2][15]; /* 132 120 */
	int coupling_prepointamp[15]; /* 252 60 */
	int coupling_postpointamp[15]; /* 312 60 */
	int sliding_lowpass[2][15]; /* 372 120 */
} vorbis_info_psy_global;

// <020CB562> ../thirdparty/minivorbis/minivorbis.h:5179
// member variables: 4
// struct size: 40
typedef struct {
	float ampmax; /* 0 4 */
	int channels; /* 4 4 */
	vorbis_info_psy_global * gi; /* 8 8 */
	int coupling_pointlimit[2][3]; /* 16 24 */
} vorbis_look_psy_global;

// <020CB5D9> ../thirdparty/minivorbis/minivorbis.h:5188
// member variables: 13
// struct size: 96
typedef struct {
	int n; /* 0 4 */
	vorbis_info_psy * vi; /* 8 8 */
	float * * * tonecurves; /* 16 8 */
	float * * noiseoffset; /* 24 8 */
	float * ath; /* 32 8 */
	long int * octave; /* 40 8 */
	long int * bark; /* 48 8 */
	long int firstoc; /* 56 8 */
	long int shiftoc; /* 64 8 */
	int eighth_octave_lines; /* 72 4 */
	int total_octave_lines; /* 76 4 */
	long int rate; /* 80 8 */
	float m_val; /* 88 4 */
} vorbis_look_psy;

// <020CB6CE> ../thirdparty/minivorbis/minivorbis.h:5273
// member variables: 10
// struct size: 80
struct bitrate_manager_state {
	int managed; /* 0 4 */
	long int avg_reservoir; /* 8 8 */
	long int minmax_reservoir; /* 16 8 */
	long int avg_bitsper; /* 24 8 */
	long int min_bitsper; /* 32 8 */
	long int max_bitsper; /* 40 8 */
	long int short_per_long; /* 48 8 */
	double avgfloat; /* 56 8 */
	vorbis_block * vb; /* 64 8 */
	int choice; /* 72 4 */
};

// <020CB78F> ../thirdparty/minivorbis/minivorbis.h:5289
// member variables: 6
// struct size: 48
struct bitrate_manager_info {
	long int avg_rate; /* 0 8 */
	long int min_rate; /* 8 8 */
	long int max_rate; /* 16 8 */
	long int reservoir_bits; /* 24 8 */
	double reservoir_bias; /* 32 8 */
	double slew_damp; /* 40 8 */
};

// <020CB80B> ../thirdparty/minivorbis/minivorbis.h:5308
// member variables: 14
// struct size: 232
struct private_state {
	envelope_lookup * ve; /* 0 8 */
	int window[2]; /* 8 8 */
	vorbis_look_transform * * transform[2]; /* 16 16 */
	drft_lookup fft_look[2]; /* 32 48 */
	int modebits; /* 80 4 */
	vorbis_look_floor * * flr; /* 88 8 */
	vorbis_look_residue * * residue; /* 96 8 */
	vorbis_look_psy * psy; /* 104 8 */
	vorbis_look_psy_global * psy_g_look; /* 112 8 */
	unsigned char * header; /* 120 8 */
	unsigned char * header1; /* 128 8 */
	unsigned char * header2; /* 136 8 */
	bitrate_manager_state bms; /* 144 80 */
	ogg_int64_t sample_count; /* 224 8 */
};

// <020CB954> ../thirdparty/minivorbis/minivorbis.h:5357
// member variables: 4
// struct size: 32
struct highlevel_byblocktype {
	double tone_mask_setting; /* 0 8 */
	double tone_peaklimit_setting; /* 8 8 */
	double noise_bias_setting; /* 16 8 */
	double noise_compand_setting; /* 24 8 */
};

// <020CB9B0> ../thirdparty/minivorbis/minivorbis.h:5364
// member variables: 23
// struct size: 288
struct highlevel_encode_setup {
	int set_in_stone; /* 0 4 */
	const void * setup; /* 8 8 */
	double base_setting; /* 16 8 */
	double impulse_noisetune; /* 24 8 */
	float req; /* 32 4 */
	int managed; /* 36 4 */
	long int bitrate_min; /* 40 8 */
	long int bitrate_av; /* 48 8 */
	double bitrate_av_damp; /* 56 8 */
	long int bitrate_max; /* 64 8 */
	long int bitrate_reservoir; /* 72 8 */
	double bitrate_reservoir_bias; /* 80 8 */
	int impulse_block_p; /* 88 4 */
	int noise_normalize_p; /* 92 4 */
	int coupling_p; /* 96 4 */
	double stereo_point_setting; /* 104 8 */
	double lowpass_kHz; /* 112 8 */
	int lowpass_altered; /* 120 4 */
	double ath_floating_dB; /* 128 8 */
	double ath_absolute_dB; /* 136 8 */
	double amplitude_track_dBpersec; /* 144 8 */
	double trigger_setting; /* 152 8 */
	highlevel_byblocktype block[4]; /* 160 128 */
};

// <020CBB52> ../thirdparty/minivorbis/minivorbis.h:5398
// member variables: 21
// struct size: 5,784
struct codec_setup_info {
	long int blocksizes[2]; /* 0 16 */
	int modes; /* 16 4 */
	int maps; /* 20 4 */
	int floors; /* 24 4 */
	int residues; /* 28 4 */
	int books; /* 32 4 */
	int psys; /* 36 4 */
	vorbis_info_mode * mode_param[64]; /* 40 512 */
	int map_type[64]; /* 552 256 */
	vorbis_info_mapping * map_param[64]; /* 808 512 */
	int floor_type[64]; /* 1320 256 */
	vorbis_info_floor * floor_param[64]; /* 1576 512 */
	int residue_type[64]; /* 2088 256 */
	vorbis_info_residue * residue_param[64]; /* 2344 512 */
	static_codebook * book_param[256]; /* 2856 2048 */
	codebook * fullbooks; /* 4904 8 */
	vorbis_info_psy * psy_param[4]; /* 4912 32 */
	vorbis_info_psy_global psy_g_param; /* 4944 492 */
	bitrate_manager_info bi; /* 5440 48 */
	highlevel_encode_setup hi; /* 5488 288 */
	int halfrate_flag; /* 5776 4 */
};

// <020CBD52> ../thirdparty/minivorbis/minivorbis.h:5442
// member variables: 12
// struct size: 1,328
typedef struct {
	int sorted_index[65]; /* 0 260 */
	int forward_index[65]; /* 260 260 */
	int reverse_index[65]; /* 520 260 */
	int hineighbor[63]; /* 780 252 */
	int loneighbor[63]; /* 1032 252 */
	int posts; /* 1284 4 */
	int n; /* 1288 4 */
	int quant_q; /* 1292 4 */
	vorbis_info_floor1 * vi; /* 1296 8 */
	long int phrasebits; /* 1304 8 */
	long int postbits; /* 1312 8 */
	long int frames; /* 1320 8 */
} vorbis_look_floor1;

// <020E7EF4> ../thirdparty/minivorbis/minivorbis.h:6595
// variable: 1
inline float unitnorm(float x)
{
	union  ix; // 6599
} /* size: 0, variables: 1 */

// <020E7E2D> ../thirdparty/minivorbis/minivorbis.h:6606
// variable: 1
inline float todB(const float* x)
{
	union  ix; // 6610
} /* size: 0, variables: 1 */

// <020E7B7C> ../thirdparty/minivorbis/minivorbis.h:6728
// variables: 10
// function calls: 4
void mdct_init(mdct_lookup* lookup, int n)
{
	int* bitrev; // 6729
	float* T; // 6730
	int i; // 6732
	int n2; // 6733
	int log2n; // 6734
	{
		int mask; // 6755
		int i; // 6755
		int j; // 6755
		int msb; // 6756
		{
			int acc; // 6758
		}
	}
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 6729
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 6730
	log(float __x); // 6734
	rint(float __x); // 6734
} /* size: 773, variables: 5, inline expansions: 4 (60 bytes) */

// <020E7B32> ../thirdparty/minivorbis/minivorbis.h:6770
// variables: 4
inline void mdct_butterfly_8(float* x)
{
	float r0; // 6771
	float r1; // 6772
	float r2; // 6773
	float r3; // 6774
} /* size: 0, variables: 4 */

// <020E7A24> ../thirdparty/minivorbis/minivorbis.h:6794
// variables: 2
// function calls: 2
void mdct_butterfly_16(float* x)
{
	float r0; // 6795
	float r1; // 6796
	mdct_butterfly_8(float* x); // 6824
	mdct_butterfly_8(float* x); // 6825
} /* size: 551, variables: 2, inline expansions: 2 (296 bytes) */

// <020E7999> ../thirdparty/minivorbis/minivorbis.h:6829
// variables: 2
void mdct_butterfly_32(float* x)
{
	float r0; // 6830
	float r1; // 6831
} /* size: 903, variables: 2 */

// <020E78EB> ../thirdparty/minivorbis/minivorbis.h:6893
// variables: 4
void mdct_butterfly_first(float* T, float* x, int points)
{
	float* x1; // 6897
	float* x2; // 6898
	float r0; // 6899
	float r1; // 6900
} /* size: 434, variables: 4 */

// <020E782E> ../thirdparty/minivorbis/minivorbis.h:6940
// variables: 4
void mdct_butterfly_generic(float* T, float* x, int points, int trigint)
{
	float* x1; // 6945
	float* x2; // 6946
	float r0; // 6947
	float r1; // 6948
} /* size: 460, variables: 4 */

// <020E77CC> ../thirdparty/minivorbis/minivorbis.h:6993
// variables: 4
inline void mdct_butterflies(mdct_lookup* init, float* x, int points)
{
	float* T; // 6997
	int stages; // 6998
	int i; // 6999
	int j; // 6999
} /* size: 0, variables: 4 */

// <020E772C> ../thirdparty/minivorbis/minivorbis.h:7015
// function call: 1
void mdct_clear(mdct_lookup* l)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 7019
} /* size: 97, inline expansions: 1 (31 bytes) */

// <020E7600> ../thirdparty/minivorbis/minivorbis.h:7023
// variables: 11
void mdct__bitreverse(mdct_lookup* init, float* x)
{
	int n; // 7025
	int* bit; // 7026
	float* w0; // 7027
	float* w1; // 7028
	float* T; // 7029
	{
		float* x0; // 7032
		float* x1; // 7033
		float r0; // 7035
		float r1; // 7036
		float r2; // 7037
		float r3; // 7038
	}
} /* size: 392, variables: 5 */

// <020E73E7> ../thirdparty/minivorbis/minivorbis.h:7073
// variables: 9
// function call: 1
void mdct_backward(mdct_lookup* init, float* in, float* out)
{
	int n; // 7074
	int n2; // 7075
	int n4; // 7076
	float* iX; // 7080
	float* oX; // 7081
	float* T; // 7082
	{
		float* oX1; // 7114
		float* oX2; // 7115
		float* iX; // 7116
	}
	mdct_butterflies(mdct_lookup* init,
			float* x,
			int points);  // 7108
} /* size: 1232, variables: 6, inline expansions: 1 (259 bytes) */

// <020E7164> ../thirdparty/minivorbis/minivorbis.h:7169
// variables: 12
// function call: 1
void mdct_forward(mdct_lookup* init, float* in, float* out)
{
	int n; // 7170
	int n2; // 7171
	int n4; // 7172
	int n8; // 7173
	float* w; // 7174
	float* w2; // 7175
	float r0; // 7181
	float r1; // 7182
	float* x0; // 7183
	float* x1; // 7184
	float* T; // 7185
	int i; // 7187
	mdct_butterflies(mdct_lookup* init,
			float* x,
			int points);  // 7224
} /* size: 0, variables: 12, inline expansions: 1 (0 bytes) */

// <020E6FD5> ../thirdparty/minivorbis/minivorbis.h:7276
// variables: 24
void drfti1(int n, float* wa, int* ifac)
{

L107: // 7311

L104: // 7294

L101: // 7287
	int ntryh; // 7277
	float tpi; // 7278
	float arg; // 7279
	float argh; // 7279
	float argld; // 7279
	float fi; // 7279
	int ntry; // 7280
	int i; // 7280
	int j; // 7280
	int k1; // 7281
	int l1; // 7281
	int l2; // 7281
	int ib; // 7281
	int ld; // 7282
	int ii; // 7282
	int ip; // 7282
	int is; // 7282
	int nq; // 7282
	int nr; // 7282
	int ido; // 7283
	int ipm; // 7283
	int nfm1; // 7283
	int nl; // 7284
	int nf; // 7285
} /* size: 0, variables: 24, goto labels: 3 */

// <020E6FA1> ../thirdparty/minivorbis/minivorbis.h:7346
void fdrffti(int n, float* wsave, int* ifac)
{
} /* size: 0 */

// <020E6E33> ../thirdparty/minivorbis/minivorbis.h:7352
// variables: 11
void dradf2(int ido, int l1, float* cc, float* ch, float* wa1)
{

L105: // 7395
	int i; // 7353
	int k; // 7353
	float ti2; // 7354
	float tr2; // 7354
	int t0; // 7355
	int t1; // 7355
	int t2; // 7355
	int t3; // 7355
	int t4; // 7355
	int t5; // 7355
	int t6; // 7355
} /* size: 0, variables: 11, goto labels: 1 */

// <020E6BCA> ../thirdparty/minivorbis/minivorbis.h:7407
// variables: 24
void dradf4(int ido, int l1, float* cc, float* ch, float* wa1, float* wa2, float* wa3)
{

L105: // 7484
	float hsqt2; // 7409
	int i; // 7410
	int k; // 7410
	int t0; // 7410
	int t1; // 7410
	int t2; // 7410
	int t3; // 7410
	int t4; // 7410
	int t5; // 7410
	int t6; // 7410
	float ci2; // 7411
	float ci3; // 7411
	float ci4; // 7411
	float cr2; // 7411
	float cr3; // 7411
	float cr4; // 7411
	float ti1; // 7411
	float ti2; // 7411
	float ti3; // 7411
	float ti4; // 7411
	float tr1; // 7411
	float tr2; // 7411
	float tr3; // 7411
	float tr4; // 7411
} /* size: 0, variables: 24, goto labels: 1 */

// <020E67BF> ../thirdparty/minivorbis/minivorbis.h:7509
// variables: 35
// function calls: 2
void dradfg(int ido, int ip, int l1, int idl1, float* cc, float* c1, float* c2, float* ch, float* ch2, float* wa)
{

L141: // 7781

L135: // 7725

L132: // 7714

L119: // 7628
	float tpi; // 7512
	int idij; // 7513
	int ipph; // 7513
	int i; // 7513
	int j; // 7513
	int k; // 7513
	int l; // 7513
	int ic; // 7513
	int ik; // 7513
	int is; // 7513
	int t0; // 7514
	int t1; // 7514
	int t2; // 7514
	int t3; // 7514
	int t4; // 7514
	int t5; // 7514
	int t6; // 7514
	int t7; // 7514
	int t8; // 7514
	int t9; // 7514
	int t10; // 7514
	float dc2; // 7515
	float ai1; // 7515
	float ai2; // 7515
	float ar1; // 7515
	float ar2; // 7515
	float ds2; // 7515
	int nbd; // 7516
	float dcp; // 7517
	float arg; // 7517
	float dsp; // 7517
	float ar1h; // 7517
	float ar2h; // 7517
	int idp2; // 7518
	int ipp2; // 7518
	cos(float __x); // 7521
	sin(float __x); // 7522
} /* size: 0, variables: 35, goto labels: 4, inline expansions: 2 (0 bytes) */

// <020E6511> ../thirdparty/minivorbis/minivorbis.h:7811
// variables: 13
void drftf1(int n, float* c, float* ch, float* wa, int* ifac)
{

L109: // 7859

L103: // 7847

L104: // 7851

L110: // 7863

L102: // 7840
	int i; // 7812
	int k1; // 7812
	int l1; // 7812
	int l2; // 7812
	int na; // 7813
	int kh; // 7813
	int nf; // 7813
	int ip; // 7814
	int iw; // 7814
	int ido; // 7814
	int idl1; // 7814
	int ix2; // 7814
	int ix3; // 7814
} /* size: 0, variables: 13, goto labels: 5 */

// <020E63A9> ../thirdparty/minivorbis/minivorbis.h:7872
// variables: 11
void dradb2(int ido, int l1, float* cc, float* ch, float* wa1)
{

L105: // 7913
	int i; // 7873
	int k; // 7873
	int t0; // 7873
	int t1; // 7873
	int t2; // 7873
	int t3; // 7873
	int t4; // 7873
	int t5; // 7873
	int t6; // 7873
	float ti2; // 7874
	float tr2; // 7874
} /* size: 0, variables: 11, goto labels: 1 */

// <020E611E> ../thirdparty/minivorbis/minivorbis.h:7924
// variables: 25
void dradb3(int ido, int l1, float* cc, float* ch, float* wa1, float* wa2)
{
	float taur; // 7926
	float taui; // 7927
	int i; // 7928
	int k; // 7928
	int t0; // 7928
	int t1; // 7928
	int t2; // 7928
	int t3; // 7928
	int t4; // 7928
	int t5; // 7928
	int t6; // 7928
	int t7; // 7928
	int t8; // 7928
	int t9; // 7928
	int t10; // 7928
	float ci2; // 7929
	float ci3; // 7929
	float di2; // 7929
	float di3; // 7929
	float cr2; // 7929
	float cr3; // 7929
	float dr2; // 7929
	float dr3; // 7929
	float ti2; // 7929
	float tr2; // 7929
} /* size: 0, variables: 25 */

// <020E5E5D> ../thirdparty/minivorbis/minivorbis.h:7987
// variables: 26
void dradb4(int ido, int l1, float* cc, float* ch, float* wa1, float* wa2, float* wa3)
{

L105: // 8055
	float sqrt2; // 7989
	int i; // 7990
	int k; // 7990
	int t0; // 7990
	int t1; // 7990
	int t2; // 7990
	int t3; // 7990
	int t4; // 7990
	int t5; // 7990
	int t6; // 7990
	int t7; // 7990
	int t8; // 7990
	float ci2; // 7991
	float ci3; // 7991
	float ci4; // 7991
	float cr2; // 7991
	float cr3; // 7991
	float cr4; // 7991
	float ti1; // 7991
	float ti2; // 7991
	float ti3; // 7991
	float ti4; // 7991
	float tr1; // 7991
	float tr2; // 7991
	float tr3; // 7991
	float tr4; // 7991
} /* size: 0, variables: 26, goto labels: 1 */

// <020E59FE> ../thirdparty/minivorbis/minivorbis.h:8078
// variables: 35
// function calls: 2
void dradbg(int ido, int ip, int l1, int idl1, float* cc, float* c1, float* c2, float* ch, float* ch2, float* wa)
{

L139: // 8371

L128: // 8311

L132: // 8335

L112: // 8182

L116: // 8216

L106: // 8126

L103: // 8113
	float tpi; // 8080
	int idij; // 8081
	int ipph; // 8081
	int i; // 8081
	int j; // 8081
	int k; // 8081
	int l; // 8081
	int ik; // 8081
	int is; // 8081
	int t0; // 8081
	int t1; // 8081
	int t2; // 8081
	int t3; // 8081
	int t4; // 8081
	int t5; // 8081
	int t6; // 8081
	int t7; // 8081
	int t8; // 8081
	int t9; // 8081
	int t10; // 8081
	int t11; // 8082
	int t12; // 8082
	float dc2; // 8083
	float ai1; // 8083
	float ai2; // 8083
	float ar1; // 8083
	float ar2; // 8083
	float ds2; // 8083
	int nbd; // 8084
	float dcp; // 8085
	float arg; // 8085
	float dsp; // 8085
	float ar1h; // 8085
	float ar2h; // 8085
	int ipp2; // 8086
	cos(float __x); // 8091
	sin(float __x); // 8092
} /* size: 0, variables: 35, goto labels: 7, inline expansions: 2 (0 bytes) */

// <020E58FD> ../thirdparty/minivorbis/minivorbis.h:8392
// variables: 12
void drftb1(int n, float* c, float* ch, float* wa, int* ifac)
{

L109: // 8439

L106: // 8428

L115: // 8460

L103: // 8418
	int i; // 8393
	int k1; // 8393
	int l1; // 8393
	int l2; // 8393
	int na; // 8394
	int nf; // 8395
	int ip; // 8395
	int iw; // 8395
	int ix2; // 8395
	int ix3; // 8395
	int ido; // 8395
	int idl1; // 8395
} /* size: 0, variables: 12, goto labels: 4 */

// <020E58D5> ../thirdparty/minivorbis/minivorbis.h:8470
void drft_forward(drft_lookup* l, float* data)
{
} /* size: 0 */

// <020E567E> ../thirdparty/minivorbis/minivorbis.h:8475
// function call: 1
void drft_backward(drft_lookup* l, float* data)
{

L109: // 8439

L106: // 8428

L115: // 8460

L103: // 8418
	drftb1(int n,
		float* c,
		float* ch,
		float* wa,
		int* ifac);  // 8477
} /* size: 0, goto labels: 4, inline expansions: 1 (0 bytes) */

// <020E52E2> ../thirdparty/minivorbis/minivorbis.h:8480
// function calls: 6
void drft_init(drft_lookup* l, int n)
{
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8482
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8483

L107: // 7311

L104: // 7294

L101: // 7287
	cos(float __x); // 7337
	sin(float __x); // 7338
	drfti1(int n,
		float* wa,
		int* ifac);  // 7349
	fdrffti(int n,
		float* wsave,
		int* ifac);  // 8484
} /* size: 787, goto labels: 3, inline expansions: 6 (1346 bytes) */

// <020E523C> ../thirdparty/minivorbis/minivorbis.h:8487
// function call: 1
void drft_clear(drft_lookup* l)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 8491
} /* size: 81, inline expansions: 1 (23 bytes) */

// <020E51F7> ../thirdparty/minivorbis/minivorbis.h:8570
// variables: 2
int vorbis_block_init(vorbis_dsp_state* v, vorbis_block* vb)
{
	int i; // 8571
	{
		vorbis_block_internal* vbi; // 8577
	}
} /* size: 0, variables: 1 */

// <020E5093> ../thirdparty/minivorbis/minivorbis.h:8596
// variables: 2
// function calls: 3
_OggAutocastPtr _vorbis_block_alloc(vorbis_block* vb, long int bytes)
{
	{
		alloc_chain* link; // 8604
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 8604
	}
	{
		void* ret; // 8616
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 8618
	}
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8612
} /* size: 149, inline expansions: 1 (0 bytes) */

// <020E4FB3> ../thirdparty/minivorbis/minivorbis.h:8630
// variables: 2
// function call: 1
void _vorbis_block_ripcord(vorbis_block* vb)
{
	alloc_chain* reap; // 8632
	{
		alloc_chain* next; // 8634
	}
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8642
} /* size: 159, variables: 1, inline expansions: 1 (0 bytes) */

// <020E4E41> ../thirdparty/minivorbis/minivorbis.h:8652
// variables: 2
// function calls: 3
int vorbis_block_clear(vorbis_block* vb)
{
	int i; // 8653
	vorbis_block_internal* vbi; // 8654
	memset(void* __dest,
		int __ch,
		size_t __len);  // 1114
	oggpack_writeclear(oggpack_buffer* b); // 8661
	memset(void* __dest,
		int __ch,
		size_t __len);  // 8666
} /* size: 184, variables: 2, inline expansions: 3 (105 bytes) */

// <020E4646> ../thirdparty/minivorbis/minivorbis.h:8674
// variables: 5
// function calls: 21
int _vds_shared_init(vorbis_dsp_state* v, vorbis_info* vi, int encp)
{

abort_books: // 8787
	int i; // 8675
	codec_setup_info* ci; // 8676
	private_state* b; // 8677
	int hs; // 8678
	{
		int i; // 8759
		_OggAutocastPtr::_OggAutocastPtr(
				void* pp);  // 8761
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 8688
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8689
	ov_ilog(ogg_uint32_t v); // 8692
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8694
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8695
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8699
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8700
	ov_ilog(ogg_uint32_t v); // 8711
	ov_ilog(ogg_uint32_t v); // 8712
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8756
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8757
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8775
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8776
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8727
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8740
	vorbis_staticbook_destroy(static_codebook* b); // 18649
	vorbis_staticbook_destroy(static_codebook* b); // 8747
	vorbis_staticbook_destroy(static_codebook* b); // 18649
	vorbis_staticbook_destroy(static_codebook* b); // 8790
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8722
} /* size: 1263, variables: 4, goto labels: 1, inline expansions: 20 (216 bytes) */

// <020E4494> ../thirdparty/minivorbis/minivorbis.h:8799
// variable: 1
// function calls: 3
int vorbis_analysis_init(vorbis_dsp_state* v, vorbis_info* vi)
{
	private_state* b; // 8800
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 13008
	_vp_global_look(vorbis_info* vi); // 8804
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8807
} /* size: 0, variables: 1, inline expansions: 3 (0 bytes) */

// <020E418F> ../thirdparty/minivorbis/minivorbis.h:8819
// variables: 4
// function calls: 4
void vorbis_dsp_clear(vorbis_dsp_state* v)
{
	int i; // 8820
	{
		vorbis_info* vi; // 8822
		codec_setup_info* ci; // 8823
		private_state* b; // 8824
		_vp_global_free(vorbis_look_psy_global* look); // 8865
		memset(void* __dest,
			int __ch,
			size_t __len);  // 19130
		vorbis_bitrate_clear(bitrate_manager_state* bm); // 8866
		memset(void* __dest,
			int __ch,
			size_t __len);  // 8889
	}
} /* size: 859, variables: 1 */

// <020E4097> ../thirdparty/minivorbis/minivorbis.h:8893
// variables: 3
// function call: 1
float** vorbis_analysis_buffer(vorbis_dsp_state* v, int vals)
{
	int i; // 8894
	vorbis_info* vi; // 8895
	private_state* b; // 8896
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 8910
} /* size: 0, variables: 3, inline expansions: 1 (0 bytes) */

// <020E3F1E> ../thirdparty/minivorbis/minivorbis.h:8920
// variables: 5
void _preextrapolate_helper(vorbis_dsp_state* v)
{
	int i; // 8921
	int order; // 8922
	float* lpc; // 8923
	float* work; // 8924
	long int j; // 8925
} /* size: 0, variables: 5 */

// <020E3D39> ../thirdparty/minivorbis/minivorbis.h:8964
// variables: 6
// function call: 1
int vorbis_analysis_wrote(vorbis_dsp_state* v, int vals)
{
	vorbis_info* vi; // 8965
	codec_setup_info* ci; // 8966
	{
		int order; // 8969
		int i; // 8970
		float* lpc; // 8971
		{
			long int n; // 8990
		}
		memset(void* __dest,
			int __ch,
			size_t __len);  // 9004
	}
} /* size: 0, variables: 2 */

// <020E39A7> ../thirdparty/minivorbis/minivorbis.h:9028
// variables: 12
// function calls: 6
int vorbis_analysis_blockout(vorbis_dsp_state* v, vorbis_block* vb)
{
	int i; // 9029
	vorbis_info* vi; // 9030
	codec_setup_info* ci; // 9031
	private_state* b; // 9032
	vorbis_look_psy_global* g; // 9033
	long int beginW; // 9034
	long int centerNext; // 9034
	vorbis_block_internal* vbi; // 9035
	{
		long int bp; // 9051
	}
	{
		long int blockbound; // 9071
	}
	{
		int new_centerNext; // 9153
		int movementW; // 9154
		memmove(void* __dest,
			const void* __src,
			size_t __len);  // 9162
	}
	_vp_ampmax_decay(float amp,
			vorbis_dsp_state* vd);  // 9121
	_OggAutocastPtr::operator float**<float*>(); // 9124
	_OggAutocastPtr::operator float**<float*>(); // 9125
	_OggAutocastPtr::operator float*<float>(); // 9128
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 9129
} /* size: 0, variables: 8, inline expansions: 5 (0 bytes) */

// <020E3937> ../thirdparty/minivorbis/minivorbis.h:9189
// variables: 3
int vorbis_synthesis_restart(vorbis_dsp_state* v)
{
	vorbis_info* vi; // 9190
	codec_setup_info* ci; // 9191
	int hs; // 9192
} /* size: 118, variables: 3 */

// <020E390C> ../thirdparty/minivorbis/minivorbis.h:9212
int vorbis_synthesis_init(vorbis_dsp_state* v, vorbis_info* vi)
{
} /* size: 0 */

// <020E367D> ../thirdparty/minivorbis/minivorbis.h:9225
// variables: 27
// function calls: 2
int vorbis_synthesis_blockin(vorbis_dsp_state* v, vorbis_block* vb)
{
	vorbis_info* vi; // 9226
	codec_setup_info* ci; // 9227
	private_state* b; // 9228
	int hs; // 9229
	int i; // 9230
	int j; // 9230
	{
		int n; // 9249
		int n0; // 9250
		int n1; // 9251
		int thisCenter; // 9253
		int prevCenter; // 9254
		{
			const float* w; // 9278
			float* pcm; // 9279
			float* p; // 9280
			_vorbis_window_get(int n); // 9278
		}
		{
			const float* w; // 9285
			float* pcm; // 9286
			float* p; // 9287
			_vorbis_window_get(int n); // 9285
		}
		{
			const float* w; // 9294
			float* pcm; // 9295
			float* p; // 9296
		}
		{
			const float* w; // 9303
			float* pcm; // 9304
			float* p; // 9305
		}
		{
			float* pcm; // 9313
			float* p; // 9314
		}
	}
	{
		long int extra; // 9367
	}
	{
		long int extra; // 9405
	}
} /* size: 1778, variables: 6 */

// <020E3638> ../thirdparty/minivorbis/minivorbis.h:9441
// variables: 2
int vorbis_synthesis_pcmout(vorbis_dsp_state* v, float*** pcm)
{
	vorbis_info* vi; // 9442
	{
		int i; // 9446
	}
} /* size: 0, variables: 1 */

// <020E360E> ../thirdparty/minivorbis/minivorbis.h:9456
int vorbis_synthesis_read(vorbis_dsp_state* v, int n)
{
} /* size: 0 */

// <020E346E> ../thirdparty/minivorbis/minivorbis.h:9467
// variables: 15
int vorbis_synthesis_lapout(vorbis_dsp_state* v, float*** pcm)
{
	vorbis_info* vi; // 9468
	codec_setup_info* ci; // 9469
	int hs; // 9470
	int n; // 9472
	int n0; // 9473
	int n1; // 9474
	int i; // 9475
	int j; // 9475
	{
		float* p; // 9493
		{
			float temp; // 9495
		}
	}
	{
		float* s; // 9510
		float* d; // 9511
	}
	{
		float* s; // 9521
		float* d; // 9522
	}
	{
		int i; // 9532
	}
} /* size: 0, variables: 8 */

// <020E3415> ../thirdparty/minivorbis/minivorbis.h:9542
// variables: 4
const float* vorbis_window(vorbis_dsp_state* v, int W)
{
	vorbis_info* vi; // 9543
	codec_setup_info* ci; // 9544
	int hs; // 9545
	private_state* b; // 9546
} /* size: 0, variables: 4 */

// <020E31C2> ../thirdparty/minivorbis/minivorbis.h:9581
// variables: 6
// function calls: 4
void _ve_envelope_init(envelope_lookup* e, vorbis_info* vi)
{
	codec_setup_info* ci; // 9582
	vorbis_info_psy_global* gi; // 9583
	int ch; // 9584
	int i; // 9585
	int j; // 9585
	int n; // 9586
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 9593
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 9612
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 9620
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 9621
} /* size: 0, variables: 6, inline expansions: 4 (0 bytes) */

// <020E30DD> ../thirdparty/minivorbis/minivorbis.h:9625
// variable: 1
// function call: 1
void _ve_envelope_clear(envelope_lookup* e)
{
	int i; // 9626
	memset(void* __dest,
		int __ch,
		size_t __len);  // 9633
} /* size: 125, variables: 1, inline expansions: 1 (13 bytes) */

// <020E2DF0> ../thirdparty/minivorbis/minivorbis.h:9639
// variables: 21
// function calls: 2
int _ve_amp(envelope_lookup* ve, vorbis_info_psy_global* gi, float* data, envelope_band* bands, envelope_filter_state* filters)
{
	long int n; // 9644
	int ret; // 9645
	long int i; // 9646
	long int j; // 9646
	float decay; // 9647
	float minV; // 9653
	float* vec; // 9654
	int stretch; // 9658
	float penalty; // 9659
	{
		float temp; // 9676
		int ptr; // 9677
		todB(const float* x); // 9694
	}
	{
		float val; // 9701
		todB(const float* x); // 9702
	}
	{
		float acc; // 9713
		float valmax; // 9714
		float valmin; // 9714
		{
			int p; // 9724
			int _vorbis_this_; // 9724
			float postmax; // 9725
			float postmin; // 9725
			float premax; // 9725
			float premin; // 9725
		}
	}
} /* size: 0, variables: 9 */

// <020E2C28> ../thirdparty/minivorbis/minivorbis.h:9765
// variables: 12
// function call: 1
long int _ve_envelope_search(vorbis_dsp_state* v)
{
	vorbis_info* vi; // 9766
	codec_setup_info* ci; // 9767
	vorbis_info_psy_global* gi; // 9768
	envelope_lookup* ve; // 9769
	long int i; // 9770
	long int j; // 9770
	int first; // 9772
	int last; // 9773
	{
		int ret; // 9783
		{
			float* pcm; // 9790
		}
	}
	{
		long int centerW; // 9811
		long int testW; // 9812
	}
	_OggAutocastPtr::_OggAutocastPtr(
			void* pp);  // 9779
} /* size: 0, variables: 8, inline expansions: 1 (0 bytes) */

// <020E2B24> ../thirdparty/minivorbis/minivorbis.h:9879
// variables: 9
int _ve_envelope_mark(vorbis_dsp_state* v)
{
	envelope_lookup* ve; // 9880
	vorbis_info* vi; // 9881
	codec_setup_info* ci; // 9882
	long int centerW; // 9883
	long int beginW; // 9884
	long int endW; // 9885
	{
		long int first; // 9896
		long int last; // 9897
		long int i; // 9898
	}
} /* size: 0, variables: 6 */

// <020E2A72> ../thirdparty/minivorbis/minivorbis.h:9905
// variables: 2
// function call: 1
void _ve_envelope_shift(envelope_lookup* e, long int shift)
{
	int smallsize; // 9906
	int smallshift; // 9908
	memmove(void* __dest,
		const void* __src,
		size_t __len);  // 9910
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <020E2A53> ../thirdparty/minivorbis/minivorbis.h:12022
const float* _vorbis_window_get(int n)
{
} /* size: 0 */

// <020E289D> ../thirdparty/minivorbis/minivorbis.h:12026
// variables: 11
void _vorbis_apply_window(float* d, int* winno, long int* blocksizes, int lW, int W, int nW)
{
	{
		const float* windowLW; // 12032
		const float* windowNW; // 12033
		long int n; // 12035
		long int ln; // 12036
		long int rn; // 12037
		long int leftbegin; // 12039
		long int leftend; // 12040
		long int rightbegin; // 12042
		long int rightend; // 12043
		int i; // 12045
		int p; // 12045
	}
} /* size: 0 */

// <020E2675> ../thirdparty/minivorbis/minivorbis.h:12307
// variables: 7
// function calls: 4
void vorbis_lsp_to_curve(float* curve, int* map, int n, int ln, float* lsp, int m, float amp, float ampoffset)
{
	int i; // 12309
