
//
// public/tier0/platform.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libfilesystem_stdio.so
//				   liblocalize.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//				   libtier0.so
//				   libvfx_vulkan.so
//
//	functions: 2,438
//	classes: 3
//	structs: 5
//

// <066ECFBF> ../public/tier0/platform.h:53
uint Plat_GetPlatformError(void)
{
} /* size: 0 */

// <008A5655> ../public/tier0/platform.h:60
void Plat_SetupFPUControlWord(void)
{
} /* size: 0 */

// <05998AA6> ../public/tier0/platform.h:64
void Plat_SetDenormalsAreZero(void)
{
} /* size: 0 */

// <00128A52> ../public/tier0/platform.h:70
void Plat_MessageBox(const char *, const char *)
{
} /* size: 0 */

// <047373B0> ../public/tier0/platform.h:82
// variables: 2
inline short unsigned int WordSwapC<short unsigned int>(short unsigned int w)
{
	union  t1; // 87
	union  t2; // 87
} /* size: 0, variables: 2 */

// <04736538> ../public/tier0/platform.h:82
// variables: 2
inline short int WordSwapC<short int>(short int w)
{
	union  t1; // 87
	union  t2; // 87
} /* size: 0, variables: 2 */

// <00F2CCA6> ../public/tier0/platform.h:100
// variables: 2
inline unsigned int DWordSwapC<unsigned int>(unsigned int dw)
{
	union  t1; // 105
	union  t2; // 105
} /* size: 0, variables: 2 */

// <0046051E> ../public/tier0/platform.h:120
// variables: 2
inline long long unsigned int QWordSwapC<long long unsigned int>(long long unsigned int qw)
{
	union  t1; // 125
	union  t2; // 125
} /* size: 0, variables: 2 */

// <04421AEF> ../public/tier0/platform.h:314
inline uint32 LoadLittleDWord(const uint32* base, unsigned int dwordIndex)
{
} /* size: 0 */

// <04421AB3> ../public/tier0/platform.h:319
inline void StoreLittleDWord(uint32* base, unsigned int dwordIndex, uint32 dword)
{
} /* size: 0 */

// <008A5679> ../public/tier0/platform.h:337
uint64 Plat_GetCurrentFrame(void)
{
} /* size: 0 */

// <01259897> ../public/tier0/platform.h:338
void Plat_SetCurrentFrame(uint64)
{
} /* size: 0 */

// <001284AD> ../public/tier0/platform.h:339
void Plat_ChangeCurrentFrame(int64)
{
} /* size: 0 */

// <00F43C89> ../public/tier0/platform.h:375
// variables: 2
inline long long unsigned int PLAT_CPU_TIME(void)
{
	long long unsigned int Low; // 378
	long long unsigned int High; // 378
} /* size: 0, variables: 2 */

// <00128986> ../public/tier0/platform.h:413
uint64 Plat_RelativeTicks(void)
{
} /* size: 0 */

// <00B63FC1> ../public/tier0/platform.h:414
uint64 Plat_RelativeTickFrequency(void)
{
} /* size: 0 */

// <00128968> ../public/tier0/platform.h:421
double Plat_TickDiffMilliSecF(uint64, uint64)
{
} /* size: 0 */

// <000B0F1F> ../public/tier0/platform.h:422
uint64 Plat_TickDiffMicroSec(uint64, uint64)
{
} /* size: 0 */

// <000B0F01> ../public/tier0/platform.h:423
double Plat_TickDiffMicroSecF(uint64, uint64)
{
} /* size: 0 */

// <0029D6DD> ../public/tier0/platform.h:427
uint64 Plat_MilliSecTickDiff(uint64)
{
} /* size: 0 */

// <023461FD> ../public/tier0/platform.h:429
uint64 Plat_MicroSecTickDiff(uint64)
{
} /* size: 0 */

// <00B63FF7> ../public/tier0/platform.h:435
uint64 Plat_TicksAfterSecsF(double)
{
} /* size: 0 */

// <004A7018> ../public/tier0/platform.h:436
uint64 Plat_TicksAfterMilliSecs(uint64)
{
} /* size: 0 */

// <02384C93> ../public/tier0/platform.h:457
// variables: 3
inline uint64 Plat_TickDiffMilliSec(uint64 nStartTicks, uint64 nEndTicks, uint64 nFreq)
{
	uint64 nTicks; // 460
	uint64 nSeconds; // 461
	uint64 nRemainder; // 462
} /* size: 0, variables: 3 */

// <022DF752> ../public/tier0/platform.h:477
// variables: 3
inline uint64 Plat_TickDiffMicroSec(uint64 nStartTicks, uint64 nEndTicks, uint64 nFreq)
{
	uint64 nTicks; // 480
	uint64 nSeconds; // 481
	uint64 nRemainder; // 482
} /* size: 0, variables: 3 */

// <006845C2> ../public/tier0/platform.h:487
// variables: 3
inline double Plat_TickDiffMicroSecF(uint64 nStartTicks, uint64 nEndTicks, uint64 nFreq)
{
	uint64 nTicks; // 490
	uint64 nSeconds; // 491
	uint64 nRemainder; // 492
} /* size: 0, variables: 3 */

// <0006AFF3> ../public/tier0/platform.h:542
// member functions: 26
// member variable: 1
// class size: 8
class CRelativeTickCount {
	/* ../public/tier0/platform.h:545 */
	void CRelativeTickCount(CRelativeTickCount* );
	/* ../public/tier0/platform.h:549 */
	void CRelativeTickCount(CRelativeTickCount* , uint64);
	/* ../public/tier0/platform.h:554 */
	void Sample(CRelativeTickCount* );
	/* ../public/tier0/platform.h:559 */
	void Init(CRelativeTickCount* );
	/* ../public/tier0/platform.h:563 */
	void Init(CRelativeTickCount* , double);
	/* ../public/tier0/platform.h:567 */
	void Init(CRelativeTickCount* , uint64);
	/* ../public/tier0/platform.h:575 */
	uint64 GetCycles64(const CRelativeTickCount* );
	/* ../public/tier0/platform.h:579 */
	uint64 GetRelativeTicks64(const CRelativeTickCount* );
	/* ../public/tier0/platform.h:584 */
	uint64 GetMicroseconds64(const CRelativeTickCount* );
	/* ../public/tier0/platform.h:588 */
