
//
// public/tier0/platform_compile_base.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libfilesystem_stdio.so
//				   liblocalize.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//				   libtier0.so
//				   libvfx_vulkan.so
//
//	functions: 2,986
//	structs: 599
//

// <0463636A> ../public/tier0/platform_compile_base.h:1299
void Plat_DebugString(const char *)
{
} /* size: 0 */

// <00004195> ../public/tier0/platform_compile_base.h:1301
void Plat_DebugPrint(const char *, ...)
{
} /* size: 0 */

// <044476CB> ../public/tier0/platform_compile_base.h:1315
void Plat_NonFatalErrorFunc(const char *, ...)
{
} /* size: 0 */

// <01D92370> ../public/tier0/platform_compile_base.h:1318
void Plat_FatalErrorFunc(const char *, ...)
{
} /* size: 0 */

// <0001130B> ../public/tier0/platform_compile_base.h:1421
// struct size: 1
struct empty_t {
};

// <00001FD4> ../public/tier0/platform_compile_base.h:1462
// member variables: 4
// struct size: 16
struct V_uuid_t {
	uint32 Data1; /* 0 4 */
	uint16 Data2; /* 4 2 */
	uint16 Data3; /* 6 2 */
	uint8 Data4[8]; /* 8 8 */
};

// <00DA97EE> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<float> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef float Type_t;
};

// <0184D49E> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<Vector4D> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct Vector4D Type_t;
};

// <06A5903C> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<short unsigned int> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef short unsigned int Type_t;
};

// <06A5918D> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<CVfxParam> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct CVfxParam Type_t;
};

// <0005F6C1> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<unsigned int> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef unsigned int Type_t;
};

// <001FD274> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<KeyValues*> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef class KeyValues * Type_t;
};

// <00241092> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetProgramType_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetProgramType_t Type_t;
};

// <00241C7C> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindShader_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindShader_t Type_t;
};

// <00242866> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindVertexShader_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindVertexShader_t Type_t;
};

// <00243450> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetPushConstants_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetPushConstants_t Type_t;
};

// <0024403A> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindDescriptorSet_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindDescriptorSet_t Type_t;
};

// <00244C24> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindTexture_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindTexture_t Type_t;
};

// <0024580E> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpRegisterTextureUseInDescriptorSet_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpRegisterTextureUseInDescriptorSet_t Type_t;
};

// <00246FE2> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindUAVTex_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindUAVTex_t Type_t;
};

// <00247BCC> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindUAVBuffer_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindUAVBuffer_t Type_t;
};

// <002487B6> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindRasterizerState_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindRasterizerState_t Type_t;
};

// <002493A0> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindDepthStencilState_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindDepthStencilState_t Type_t;
};

// <00249F8A> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpBindBlendState_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpBindBlendState_t Type_t;
};

// <0024AB74> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetRasterizerStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetRasterizerStateDesc_t Type_t;
};

// <0024B75E> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetDepthStencilStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetDepthStencilStateDesc_t Type_t;
};

// <0024C348> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetBlendStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetBlendStateDesc_t Type_t;
};

// <0024CF32> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetUsedSamplers_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetUsedSamplers_t Type_t;
};

// <0024DB1C> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetSamplerDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetSamplerDesc_t Type_t;
};

// <0024E770> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<CSamplerStateDescBase> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct CSamplerStateDescBase Type_t;
};

// <0024F354> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetCommonSamplerDesc0_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetCommonSamplerDesc0_t Type_t;
};

// <0024FF43> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpFillDynamicMaterialCB_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpFillDynamicMaterialCB_t Type_t;
};

// <00250B2D> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadFloatLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadFloatLiteral_t Type_t;
};

// <00251717> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadIntLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadIntLiteral_t Type_t;
};

// <00252301> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadVec4Literal_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadVec4Literal_t Type_t;
};

// <00252EEB> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadCBLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadCBLiteral_t Type_t;
};

// <00253AD5> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpSetGlobalsBDA_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpSetGlobalsBDA_t Type_t;
};

// <002546BF> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpFillDynamicGlobalsBDA_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpFillDynamicGlobalsBDA_t Type_t;
};

// <002552A9> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadSamplerFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadSamplerFromAttr_t Type_t;
};

// <00255E93> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadTexFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadTexFromAttr_t Type_t;
};

// <00256A7D> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadCBFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadCBFromAttr_t Type_t;
};

// <00258251> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadTexFromParam_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadTexFromParam_t Type_t;
};

// <00258E3B> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadTexFromDynParam_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadTexFromDynParam_t Type_t;
};

// <00259A25> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadTexFromVfxExpr_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadTexFromVfxExpr_t Type_t;
};

// <0025A60F> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpLoadVec4FromVfxExpr_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpLoadVec4FromVfxExpr_t Type_t;
};

// <0025C9CD> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpClampShort_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpClampShort_t Type_t;
};

// <0025D5B7> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpClampVec4_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpClampVec4_t Type_t;
};

// <0025E1A1> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreRsSrgbWriteEnable_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreRsSrgbWriteEnable_t Type_t;
};

// <0025ED8B> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreRsColorWriteEnable_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreRsColorWriteEnable_t Type_t;
};

// <0025F975> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsFilter_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsFilter_t Type_t;
};

// <0026055F> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsAddressU_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsAddressU_t Type_t;
};

// <00261149> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsAddressV_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsAddressV_t Type_t;
};

// <00261D33> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsAddressW_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsAddressW_t Type_t;
};

// <0026291D> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsBorderColor_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsBorderColor_t Type_t;
};

// <00263507> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsMipLodBias_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsMipLodBias_t Type_t;
};

// <002640F1> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsMaxLod_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsMaxLod_t Type_t;
};

// <00264CDB> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsMaxAniso_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsMaxAniso_t Type_t;
};

// <002658C5> ../public/tier0/platform_compile_base.h:1500
// struct size: 1
struct _V_remove_const<MatOpStoreSsMinLod_t> {
	/* ../public/tier0/platform_compile_base.h:1500 */
	typedef struct MatOpStoreSsMinLod_t Type_t;
};

// <0184BD53> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const Vector> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct Vector Type_t;
};

// <0184C9A1> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const Vector4D> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct Vector4D Type_t;
};

// <0184D5EF> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const Vector2D> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct Vector2D Type_t;
};

// <06A5653A> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<short unsigned int const> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef short unsigned int Type_t;
};

// <06A56FC4> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<float const> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef float Type_t;
};

// <06A5711F> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const CVfxParam> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct CVfxParam Type_t;
};

// <00240605> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetProgramType_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetProgramType_t Type_t;
};

// <002411EF> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindShader_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindShader_t Type_t;
};

// <00241DD9> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindVertexShader_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindVertexShader_t Type_t;
};

// <002429C3> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetPushConstants_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetPushConstants_t Type_t;
};

// <002435AD> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindDescriptorSet_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindDescriptorSet_t Type_t;
};

// <00244197> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindTexture_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindTexture_t Type_t;
};

// <00244D81> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpRegisterTextureUseInDescriptorSet_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpRegisterTextureUseInDescriptorSet_t Type_t;
};

// <00246555> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindUAVTex_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindUAVTex_t Type_t;
};

// <0024713F> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindUAVBuffer_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindUAVBuffer_t Type_t;
};

// <00247D29> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindRasterizerState_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindRasterizerState_t Type_t;
};

// <002494FD> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpBindBlendState_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpBindBlendState_t Type_t;
};

// <0024A0E7> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetRasterizerStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetRasterizerStateDesc_t Type_t;
};

// <0024ACD1> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetDepthStencilStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetDepthStencilStateDesc_t Type_t;
};

// <0024B8BB> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetBlendStateDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetBlendStateDesc_t Type_t;
};

// <0024C4A5> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetUsedSamplers_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetUsedSamplers_t Type_t;
};

// <0024D08F> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetSamplerDesc_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetSamplerDesc_t Type_t;
};

// <0024DC79> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const CSamplerStateDescBase> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct CSamplerStateDescBase Type_t;
};

// <0024E8C7> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetCommonSamplerDesc0_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetCommonSamplerDesc0_t Type_t;
};

// <0024F4B6> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpFillDynamicMaterialCB_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpFillDynamicMaterialCB_t Type_t;
};

// <002500A0> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadFloatLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadFloatLiteral_t Type_t;
};

// <00250C8A> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadIntLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadIntLiteral_t Type_t;
};

// <00251874> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadVec4Literal_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadVec4Literal_t Type_t;
};

// <0025245E> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadCBLiteral_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadCBLiteral_t Type_t;
};

// <00253048> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpSetGlobalsBDA_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpSetGlobalsBDA_t Type_t;
};

// <00253C32> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpFillDynamicGlobalsBDA_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpFillDynamicGlobalsBDA_t Type_t;
};

// <0025481C> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadSamplerFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadSamplerFromAttr_t Type_t;
};

// <00255406> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadTexFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadTexFromAttr_t Type_t;
};

// <00255FF0> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadCBFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadCBFromAttr_t Type_t;
};

// <00256BDA> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadBufferFromAttr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadBufferFromAttr_t Type_t;
};

// <002577C4> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadTexFromParam_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadTexFromParam_t Type_t;
};

// <002583AE> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadTexFromDynParam_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadTexFromDynParam_t Type_t;
};

// <00258F98> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadTexFromVfxExpr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadTexFromVfxExpr_t Type_t;
};

// <00259B82> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpLoadVec4FromVfxExpr_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpLoadVec4FromVfxExpr_t Type_t;
};

// <0025A76C> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpClampFloat_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpClampFloat_t Type_t;
};

// <0025B356> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpClampInt_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpClampInt_t Type_t;
};

// <0025BF40> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpClampShort_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpClampShort_t Type_t;
};

// <0025CB2A> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpClampVec4_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpClampVec4_t Type_t;
};

// <0025D714> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreRsSrgbWriteEnable_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreRsSrgbWriteEnable_t Type_t;
};

// <0025E2FE> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreRsColorWriteEnable_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreRsColorWriteEnable_t Type_t;
};

// <0025EEE8> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsFilter_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsFilter_t Type_t;
};

// <0025FAD2> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsAddressU_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsAddressU_t Type_t;
};

// <002606BC> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsAddressV_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsAddressV_t Type_t;
};

// <002612A6> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsAddressW_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsAddressW_t Type_t;
};

// <00261E90> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsBorderColor_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsBorderColor_t Type_t;
};

// <00262A7A> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsMipLodBias_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsMipLodBias_t Type_t;
};

// <00263664> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsMaxLod_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsMaxLod_t Type_t;
};

// <0026424E> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsMaxAniso_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsMaxAniso_t Type_t;
};

// <00264E38> ../public/tier0/platform_compile_base.h:1501
// struct size: 1
struct _V_remove_const<const MatOpStoreSsMinLod_t> {
	/* ../public/tier0/platform_compile_base.h:1501 */
	typedef struct MatOpStoreSsMinLod_t Type_t;
};

// <068EB34D> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<ConstantBufferBindInfo_t*>(ConstantBufferBindInfo_t *& x, ConstantBufferBindInfo_t *& y)
{
	ConstantBufferBindInfo_t* t; // 1512
} /* size: 0, variables: 1 */

// <068EB1E2> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<RsRasterizerStateHandle_t__**>(RsRasterizerStateHandle_t__* *& x, RsRasterizerStateHandle_t__* *& y)
{
	RsRasterizerStateHandle_t__** t; // 1512
} /* size: 0, variables: 1 */

// <068EB167> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<RsDepthStencilStateHandle_t__**>(RsDepthStencilStateHandle_t__* *& x, RsDepthStencilStateHandle_t__* *& y)
{
	RsDepthStencilStateHandle_t__** t; // 1512
} /* size: 0, variables: 1 */

// <068EB0EC> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<RsBlendStateHandle_t__**>(RsBlendStateHandle_t__* *& x, RsBlendStateHandle_t__* *& y)
{
	RsBlendStateHandle_t__** t; // 1512
} /* size: 0, variables: 1 */

// <068EB071> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<unsigned char*>(unsigned char *& x, unsigned char *& y)
{
	unsigned char* t; // 1512
} /* size: 0, variables: 1 */

// <068DEF89> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlString, empty_t>*>(CUtlHashtableEntry<CUtlString, empty_t> *& x, CUtlHashtableEntry<CUtlString, empty_t> *& y)
{
	CUtlHashtableEntry<CUtlString, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <06076A06> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, int>* t; // 1512
} /* size: 0, variables: 1 */

// <060766CA> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::FaceVertex_t>::ComponentHandleWithListPointer_t, int>* t; // 1512
} /* size: 0, variables: 1 */

// <060727EA> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, int>* t; // 1512
} /* size: 0, variables: 1 */

// <060723E0> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, int>* t; // 1512
} /* size: 0, variables: 1 */

// <06072025> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Face_t>::ComponentHandleWithListPointer_t, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <060698C2> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <06069744> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<int, empty_t>*>(CUtlHashtableEntry<int, empty_t> *& x, CUtlHashtableEntry<int, empty_t> *& y)
{
	CUtlHashtableEntry<int, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05F5E401> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, empty_t>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, empty_t> *& x, CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, empty_t> *& y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CModelMesh::Edge_t>::ComponentHandleWithListPointer_t, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05F5D9C6> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, int>*>(CUtlHashtableEntry<unsigned int, int> *& x, CUtlHashtableEntry<unsigned int, int> *& y)
{
	CUtlHashtableEntry<unsigned int, int>* t; // 1512
} /* size: 0, variables: 1 */

// <05ED30B9> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIFRVertexData_t, HullIFRHalfEdgeData_t, HullIFRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t>*>(CUtlHashtableEntry<const qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIFRVertexData_t, HullIFRHalfEdgeData_t, Hull x, CUtlHashtableEntry<const qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIFRVertexData_t, HullIFRHalfEdgeData_t, Hull y)
{
	CUtlHashtableEntry<const qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIFRVertexData_t, HullIFRHalfEdgeData_t, HullIFRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05E4D4D7> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t>*>(CUtlHashtableEntry<qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vert x, CUtlHashtableEntry<qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vert y)
{
	CUtlHashtableEntry<qhVertex*, CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05E4D37E> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::Comp x, CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::Comp y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05E4D322> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t, Vector>*>(CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::Comp x, CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::Comp y)
{
	CUtlHashtableEntry<CHalfEdgeComponentList<CHalfEdgeMesh<HullIVRVertexData_t, empty_t, HullIVRFaceData_t>::Vertex_t>::ComponentHandleWithListPointer_t, Vector>* t; // 1512
} /* size: 0, variables: 1 */

// <05DC78AD> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const qhFace*, int>*>(CUtlHashtableEntry<const qhFace*, int> *& x, CUtlHashtableEntry<const qhFace*, int> *& y)
{
	CUtlHashtableEntry<const qhFace*, int>* t; // 1512
} /* size: 0, variables: 1 */

// <05DB6B13> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const qhVertex*, int>*>(CUtlHashtableEntry<const qhVertex*, int> *& x, CUtlHashtableEntry<const qhVertex*, int> *& y)
{
	CUtlHashtableEntry<const qhVertex*, int>* t; // 1512
} /* size: 0, variables: 1 */

// <05CD9913> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<UndirectedEdge_t, int>*>(CUtlHashtableEntry<UndirectedEdge_t, int> *& x, CUtlHashtableEntry<UndirectedEdge_t, int> *& y)
{
	CUtlHashtableEntry<UndirectedEdge_t, int>* t; // 1512
} /* size: 0, variables: 1 */

// <05CD856C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<UndirectedEdge_t, EdgeFaceIdEntry_t>*>(CUtlHashtableEntry<UndirectedEdge_t, EdgeFaceIdEntry_t> *& x, CUtlHashtableEntry<UndirectedEdge_t, EdgeFaceIdEntry_t> *& y)
{
	CUtlHashtableEntry<UndirectedEdge_t, EdgeFaceIdEntry_t>* t; // 1512
} /* size: 0, variables: 1 */

// <05545346> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlStringToken, int>*>(CUtlHashtableEntry<CUtlStringToken, int> *& x, CUtlHashtableEntry<CUtlStringToken, int> *& y)
{
	CUtlHashtableEntry<CUtlStringToken, int>* t; // 1512
} /* size: 0, variables: 1 */

// <04E3332A> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<short unsigned int, unsigned int>*>(CUtlHashtableEntry<short unsigned int, unsigned int> *& x, CUtlHashtableEntry<short unsigned int, unsigned int> *& y)
{
	CUtlHashtableEntry<short unsigned int, unsigned int>* t; // 1512
} /* size: 0, variables: 1 */

// <04DB91DC> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CMoveSpeed*>(CMoveSpeed *& x, CMoveSpeed *& y)
{
	CMoveSpeed* t; // 1512
} /* size: 0, variables: 1 */

// <04D978B3> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CLookAtChainItem*>(CLookAtChainItem *& x, CLookAtChainItem *& y)
{
	CLookAtChainItem* t; // 1512
} /* size: 0, variables: 1 */

// <04CB6E8C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<RenderSkeletonBone_t*>(RenderSkeletonBone_t *& x, RenderSkeletonBone_t *& y)
{
	RenderSkeletonBone_t* t; // 1512
} /* size: 0, variables: 1 */

// <04CB6CEC> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<int*>(int *& x, int *& y)
{
	int* t; // 1512
} /* size: 0, variables: 1 */

// <04CAC8FF> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<long long unsigned int, empty_t>*>(CUtlHashtableEntry<long long unsigned int, empty_t> *& x, CUtlHashtableEntry<long long unsigned int, empty_t> *& y)
{
	CUtlHashtableEntry<long long unsigned int, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1EBE> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlString*>(CUtlString *& x, CUtlString *& y)
{
	CUtlString* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1E43> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<short int*>(short int *& x, short int *& y)
{
	short int* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1DC8> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<unsigned int*>(unsigned int *& x, unsigned int *& y)
{
	unsigned int* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1CD2> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CModelSkeleton::BoneFlags_t*>(BoneFlags_t *& x, BoneFlags_t *& y)
{
	BoneFlags_t* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1C57> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<Vector*>(Vector *& x, Vector *& y)
{
	Vector* t; // 1512
} /* size: 0, variables: 1 */

// <04BA1BDC> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<Quaternion*>(Quaternion *& x, Quaternion *& y)
{
	Quaternion* t; // 1512
} /* size: 0, variables: 1 */

// <03D9007B> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const IMaterial2*, empty_t>*>(CUtlHashtableEntry<const IMaterial2*, empty_t> *& x, CUtlHashtableEntry<const IMaterial2*, empty_t> *& y)
{
	CUtlHashtableEntry<const IMaterial2*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <033A8DCA> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>*>(CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t> *& x, CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t> *& y)
{
	CUtlHashtableEntry<unsigned int, CSceneSystem::FrameBufferScratchTexInfo_t>* t; // 1512
} /* size: 0, variables: 1 */

// <02B7409D> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CSceneLightProbeVolumeObject*, int>*>(CUtlHashtableEntry<CSceneLightProbeVolumeObject*, int> *& x, CUtlHashtableEntry<CSceneLightProbeVolumeObject*, int> *& y)
{
	CUtlHashtableEntry<CSceneLightProbeVolumeObject*, int>* t; // 1512
} /* size: 0, variables: 1 */

// <02B74041> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<int, int>*>(CUtlHashtableEntry<int, int> *& x, CUtlHashtableEntry<int, int> *& y)
{
	CUtlHashtableEntry<int, int>* t; // 1512
} /* size: 0, variables: 1 */

// <0269CB62> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, CVSoundTypeManager::SfxDictEntry>*>(CUtlHashtableEntry<unsigned int, CVSoundTypeManager::SfxDictEntry> *& x, CUtlHashtableEntry<unsigned int, CVSoundTypeManager::SfxDictEntry> *& y)
{
	CUtlHashtableEntry<unsigned int, CVSoundTypeManager::SfxDictEntry>* t; // 1512
} /* size: 0, variables: 1 */

// <023E50ED> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const ResourceBindingBase_t*, empty_t>*>(CUtlHashtableEntry<const ResourceBindingBase_t*, empty_t> *& x, CUtlHashtableEntry<const ResourceBindingBase_t*, empty_t> *& y)
{
	CUtlHashtableEntry<const ResourceBindingBase_t*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <023493F2> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<ResourceId_t, const ResourceBindingBase_t*>*>(CUtlHashtableEntry<ResourceId_t, const ResourceBindingBase_t*> *& x, CUtlHashtableEntry<ResourceId_t, const ResourceBindingBase_t*> *& y)
{
	CUtlHashtableEntry<ResourceId_t, const ResourceBindingBase_t*>* t; // 1512
} /* size: 0, variables: 1 */

// <0229C956> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CLoadingResource*, empty_t>*>(CUtlHashtableEntry<CLoadingResource*, empty_t> *& x, CUtlHashtableEntry<CLoadingResource*, empty_t> *& y)
{
	CUtlHashtableEntry<CLoadingResource*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <021CA15D> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<ResourceId_t, CUtlVector<IGenericDataResourceListener*>*>*>(CUtlHashtableEntry<ResourceId_t, CUtlVector<IGenericDataResourceListener*, CUtlMemory<IGenericDataResourceListener*, int> x, CUtlHashtableEntry<ResourceId_t, CUtlVector<IGenericDataResourceListener*, CUtlMemory<IGenericDataResourceListener*, int> y)
{
	CUtlHashtableEntry<ResourceId_t, CUtlVector<IGenericDataResourceListener*, CUtlMemory<IGenericDataResourceListener*, int> >*>* t; // 1512
} /* size: 0, variables: 1 */

// <00FFB05E> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlStringToken, CWeakHandle<InfoForResourceTypeCEntityLump> >*>(CUtlHashtableEntry<CUtlStringToken, CWeakHandle<InfoForResourceTypeCEntityLump> > *& x, CUtlHashtableEntry<CUtlStringToken, CWeakHandle<InfoForResourceTypeCEntityLump> > *& y)
{
	CUtlHashtableEntry<CUtlStringToken, CWeakHandle<InfoForResourceTypeCEntityLump> >* t; // 1512
} /* size: 0, variables: 1 */

// <00E69684> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, empty_t>*>(CUtlHashtableEntry<unsigned int, empty_t> *& x, CUtlHashtableEntry<unsigned int, empty_t> *& y)
{
	CUtlHashtableEntry<unsigned int, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00B0C9FB> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<unsigned int>(unsigned int& x, unsigned int& y)
{
	unsigned int t; // 1512
} /* size: 0, variables: 1 */

// <00B0C9B8> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<b3ContactId, empty_t>*>(CUtlHashtableEntry<b3ContactId, empty_t> *& x, CUtlHashtableEntry<b3ContactId, empty_t> *& y)
{
	CUtlHashtableEntry<b3ContactId, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00B0C97B> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<int>(int& x, int& y)
{
	int t; // 1512
} /* size: 0, variables: 1 */

// <025AFFE4> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, CAnimationDecodeCacheEntry_t>*>(CUtlHashtableEntry<unsigned int, CAnimationDecodeCacheEntry_t> *& x, CUtlHashtableEntry<unsigned int, CAnimationDecodeCacheEntry_t> *& y)
{
	CUtlHashtableEntry<unsigned int, CAnimationDecodeCacheEntry_t>* t; // 1512
} /* size: 0, variables: 1 */

// <01C41237> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<Reflection::CClassInfo::BaseClassInfo_t*>(BaseClassInfo_t *& x, BaseClassInfo_t *& y)
{
	BaseClassInfo_t* t; // 1512
} /* size: 0, variables: 1 */

// <015714B5> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, CPackedHandle<CAnimUpdateNodeBase> >*>(CUtlHashtableEntry<AnimNodeID, CPackedHandle<CAnimUpdateNodeBase> > *& x, CUtlHashtableEntry<AnimNodeID, CPackedHandle<CAnimUpdateNodeBase> > *& y)
{
	CUtlHashtableEntry<AnimNodeID, CPackedHandle<CAnimUpdateNodeBase> >* t; // 1512
} /* size: 0, variables: 1 */

// <0157141C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, CSmartPtr<const CAnimNodeBase> >*>(CUtlHashtableEntry<AnimNodeID, CSmartPtr<const CAnimNodeBase, CRefCountAccessor> > *& x, CUtlHashtableEntry<AnimNodeID, CSmartPtr<const CAnimNodeBase, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<AnimNodeID, CSmartPtr<const CAnimNodeBase, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <015713C0> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, int>*>(CUtlHashtableEntry<AnimNodeID, int> *& x, CUtlHashtableEntry<AnimNodeID, int> *& y)
{
	CUtlHashtableEntry<AnimNodeID, int>* t; // 1512
} /* size: 0, variables: 1 */

// <0156C43C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, CSmartPtr<CUpdateNodeManager> >*>(CUtlHashtableEntry<AnimNodeID, CSmartPtr<CUpdateNodeManager, CRefCountAccessor> > *& x, CUtlHashtableEntry<AnimNodeID, CSmartPtr<CUpdateNodeManager, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<AnimNodeID, CSmartPtr<CUpdateNodeManager, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <0156C3BA> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const CAnimUpdateNodeBase*, CRootMotion>*>(CUtlHashtableEntry<const CAnimUpdateNodeBase*, CRootMotion> *& x, CUtlHashtableEntry<const CAnimUpdateNodeBase*, CRootMotion> *& y)
{
	CUtlHashtableEntry<const CAnimUpdateNodeBase*, CRootMotion>* t; // 1512
} /* size: 0, variables: 1 */

// <0156C35E> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const CAnimUpdateNodeBase*, CStrideStatus>*>(CUtlHashtableEntry<const CAnimUpdateNodeBase*, CStrideStatus> *& x, CUtlHashtableEntry<const CAnimUpdateNodeBase*, CStrideStatus> *& y)
{
	CUtlHashtableEntry<const CAnimUpdateNodeBase*, CStrideStatus>* t; // 1512
} /* size: 0, variables: 1 */

// <01460846> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CAnimMotorInstance, CAnimMotorBase, const CAnimMotorUpdaterBase*, const CSmartPtr<CAnimGraphUpdateContext, CRefCountAccessor>&>::CFactoryMaker, CRefCountAccessor> >*>(CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CAnimMotorInstance, CAnimMotorBase, const x, CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CAnimMotorInstance, CAnimMotorBase, const y)
{
	CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CAnimMotorInstance, CAnimMotorBase, const CAnimMotorUpdaterBase*, const CSmartPtr<CAnimGraphUpdateContext, CRefCountAccessor>&>::CFactoryMaker, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <013E9411> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<HSequence, CSmartPtr<CSequenceDistanceHelper> >*>(CUtlHashtableEntry<HSequence, CSmartPtr<CSequenceDistanceHelper, CRefCountAccessor> > *& x, CUtlHashtableEntry<HSequence, CSmartPtr<CSequenceDistanceHelper, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<HSequence, CSmartPtr<CSequenceDistanceHelper, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <013E8D29> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CMotionMetricInstance, CMotionMetricBase, const CSmartPtr<CAnimGraphUpdateContext, CRefCountAccessor>&, CPackedHandle<const CMotionMetricEvaluator> >::CFactoryMaker, CRefCountAccessor> >*>(CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CMotionMetricInstance, CMotionMetricBase, x, CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CMotionMetricInstance, CMotionMetricBase, y)
{
	CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<Reflection::CInstanceFactory<CMotionMetricInstance, CMotionMetricBase, const CSmartPtr<CAnimGraphUpdateContext, CRefCountAccessor>&, CPackedHandle<const CMotionMetricEvaluator> >::CFactoryMaker, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <01306723> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<Reflection::ClassID, CUtlVector<IAnimTagListener*> >*>(CUtlHashtableEntry<Reflection::ClassID, CUtlVector<IAnimTagListener*, CUtlMemory<IAnimTagListener*, int> > > *& x, CUtlHashtableEntry<Reflection::ClassID, CUtlVector<IAnimTagListener*, CUtlMemory<IAnimTagListener*, int> > > *& y)
{
	CUtlHashtableEntry<Reflection::ClassID, CUtlVector<IAnimTagListener*, CUtlMemory<IAnimTagListener*, int> > >* t; // 1512
} /* size: 0, variables: 1 */

// <0125DDCD> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlString, CSmartPtr<CSubGraph> >*>(CUtlHashtableEntry<CUtlString, CSmartPtr<CSubGraph, CRefCountAccessor> > *& x, CUtlHashtableEntry<CUtlString, CSmartPtr<CSubGraph, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<CUtlString, CSmartPtr<CSubGraph, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <01054B38> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<Reflection::ClassID, std::shared_ptr<Reflection::CAttribute> >*>(CUtlHashtableEntry<Reflection::ClassID, std::shared_ptr<Reflection::CAttribute> > *& x, CUtlHashtableEntry<Reflection::ClassID, std::shared_ptr<Reflection::CAttribute> > *& y)
{
	CUtlHashtableEntry<Reflection::ClassID, std::shared_ptr<Reflection::CAttribute> >* t; // 1512
} /* size: 0, variables: 1 */

// <00F41D83> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlString, int>*>(CUtlHashtableEntry<CUtlString, int> *& x, CUtlHashtableEntry<CUtlString, int> *& y)
{
	CUtlHashtableEntry<CUtlString, int>* t; // 1512
} /* size: 0, variables: 1 */

// <00F41206> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimParamID, int>*>(CUtlHashtableEntry<AnimParamID, int> *& x, CUtlHashtableEntry<AnimParamID, int> *& y)
{
	CUtlHashtableEntry<AnimParamID, int>* t; // 1512
} /* size: 0, variables: 1 */

// <00F41081> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<short int>(short int& x, short int& y)
{
	short int t; // 1512
} /* size: 0, variables: 1 */

// <00F4103E> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CTransform*>(CTransform *& x, CTransform *& y)
{
	CTransform* t; // 1512
} /* size: 0, variables: 1 */

// <00F40EF7> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<CAnimNodeInstanceFactory::CFactoryMaker> >*>(CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<CAnimNodeInstanceFactory::CFactoryMaker, CRefCountAccessor> > *& x, CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<CAnimNodeInstanceFactory::CFactoryMaker, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<Reflection::ClassID, CSmartPtr<CAnimNodeInstanceFactory::CFactoryMaker, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <00E00A70> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<int, CSmartPtr<const CActivityValues> >*>(CUtlHashtableEntry<int, CSmartPtr<const CActivityValues, CRefCountAccessor> > *& x, CUtlHashtableEntry<int, CSmartPtr<const CActivityValues, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<int, CSmartPtr<const CActivityValues, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <00E008D5> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<int, CSmartPtr<CAnimNodeInstanceBase> >*>(CUtlHashtableEntry<int, CSmartPtr<CAnimNodeInstanceBase, CRefCountAccessor> > *& x, CUtlHashtableEntry<int, CSmartPtr<CAnimNodeInstanceBase, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<int, CSmartPtr<CAnimNodeInstanceBase, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <00E007A3> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimParamID, const CAnimParameterBase*>*>(CUtlHashtableEntry<AnimParamID, const CAnimParameterBase*> *& x, CUtlHashtableEntry<AnimParamID, const CAnimParameterBase*> *& y)
{
	CUtlHashtableEntry<AnimParamID, const CAnimParameterBase*>* t; // 1512
} /* size: 0, variables: 1 */

// <00E00747> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimTagID, const CAnimTagBase*>*>(CUtlHashtableEntry<AnimTagID, const CAnimTagBase*> *& x, CUtlHashtableEntry<AnimTagID, const CAnimTagBase*> *& y)
{
	CUtlHashtableEntry<AnimTagID, const CAnimTagBase*>* t; // 1512
} /* size: 0, variables: 1 */

// <00C29058> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<char const*, empty_t>*>(CUtlHashtableEntry<char const*, empty_t> *& x, CUtlHashtableEntry<char const*, empty_t> *& y)
{
	CUtlHashtableEntry<char const*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <004B717F> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimOutputID, CNodeConnection>*>(CUtlHashtableEntry<AnimOutputID, CNodeConnection> *& x, CUtlHashtableEntry<AnimOutputID, CNodeConnection> *& y)
{
	CUtlHashtableEntry<AnimOutputID, CNodeConnection>* t; // 1512
} /* size: 0, variables: 1 */

// <0040CC58> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, CSmartPtr<CAnimNodeBase> >*>(CUtlHashtableEntry<AnimNodeID, CSmartPtr<CAnimNodeBase, CRefCountAccessor> > *& x, CUtlHashtableEntry<AnimNodeID, CSmartPtr<CAnimNodeBase, CRefCountAccessor> > *& y)
{
	CUtlHashtableEntry<AnimNodeID, CSmartPtr<CAnimNodeBase, CRefCountAccessor> >* t; // 1512
} /* size: 0, variables: 1 */

// <0040CB80> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<AnimNodeID, CAnimNodeBase*>*>(CUtlHashtableEntry<AnimNodeID, CAnimNodeBase*> *& x, CUtlHashtableEntry<AnimNodeID, CAnimNodeBase*> *& y)
{
	CUtlHashtableEntry<AnimNodeID, CAnimNodeBase*>* t; // 1512
} /* size: 0, variables: 1 */

// <00C24952> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CDescriptorSetVulkan*, empty_t>*>(CUtlHashtableEntry<CDescriptorSetVulkan*, empty_t> *& x, CUtlHashtableEntry<CDescriptorSetVulkan*, empty_t> *& y)
{
	CUtlHashtableEntry<CDescriptorSetVulkan*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00BB6634> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderFile_t>::IndirectIndex, empty_t>*>(CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderFile_t>::IndirectIndex x, CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderFile_t>::IndirectIndex y)
{
	CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderFile_t>::IndirectIndex, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00BB659B> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderModule_t>::IndirectIndex, empty_t>*>(CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderModule_t>::IndirectInd x, CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderModule_t>::IndirectInd y)
{
	CUtlHashtableEntry<CUtlStableHashtable<long long unsigned int, CShaderTableVulkan::RefCountedShaderModule_t>::IndirectIndex, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00AB5E8C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<short unsigned int, empty_t>*>(CUtlHashtableEntry<short unsigned int, empty_t> *& x, CUtlHashtableEntry<short unsigned int, empty_t> *& y)
{
	CUtlHashtableEntry<short unsigned int, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <009AA7C6> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__*>*>(CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__*> *& x, CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__*> *& y)
{
	CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__*>* t; // 1512
} /* size: 0, variables: 1 */

// <009A8A49> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CInputLayoutDict<CInputLayoutVulkan>::RenderInputLayoutDesc_t, CInputLayoutVulkan*>*>(CUtlHashtableEntry<CInputLayoutDict<CInputLayoutVulkan>::RenderInputLayoutDesc_t, CInputLayoutVulkan*> *& x, CUtlHashtableEntry<CInputLayoutDict<CInputLayoutVulkan>::RenderInputLayoutDesc_t, CInputLayoutVulkan*> *& y)
{
	CUtlHashtableEntry<CInputLayoutDict<CInputLayoutVulkan>::RenderInputLayoutDesc_t, CInputLayoutVulkan*>* t; // 1512
} /* size: 0, variables: 1 */

// <006F1104> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<PipelineCreateInfo_t, PipelineObjectVulkan_t*>*>(CUtlHashtableEntry<PipelineCreateInfo_t, PipelineObjectVulkan_t*> *& x, CUtlHashtableEntry<PipelineCreateInfo_t, PipelineObjectVulkan_t*> *& y)
{
	CUtlHashtableEntry<PipelineCreateInfo_t, PipelineObjectVulkan_t*>* t; // 1512
} /* size: 0, variables: 1 */

// <006F106B> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<VkRenderPass_T*, empty_t>*>(CUtlHashtableEntry<VkRenderPass_T*, empty_t> *& x, CUtlHashtableEntry<VkRenderPass_T*, empty_t> *& y)
{
	CUtlHashtableEntry<VkRenderPass_T*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <006F0C61> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<PipelineLayoutCreateInfo_t, PipelineLayoutVulkan_t>*>(CUtlHashtableEntry<PipelineLayoutCreateInfo_t, PipelineLayoutVulkan_t> *& x, CUtlHashtableEntry<PipelineLayoutCreateInfo_t, PipelineLayoutVulkan_t> *& y)
{
	CUtlHashtableEntry<PipelineLayoutCreateInfo_t, PipelineLayoutVulkan_t>* t; // 1512
} /* size: 0, variables: 1 */

// <006F0684> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlVector<VkDescriptorSetLayoutBinding>*>(CUtlVector<VkDescriptorSetLayoutBinding, CUtlMemory<VkDescriptorSetLayoutBinding, int> > *& x, CUtlVector<VkDescriptorSetLayoutBinding, CUtlMemory<VkDescriptorSetLayoutBinding, int> > *& y)
{
	CUtlVector<VkDescriptorSetLayoutBinding, CUtlMemory<VkDescriptorSetLayoutBinding, int> >* t; // 1512
} /* size: 0, variables: 1 */

// <006F0609> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<VkPushConstantRange*>(VkPushConstantRange *& x, VkPushConstantRange *& y)
{
	VkPushConstantRange* t; // 1512
} /* size: 0, variables: 1 */

// <006F058E> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<PipelineLayoutImmutableSampler_t*>(PipelineLayoutImmutableSampler_t *& x, PipelineLayoutImmutableSampler_t *& y)
{
	PipelineLayoutImmutableSampler_t* t; // 1512
} /* size: 0, variables: 1 */

// <006F0513> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlVector<unsigned int>*>(CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > *& x, CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > *& y)
{
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >* t; // 1512
} /* size: 0, variables: 1 */

// <006396EB> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<long unsigned int, const CShaderVulkanBase*>*>(CUtlHashtableEntry<long unsigned int, const CShaderVulkanBase*> *& x, CUtlHashtableEntry<long unsigned int, const CShaderVulkanBase*> *& y)
{
	CUtlHashtableEntry<long unsigned int, const CShaderVulkanBase*>* t; // 1512
} /* size: 0, variables: 1 */

// <004FD7C0> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CVulkanImage*, CImageLayoutTracker::ImageTransition_t>*>(CUtlHashtableEntry<CVulkanImage*, CImageLayoutTracker::ImageTransition_t> *& x, CUtlHashtableEntry<CVulkanImage*, CImageLayoutTracker::ImageTransition_t> *& y)
{
	CUtlHashtableEntry<CVulkanImage*, CImageLayoutTracker::ImageTransition_t>* t; // 1512
} /* size: 0, variables: 1 */

// <004D4AC8> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<VulkanFramebufferState_t, VkFramebuffer_T*>*>(CUtlHashtableEntry<VulkanFramebufferState_t, VkFramebuffer_T*> *& x, CUtlHashtableEntry<VulkanFramebufferState_t, VkFramebuffer_T*> *& y)
{
	CUtlHashtableEntry<VulkanFramebufferState_t, VkFramebuffer_T*>* t; // 1512
} /* size: 0, variables: 1 */

// <004D4A2F> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<VulkanFramebufferState_t, VkRenderPass_T*>*>(CUtlHashtableEntry<VulkanFramebufferState_t, VkRenderPass_T*> *& x, CUtlHashtableEntry<VulkanFramebufferState_t, VkRenderPass_T*> *& y)
{
	CUtlHashtableEntry<VulkanFramebufferState_t, VkRenderPass_T*>* t; // 1512
} /* size: 0, variables: 1 */

// <0044703F> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<RenderResourceHandle_t__*, RenderDescriptorBinding_t>*>(CUtlHashtableEntry<RenderResourceHandle_t__*, RenderDescriptorBinding_t> *& x, CUtlHashtableEntry<RenderResourceHandle_t__*, RenderDescriptorBinding_t> *& y)
{
	CUtlHashtableEntry<RenderResourceHandle_t__*, RenderDescriptorBinding_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00393E12> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<TextureStreamingPriorityInfo_t*>(TextureStreamingPriorityInfo_t *& x, TextureStreamingPriorityInfo_t *& y)
{
	TextureStreamingPriorityInfo_t* t; // 1512
} /* size: 0, variables: 1 */

// <005721E9> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<char const*, int>*>(CUtlHashtableEntry<char const*, int> *& x, CUtlHashtableEntry<char const*, int> *& y)
{
	CUtlHashtableEntry<char const*, int>* t; // 1512
} /* size: 0, variables: 1 */

// <005439F5> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<unsigned char>(unsigned char& x, unsigned char& y)
{
	unsigned char t; // 1512
} /* size: 0, variables: 1 */

// <00258542> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<CKeyValuesSystem::SharedStringData_t*, CInterlockedIntT<int> >*>(CUtlHashtableEntry<CKeyValuesSystem::SharedStringData_t*, CInterlockedIntT<int, 4> > *& x, CUtlHashtableEntry<CKeyValuesSystem::SharedStringData_t*, CInterlockedIntT<int, 4> > *& y)
{
	CUtlHashtableEntry<CKeyValuesSystem::SharedStringData_t*, CInterlockedIntT<int, 4> >* t; // 1512
} /* size: 0, variables: 1 */

// <002584A9> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, CKeyValuesSystem::SharedStringData_t*>*>(CUtlHashtableEntry<unsigned int, CKeyValuesSystem::SharedStringData_t*> *& x, CUtlHashtableEntry<unsigned int, CKeyValuesSystem::SharedStringData_t*> *& y)
{
	CUtlHashtableEntry<unsigned int, CKeyValuesSystem::SharedStringData_t*>* t; // 1512
} /* size: 0, variables: 1 */

// <00043D58> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<char>(char& x, char& y)
{
	char t; // 1512
} /* size: 0, variables: 1 */

// <001611A8> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<long long unsigned int, char const*>*>(CUtlHashtableEntry<long long unsigned int, char const*> *& x, CUtlHashtableEntry<long long unsigned int, char const*> *& y)
{
	CUtlHashtableEntry<long long unsigned int, char const*>* t; // 1512
} /* size: 0, variables: 1 */

// <00160DB7> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, const CResourceDiskStruct*>*>(CUtlHashtableEntry<unsigned int, const CResourceDiskStruct*> *& x, CUtlHashtableEntry<unsigned int, const CResourceDiskStruct*> *& y)
{
	CUtlHashtableEntry<unsigned int, const CResourceDiskStruct*>* t; // 1512
} /* size: 0, variables: 1 */

// <00160AC5> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<unsigned int, const CResourceDiskEnum*>*>(CUtlHashtableEntry<unsigned int, const CResourceDiskEnum*> *& x, CUtlHashtableEntry<unsigned int, const CResourceDiskEnum*> *& y)
{
	CUtlHashtableEntry<unsigned int, const CResourceDiskEnum*>* t; // 1512
} /* size: 0, variables: 1 */

// <0015EF6F> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const CResourceDiskStructField*, empty_t>*>(CUtlHashtableEntry<const CResourceDiskStructField*, empty_t> *& x, CUtlHashtableEntry<const CResourceDiskStructField*, empty_t> *& y)
{
	CUtlHashtableEntry<const CResourceDiskStructField*, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <0015EF13> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<const CResourceDiskStructField*, const KV3ConvertSpecialFieldBehavior_t*>*>(CUtlHashtableEntry<const CResourceDiskStructField*, const KV3ConvertSpecialFieldBehavior_t*> *& x, CUtlHashtableEntry<const CResourceDiskStructField*, const KV3ConvertSpecialFieldBehavior_t*> *& y)
{
	CUtlHashtableEntry<const CResourceDiskStructField*, const KV3ConvertSpecialFieldBehavior_t*>* t; // 1512
} /* size: 0, variables: 1 */

// <00341BF4> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<int, float>*>(CUtlHashtableEntry<int, float> *& x, CUtlHashtableEntry<int, float> *& y)
{
	CUtlHashtableEntry<int, float>* t; // 1512
} /* size: 0, variables: 1 */

// <002ECC31> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashtableEntry<SpamKey_t, empty_t>*>(CUtlHashtableEntry<SpamKey_t, empty_t> *& x, CUtlHashtableEntry<SpamKey_t, empty_t> *& y)
{
	CUtlHashtableEntry<SpamKey_t, empty_t>* t; // 1512
} /* size: 0, variables: 1 */

// <00045D78> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CLocalize::LocalizationFileInfo_t*>(LocalizationFileInfo_t *& x, LocalizationFileInfo_t *& y)
{
	LocalizationFileInfo_t* t; // 1512
} /* size: 0, variables: 1 */

// <000452B2> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashMap<char const*, int, FastCaselessStringEqualFunctor, FastCaselessStringHashFunctor>::Node_t*>(Node_t *& x, Node_t *& y)
{
	Node_t* t; // 1512
} /* size: 0, variables: 1 */

// <0004525C> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CLocalize::LocalizedString_t*>(LocalizedString_t *& x, LocalizedString_t *& y)
{
	LocalizedString_t* t; // 1512
} /* size: 0, variables: 1 */

// <000446C8> ../public/tier0/platform_compile_base.h:1510
// variable: 1
void V_swap_through_temp<CUtlHashMap<char const*, int, FastCaselessStringEqualFunctor, FastCaselessStringHashFunctor>::HashBucket_t*>(HashBucket_t *& x, HashBucket_t *& y)
{
	HashBucket_t* t; // 1512
} /* size: 0, variables: 1 */

// <06F1EB7A> ../../public/tier0/platform_compile_base.h:1566
inline void ValidateAlignmentExplicit<CFeAgglomerator::CCluster*, 8>(void)
{
} /* size: 0 */

// <06F1EA8E> ../../public/tier0/platform_compile_base.h:1566
inline void ValidateAlignmentExplicit<CFeAgglomerator::CLink, 8>(void)
{
} /* size: 0 */

// <06D4AFC5> ../../public/tier0/platform_compile_base.h:1566
inline void ValidateAlignmentExplicit<filterstate_t, 16>(void)
{
} /* size: 0 */

// <06AACE1F> ../public/tier0/platform_compile_base.h:1566
inline void ValidateAlignmentExplicit<UtlRBTreeNode_t<CUtlMap<CVfxHashValue, int, int>::Node_t, int>, 4>(void)
{
} /* size: 0 */

// <06AACCA4> ../public/tier0/platform_compile_base.h:1566
inline void ValidateAlignmentExplicit<CVfxByteCodeManager::ByteCodeInfo_t, 8>(void)
{
} /* size: 0 */

// <06AACC0E> ../public/tier0/platform_compile_base.h:1566
