
//
// public/tier0/utlattributelist.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//				   libvfx_vulkan.so
//
//	functions: 1,211
//	classes: 93
//

// <03AE2509> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<CSceneUtils::RenderingPipelineInfo_t>(RenderingPipelineInfo_t* pT)
{
} /* size: 0 */

// <0345E895> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<ISceneLayer::RenderTargetAttribute_t>(RenderTargetAttribute_t* pT)
{
} /* size: 0 */

// <00132B3A> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<Vector4D>(Vector4D* pT)
{
} /* size: 0 */

// <00132B14> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<VMatrix>(VMatrix* pT)
{
} /* size: 0 */

// <00132AEE> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<void*>(void** pT)
{
} /* size: 0 */

// <00132AC8> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<IntVector4D>(IntVector4D* pT)
{
} /* size: 0 */

// <00132AA2> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<CRenderAttributes::ConstantBufferAttr_t>(ConstantBufferAttr_t* pT)
{
} /* size: 0 */

// <00132A7C> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<CRenderAttributes::DescriptorSetAttr_t>(DescriptorSetAttr_t* pT)
{
} /* size: 0 */

// <0012CD35> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<CRenderAttributes::SamplerAttrForStorage_t>(SamplerAttrForStorage_t* pT)
{
} /* size: 0 */

// <0022D73B> ../../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<bool>(bool* pT)
{
} /* size: 0 */

// <0008C5FF> ../public/tier0/utlattributelist.h:17
inline void ReleaseValueFromAttribute<int>(int* pT)
{
} /* size: 0 */

// <0015C4E4> ../public/tier0/utlattributelist.h:37
inline void SetFixedKeysToZero<1>(i32x4* pFixedKeys)
{
} /* size: 0 */

// <0015C4B4> ../public/tier0/utlattributelist.h:43
inline void SetFixedKeysToZero<2>(i32x4* pFixedKeys)
{
} /* size: 0 */

// <01350DCF> ../public/tier0/utlattributelist.h:59
inline void SetFixedKeysToZero<4>(i32x4* pFixedKeys)
{
} /* size: 0 */

// <06E2A20B> ../../public/tier0/utlattributelist.h:68
void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::~CUtlAttributeListChunk()
{
} /* size: 0 */

// <06E2A1EF> ../../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::~CUtlAttributeListChunk()
{
} /* size: 0 */

// <00445506> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<Vector4D, 8, Vector4D>::operator=(const CUtlAttributeListChunk<Vector4D, 8, Vector4D> &)
{
} /* size: 0 */

// <004454B3> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<VMatrix, 1, VMatrix>::operator=(const CUtlAttributeListChunk<VMatrix, 1, VMatrix> &)
{
} /* size: 0 */

// <004453F3> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::operator=(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t> &)
{
} /* size: 0 */

// <004453A0> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::operator=(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t> &)
{
} /* size: 0 */

// <0044534D> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::operator=(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t> &)
{
} /* size: 0 */

// <004452D4> ../public/tier0/utlattributelist.h:68
inline void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::operator=(const CUtlAttributeListChunk<CUtlString, 2, CUtlString> &)
{
} /* size: 0 */

// <0004A8D2> ../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<Vector4D, 8, Vector4D> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	Vector4D m_FixedValues[8]; /* 32 128 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , Vector4D* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	Vector4D GetValueOrDefault(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32, Vector4D);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const Vector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	Vector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E12GetFreeIndexEv */
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, Vector4D)> >(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0004B574> ../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<Vector4D, 4, Vector4D> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	Vector4D m_FixedValues[4]; /* 16 64 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , Vector4D* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	Vector4D GetValueOrDefault(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32, Vector4D);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const Vector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	Vector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E12GetFreeIndexEv */
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, Vector4D)> >(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0004B7D7> ../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<VMatrix, 1, VMatrix> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	VMatrix m_FixedValues[1]; /* 16 64 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , VMatrix* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	VMatrix GetValueOrDefault(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32, VMatrix);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const VMatrix* GetValuePtrFromIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	VMatrix* GetValuePtrFromIndex(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	void ReleaseValues(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class VMatrix *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class VMatrix GetValueOrDefault(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32, class VMatrix); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E18GetKeyPtrFromIndexEi */
	const class VMatrix  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	class VMatrix * GetValuePtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, 2>::MergeTo(ThisType_t&) const::<lambda(int, VMatrix)> >(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li1ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0004C477> ../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 144
class CUtlAttributeListChunk<VMatrix, 2, VMatrix> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	VMatrix m_FixedValues[2]; /* 16 128 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , VMatrix* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	VMatrix GetValueOrDefault(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32, VMatrix);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const VMatrix* GetValuePtrFromIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	VMatrix* GetValuePtrFromIndex(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	void ReleaseValues(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class VMatrix *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class VMatrix GetValueOrDefault(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32, class VMatrix); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E18GetKeyPtrFromIndexEi */
	const class VMatrix  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	class VMatrix * GetValuePtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, 2>::MergeTo(ThisType_t&) const::<lambda(int, VMatrix)> >(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li1ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0004C6DA> ../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	IntVector4D m_FixedValues[8]; /* 32 128 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , IntVector4D* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	IntVector4D GetValueOrDefault(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32, IntVector4D);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const IntVector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	IntVector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, IntVector4D)> >(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E12GetFreeIndexEv */
};

// <0004D36C> ../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	IntVector4D m_FixedValues[4]; /* 16 64 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , IntVector4D* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	IntVector4D GetValueOrDefault(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32, IntVector4D);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const IntVector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	IntVector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, IntVector4D)> >(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E12GetFreeIndexEv */
};

// <0004D5CF> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	TextureAttrForStorage_t m_FixedValues[8]; /* 32 128 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , TextureAttr_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	TextureAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32, TextureAttr_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const TextureAttrForStorage_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	TextureAttrForStorage_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
};

// <0004E267> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 192
class CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	SamplerAttrForStorage_t m_FixedValues[8]; /* 32 160 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , SamplerAttr_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	SamplerAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32, SamplerAttr_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const SamplerAttrForStorage_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	SamplerAttrForStorage_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
};

// <0004EEFF> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	ConstantBufferAttr_t m_FixedValues[4]; /* 16 64 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , ConstantBufferAttr_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	ConstantBufferAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32, ConstantBufferAttr_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const ConstantBufferAttr_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	ConstantBufferAttr_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
};

// <0004FB95> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 112
class CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	DescriptorSetAttr_t m_FixedValues[4]; /* 16 96 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , DescriptorSetAttr_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	DescriptorSetAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32, DescriptorSetAttr_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const DescriptorSetAttr_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	DescriptorSetAttr_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
};

// <0005082B> ../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 48
class CUtlAttributeListChunk<void*, 4, void*> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	void * m_FixedValues[4]; /* 16 32 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<void*, 4, void*>* , void** , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	void* GetValueOrDefault(const CUtlAttributeListChunk<void*, 4, void*>* , uint32, void* );
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<void*, 4, void*>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	void* const* GetValuePtrFromIndex(const CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	void** GetValuePtrFromIndex(CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<void*, 4, void*>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<void*, 4, void*>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<void*, 4, void*>* );
	void ReleaseValues(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<void*, 4, void*>  *, void * *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	void * GetValueOrDefault(const class CUtlAttributeListChunk<void*, 4, void*>  *, uint32, void *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<void*, 4, void*> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<void*, 4, void*> *, int); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E18GetKeyPtrFromIndexEi */
	void * const * GetValuePtrFromIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E20GetValuePtrFromIndexEi */
	void * * GetValuePtrFromIndex(class CUtlAttributeListChunk<void*, 4, void*> *, int); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<void*, 4, void*>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<void*, 4, void*>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E12GetFreeIndexEv */
	/* <402af45> ../public/tier0/utlattributelist.h:92 */
	void VisitAllAttributes<CUtlAttributeList<void*, 4, void*, 4>::MergeTo(ThisType_t&) const::<lambda(int, void*)> >(const class CUtlAttributeListChunk<void*, 4, void*>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li4ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <000514B1> ../public/tier0/utlattributelist.h:68
// member functions: 32
// member variables: 2
// class size: 32
class CUtlAttributeListChunk<CUtlString, 2, CUtlString> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	CUtlString m_FixedValues[2]; /* 16 16 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , CUtlString* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	CUtlString GetValueOrDefault(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32, CUtlString);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const CUtlString* GetValuePtrFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	CUtlString* GetValuePtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	void ReleaseValues(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class CUtlString *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class CUtlString GetValueOrDefault(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32, class CUtlString); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18GetKeyPtrFromIndexEi */
	const class CUtlString  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	class CUtlString * GetValuePtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E12GetFreeIndexEv */
	void ~CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_ED4Ev */
	void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::MergeTo(ThisType_t&) const::<lambda(int, CUtlString)> >(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li2ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <000537D3> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 320
class CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	RenderTargetAttribute_t m_FixedValues[16]; /* 64 256 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , RenderTargetAttribute_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	RenderTargetAttribute_t GetValueOrDefault(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , uint32, RenderTargetAttribute_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const RenderTargetAttribute_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	RenderTargetAttribute_t* GetValuePtrFromIndex(CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>* );
};

// <03ADACCF> ../public/tier0/utlattributelist.h:68
// member functions: 16
// member variables: 2
// class size: 320
class CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	RenderingPipelineInfo_t m_FixedValues[16]; /* 64 256 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , RenderingPipelineInfo_t* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	RenderingPipelineInfo_t GetValueOrDefault(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , uint32, RenderingPipelineInfo_t);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const RenderingPipelineInfo_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	RenderingPipelineInfo_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* );
	/* ../public/tier0/utlattributelist.h:104 */
	void VisitAllAttributesForWrite<CSceneUtils::Shutdown()::<lambda(uint32, CSceneUtils::RenderingPipelineInfo_t&)> >(CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>* , );
};

// <06A57BA3> ../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 192
class CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	const class CVfxParam * m_FixedValues[16]; /* 64 128 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , const CVfxParam** , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	const CVfxParam* GetValueOrDefault(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , uint32, const CVfxParam* );
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const CVfxParam* const* GetValuePtrFromIndex(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	const CVfxParam* * GetValuePtrFromIndex(CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<const CVfxParam*, 16, const CVfxParam*>* );
};

// <06A58332> ../public/tier0/utlattributelist.h:68
// member functions: 30
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<bool, 16, bool> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	bool m_FixedValues[16]; /* 64 16 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<bool, 16, bool>* , bool* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	bool GetValueOrDefault(const CUtlAttributeListChunk<bool, 16, bool>* , uint32, bool);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<bool, 16, bool>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const bool* GetValuePtrFromIndex(const CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	bool* GetValuePtrFromIndex(CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<bool, 16, bool>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<bool, 16, bool>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<bool, 16, bool>* );
	void ReleaseValues(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbEC4Ev */
	int Count(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<bool, 16, bool>  *, bool *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE8GetValueEPbRK15CUtlStringToken */
	bool GetValueOrDefault(const class CUtlAttributeListChunk<bool, 16, bool>  *, uint32, bool); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE17GetValueOrDefaultEjb */
	void DeleteValue(class CUtlAttributeListChunk<bool, 16, bool> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<bool, 16, bool> *, int); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE18GetKeyPtrFromIndexEi */
	const bool  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE20GetValuePtrFromIndexEi */
	bool * GetValuePtrFromIndex(class CUtlAttributeListChunk<bool, 16, bool> *, int); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<bool, 16, bool>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<bool, 16, bool>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE12GetFreeIndexEv */
};

// <001CD764> ../public/tier0/utlattributelist.h:68
// member functions: 33
// member variables: 2
// class size: 32
class CUtlAttributeListChunk<CUtlString, 2, CUtlString> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	CUtlString m_FixedValues[2]; /* 16 16 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , CUtlString* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	CUtlString GetValueOrDefault(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32, CUtlString);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const CUtlString* GetValuePtrFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	CUtlString* GetValuePtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	void ~CUtlAttributeListChunk(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	void ReleaseValues(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class CUtlString *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class CUtlString GetValueOrDefault(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32, class CUtlString); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18GetKeyPtrFromIndexEi */
	const class CUtlString  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	class CUtlString * GetValuePtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E12GetFreeIndexEv */
	void ~CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_ED4Ev */
	void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::MergeTo(ThisType_t&) const::<lambda(int, CUtlString)> >(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li2ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0021C267> ../../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<Vector4D, 8, Vector4D> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	Vector4D m_FixedValues[8]; /* 32 128 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , Vector4D* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	Vector4D GetValueOrDefault(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32, Vector4D);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const Vector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	Vector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<Vector4D, 8, Vector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E12GetFreeIndexEv */
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, Vector4D)> >(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0021CF09> ../../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<Vector4D, 4, Vector4D> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	Vector4D m_FixedValues[4]; /* 16 64 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , Vector4D* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	Vector4D GetValueOrDefault(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32, Vector4D);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const Vector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	Vector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<Vector4D, 4, Vector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 8, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 8, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi8ES0_E12GetFreeIndexEv */
	void ReleaseValues(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class Vector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class Vector4D GetValueOrDefault(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32, class Vector4D); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class Vector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class Vector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<Vector4D, 4, Vector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI8Vector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, Vector4D)> >(const class CUtlAttributeListChunk<Vector4D, 4, Vector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI8Vector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0021D16C> ../../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<VMatrix, 1, VMatrix> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	VMatrix m_FixedValues[1]; /* 16 64 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , VMatrix* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	VMatrix GetValueOrDefault(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32, VMatrix);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const VMatrix* GetValuePtrFromIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	VMatrix* GetValuePtrFromIndex(CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<VMatrix, 1, VMatrix>* );
	void ReleaseValues(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class VMatrix *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class VMatrix GetValueOrDefault(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32, class VMatrix); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E18GetKeyPtrFromIndexEi */
	const class VMatrix  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	class VMatrix * GetValuePtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, 2>::MergeTo(ThisType_t&) const::<lambda(int, VMatrix)> >(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li1ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0021DE0C> ../../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 144
class CUtlAttributeListChunk<VMatrix, 2, VMatrix> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	VMatrix m_FixedValues[2]; /* 16 128 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , VMatrix* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	VMatrix GetValueOrDefault(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32, VMatrix);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const VMatrix* GetValuePtrFromIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	VMatrix* GetValuePtrFromIndex(CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<VMatrix, 2, VMatrix>* );
	void ReleaseValues(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class VMatrix *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class VMatrix GetValueOrDefault(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32, class VMatrix); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E18GetKeyPtrFromIndexEi */
	const class VMatrix  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	class VMatrix * GetValuePtrFromIndex(class CUtlAttributeListChunk<VMatrix, 2, VMatrix> *, int); /* linkage=_ZN22CUtlAttributeListChunkI7VMatrixLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, 2>::MergeTo(ThisType_t&) const::<lambda(int, VMatrix)> >(const class CUtlAttributeListChunk<VMatrix, 2, VMatrix>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI7VMatrixLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li1ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <0021E06F> ../../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	IntVector4D m_FixedValues[8]; /* 32 128 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , IntVector4D* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	IntVector4D GetValueOrDefault(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32, IntVector4D);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const IntVector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	IntVector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, IntVector4D)> >(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E12GetFreeIndexEv */
};

// <0021ED01> ../../public/tier0/utlattributelist.h:68
// member functions: 46
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	IntVector4D m_FixedValues[4]; /* 16 64 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , IntVector4D* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	IntVector4D GetValueOrDefault(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32, IntVector4D);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const IntVector4D* GetValuePtrFromIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	IntVector4D* GetValuePtrFromIndex(CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>* );
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E12GetFreeIndexEv */
	void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, 4>::MergeTo(ThisType_t&) const::<lambda(int, IntVector4D)> >(const class CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li8ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
	void ReleaseValues(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, class IntVector4D *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class IntVector4D GetValueOrDefault(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32, class IntVector4D); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E18GetKeyPtrFromIndexEi */
	const class IntVector4D  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	class IntVector4D * GetValuePtrFromIndex(class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D> *, int); /* linkage=_ZN22CUtlAttributeListChunkI11IntVector4DLi8ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>  *); /* linkage=_ZNK22CUtlAttributeListChunkI11IntVector4DLi8ES0_E12GetFreeIndexEv */
};

// <0021EF64> ../../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 160
class CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	TextureAttrForStorage_t m_FixedValues[8]; /* 32 128 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , TextureAttr_t* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	TextureAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32, TextureAttr_t);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const TextureAttrForStorage_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	TextureAttrForStorage_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>* );
};

// <0021FBFC> ../../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 192
class CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t> {
	i32x4 m_nFixedKeys[2]; /* 0 32 */
	SamplerAttrForStorage_t m_FixedValues[8]; /* 32 160 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , SamplerAttr_t* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	SamplerAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32, SamplerAttr_t);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const SamplerAttrForStorage_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	SamplerAttrForStorage_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>* );
};

// <00220894> ../../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	ConstantBufferAttr_t m_FixedValues[4]; /* 16 64 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , ConstantBufferAttr_t* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	ConstantBufferAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32, ConstantBufferAttr_t);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const ConstantBufferAttr_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	ConstantBufferAttr_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>* );
};

// <0022152A> ../../public/tier0/utlattributelist.h:68
// member functions: 15
// member variables: 2
// class size: 112
class CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	DescriptorSetAttr_t m_FixedValues[4]; /* 16 96 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , DescriptorSetAttr_t* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	DescriptorSetAttr_t GetValueOrDefault(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32, DescriptorSetAttr_t);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const DescriptorSetAttr_t* GetValuePtrFromIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	DescriptorSetAttr_t* GetValuePtrFromIndex(CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>* );
};

// <002221C0> ../../public/tier0/utlattributelist.h:68
// member functions: 31
// member variables: 2
// class size: 48
class CUtlAttributeListChunk<void*, 4, void*> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	void * m_FixedValues[4]; /* 16 32 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<void*, 4, void*>* , void** , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	void* GetValueOrDefault(const CUtlAttributeListChunk<void*, 4, void*>* , uint32, void* );
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<void*, 4, void*>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	void* const* GetValuePtrFromIndex(const CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	void** GetValuePtrFromIndex(CUtlAttributeListChunk<void*, 4, void*>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<void*, 4, void*>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<void*, 4, void*>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<void*, 4, void*>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<void*, 4, void*>* );
	void ReleaseValues(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<void*, 4, void*> *); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<void*, 4, void*>  *, void * *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E8GetValueEPS0_RK15CUtlStringToken */
	void * GetValueOrDefault(const class CUtlAttributeListChunk<void*, 4, void*>  *, uint32, void *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<void*, 4, void*> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<void*, 4, void*> *, int); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E18GetKeyPtrFromIndexEi */
	void * const * GetValuePtrFromIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E20GetValuePtrFromIndexEi */
	void * * GetValuePtrFromIndex(class CUtlAttributeListChunk<void*, 4, void*> *, int); /* linkage=_ZN22CUtlAttributeListChunkIPvLi4ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<void*, 4, void*>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<void*, 4, void*>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<void*, 4, void*>  *); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E12GetFreeIndexEv */
	/* <402af45> ../public/tier0/utlattributelist.h:92 */
	void VisitAllAttributes<CUtlAttributeList<void*, 4, void*, 4>::MergeTo(ThisType_t&) const::<lambda(int, void*)> >(const class CUtlAttributeListChunk<void*, 4, void*>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkIPvLi4ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li4ES0_Li4EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <00222E4C> ../../public/tier0/utlattributelist.h:68
// member functions: 32
// member variables: 2
// class size: 32
class CUtlAttributeListChunk<CUtlString, 2, CUtlString> {
	i32x4 m_nFixedKeys[1]; /* 0 16 */
	CUtlString m_FixedValues[2]; /* 16 16 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , CUtlString* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	CUtlString GetValueOrDefault(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32, CUtlString);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const CUtlString* GetValuePtrFromIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	CUtlString* GetValuePtrFromIndex(CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<CUtlString, 2, CUtlString>* );
	void ReleaseValues(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_EC4Ev */
	int Count(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class CUtlString *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E8GetValueEPS0_RK15CUtlStringToken */
	class CUtlString GetValueOrDefault(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32, class CUtlString); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E17GetValueOrDefaultEjS0_ */
	void DeleteValue(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18GetKeyPtrFromIndexEi */
	const class CUtlString  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	class CUtlString * GetValuePtrFromIndex(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *, int); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_E20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E12GetFreeIndexEv */
	void ~CUtlAttributeListChunk(class CUtlAttributeListChunk<CUtlString, 2, CUtlString> *); /* linkage=_ZN22CUtlAttributeListChunkI10CUtlStringLi2ES0_ED4Ev */
	void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::MergeTo(ThisType_t&) const::<lambda(int, CUtlString)> >(const class CUtlAttributeListChunk<CUtlString, 2, CUtlString>  *, class ); /* linkage=_ZNK22CUtlAttributeListChunkI10CUtlStringLi2ES0_E18VisitAllAttributesIZNK17CUtlAttributeListIS0_Li2ES0_Li2EE7MergeToERS4_EUliS0_E_EEvT_ */
};

// <00228AB2> ../../public/tier0/utlattributelist.h:68
// member functions: 30
// member variables: 2
// class size: 80
class CUtlAttributeListChunk<bool, 16, bool> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	bool m_FixedValues[16]; /* 64 16 */
	/* ../../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<bool, 16, bool>* , bool* , const CUtlStringToken& );
	/* ../../public/tier0/utlattributelist.h:154 */
	bool GetValueOrDefault(const CUtlAttributeListChunk<bool, 16, bool>* , uint32, bool);
	/* ../../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<bool, 16, bool>* , uint32);
	/* ../../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../../public/tier0/utlattributelist.h:188 */
	const bool* GetValuePtrFromIndex(const CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../../public/tier0/utlattributelist.h:192 */
	bool* GetValuePtrFromIndex(CUtlAttributeListChunk<bool, 16, bool>* , int);
	/* ../../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<bool, 16, bool>* );
	/* ../../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<bool, 16, bool>* , i32x4);
	/* ../../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<bool, 16, bool>* , uint32);
	/* ../../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<bool, 16, bool>* );
	void ReleaseValues(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<bool, 16, bool> *); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbEC4Ev */
	int Count(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<bool, 16, bool>  *, bool *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE8GetValueEPbRK15CUtlStringToken */
	bool GetValueOrDefault(const class CUtlAttributeListChunk<bool, 16, bool>  *, uint32, bool); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE17GetValueOrDefaultEjb */
	void DeleteValue(class CUtlAttributeListChunk<bool, 16, bool> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<bool, 16, bool> *, int); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE18GetKeyPtrFromIndexEi */
	const bool  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE20GetValuePtrFromIndexEi */
	bool * GetValuePtrFromIndex(class CUtlAttributeListChunk<bool, 16, bool> *, int); /* linkage=_ZN22CUtlAttributeListChunkIbLi16EbE20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<bool, 16, bool>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<bool, 16, bool>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<bool, 16, bool>  *); /* linkage=_ZNK22CUtlAttributeListChunkIbLi16EbE12GetFreeIndexEv */
};

// <00076861> ../public/tier0/utlattributelist.h:68
// member functions: 30
// member variables: 2
// class size: 128
class CUtlAttributeListChunk<int, 16, int> {
	i32x4 m_nFixedKeys[4]; /* 0 64 */
	int m_FixedValues[16]; /* 64 64 */
	/* ../public/tier0/utlattributelist.h:74 */
	void ReleaseValues(CUtlAttributeListChunk<int, 16, int>* );
	/* ../public/tier0/utlattributelist.h:86 */
	void Clear(CUtlAttributeListChunk<int, 16, int>* );
	/* ../public/tier0/utlattributelist.h:116 */
	void CUtlAttributeListChunk(CUtlAttributeListChunk<int, 16, int>* );
	/* ../public/tier0/utlattributelist.h:122 */
	int Count(const CUtlAttributeListChunk<int, 16, int>* );
	/* ../public/tier0/utlattributelist.h:142 */
	bool GetValue(const CUtlAttributeListChunk<int, 16, int>* , int* , const CUtlStringToken& );
	/* ../public/tier0/utlattributelist.h:154 */
	int GetValueOrDefault(const CUtlAttributeListChunk<int, 16, int>* , uint32, int);
	/* ../public/tier0/utlattributelist.h:166 */
	void DeleteValue(CUtlAttributeListChunk<int, 16, int>* , uint32);
	/* ../public/tier0/utlattributelist.h:177 */
	uint32 GetKeyFromIndex(const CUtlAttributeListChunk<int, 16, int>* , int);
	/* ../public/tier0/utlattributelist.h:182 */
	uint32* GetKeyPtrFromIndex(CUtlAttributeListChunk<int, 16, int>* , int);
	/* ../public/tier0/utlattributelist.h:188 */
	const int* GetValuePtrFromIndex(const CUtlAttributeListChunk<int, 16, int>* , int);
	/* ../public/tier0/utlattributelist.h:192 */
	int* GetValuePtrFromIndex(CUtlAttributeListChunk<int, 16, int>* , int);
	/* ../public/tier0/utlattributelist.h:197 */
	bool IsEmpty(const CUtlAttributeListChunk<int, 16, int>* );
	/* ../public/tier0/utlattributelist.h:210 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<int, 16, int>* , i32x4);
	/* ../public/tier0/utlattributelist.h:235 */
	int FindIndexOfMatch(const CUtlAttributeListChunk<int, 16, int>* , uint32);
	/* ../public/tier0/utlattributelist.h:240 */
	int GetFreeIndex(const CUtlAttributeListChunk<int, 16, int>* );
	void ReleaseValues(class CUtlAttributeListChunk<int, 16, int> *); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiE13ReleaseValuesEv */
	void Clear(class CUtlAttributeListChunk<int, 16, int> *); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiE5ClearEv */
	void CUtlAttributeListChunk(class CUtlAttributeListChunk<int, 16, int> *); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiEC4Ev */
	int Count(const class CUtlAttributeListChunk<int, 16, int>  *); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE5CountEv */
	bool GetValue(const class CUtlAttributeListChunk<int, 16, int>  *, int *, const class CUtlStringToken  &); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE8GetValueEPiRK15CUtlStringToken */
	int GetValueOrDefault(const class CUtlAttributeListChunk<int, 16, int>  *, uint32, int); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE17GetValueOrDefaultEji */
	void DeleteValue(class CUtlAttributeListChunk<int, 16, int> *, uint32); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiE11DeleteValueEj */
	uint32 GetKeyFromIndex(const class CUtlAttributeListChunk<int, 16, int>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE15GetKeyFromIndexEi */
	uint32 * GetKeyPtrFromIndex(class CUtlAttributeListChunk<int, 16, int> *, int); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiE18GetKeyPtrFromIndexEi */
	const int  * GetValuePtrFromIndex(const class CUtlAttributeListChunk<int, 16, int>  *, int); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE20GetValuePtrFromIndexEi */
	int * GetValuePtrFromIndex(class CUtlAttributeListChunk<int, 16, int> *, int); /* linkage=_ZN22CUtlAttributeListChunkIiLi16EiE20GetValuePtrFromIndexEi */
	bool IsEmpty(const class CUtlAttributeListChunk<int, 16, int>  *); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE7IsEmptyEv */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<int, 16, int>  *, i32x4); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE16FindIndexOfMatchEDv2_x */
	int FindIndexOfMatch(const class CUtlAttributeListChunk<int, 16, int>  *, uint32); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE16FindIndexOfMatchEj */
	int GetFreeIndex(const class CUtlAttributeListChunk<int, 16, int>  *); /* linkage=_ZNK22CUtlAttributeListChunkIiLi16EiE12GetFreeIndexEv */
};

// <06E2536F> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<Vector4D, 4, Vector4D>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E2533E> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<Vector4D, 8, Vector4D>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E252CB> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<VMatrix, 2, VMatrix>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E2529A> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<VMatrix, 1, VMatrix>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E25227> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E251F6> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E25184> ../../public/tier0/utlattributelist.h:74
// variables: 2
void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E25111> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E2509E> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E2502B> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<void::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E24FB9> ../../public/tier0/utlattributelist.h:74
// variables: 2
void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E24B77> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <03FF99C8> ../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <03FF97FC> ../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <03AE296B> ../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <0345F4FC> ../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <0022D7B9> ../../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<bool, 16, bool>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <0008D79F> ../public/tier0/utlattributelist.h:74
// variables: 2
inline void CUtlAttributeListChunk<int, 16, int>::ReleaseValues()
{
	const uint32* pKeys; // 76
	{
		int i; // 77
	}
} /* size: 0, variables: 1 */

// <06E25D9A> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<Vector4D, 4, Vector4D>::Clear()
{
} /* size: 0 */

// <06E25D81> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<Vector4D, 8, Vector4D>::Clear()
{
} /* size: 0 */

// <06E25CE0> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<VMatrix, 2, VMatrix>::Clear()
{
} /* size: 0 */

// <06E25CC7> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<VMatrix, 1, VMatrix>::Clear()
{
} /* size: 0 */

// <06E25C26> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>::Clear()
{
} /* size: 0 */

// <06E25C0D> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>::Clear()
{
} /* size: 0 */

// <06E25B6C> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::Clear()
{
} /* size: 0 */

// <06E25ACB> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::Clear()
{
} /* size: 0 */

// <06E25A2A> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::Clear()
{
} /* size: 0 */

// <06E25989> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<void::Clear()
{
} /* size: 0 */

// <06E258E8> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CUtlString, 2, CUtlString>::Clear()
{
} /* size: 0 */

// <06E24EFF> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::Clear()
{
} /* size: 0 */

// <03AE36EC> ../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<CSceneUtils::RenderingPipelineInfo_t, 16, CSceneUtils::RenderingPipelineInfo_t>::Clear()
{
} /* size: 0 */

// <03460AF1> ../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>::Clear()
{
} /* size: 0 */

// <0022DB91> ../../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<bool, 16, bool>::Clear()
{
} /* size: 0 */

// <0008EB7B> ../public/tier0/utlattributelist.h:86
inline void CUtlAttributeListChunk<int, 16, int>::Clear()
{
} /* size: 0 */

// <0402AF45> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 56
void VisitAllAttributes<CUtlAttributeList<void*, 4, void*, CUtlAttributeListChunk<void::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<void::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<void::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>& __for_range; // 11952
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_begin; // 11962
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_end; // 11972
			CUtlIntrusiveList<CUtlAttributeList<void::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<void::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<void::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<void::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<void::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<void::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<void::operator++(); // 317
		}
		CUtlAttributeList<void::FindIndexOfMatch(
				i32x4 n4Key,
				void*** pValueOut);  // 309
		CUtlAttributeList<void::FindIndexOfMatch(
				i32x4 n4Key,
				void*** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<void::FindIndexOfMatch(
				uint32 nKey,
				void*** pValueOut);  // 547
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<void::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<void::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>& __for_range; // 59877
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_begin; // 59887
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_end; // 59897
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<void::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<void::operator++(); // 337
		}
		CUtlAttributeList<void::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					void*** pValueOut);  // 328
		CUtlAttributeList<void::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					void*** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<void::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t, CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<void::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
						int nIdx);  // 562
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<void::SetValue(
			uint32 nKey,
			void* nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				void* nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03FFD817> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 63
void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, CUtlAttributeListChunk<Vector4D, 8, Vector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		Vector4D::Vector4D(
			const Vector4D& vOther);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>& __for_range; // 12280
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_begin; // 12290
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_end; // 12300
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				Vector4D** pValueOut);  // 309
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				Vector4D** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				uint32 nKey,
				Vector4D** pValueOut);  // 547
		Vector4D::operator=(
				const Vector4D& vOther);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>& __for_range; // 63896
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_begin; // 63906
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_end; // 63916
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::begin(); // 337
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::end(); // 337
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					Vector4D** pValueOut);  // 328
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					Vector4D** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t, CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetKeyPtrFromIndex(
						int nIdx);  // 562
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::SetValue(
			uint32 nKey,
			Vector4D nValue);  // 453
		Vector4D::Vector4D(
			const Vector4D& vOther);  // 453
		operator()(const class* __closure,
				int nKey,
				Vector4D nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03FFD7D3> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, CUtlAttributeListChunk<Vector4D, 4, Vector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFD777> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, CUtlAttributeListChunk<VMatrix, 1, VMatrix>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFD733> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<VMatrix, 1, VMatrix, CUtlAttributeListChunk<VMatrix, 2, VMatrix>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFD6D7> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, CUtlAttributeListChunk<IntVector4D, 8, IntVector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFD693> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<IntVector4D, 8, IntVector4D, CUtlAttributeListChunk<IntVector4D, 4, IntVector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFC937> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 53
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		SamplerAttr_t::SamplerAttr_t(
				const SamplerAttrForStorage_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 11460
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 11470
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 11480
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForSto this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 317
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 309
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				uint32 nKey,
				SamplerAttrForStorage_t** pValueOut);  // 547
		SamplerAttrForStorage_t::operator=(
				const SamplerAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 33956
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 33966
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 33976
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 337
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 328
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this,
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::SetValue(
			uint32 nKey,
			SamplerAttr_t nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				SamplerAttr_t nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03FFC8DB> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFC87F> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::MergeTo(ThisType_t&) const::<lambda(int, CRenderAttributes::ConstantBufferAttr_t)> >(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t> this, f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFBA1E> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 58
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 10741
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 10751
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 10761
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorS this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 317
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 309
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				uint32 nKey,
				DescriptorSetAttr_t** pValueOut);  // 547
		DescriptorSetAttr_t::operator=(
				const DescriptorSetAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 47013
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 47023
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 47033
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 337
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 328
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this,
					OverflowChunk_t* node);  // 560
			DescriptorSetAttr_t::DescriptorSetAttr_t(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::SetValue(
			uint32 nKey,
			DescriptorSetAttr_t nValue);  // 453
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 453
		operator()(const class* __closure,
				int nKey,
				DescriptorSetAttr_t nValue); // 99
	}
} /* size: 571, variables: 1 */

// <03FFB9C2> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<void*, 4, void*, CUtlAttributeListChunk<void::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03FFA8ED> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 70
void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, CUtlAttributeListChunk<CUtlString, 2, CUtlString>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 99
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 453
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 11788
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 11798
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 11808
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 309
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 356
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				uint32 nKey,
				CUtlString** pValueOut);  // 547
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 551
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 59563
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 59573
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 59583
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 328
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 556
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 566
		{
			OverflowChunk_t* pNew; // 559
			CUtlString::CUtlString(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t, CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 562
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::SetValue(
			uint32 nKey,
			CUtlString nValue);  // 453
		CUtlString::~CUtlString(); // 453
		operator()(const class* __closure,
				int nKey,
				CUtlString nValue); // 99
		CUtlString::~CUtlString(); // 99
	}
} /* size: 0, variables: 1 */

// <03EB1171> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 56
void VisitAllAttributes<CUtlAttributeList<void*, 4, void*, CUtlAttributeListChunk<void::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<void::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<void::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>& __for_range; // 11868
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_begin; // 11878
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_end; // 11888
			CUtlIntrusiveList<CUtlAttributeList<void::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<void::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<void::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<void::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<void::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<void::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<void::operator++(); // 317
		}
		CUtlAttributeList<void::FindIndexOfMatch(
				i32x4 n4Key,
				void*** pValueOut);  // 309
		CUtlAttributeList<void::FindIndexOfMatch(
				i32x4 n4Key,
				void*** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<void::FindIndexOfMatch(
				uint32 nKey,
				void*** pValueOut);  // 547
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<void::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<void::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>& __for_range; // 3058
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_begin; // 3068
			CUtlIntrusiveListIterator<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t> __for_end; // 3078
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<void::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<void::operator++(); // 337
		}
		CUtlAttributeList<void::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					void*** pValueOut);  // 328
		CUtlAttributeList<void::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					void*** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<void::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t, CUtlAttributeList<void*, 4, void*, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<void::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<void::GetKeyPtrFromIndex(
						int nIdx);  // 562
			CUtlAttributeListChunk<void::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<void::SetValue(
			uint32 nKey,
			void* nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				void* nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03E7F6B8> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 63
void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, CUtlAttributeListChunk<Vector4D, 8, Vector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		Vector4D::Vector4D(
			const Vector4D& vOther);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>& __for_range; // 12196
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_begin; // 12206
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_end; // 12216
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				Vector4D** pValueOut);  // 309
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				Vector4D** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexOfMatch(
				uint32 nKey,
				Vector4D** pValueOut);  // 547
		Vector4D::operator=(
				const Vector4D& vOther);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>& __for_range; // 7077
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_begin; // 7087
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t> __for_end; // 7097
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::begin(); // 337
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::end(); // 337
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					Vector4D** pValueOut);  // 328
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<Vector4D, 8, Vector4D>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					Vector4D** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t, CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<Vector4D, 8, Vector4D, 4>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetKeyPtrFromIndex(
						int nIdx);  // 562
			CUtlAttributeListChunk<Vector4D, 4, Vector4D>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<Vector4D, 8, Vector4D, 4>::SetValue(
			uint32 nKey,
			Vector4D nValue);  // 453
		Vector4D::Vector4D(
			const Vector4D& vOther);  // 453
		operator()(const class* __closure,
				int nKey,
				Vector4D nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03E7E7D7> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 53
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		SamplerAttr_t::SamplerAttr_t(
				const SamplerAttrForStorage_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 11376
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 11386
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 11396
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForSto this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 317
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 309
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				uint32 nKey,
				SamplerAttrForStorage_t** pValueOut);  // 547
		SamplerAttrForStorage_t::operator=(
				const SamplerAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 41798
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 41808
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 41818
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 337
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 328
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this,
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::SetValue(
			uint32 nKey,
			SamplerAttr_t nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				SamplerAttr_t nValue); // 99
	}
} /* size: 0, variables: 1 */

// <03E7D91C> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 59
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::MergeTo(ThisType_t&) const::<lambda(int, CRenderAttributes::ConstantBufferAttr_t)> >(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t> this, f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		ConstantBufferAttr_t::ConstantBufferAttr_t(
					const ConstantBufferAttr_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>   this,
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t>& __for_range; // 10821
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t> __for_begin; // 10831
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t> __for_end; // 10841
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBu this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::Constant this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAt this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::Constant this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAt this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>   this,
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::Constant this); // 317
		}
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				ConstantBufferAttr_t** pValueOut);  // 309
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				ConstantBufferAttr_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::FindIndexOfMatch(
				uint32 nKey,
				ConstantBufferAttr_t** pValueOut);  // 547
		ConstantBufferAttr_t::operator=(
				const ConstantBufferAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>   this,
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t>& __for_range; // 59430
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t> __for_begin; // 59440
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t> __for_end; // 59450
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			FindIndexOfMatch(const CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>   this,
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::Constant this); // 337
		}
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					ConstantBufferAttr_t** pValueOut);  // 328
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					ConstantBufferAttr_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			ConstantBufferAttr_t::ConstantBufferAttr_t(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAt this,
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t>::GetKeyPtrFromIndex(
						int nIdx);  // 562
		}
		CUtlAttributeList<CRenderAttributes::ConstantBufferAttr_t, 4, CRenderAttributes::ConstantBufferAttr_t, 4>::SetValue(
			uint32 nKey,
			ConstantBufferAttr_t nValue);  // 453
		ConstantBufferAttr_t::ConstantBufferAttr_t(
					const ConstantBufferAttr_t& other);  // 453
		operator()(const class* __closure,
				int nKey,
				ConstantBufferAttr_t nValue); // 99
	}
} /* size: 547, variables: 1 */

// <03E7CABB> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 58
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 10657
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 10667
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 10677
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorS this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 317
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 309
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				uint32 nKey,
				DescriptorSetAttr_t** pValueOut);  // 547
		DescriptorSetAttr_t::operator=(
				const DescriptorSetAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 59116
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 59126
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 59136
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 337
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 328
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this,
					OverflowChunk_t* node);  // 560
			DescriptorSetAttr_t::DescriptorSetAttr_t(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::SetValue(
			uint32 nKey,
			DescriptorSetAttr_t nValue);  // 453
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 453
		operator()(const class* __closure,
				int nKey,
				DescriptorSetAttr_t nValue); // 99
	}
} /* size: 571, variables: 1 */

// <03E7B989> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 70
void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, CUtlAttributeListChunk<CUtlString, 2, CUtlString>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 99
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 453
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 11704
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 11714
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 11724
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 309
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 356
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				uint32 nKey,
				CUtlString** pValueOut);  // 547
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 551
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 2744
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 2754
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 2764
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 328
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 556
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 566
		{
			OverflowChunk_t* pNew; // 559
			CUtlString::CUtlString(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t, CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 562
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::SetValue(
			uint32 nKey,
			CUtlString nValue);  // 453
		CUtlString::~CUtlString(); // 453
		operator()(const class* __closure,
				int nKey,
				CUtlString nValue); // 99
		CUtlString::~CUtlString(); // 99
	}
} /* size: 0, variables: 1 */

// <03739426> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>::VisitAllAttributes<CScratchRenderTargetSystem::ComputeLayerInfo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <0373926C> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>::VisitAllAttributes<CScratchRenderTargetSystem::ComputeInternalLayerFlags(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03738E5A> ../public/tier0/utlattributelist.h:92
// variables: 5
// function calls: 11
void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::VisitAllAttributes<CScratchRenderTargetSystem::OutputRenderTargetBindings(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		{
			HRenderTexture hTexture; // 2446
			CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
			CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
					const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2447
			{
				RenderMultisampleType_t nType; // 2455
				CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
					const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
				CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
						const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2455
			}
			CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
			CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
					const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2446
		}
		operator()(const class* __closure,
				uint32 nAttributeKey,
				const TextureAttr_t& txtr); // 99
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator CWeakHandle<InfoForResourceTypeCTextureBase>::ResourceHandleTyped_t(); // 993
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			ResourceHandleTyped_t hResource);  // 266
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				ResourceHandleTyped_t hResource);  // 993
		TextureAttr_t::TextureAttr_t(
				const TextureAttrForStorage_t& other);  // 99
	}
} /* size: 346, variables: 1 */

// <03738DFE> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void CUtlAttributeListChunk<ISceneLayer::RenderTargetAttribute_t, 16, ISceneLayer::RenderTargetAttribute_t>::VisitAllAttributes<CScratchRenderTargetSystem::ValidateLegalRenderTargets(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <03125185> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void CUtlAttributeListChunk<CRenderAttributes::TextureAttr_t, 8, CRenderAttributes::TextureAttrForStorage_t>::VisitAllAttributes<CDebugLayerRenderer::ShowRenderTargets(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <02E910C1> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<Vector4D, 8, Vector4D, CUtlAttributeListChunk<Vector4D, 8, Vector4D>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <02E901E0> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 53
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		SamplerAttr_t::SamplerAttr_t(
				const SamplerAttrForStorage_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 47478
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 47488
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 47498
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForSto this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 317
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 309
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				uint32 nKey,
				SamplerAttrForStorage_t** pValueOut);  // 547
		SamplerAttrForStorage_t::operator=(
				const SamplerAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 44676
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 44686
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 44696
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 337
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 328
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this,
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::SetValue(
			uint32 nKey,
			SamplerAttr_t nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				SamplerAttr_t nValue); // 99
	}
} /* size: 0, variables: 1 */

// <02E900CC> ../public/tier0/utlattributelist.h:92
// variables: 2
inline void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
	}
} /* size: 0, variables: 1 */

// <02E8EF9A> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 70
void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, CUtlAttributeListChunk<CUtlString, 2, CUtlString>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 99
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 453
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 47806
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 47816
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 47826
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 309
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 356
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				uint32 nKey,
				CUtlString** pValueOut);  // 547
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 551
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 42761
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 42771
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 42781
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 328
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 556
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 566
		{
			OverflowChunk_t* pNew; // 559
			CUtlString::CUtlString(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t, CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 562
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::SetValue(
			uint32 nKey,
			CUtlString nValue);  // 453
		CUtlString::~CUtlString(); // 453
		operator()(const class* __closure,
				int nKey,
				CUtlString nValue); // 99
		CUtlString::~CUtlString(); // 99
	}
} /* size: 0, variables: 1 */

// <02796C84> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 53
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		SamplerAttr_t::SamplerAttr_t(
				const SamplerAttrForStorage_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 52578
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 52588
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 52598
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForSto this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 317
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 309
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				uint32 nKey,
				SamplerAttrForStorage_t** pValueOut);  // 547
		SamplerAttrForStorage_t::operator=(
				const SamplerAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 6440
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 6450
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 6460
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 337
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 328
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					SamplerAttrForStorage_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this,
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 563
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::SetValue(
			uint32 nKey,
			SamplerAttr_t nValue);  // 453
		operator()(const class* __closure,
				int nKey,
				SamplerAttr_t nValue); // 99
	}
} /* size: 0, variables: 1 */

// <02795D6A> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 58
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::4>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 51859
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 51869
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 51879
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorS this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 317
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 309
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				i32x4 n4Key,
				DescriptorSetAttr_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexOfMatch(
				uint32 nKey,
				DescriptorSetAttr_t** pValueOut);  // 547
		DescriptorSetAttr_t::operator=(
				const DescriptorSetAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>& __for_range; // 18083
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_begin; // 18093
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t> __for_end; // 18103
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::GetValuePtrFromIndex(
						int nIdx);  // 343
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::Descripto this); // 337
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 328
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					DescriptorSetAttr_t** pValueOut);  // 556
		{
			OverflowChunk_t* pNew; // 559
			AddToHead<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t, CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			AddToHead(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr this,
					OverflowChunk_t* node);  // 560
			DescriptorSetAttr_t::DescriptorSetAttr_t(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
		}
		CUtlAttributeList<CRenderAttributes::DescriptorSetAttr_t, 4, CRenderAttributes::DescriptorSetAttr_t, 4>::SetValue(
			uint32 nKey,
			DescriptorSetAttr_t nValue);  // 453
		DescriptorSetAttr_t::DescriptorSetAttr_t(
					const DescriptorSetAttr_t& other);  // 453
		operator()(const class* __closure,
				int nKey,
				DescriptorSetAttr_t nValue); // 99
	}
} /* size: 571, variables: 1 */

// <02794C38> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 70
void VisitAllAttributes<CUtlAttributeList<CUtlString, 2, CUtlString, CUtlAttributeListChunk<CUtlString, 2, CUtlString>::2>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 99
		CUtlString::Get(); // 354
		CUtlString::CUtlString(
				const CUtlString& string);  // 453
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 314
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 52906
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 52916
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 52926
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::Head(); // 1151
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1151
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::begin(); // 317
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::CUtlIntrusiveListIterator(
							OverflowChunk_t* pNode);  // 1156
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::end(); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 322
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 317
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 309
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				i32x4 n4Key,
				CUtlString** pValueOut);  // 356
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexOfMatch(
				uint32 nKey,
				CUtlString** pValueOut);  // 547
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 551
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
					int nIdx);  // 333
		CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
					int nIdx);  // 334
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>& __for_range; // 30910
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_begin; // 30920
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t> __for_end; // 30930
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 339
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 342
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetValuePtrFromIndex(
						int nIdx);  // 343
			CUtlIntrusiveListIterator<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::operator++(); // 337
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 328
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::FindIndexAndKeyOfMatch(
					i32x4 n4Key,
					uint32** pKeyOut,
					CUtlString** pValueOut);  // 556
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 161
		CUtlString::Get(); // 161
		CUtlString::operator=(
				const CUtlString& src);  // 566
		{
			OverflowChunk_t* pNew; // 559
			CUtlString::CUtlString(); // 117
			_mm_store_ps(float* __P,
					__m128 __A);  // 2680
			StoreAlignedIntSIMD<>(i32x4& pSIMD,
						const fltx4& a);  // 39
			SetFixedKeysToZero<1>(i32x4* pFixedKeys); // 118
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::CUtlAttributeListChunk(); // 254
			OverflowChunk_t::OverflowChunk_t(); // 559
			AddToHead<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t, CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>(OverflowChunk_t *& head,
																OverflowChunk_t* node);  // 960
			CUtlIntrusiveList<CUtlAttributeList<CUtlString, 2, CUtlString, 2>::OverflowChunk_t>::AddToHead(
					OverflowChunk_t* node);  // 560
			CUtlAttributeListChunk<CUtlString, 2, CUtlString>::GetKeyPtrFromIndex(
						int nIdx);  // 562
		}
		CUtlAttributeList<CUtlString, 2, CUtlString, 2>::SetValue(
			uint32 nKey,
			CUtlString nValue);  // 453
		CUtlString::~CUtlString(); // 453
		operator()(const class* __closure,
				int nKey,
				CUtlString nValue); // 99
		CUtlString::~CUtlString(); // 99
	}
} /* size: 0, variables: 1 */

// <01D9C137> ../public/tier0/utlattributelist.h:92
// variables: 29
// function calls: 53
void VisitAllAttributes<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::8>::MergeTo(f)
{
	const int* pKeys; // 94
	{
		int i; // 95
		SamplerAttr_t::SamplerAttr_t(
				const SamplerAttrForStorage_t& other);  // 99
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 311
		{
			OverflowChunk_t& p; // 317
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 348
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 358
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_end; // 368
			Head(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForSto this); // 1151
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1151
			begin(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			CUtlIntrusiveListIterator(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this,
							OverflowChunk_t* pNode);  // 1156
			end(const CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t this); // 317
			{
				int i; // 212
				{
					int nTestResult; // 217
					{
						fltx4 retVal; // 1880
						_mm_cmpeq_epi32(__m128i __A,
								__m128i __B);  // 1881
						_mm_castsi128_ps(__m128i __A); // 1881
					}
					CmpEqSIMD<>(const i32x4& a,
							const i32x4& b);  // 217
					_mm_movemask_ps(__m128 __A); // 1805
					TestSignSIMD<>(const fltx4& a); // 217
					{
						const int  nIndex; // 220
					}
				}
			}
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
					i32x4 i4KMatch);  // 319
			operator++(const CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForS this); // 317
			CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
						int nIdx);  // 322
		}
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 309
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::GetValuePtrFromIndex(
					int nIdx);  // 314
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				i32x4 n4Key,
				SamplerAttrForStorage_t** pValueOut);  // 356
		{
			__m128i retVal; // 1105
			_mm_set_epi32(int __q3,
					int __q2,
					int __q1,
					int __q0);  // 648
			_mm_set1_epi32(int __A); // 1106
		}
		ReplicateIX4<>(int nValue); // 356
		CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::FindIndexOfMatch(
				uint32 nKey,
				SamplerAttrForStorage_t** pValueOut);  // 547
		SamplerAttrForStorage_t::operator=(
				const SamplerAttr_t& other);  // 566
		{
			int i; // 212
			{
				int nTestResult; // 217
				{
					fltx4 retVal; // 1880
					_mm_cmpeq_epi32(__m128i __A,
							__m128i __B);  // 1881
					_mm_castsi128_ps(__m128i __A); // 1881
				}
				CmpEqSIMD<>(const i32x4& a,
						const i32x4& b);  // 217
				_mm_movemask_ps(__m128 __A); // 1805
				TestSignSIMD<>(const fltx4& a); // 217
				{
					const int  nIndex; // 220
				}
			}
		}
		CUtlAttributeListChunk<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t>::FindIndexOfMatch(
				i32x4 i4KMatch);  // 330
		{
			OverflowChunk_t& p; // 337
			CUtlIntrusiveList<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t>& __for_range; // 28123
			CUtlIntrusiveListIterator<CUtlAttributeList<CRenderAttributes::SamplerAttr_t, 8, CRenderAttributes::SamplerAttrForStorage_t, 8>::OverflowChunk_t> __for_begin; // 28133
