
//
// kv3lib/keyvalues3.cpp
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   liblocalize.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//
//	functions: 711
//	classes: 10
//	structs: 3
//

// <055443E9> kv3lib/keyvalues3.cpp:28
bool LoadKV3Text(KeyValues3 *, CUtlString *, const char *, const KV3ID_t &, const char *)
{
} /* size: 0 */

// <055443B9> kv3lib/keyvalues3.cpp:31
bool SaveKV3Text(const KV3ID_t &, const KV3ID_t &, const KeyValues3 *, CUtlString *, CUtlBuffer *)
{
} /* size: 0 */

// <05544389> kv3lib/keyvalues3.cpp:32
bool SaveKV3Binary(const KV3ID_t &, const KV3ID_t &, const KeyValues3 *, CUtlString *, CUtlBuffer *)
{
} /* size: 0 */

// <0557C84C> kv3lib/keyvalues3.cpp:93
bool IsInternalTypeNumeric(KeyValues3InternalType_t nType)
{
} /* size: 0 */

// <0557C7D8> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 36116
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <028F41D2> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 54787
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <01259404> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 16371
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <002D4BC9> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 2538
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <00639DCB> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 28524
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <00A11A52> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 34675
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <0011E5D3> kv3lib/keyvalues3.cpp:114
// variables: 2
const char* ExternalNameForInternalType(KeyValues3InternalType_t nType)
{
	const char   __FUNCTION__; // 27172
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 119
	}
} /* size: 0, variables: 1 */

// <05528552> kv3lib/keyvalues3.cpp:151
// member functions: 10
// member variables: 2
// class size: 72
class CKeyValues3Array {
	/* kv3lib/keyvalues3.cpp:154 */
	void CKeyValues3Array(CKeyValues3Array* , int32);
	/* kv3lib/keyvalues3.cpp:155 */
	void ~CKeyValues3Array(CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:157 */
	void Expand(CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:162 */
	int GetElementCount(const CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:167 */
	KeyValues3* GetElement(CKeyValues3Array* , int);
	const int32 m_nClusterIndex; /* 0 4 */
	CUtlVectorFixedGrowable<KeyValues3*, 4> m_Elements __attribute__((__aligned__(8))); /* 8 64 */
	void CKeyValues3Array(class CKeyValues3Array *, int32); /* linkage=_ZN16CKeyValues3ArrayC4Ei */
	void ~CKeyValues3Array(class CKeyValues3Array *); /* linkage=_ZN16CKeyValues3ArrayD4Ev */
	void Expand(class CKeyValues3Array *); /* linkage=_ZN16CKeyValues3Array6ExpandEv */
	int GetElementCount(const class CKeyValues3Array  *); /* linkage=_ZNK16CKeyValues3Array15GetElementCountEv */
	class KeyValues3 * GetElement(class CKeyValues3Array *, int); /* linkage=_ZN16CKeyValues3Array10GetElementEi */
} __attribute__((__aligned__(8)));

// <0557C788> kv3lib/keyvalues3.cpp:154
void CKeyValues3Array::CKeyValues3Array(int32 nClusterIndex)
{
} /* size: 0 */

// <0557C763> kv3lib/keyvalues3.cpp:154
inline void CKeyValues3Array::CKeyValues3Array(int32 nClusterIndex)
{
} /* size: 0 */

// <0557C74C> kv3lib/keyvalues3.cpp:155
void CKeyValues3Array::~CKeyValues3Array()
{
} /* size: 0 */

// <0557C733> kv3lib/keyvalues3.cpp:155
inline void CKeyValues3Array::~CKeyValues3Array()
{
} /* size: 0 */

// <0557C71A> kv3lib/keyvalues3.cpp:157
inline void CKeyValues3Array::Expand()
{
} /* size: 0 */

// <0557C701> kv3lib/keyvalues3.cpp:162
inline void CKeyValues3Array::GetElementCount()
{
} /* size: 0 */

// <0557C6B3> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 35672
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <028F40AD> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 54343
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <012592DF> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 15927
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <002D4AA4> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 2094
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <00639CA6> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 28080
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <00A1192D> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 34231
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <0011E4AE> kv3lib/keyvalues3.cpp:167
// variables: 2
inline void CKeyValues3Array::GetElement(int nIndex)
{
	const char   __FUNCTION__; // 26728
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 177
	}
} /* size: 0, variables: 1 */

// <0552812E> kv3lib/keyvalues3.cpp:189
// member functions: 42
// member variables: 6
// static member variables: 2
// class size: 312
class CKeyValues3Table {
	/* kv3lib/keyvalues3.cpp:225 */
	enum MemberFlags_t {
		MEMBER_FLAG_EXTERNAL_NAME = 1,
	};
	/* kv3lib/keyvalues3.cpp:235 */
	struct LargeTableIndex_t {
		CUtlHashtable<CUtlStringToken, int, DefaultHashFunctor<CUtlStringToken>, DefaultEqualFunctor<CUtlStringToken>, undefined_t, CUtlMemory<CUtlHashtableEntry<CUtlStringToken, int>, int> > m_Entries; /* 0 32 */
		void LargeTableIndex_t(LargeTableIndex_t* );
		void ~LargeTableIndex_t(LargeTableIndex_t* );
	};
	/* kv3lib/keyvalues3.cpp:192 */
	void CKeyValues3Table(CKeyValues3Table* , int32);
	/* kv3lib/keyvalues3.cpp:193 */
	void ~CKeyValues3Table(CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:195 */
	void Init(CKeyValues3Table* , KeyValues3* );
	/* kv3lib/keyvalues3.cpp:196 */
	void Free(CKeyValues3Table* , KeyValues3* , KeyValues3InternalFreeMode_t);
	/* kv3lib/keyvalues3.cpp:198 */
	KeyValues3* MemberData(CKeyValues3Table* , int);
	/* kv3lib/keyvalues3.cpp:199 */
	const KeyValues3* MemberData(const CKeyValues3Table* , int);
	/* kv3lib/keyvalues3.cpp:200 */
	const char* MemberName(const CKeyValues3Table* , int);
	/* kv3lib/keyvalues3.cpp:201 */
	KeyValues3LowercaseHash_t MemberNameHash(const CKeyValues3Table* , int);
	/* kv3lib/keyvalues3.cpp:202 */
	CKV3MemberName KV3MemberName(const CKeyValues3Table* , int);
	/* kv3lib/keyvalues3.cpp:204 */
	void Clear(CKeyValues3Table* , KeyValues3* , uint);
	/* kv3lib/keyvalues3.cpp:206 */
	void CopyFrom(CKeyValues3Table* , KeyValues3* , const CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:208 */
	bool IsIdenticalTo(const CKeyValues3Table* , const CKeyValues3Table* , bool);
	/* kv3lib/keyvalues3.cpp:210 */
	int Count(const CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:211 */
	void Remove(CKeyValues3Table* , KeyValues3* , int);
	/* kv3lib/keyvalues3.cpp:212 */
	bool Remove(CKeyValues3Table* , KeyValues3* , KeyValues3* );
	/* kv3lib/keyvalues3.cpp:213 */
	void RenameMember(CKeyValues3Table* , KeyValues3* , int, CKV3MemberName);
	/* kv3lib/keyvalues3.cpp:216 */
	int FindMember_Internal(const CKeyValues3Table* , CKV3MemberName, uint& );
	/* kv3lib/keyvalues3.cpp:217 */
	int FindOrCreateMember_Internal(CKeyValues3Table* , KeyValues3* , CKV3MemberName, bool, bool* );
	/* kv3lib/keyvalues3.cpp:218 */
	int AddMember_Internal(CKeyValues3Table* , KeyValues3* , CKV3MemberName, bool);
	/* kv3lib/keyvalues3.cpp:219 */
	void InitLargeTableIndex_Internal(CKeyValues3Table* );
	const int32 m_nClusterIndex; /* 0 4 */
private:
	static const int LARGE_TABLE_INDEX_CREATION_THRESHOLD = 128; /* 0 0 */
	static const int KV3_TABLE_EMBEDDED_MEMBER_STORAGE_COUNT = 8; /* 0 0 */
	LargeTableIndex_t * m_pLargeTableIndex; /* 8 8 */
	CUtlVectorFixedGrowable<CUtlStringToken, 8> m_MemberNameLowerHash __attribute__((__aligned__(8))); /* 16 64 */
	CUtlVectorFixedGrowable<KeyValues3*, 8> m_MemberData __attribute__((__aligned__(8))); /* 80 96 */
	CUtlVectorFixedGrowable<char const*, 8> m_MemberName __attribute__((__aligned__(8))); /* 176 96 */
	CUtlVectorFixedGrowable<unsigned char, 8> m_MemberFlags __attribute__((__aligned__(8))); /* 272 40 */
	void CKeyValues3Table(class CKeyValues3Table *, int32); /* linkage=_ZN16CKeyValues3TableC4Ei */
	void ~CKeyValues3Table(class CKeyValues3Table *); /* linkage=_ZN16CKeyValues3TableD4Ev */
	/* <5584b11> kv3lib/keyvalues3.cpp:3185 */
	void Init(class CKeyValues3Table *, class KeyValues3 *); /* linkage=_ZN16CKeyValues3Table4InitEP10KeyValues3 */
	void Free(class CKeyValues3Table *, class KeyValues3 *, enum KeyValues3InternalFreeMode_t); /* linkage=_ZN16CKeyValues3Table4FreeEP10KeyValues328KeyValues3InternalFreeMode_t */
	/* <55851dd> kv3lib/keyvalues3.cpp:3336 */
	class KeyValues3 * MemberData(class CKeyValues3Table *, int); /* linkage=_ZN16CKeyValues3Table10MemberDataEi */
	/* <55852be> kv3lib/keyvalues3.cpp:3351 */
	const class KeyValues3  * MemberData(const class CKeyValues3Table  *, int); /* linkage=_ZNK16CKeyValues3Table10MemberDataEi */
	/* <558539f> kv3lib/keyvalues3.cpp:3366 */
	const char  * MemberName(const class CKeyValues3Table  *, int); /* linkage=_ZNK16CKeyValues3Table10MemberNameEi */
	/* <5585480> kv3lib/keyvalues3.cpp:3381 */
	KeyValues3LowercaseHash_t MemberNameHash(const class CKeyValues3Table  *, int); /* linkage=_ZNK16CKeyValues3Table14MemberNameHashEi */
	class CKV3MemberName KV3MemberName(const class CKeyValues3Table  *, int); /* linkage=_ZNK16CKeyValues3Table13KV3MemberNameEi */
	void Clear(class CKeyValues3Table *, class KeyValues3 *, uint); /* linkage=_ZN16CKeyValues3Table5ClearEP10KeyValues3j */
	void CopyFrom(class CKeyValues3Table *, class KeyValues3 *, const class CKeyValues3Table  *); /* linkage=_ZN16CKeyValues3Table8CopyFromEP10KeyValues3PKS_ */
	bool IsIdenticalTo(const class CKeyValues3Table  *, const class CKeyValues3Table  *, bool); /* linkage=_ZNK16CKeyValues3Table13IsIdenticalToEPKS_b */
	int Count(const class CKeyValues3Table  *); /* linkage=_ZNK16CKeyValues3Table5CountEv */
	void Remove(class CKeyValues3Table *, class KeyValues3 *, int); /* linkage=_ZN16CKeyValues3Table6RemoveEP10KeyValues3i */
	/* <5588459> kv3lib/keyvalues3.cpp:3506 */
	bool Remove(class CKeyValues3Table *, class KeyValues3 *, class KeyValues3 *); /* linkage=_ZN16CKeyValues3Table6RemoveEP10KeyValues3S1_ */
	void RenameMember(class CKeyValues3Table *, class KeyValues3 *, int, class CKV3MemberName); /* linkage=_ZN16CKeyValues3Table12RenameMemberEP10KeyValues3i14CKV3MemberName */
	int FindMember_Internal(const class CKeyValues3Table  *, class CKV3MemberName, uint &); /* linkage=_ZNK16CKeyValues3Table19FindMember_InternalE14CKV3MemberNameRj */
	/* <558b5b9> kv3lib/keyvalues3.cpp:3191 */
	int FindOrCreateMember_Internal(class CKeyValues3Table *, class KeyValues3 *, class CKV3MemberName, bool, bool *); /* linkage=_ZN16CKeyValues3Table27FindOrCreateMember_InternalEP10KeyValues314CKV3MemberNamebPb */
	int AddMember_Internal(class CKeyValues3Table *, class KeyValues3 *, class CKV3MemberName, bool); /* linkage=_ZN16CKeyValues3Table18AddMember_InternalEP10KeyValues314CKV3MemberNameb */
	void InitLargeTableIndex_Internal(class CKeyValues3Table *); /* linkage=_ZN16CKeyValues3Table28InitLargeTableIndex_InternalEv */
} __attribute__((__aligned__(8)));

// <0557C69A> kv3lib/keyvalues3.cpp:210
inline void CKeyValues3Table::Count()
{
} /* size: 0 */

// <05560EC0> kv3lib/keyvalues3.cpp:235
void LargeTableIndex_t::~LargeTableIndex_t()
{
} /* size: 0 */

// <05560EA4> kv3lib/keyvalues3.cpp:235
inline void LargeTableIndex_t::~LargeTableIndex_t()
{
} /* size: 0 */

// <0555FBC6> kv3lib/keyvalues3.cpp:235
void LargeTableIndex_t::LargeTableIndex_t()
{
} /* size: 0 */

// <0555FBAA> kv3lib/keyvalues3.cpp:235
inline void LargeTableIndex_t::LargeTableIndex_t()
{
} /* size: 0 */

// <05528634> kv3lib/keyvalues3.cpp:251
// member functions: 2
// member variable: 1
// struct size: 8
struct KeyValues3BinaryBlob_t {
	/* kv3lib/keyvalues3.cpp:253 */
	const byte* AsByteArray(const KeyValues3BinaryBlob_t* );
	/* kv3lib/keyvalues3.cpp:254 */
	byte* AsByteArray(KeyValues3BinaryBlob_t* );
	intp m_nCount; /* 0 8 */
};

// <0557C681> kv3lib/keyvalues3.cpp:254
inline void KeyValues3BinaryBlob_t::AsByteArray()
{
} /* size: 0 */

// <055286A3> kv3lib/keyvalues3.cpp:262
// member functions: 2
// member variables: 3
// struct size: 24
struct KeyValues3BinaryBlobExternal_t {
	/* kv3lib/keyvalues3.cpp:264 */
	const byte* AsByteArray(const KeyValues3BinaryBlobExternal_t* );
	/* kv3lib/keyvalues3.cpp:265 */
	byte* AsByteArray(KeyValues3BinaryBlobExternal_t* );
	intp m_nCount; /* 0 8 */
	byte * m_pData; /* 8 8 */
	bool m_bOwnsData; /* 16 1 */
};

// <0557C60F> kv3lib/keyvalues3.cpp:274
void CKeyValues3Metadata::~CKeyValues3Metadata()
{
} /* size: 0 */

// <0557C5F2> kv3lib/keyvalues3.cpp:274
inline void CKeyValues3Metadata::~CKeyValues3Metadata()
{
} /* size: 0 */

// <0557C3C8> kv3lib/keyvalues3.cpp:274
void CKeyValues3Metadata::CKeyValues3Metadata()
{
} /* size: 0 */

// <0557C3AB> kv3lib/keyvalues3.cpp:274
inline void CKeyValues3Metadata::CKeyValues3Metadata()
{
} /* size: 0 */

// <0552BFBB> kv3lib/keyvalues3.cpp:274
// member functions: 4
// member variables: 4
// class size: 48
class CKeyValues3Metadata {
	int m_nLineNumber; /* 0 4 */
	CUtlSymbolLarge m_File; /* 8 8 */
	CBufferString m_Preamble; /* 16 16 */
	CBufferString m_Postamble; /* 32 16 */
	void CKeyValues3Metadata(CKeyValues3Metadata* );
	void ~CKeyValues3Metadata(CKeyValues3Metadata* );
	void CKeyValues3Metadata(class CKeyValues3Metadata *); /* linkage=_ZN19CKeyValues3MetadataC4Ev */
	void ~CKeyValues3Metadata(class CKeyValues3Metadata *); /* linkage=_ZN19CKeyValues3MetadataD4Ev */
};

// <0557C5DB> kv3lib/keyvalues3.cpp:286
void CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster()
{
} /* size: 0 */

// <0557C5BE> kv3lib/keyvalues3.cpp:286
inline void CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster()
{
} /* size: 0 */

// <0557C394> kv3lib/keyvalues3.cpp:286
void CKeyValues3MetadataCluster::CKeyValues3MetadataCluster()
{
} /* size: 0 */

// <0557C377> kv3lib/keyvalues3.cpp:286
inline void CKeyValues3MetadataCluster::CKeyValues3MetadataCluster()
{
} /* size: 0 */

// <0553AF2C> kv3lib/keyvalues3.cpp:286
// member functions: 4
// member variable: 1
// class size: 3,024
class CKeyValues3MetadataCluster {
	CKeyValues3Metadata m_Metadata[63]; /* 0 3024 */
	void CKeyValues3MetadataCluster(CKeyValues3MetadataCluster* );
	void ~CKeyValues3MetadataCluster(CKeyValues3MetadataCluster* );
	void CKeyValues3MetadataCluster(class CKeyValues3MetadataCluster *); /* linkage=_ZN26CKeyValues3MetadataClusterC4Ev */
	void ~CKeyValues3MetadataCluster(class CKeyValues3MetadataCluster *); /* linkage=_ZN26CKeyValues3MetadataClusterD4Ev */
};

// <0553AF90> kv3lib/keyvalues3.cpp:303
// member functions: 24
// member variables: 3
// class size: 1,024
class CKV3ClusterAlloc<KeyValues3, 63> {
	/* kv3lib/keyvalues3.cpp:346 */
	void CKV3ClusterAlloc(CKV3ClusterAlloc<KeyValues3, 63>* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:309 */
	void ~CKV3ClusterAlloc(CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:311 */
	int Capacity(const CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:312 */
	int AllocationCount(const CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:313 */
	bool IsFull(const CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:314 */
	bool IsEmpty(const CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:425 */
	void Free(CKV3ClusterAlloc<KeyValues3, 63>* , KeyValues3* );
	/* kv3lib/keyvalues3.cpp:357 */
	KeyValues3* Get(CKV3ClusterAlloc<KeyValues3, 63>* , int);
	/* kv3lib/keyvalues3.cpp:324 */
	CKeyValues3Context* GetParentContext(CKV3ClusterAlloc<KeyValues3, 63>* );
	/* kv3lib/keyvalues3.cpp:387 */
	int GetIndexForEntry(CKV3ClusterAlloc<KeyValues3, 63>* , const KeyValues3* );
	/* kv3lib/keyvalues3.cpp:368 */
	void Dump(CKV3ClusterAlloc<KeyValues3, 63>* );
protected:
	/* kv3lib/keyvalues3.cpp:402 */
	KeyValues3* AllocateEntry(CKV3ClusterAlloc<KeyValues3, 63>* );
	CKeyValues3Context * m_pContext; /* 0 8 */
	uint64 m_nAllocatedFlags; /* 8 8 */
	KeyValues3 m_Values[63]; /* 16 1008 */
	/* kv3lib/keyvalues3.cpp:306 */
	typedef struct KeyValues3 ClusteredType;
	void CKV3ClusterAlloc(class CKV3ClusterAlloc<KeyValues3, 63> *, class CKeyValues3Context *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EEC4EP18CKeyValues3Context */
	void ~CKV3ClusterAlloc(class CKV3ClusterAlloc<KeyValues3, 63> *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EED4Ev */
	int Capacity(const class CKV3ClusterAlloc<KeyValues3, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI10KeyValues3Li63EE8CapacityEv */
	int AllocationCount(const class CKV3ClusterAlloc<KeyValues3, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI10KeyValues3Li63EE15AllocationCountEv */
	bool IsFull(const class CKV3ClusterAlloc<KeyValues3, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI10KeyValues3Li63EE6IsFullEv */
	bool IsEmpty(const class CKV3ClusterAlloc<KeyValues3, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI10KeyValues3Li63EE7IsEmptyEv */
	void Free(class CKV3ClusterAlloc<KeyValues3, 63> *, class KeyValues3 *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE4FreeEPS0_ */
	class KeyValues3 * Get(class CKV3ClusterAlloc<KeyValues3, 63> *, int); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE3GetEi */
	class CKeyValues3Context * GetParentContext(class CKV3ClusterAlloc<KeyValues3, 63> *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE16GetParentContextEv */
	int GetIndexForEntry(class CKV3ClusterAlloc<KeyValues3, 63> *, const class KeyValues3  *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE16GetIndexForEntryEPKS0_ */
	void Dump(class CKV3ClusterAlloc<KeyValues3, 63> *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE4DumpEv */
	class KeyValues3 * AllocateEntry(class CKV3ClusterAlloc<KeyValues3, 63> *); /* linkage=_ZN16CKV3ClusterAllocI10KeyValues3Li63EE13AllocateEntryEv */
};

// <0553B342> kv3lib/keyvalues3.cpp:303
// member functions: 12
// member variables: 3
// class size: 4,552
class CKV3ClusterAlloc<CKeyValues3Array, 63> {
	/* kv3lib/keyvalues3.cpp:346 */
	void CKV3ClusterAlloc(CKV3ClusterAlloc<CKeyValues3Array, 63>* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:309 */
	void ~CKV3ClusterAlloc(CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:311 */
	int Capacity(const CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:312 */
	int AllocationCount(const CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:313 */
	bool IsFull(const CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:314 */
	bool IsEmpty(const CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:425 */
	void Free(CKV3ClusterAlloc<CKeyValues3Array, 63>* , CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:357 */
	CKeyValues3Array* Get(CKV3ClusterAlloc<CKeyValues3Array, 63>* , int);
	/* kv3lib/keyvalues3.cpp:324 */
	CKeyValues3Context* GetParentContext(CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	/* kv3lib/keyvalues3.cpp:387 */
	int GetIndexForEntry(CKV3ClusterAlloc<CKeyValues3Array, 63>* , const CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:368 */
	void Dump(CKV3ClusterAlloc<CKeyValues3Array, 63>* );
protected:
	/* kv3lib/keyvalues3.cpp:402 */
	CKeyValues3Array* AllocateEntry(CKV3ClusterAlloc<CKeyValues3Array, 63>* );
	CKeyValues3Context * m_pContext; /* 0 8 */
	uint64 m_nAllocatedFlags; /* 8 8 */
	CKeyValues3Array m_Values[63] __attribute__((__aligned__(8))); /* 16 4536 */
	/* kv3lib/keyvalues3.cpp:306 */
	typedef struct CKeyValues3Array ClusteredType;
} __attribute__((__aligned__(8)));

// <0553B66B> kv3lib/keyvalues3.cpp:303
// member functions: 24
// member variables: 3
// class size: 19,672
class CKV3ClusterAlloc<CKeyValues3Table, 63> {
	/* kv3lib/keyvalues3.cpp:346 */
	void CKV3ClusterAlloc(CKV3ClusterAlloc<CKeyValues3Table, 63>* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:309 */
	void ~CKV3ClusterAlloc(CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:311 */
	int Capacity(const CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:312 */
	int AllocationCount(const CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:313 */
	bool IsFull(const CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:314 */
	bool IsEmpty(const CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:425 */
	void Free(CKV3ClusterAlloc<CKeyValues3Table, 63>* , CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:357 */
	CKeyValues3Table* Get(CKV3ClusterAlloc<CKeyValues3Table, 63>* , int);
	/* kv3lib/keyvalues3.cpp:324 */
	CKeyValues3Context* GetParentContext(CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	/* kv3lib/keyvalues3.cpp:387 */
	int GetIndexForEntry(CKV3ClusterAlloc<CKeyValues3Table, 63>* , const CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:368 */
	void Dump(CKV3ClusterAlloc<CKeyValues3Table, 63>* );
protected:
	/* kv3lib/keyvalues3.cpp:402 */
	CKeyValues3Table* AllocateEntry(CKV3ClusterAlloc<CKeyValues3Table, 63>* );
	CKeyValues3Context * m_pContext; /* 0 8 */
	uint64 m_nAllocatedFlags; /* 8 8 */
	CKeyValues3Table m_Values[63] __attribute__((__aligned__(8))); /* 16 19656 */
	/* kv3lib/keyvalues3.cpp:306 */
	typedef struct CKeyValues3Table ClusteredType;
	void CKV3ClusterAlloc(class CKV3ClusterAlloc<CKeyValues3Table, 63> *, class CKeyValues3Context *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EEC4EP18CKeyValues3Context */
	void ~CKV3ClusterAlloc(class CKV3ClusterAlloc<CKeyValues3Table, 63> *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EED4Ev */
	int Capacity(const class CKV3ClusterAlloc<CKeyValues3Table, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI16CKeyValues3TableLi63EE8CapacityEv */
	int AllocationCount(const class CKV3ClusterAlloc<CKeyValues3Table, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI16CKeyValues3TableLi63EE15AllocationCountEv */
	bool IsFull(const class CKV3ClusterAlloc<CKeyValues3Table, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI16CKeyValues3TableLi63EE6IsFullEv */
	bool IsEmpty(const class CKV3ClusterAlloc<CKeyValues3Table, 63>  *); /* linkage=_ZNK16CKV3ClusterAllocI16CKeyValues3TableLi63EE7IsEmptyEv */
	void Free(class CKV3ClusterAlloc<CKeyValues3Table, 63> *, class CKeyValues3Table *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE4FreeEPS0_ */
	class CKeyValues3Table * Get(class CKV3ClusterAlloc<CKeyValues3Table, 63> *, int); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE3GetEi */
	class CKeyValues3Context * GetParentContext(class CKV3ClusterAlloc<CKeyValues3Table, 63> *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE16GetParentContextEv */
	int GetIndexForEntry(class CKV3ClusterAlloc<CKeyValues3Table, 63> *, const class CKeyValues3Table  *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE16GetIndexForEntryEPKS0_ */
	void Dump(class CKV3ClusterAlloc<CKeyValues3Table, 63> *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE4DumpEv */
	class CKeyValues3Table * AllocateEntry(class CKV3ClusterAlloc<CKeyValues3Table, 63> *); /* linkage=_ZN16CKV3ClusterAllocI16CKeyValues3TableLi63EE13AllocateEntryEv */
} __attribute__((__aligned__(8)));

// <05550A33> kv3lib/keyvalues3.cpp:309
void CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <05550A1A> kv3lib/keyvalues3.cpp:309
inline void CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <0555084F> kv3lib/keyvalues3.cpp:309
void CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <05550836> kv3lib/keyvalues3.cpp:309
inline void CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <055507AA> kv3lib/keyvalues3.cpp:309
void CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <05550791> kv3lib/keyvalues3.cpp:309
inline void CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc()
{
} /* size: 0 */

// <0554B1CD> kv3lib/keyvalues3.cpp:311
inline void CKV3ClusterAlloc<KeyValues3, 63>::Capacity()
{
} /* size: 0 */

// <0554B0F2> kv3lib/keyvalues3.cpp:311
inline void CKV3ClusterAlloc<CKeyValues3Array, 63>::Capacity()
{
} /* size: 0 */

// <0554B017> kv3lib/keyvalues3.cpp:311
inline void CKV3ClusterAlloc<CKeyValues3Table, 63>::Capacity()
{
} /* size: 0 */

// <0554B219> kv3lib/keyvalues3.cpp:312
inline void CKV3ClusterAlloc<KeyValues3, 63>::AllocationCount()
{
} /* size: 0 */

// <0554B13E> kv3lib/keyvalues3.cpp:312
inline void CKV3ClusterAlloc<CKeyValues3Array, 63>::AllocationCount()
{
} /* size: 0 */

// <0554B063> kv3lib/keyvalues3.cpp:312
inline void CKV3ClusterAlloc<CKeyValues3Table, 63>::AllocationCount()
{
} /* size: 0 */

// <0554B373> kv3lib/keyvalues3.cpp:313
inline void CKV3ClusterAlloc<KeyValues3, 63>::IsFull()
{
} /* size: 0 */

// <0554B327> kv3lib/keyvalues3.cpp:313
inline void CKV3ClusterAlloc<CKeyValues3Array, 63>::IsFull()
{
} /* size: 0 */

// <0554B2DB> kv3lib/keyvalues3.cpp:313
inline void CKV3ClusterAlloc<CKeyValues3Table, 63>::IsFull()
{
} /* size: 0 */

// <0554D209> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 35829
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <028C4C03> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 54500
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <01229E35> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 16084
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <002A55FA> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 2251
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <0060A7FC> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 28237
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <009E2483> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 34388
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <000EF004> kv3lib/keyvalues3.cpp:324
// variables: 2
inline void CKV3ClusterAlloc<KeyValues3, 63>::GetParentContext()
{
	const char   __FUNCTION__; // 26885
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 324
	}
} /* size: 0, variables: 1 */

// <05550A70> kv3lib/keyvalues3.cpp:346
// function calls: 5
void CKV3ClusterAlloc<KeyValues3, 63>::CKV3ClusterAlloc(CKeyValues3Context* pContext)
{
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 3722
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 3724
	KeyValues3::KeyValues3(
			KeyValues3Type_t nType);  // 347
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 350
} /* size: 105, inline expansions: 5 (61 bytes) */

// <05550A4A> kv3lib/keyvalues3.cpp:346
void CKV3ClusterAlloc<KeyValues3, 63>::CKV3ClusterAlloc(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0555088C> kv3lib/keyvalues3.cpp:346
void CKV3ClusterAlloc<CKeyValues3Array, 63>::CKV3ClusterAlloc(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <055507E7> kv3lib/keyvalues3.cpp:346
void CKV3ClusterAlloc<CKeyValues3Table, 63>::CKV3ClusterAlloc(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0554CB3D> kv3lib/keyvalues3.cpp:357
void CKV3ClusterAlloc<KeyValues3, 63>::Get(int nIndex)
{
} /* size: 0 */

// <055508A8> kv3lib/keyvalues3.cpp:387
// variable: 1
void CKV3ClusterAlloc<KeyValues3, 63>::GetIndexForEntry(const KeyValues3* pEntry)
{
	size_t nIndex; // 392
	{
	}
	{
	}
} /* size: 0, variables: 1 */

// <055509E7> kv3lib/keyvalues3.cpp:402
// variables: 2
void CKV3ClusterAlloc<KeyValues3, 63>::AllocateEntry()
{
	int nIndexOfZeroBit; // 407
	uint64 nMask; // 414
} /* size: 0, variables: 2 */

// <05550803> kv3lib/keyvalues3.cpp:402
// variables: 2
void CKV3ClusterAlloc<CKeyValues3Array, 63>::AllocateEntry()
{
	int nIndexOfZeroBit; // 407
	uint64 nMask; // 414
} /* size: 0, variables: 2 */

// <0555075E> kv3lib/keyvalues3.cpp:402
// variables: 2
void CKV3ClusterAlloc<CKeyValues3Table, 63>::AllocateEntry()
{
	int nIndexOfZeroBit; // 407
	uint64 nMask; // 414
} /* size: 0, variables: 2 */

// <0554B232> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 35515
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <0554B157> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 35515
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <0554B07C> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 35515
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <028C2C2C> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 54186
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <028C2B51> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 54186
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <028C2A76> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 54186
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <01227E5E> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 15770
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <01227D83> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 15770
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <01227CA8> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 15770
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <002A3623> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 1937
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <002A3548> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 1937
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <002A346D> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 1937
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <00608825> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 27923
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <0060874A> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 27923
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <0060866F> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 27923
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <009E04AC> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 34074
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <009E03D1> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 34074
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <009E02F6> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 34074
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <000ED02D> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<KeyValues3, 63>::Free(KeyValues3* pKV3)
{
	const char   __FUNCTION__; // 26571
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <000ECF52> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Array, 63>::Free(CKeyValues3Array* pKV3)
{
	const char   __FUNCTION__; // 26571
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <000ECE77> kv3lib/keyvalues3.cpp:425
// variables: 5
void CKV3ClusterAlloc<CKeyValues3Table, 63>::Free(CKeyValues3Table* pKV3)
{
	const char   __FUNCTION__; // 26571
	bool bInCluster; // 427
	size_t nIndex; // 432
	uint64 nMask; // 434
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 441
	}
} /* size: 0, variables: 4 */

// <0553B1BC> kv3lib/keyvalues3.cpp:449
// member functions: 18
// member variables: 3
// class size: 1,040
class CKeyValues3Cluster : public CKV3ClusterAlloc<KeyValues3, 63> {
public:
	/* class CKV3ClusterAlloc<KeyValues3, 63> <ancestor>; */ /* 0 1024 */
	/* kv3lib/keyvalues3.cpp:452 */
	CKeyValues3Cluster* ClusterFromPointer(const KeyValues3* );
	/* kv3lib/keyvalues3.cpp:454 */
	void CKeyValues3Cluster(CKeyValues3Cluster* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:458 */
	void ~CKeyValues3Cluster(CKeyValues3Cluster* );
	/* kv3lib/keyvalues3.cpp:464 */
	KeyValues3* Allocate(CKeyValues3Cluster* , KeyValues3InternalType_t);
	/* kv3lib/keyvalues3.cpp:466 */
	CKeyValues3Metadata* GetMetadataForKV3(CKeyValues3Cluster* , const KeyValues3* );
	/* kv3lib/keyvalues3.cpp:468 */
	void SetMetadataEnabled(CKeyValues3Cluster* , bool);
	/* kv3lib/keyvalues3.cpp:470 */
	CKeyValues3Cluster* GetNextFreeCluster(CKeyValues3Cluster* );
	/* kv3lib/keyvalues3.cpp:471 */
	void SetNextFreeCluster(CKeyValues3Cluster* , CKeyValues3Cluster* );
	/* kv3lib/keyvalues3.cpp:473 */
	void FreeAllDireclyOwnedMemory(CKeyValues3Cluster* );
private:
	CKeyValues3MetadataCluster * m_pMetadata; /* 1024 8 */
	CKeyValues3Cluster * m_pNextFreeCluster; /* 1032 8 */
	/* <5582459> kv3lib/keyvalues3.cpp:482 */
	class CKeyValues3Cluster * ClusterFromPointer(const class KeyValues3  *); /* linkage=_ZN18CKeyValues3Cluster18ClusterFromPointerEPK10KeyValues3 */
	void CKeyValues3Cluster(class CKeyValues3Cluster *, class CKeyValues3Context *); /* linkage=_ZN18CKeyValues3ClusterC4EP18CKeyValues3Context */
	void ~CKeyValues3Cluster(class CKeyValues3Cluster *); /* linkage=_ZN18CKeyValues3ClusterD4Ev */
	/* <5586497> kv3lib/keyvalues3.cpp:499 */
	class KeyValues3 * Allocate(class CKeyValues3Cluster *, enum KeyValues3InternalType_t); /* linkage=_ZN18CKeyValues3Cluster8AllocateE24KeyValues3InternalType_t */
	/* <55824b8> kv3lib/keyvalues3.cpp:529 */
	class CKeyValues3Metadata * GetMetadataForKV3(class CKeyValues3Cluster *, const class KeyValues3  *); /* linkage=_ZN18CKeyValues3Cluster17GetMetadataForKV3EPK10KeyValues3 */
	/* <55825c7> kv3lib/keyvalues3.cpp:544 */
	void SetMetadataEnabled(class CKeyValues3Cluster *, bool); /* linkage=_ZN18CKeyValues3Cluster18SetMetadataEnabledEb */
	class CKeyValues3Cluster * GetNextFreeCluster(class CKeyValues3Cluster *); /* linkage=_ZN18CKeyValues3Cluster18GetNextFreeClusterEv */
	void SetNextFreeCluster(class CKeyValues3Cluster *, class CKeyValues3Cluster *); /* linkage=_ZN18CKeyValues3Cluster18SetNextFreeClusterEPS_ */
	/* <55885f8> kv3lib/keyvalues3.cpp:515 */
	void FreeAllDireclyOwnedMemory(class CKeyValues3Cluster *); /* linkage=_ZN18CKeyValues3Cluster25FreeAllDireclyOwnedMemoryEv */
};

// <0557C64C> kv3lib/keyvalues3.cpp:454
void CKeyValues3Cluster::CKeyValues3Cluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557C626> kv3lib/keyvalues3.cpp:454
inline void CKeyValues3Cluster::CKeyValues3Cluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557C5A7> kv3lib/keyvalues3.cpp:458
void CKeyValues3Cluster::~CKeyValues3Cluster()
{
} /* size: 0 */

// <0557C58E> kv3lib/keyvalues3.cpp:458
inline void CKeyValues3Cluster::~CKeyValues3Cluster()
{
} /* size: 0 */

// <0557C575> kv3lib/keyvalues3.cpp:470
inline void CKeyValues3Cluster::GetNextFreeCluster()
{
} /* size: 0 */

// <0557C54F> kv3lib/keyvalues3.cpp:471
inline void CKeyValues3Cluster::SetNextFreeCluster(CKeyValues3Cluster* pCluster)
{
} /* size: 0 */

// <05582459> kv3lib/keyvalues3.cpp:482
// variables: 2
void ClusterFromPointer(const KeyValues3* pKV3)
{
	{
		const KeyValues3* pFirstInCluster; // 490
		CKeyValues3Cluster* pCluster; // 491
	}
} /* size: 0 */

// <05586497> kv3lib/keyvalues3.cpp:499
// variables: 2
// function calls: 5
void CKeyValues3Cluster::Allocate(KeyValues3InternalType_t nInternalType)
{
	KeyValues3* pKV3; // 501
	const int  nIndex; // 502
	FindLeastSignificantBit64(uint64 n); // 407
	CKV3ClusterAlloc<KeyValues3, 63>::AllocateEntry(); // 501
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 3750
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 3752
	KeyValues3::KeyValues3(
			CKeyValues3Context* pContext,
			KeyValues3InternalType_t nInternalType,
			uint nClusterIndex);  // 504
} /* size: 0, variables: 2, inline expansions: 5 (0 bytes) */

// <0557C4D4> kv3lib/keyvalues3.cpp:499
// variables: 2
void CKeyValues3Cluster::Allocate(KeyValues3InternalType_t nInternalType)
{
	KeyValues3* pKV3; // 501
	const int  nIndex; // 502
} /* size: 0, variables: 2 */

// <055885F8> kv3lib/keyvalues3.cpp:515
// variables: 2
// function calls: 3
void CKeyValues3Cluster::FreeAllDireclyOwnedMemory()
{
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
} /* size: 0 */

// <0557C49C> kv3lib/keyvalues3.cpp:515
// variables: 2
void CKeyValues3Cluster::FreeAllDireclyOwnedMemory()
{
	{
		int i; // 517
		{
			uint64 nMask; // 519
		}
	}
} /* size: 0 */

// <055824B8> kv3lib/keyvalues3.cpp:529
// variable: 1
// function calls: 3
void CKeyValues3Cluster::GetMetadataForKV3(const KeyValues3* pKV3)
{
	int nIndex; // 531
	{
	}
	{
		_DebuggerBreakInlineExpressionWrapper(void); // 393
	}
	CKV3ClusterAlloc<KeyValues3, 63>::GetIndexForEntry(
			const KeyValues3* pEntry);  // 531
	{
		_DebuggerBreakInlineExpressionWrapper(void); // 532
	}
} /* size: 0, variables: 1, inline expansions: 1 (50 bytes) */

// <0557C3DF> kv3lib/keyvalues3.cpp:529
// variable: 1
void CKeyValues3Cluster::GetMetadataForKV3(const KeyValues3* pKV3)
{
	int nIndex; // 531
	{
	}
} /* size: 0, variables: 1 */

// <055825C7> kv3lib/keyvalues3.cpp:544
// function calls: 12
void CKeyValues3Cluster::SetMetadataEnabled(bool bMetadata)
{
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 555
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 274
	CUtlSymbolLarge::CUtlSymbolLarge(
			UtlSymLargeId_t id);  // 274
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 274
	CKeyValues3Metadata::CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::CKeyValues3MetadataCluster(); // 551
	CKeyValues3Cluster::SetMetadataEnabled(
				bool bMetadata);  // 544
} /* size: 255, inline expansions: 12 (410 bytes) */

// <0557C34E> kv3lib/keyvalues3.cpp:544
void CKeyValues3Cluster::SetMetadataEnabled(bool bMetadata)
{
} /* size: 0 */

// <0555039F> kv3lib/keyvalues3.cpp:563
void CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster()
{
} /* size: 0 */

// <05550382> kv3lib/keyvalues3.cpp:563
inline void CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster()
{
} /* size: 0 */

// <0553B574> kv3lib/keyvalues3.cpp:563
// member functions: 12
// member variables: 2
// class size: 4,560
class CKeyValues3ArrayCluster : public CKV3ClusterAlloc<CKeyValues3Array, 63> {
public:
	/* class CKV3ClusterAlloc<CKeyValues3Array, 63> <ancestor>; */ /* 0 4552 */
	/* kv3lib/keyvalues3.cpp:566 */
	CKeyValues3ArrayCluster* ClusterFromPointer(const CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:568 */
	void CKeyValues3ArrayCluster(CKeyValues3ArrayCluster* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:572 */
	CKeyValues3Array* Allocate(CKeyValues3ArrayCluster* );
	/* kv3lib/keyvalues3.cpp:574 */
	CKeyValues3ArrayCluster* GetNextFreeCluster(CKeyValues3ArrayCluster* );
	/* kv3lib/keyvalues3.cpp:575 */
	void SetNextFreeCluster(CKeyValues3ArrayCluster* , CKeyValues3ArrayCluster* );
private:
	CKeyValues3ArrayCluster * m_pNextFreeCluster; /* 4552 8 */
	void ~CKeyValues3ArrayCluster(CKeyValues3ArrayCluster* );
	/* <5582861> kv3lib/keyvalues3.cpp:583 */
	class CKeyValues3ArrayCluster * ClusterFromPointer(const class CKeyValues3Array  *); /* linkage=_ZN23CKeyValues3ArrayCluster18ClusterFromPointerEPK16CKeyValues3Array */
	void CKeyValues3ArrayCluster(class CKeyValues3ArrayCluster *, class CKeyValues3Context *); /* linkage=_ZN23CKeyValues3ArrayClusterC4EP18CKeyValues3Context */
	class CKeyValues3Array * Allocate(class CKeyValues3ArrayCluster *); /* linkage=_ZN23CKeyValues3ArrayCluster8AllocateEv */
	class CKeyValues3ArrayCluster * GetNextFreeCluster(class CKeyValues3ArrayCluster *); /* linkage=_ZN23CKeyValues3ArrayCluster18GetNextFreeClusterEv */
	void SetNextFreeCluster(class CKeyValues3ArrayCluster *, class CKeyValues3ArrayCluster *); /* linkage=_ZN23CKeyValues3ArrayCluster18SetNextFreeClusterEPS_ */
	void ~CKeyValues3ArrayCluster(class CKeyValues3ArrayCluster *); /* linkage=_ZN23CKeyValues3ArrayClusterD4Ev */
} __attribute__((__aligned__(8)));

// <0557C332> kv3lib/keyvalues3.cpp:568
void CKeyValues3ArrayCluster::CKeyValues3ArrayCluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557C30C> kv3lib/keyvalues3.cpp:568
inline void CKeyValues3ArrayCluster::CKeyValues3ArrayCluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557C2F3> kv3lib/keyvalues3.cpp:574
inline void CKeyValues3ArrayCluster::GetNextFreeCluster()
{
} /* size: 0 */

// <0557C2CD> kv3lib/keyvalues3.cpp:575
inline void CKeyValues3ArrayCluster::SetNextFreeCluster(CKeyValues3ArrayCluster* pCluster)
{
} /* size: 0 */

// <05582861> kv3lib/keyvalues3.cpp:583
// variables: 2
void ClusterFromPointer(const CKeyValues3Array* pArray)
{
	{
		const CKeyValues3Array* pFirstInCluster; // 591
		CKeyValues3ArrayCluster* pCluster; // 592
	}
} /* size: 0 */

// <0557BF4F> kv3lib/keyvalues3.cpp:600
// variables: 2
// function calls: 13
void CKeyValues3ArrayCluster::Allocate()
{
	CKeyValues3Array* pArray; // 602
	const int  nIndex; // 603
	FindLeastSignificantBit64(uint64 n); // 407
	CKV3ClusterAlloc<CKeyValues3Array, 63>::AllocateEntry(); // 602
	{
	}
	AlignedByteArrayExplicit_t<4, KeyValues3::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<4, KeyValues3::AlignedByteArray_t(); // 228
	CUtlMemory<KeyValues3::CUtlMemory(
			KeyValues3** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<KeyValues3::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<KeyValues3::CUtlMemoryFixedGrowable_Base(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<4, KeyValues3::Base(); // 231
	CUtlMemoryFixedGrowable<KeyValues3::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<KeyValues3::CUtlVectorFixedGrowable(
				int growSize);  // 154
	CKeyValues3Array::CKeyValues3Array(
			int32 nClusterIndex);  // 605
} /* size: 0, variables: 2, inline expansions: 13 (368 bytes) */

// <05550345> kv3lib/keyvalues3.cpp:616
void CKeyValues3TableCluster::~CKeyValues3TableCluster()
{
} /* size: 0 */

// <05550328> kv3lib/keyvalues3.cpp:616
inline void CKeyValues3TableCluster::~CKeyValues3TableCluster()
{
} /* size: 0 */

// <0553B89D> kv3lib/keyvalues3.cpp:616
// member functions: 12
// member variables: 2
// class size: 19,680
class CKeyValues3TableCluster : public CKV3ClusterAlloc<CKeyValues3Table, 63> {
public:
	/* class CKV3ClusterAlloc<CKeyValues3Table, 63> <ancestor>; */ /* 0 19672 */
	/* kv3lib/keyvalues3.cpp:619 */
	CKeyValues3TableCluster* ClusterFromPointer(const CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:621 */
	void CKeyValues3TableCluster(CKeyValues3TableCluster* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:625 */
	CKeyValues3Table* Allocate(CKeyValues3TableCluster* );
	/* kv3lib/keyvalues3.cpp:627 */
	CKeyValues3TableCluster* GetNextFreeCluster(CKeyValues3TableCluster* );
	/* kv3lib/keyvalues3.cpp:628 */
	void SetNextFreeCluster(CKeyValues3TableCluster* , CKeyValues3TableCluster* );
private:
	CKeyValues3TableCluster * m_pNextFreeCluster; /* 19672 8 */
	void ~CKeyValues3TableCluster(CKeyValues3TableCluster* );
	/* <5582aa4> kv3lib/keyvalues3.cpp:636 */
	class CKeyValues3TableCluster * ClusterFromPointer(const class CKeyValues3Table  *); /* linkage=_ZN23CKeyValues3TableCluster18ClusterFromPointerEPK16CKeyValues3Table */
	void CKeyValues3TableCluster(class CKeyValues3TableCluster *, class CKeyValues3Context *); /* linkage=_ZN23CKeyValues3TableClusterC4EP18CKeyValues3Context */
	/* <5583ffb> kv3lib/keyvalues3.cpp:653 */
	class CKeyValues3Table * Allocate(class CKeyValues3TableCluster *); /* linkage=_ZN23CKeyValues3TableCluster8AllocateEv */
	class CKeyValues3TableCluster * GetNextFreeCluster(class CKeyValues3TableCluster *); /* linkage=_ZN23CKeyValues3TableCluster18GetNextFreeClusterEv */
	void SetNextFreeCluster(class CKeyValues3TableCluster *, class CKeyValues3TableCluster *); /* linkage=_ZN23CKeyValues3TableCluster18SetNextFreeClusterEPS_ */
	void ~CKeyValues3TableCluster(class CKeyValues3TableCluster *); /* linkage=_ZN23CKeyValues3TableClusterD4Ev */
} __attribute__((__aligned__(8)));

// <0557BF33> kv3lib/keyvalues3.cpp:621
void CKeyValues3TableCluster::CKeyValues3TableCluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557BF0D> kv3lib/keyvalues3.cpp:621
inline void CKeyValues3TableCluster::CKeyValues3TableCluster(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <0557BEF4> kv3lib/keyvalues3.cpp:627
inline void CKeyValues3TableCluster::GetNextFreeCluster()
{
} /* size: 0 */

// <0557BECE> kv3lib/keyvalues3.cpp:628
inline void CKeyValues3TableCluster::SetNextFreeCluster(CKeyValues3TableCluster* pCluster)
{
} /* size: 0 */

// <05582AA4> kv3lib/keyvalues3.cpp:636
// variables: 2
void ClusterFromPointer(const CKeyValues3Table* pTable)
{
	{
		const CKeyValues3Table* pFirstInCluster; // 644
		CKeyValues3TableCluster* pCluster; // 645
	}
} /* size: 0 */

// <05583FFB> kv3lib/keyvalues3.cpp:653
// variables: 2
// function calls: 2
void CKeyValues3TableCluster::Allocate()
{
	CKeyValues3Table* pTable; // 655
	const int  nIndex; // 656
	FindLeastSignificantBit64(uint64 n); // 407
	CKV3ClusterAlloc<CKeyValues3Table, 63>::AllocateEntry(); // 655
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <0557BE60> kv3lib/keyvalues3.cpp:653
// variables: 2
void CKeyValues3TableCluster::Allocate()
{
	CKeyValues3Table* pTable; // 655
	const int  nIndex; // 656
} /* size: 0, variables: 2 */

// <0552D6B1> kv3lib/keyvalues3.cpp:669
// member functions: 17
// member variables: 12
// struct size: 1,528
struct CKeyValues3ContextImpl {
	/* kv3lib/keyvalues3.cpp:671 */
	void CKeyValues3ContextImpl(CKeyValues3ContextImpl* , CKeyValues3Context* );
	/* kv3lib/keyvalues3.cpp:672 */
	void ~CKeyValues3ContextImpl(CKeyValues3ContextImpl* );
	/* kv3lib/keyvalues3.cpp:674 */
	KeyValues3* AllocKV_Internal(CKeyValues3ContextImpl* , KeyValues3Type_t);
	/* kv3lib/keyvalues3.cpp:675 */
	void FreeKV_Internal(CKeyValues3ContextImpl* , KeyValues3* );
	/* kv3lib/keyvalues3.cpp:677 */
	CKeyValues3Array* AllocArray_Internal(CKeyValues3ContextImpl* );
	/* kv3lib/keyvalues3.cpp:678 */
	void FreeArray_Internal(CKeyValues3ContextImpl* , CKeyValues3Array* );
	/* kv3lib/keyvalues3.cpp:680 */
	CKeyValues3Table* AllocTable_Internal(CKeyValues3ContextImpl* );
	/* kv3lib/keyvalues3.cpp:681 */
	void FreeTable_Internal(CKeyValues3ContextImpl* , CKeyValues3Table* );
	/* kv3lib/keyvalues3.cpp:689 */
	void InitNewCluster(CKeyValues3ContextImpl* , CKeyValues3Cluster* );
	/* kv3lib/keyvalues3.cpp:690 */
	void InitNewCluster(CKeyValues3ContextImpl* , CKeyValues3TableCluster* );
	/* kv3lib/keyvalues3.cpp:691 */
	void InitNewCluster(CKeyValues3ContextImpl* , CKeyValues3ArrayCluster* );
	const class CKeyValues3Context * m_pOwner; /* 0 8 */
	CUtlBuffer m_LongTermScratchBuffer; /* 8 80 */
	CKeyValues3Cluster m_EmbeddedCluster; /* 88 1040 */
	CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8> m_AdditionalKVClusters __attribute__((__aligned__(8))); /* 1128 96 */
	CKeyValues3Cluster * m_pFreeKVClusterList; /* 1224 8 */
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster*, 4> m_ArrayClusters __attribute__((__aligned__(8))); /* 1232 64 */
	CKeyValues3ArrayCluster * m_pFreeArrayClusterList; /* 1296 8 */
	CUtlVectorFixedGrowable<CKeyValues3TableCluster*, 4> m_TableClusters __attribute__((__aligned__(8))); /* 1304 64 */
	CKeyValues3TableCluster * m_pFreeTableClusterList; /* 1368 8 */
	CUtlSymbolTableLarge m_Symbols; /* 1376 144 */
	bool m_bMetadataEnabled:1; /* 1520: 0 1 */
	bool m_bWasUpconverted:1; /* 1520: 1 1 */
	/* kv3lib/keyvalues3.cpp:4100 */
	void FreeToCluster<CKeyValues3TableCluster, CUtlMemoryFixedGrowable<CKeyValues3TableCluster*, 4, int> >(CKeyValues3ContextImpl* , ClusteredType* , CKeyValues3TableCluster* , CUtlVectorBase<CKeyValues3TableCluster*, CUtlMemoryFixedGrowable<CKeyValues3TableCluster*, 4, int> >& , CKeyValues3TableCluster* & );
	/* kv3lib/keyvalues3.cpp:4100 */
	void FreeToCluster<CKeyValues3ArrayCluster, CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster*, 4, int> >(CKeyValues3ContextImpl* , ClusteredType* , CKeyValues3ArrayCluster* , CUtlVectorBase<CKeyValues3ArrayCluster*, CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster*, 4, int> >& , CKeyValues3ArrayCluster* & );
	/* kv3lib/keyvalues3.cpp:4100 */
	void FreeToCluster<CKeyValues3Cluster, CUtlMemoryFixedGrowable<CKeyValues3Cluster*, 8, int> >(CKeyValues3ContextImpl* , ClusteredType* , CKeyValues3Cluster* , CUtlVectorBase<CKeyValues3Cluster*, CUtlMemoryFixedGrowable<CKeyValues3Cluster*, 8, int> >& , CKeyValues3Cluster* & );
	/* kv3lib/keyvalues3.cpp:4024 */
	ClusteredType* AllocateFromCluster<CKeyValues3TableCluster, CUtlMemoryFixedGrowable<CKeyValues3TableCluster*, 4, int> >(CKeyValues3ContextImpl* , CKeyValues3TableCluster* & , CUtlVectorBase<CKeyValues3TableCluster*, CUtlMemoryFixedGrowable<CKeyValues3TableCluster*, 4, int> >& );
	/* kv3lib/keyvalues3.cpp:4024 */
	ClusteredType* AllocateFromCluster<CKeyValues3ArrayCluster, CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster*, 4, int> >(CKeyValues3ContextImpl* , CKeyValues3ArrayCluster* & , CUtlVectorBase<CKeyValues3ArrayCluster*, CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster*, 4, int> >& );
	/* kv3lib/keyvalues3.cpp:4024 */
	ClusteredType* AllocateFromCluster<CKeyValues3Cluster, CUtlMemoryFixedGrowable<CKeyValues3Cluster*, 8, int>, KeyValues3InternalType_t>(CKeyValues3ContextImpl* , CKeyValues3Cluster* & , CUtlVectorBase<CKeyValues3Cluster*, CUtlMemoryFixedGrowable<CKeyValues3Cluster*, 8, int> >& , KeyValues3InternalType_t& );
} __attribute__((__aligned__(8)));

// <0557B13E> kv3lib/keyvalues3.cpp:716
// function calls: 49
void CKeyValues3ContextImpl::CKeyValues3ContextImpl(CKeyValues3Context* pContext)
{
	CKeyValues3Cluster::CKeyValues3Cluster(
				CKeyValues3Context* pContext);  // 717
	CUtlMemory<CKeyValues3Cluster::CUtlMemory(
			CKeyValues3Cluster** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CKeyValues3Cluster::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::CUtlMemoryFixedGrowable_Base(
					CKeyValues3Cluster** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	{
	}
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<8, CKeyValues3Cluster::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 231
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 530
	CUtlVectorBase<CKeyValues3Cluster::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CKeyValues3Cluster::CUtlVectorFixedGrowable(
				int growSize);  // 718
	{
	}
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<4, CKeyValues3ArrayCluster::AlignedByteArray_t(); // 228
	CUtlMemory<CKeyValues3ArrayCluster::CUtlMemory(
			CKeyValues3ArrayCluster** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CKeyValues3ArrayCluster::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::CUtlMemoryFixedGrowable_Base(
					CKeyValues3ArrayCluster** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 231
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 530
	CUtlVectorBase<CKeyValues3ArrayCluster::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::CUtlVectorFixedGrowable(
				int growSize);  // 718
	{
	}
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<4, CKeyValues3TableCluster::AlignedByteArray_t(); // 228
	CUtlMemory<CKeyValues3TableCluster::CUtlMemory(
			CKeyValues3TableCluster** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CKeyValues3TableCluster::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::CUtlMemoryFixedGrowable_Base(
					CKeyValues3TableCluster** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 231
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 530
	CUtlVectorBase<CKeyValues3TableCluster::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::CUtlVectorFixedGrowable(
				int growSize);  // 718
	{
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::ValidateGrowSize(); // 475
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 178
		Eq_t::Eq_t(); // 178
		Hash_t::Hash_t(); // 178
		Init(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 178
		CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this,
				int minimumSize);  // 49
		CUtlMemory<unsigned int, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 472
		CUtlMemory<unsigned int, int>::ValidateGrowSize(); // 475
		CUtlMemory<unsigned int, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 530
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 419
		CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVector(
				int growSize,
				int initCapacity);  // 49
		CThreadNullMutex::CThreadNullMutex(
				const char* pName);  // 48
		GetEqualRef(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 52
		Eq_t::SetSymbolTable(
				CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>* pTable);  // 52
		GetHashRef(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 53
		Hash_t::SetSymbolTable(
				CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>* pTable);  // 53
	}
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::CUtlSymbolTableLargeBase(
				int growSize,
				int initSize,
				bool caseInsensitive);  // 718
} /* size: 506, inline expansions: 32 (1051 bytes) */

// <0557B115> kv3lib/keyvalues3.cpp:716
void CKeyValues3ContextImpl::CKeyValues3ContextImpl(CKeyValues3Context* pContext)
{
} /* size: 0 */

// <055790E5> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 10459
		iterator __for_begin; // 10469
		iterator __for_end; // 10479
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 10459
		iterator __for_begin; // 10469
		iterator __for_end; // 10479
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 1842, inline expansions: 105 (5370 bytes) */

// <05579096> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 10491
		iterator __for_begin; // 23926
		iterator __for_end; // 23926
	}
} /* size: 0 */

// <028F0ADF> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 29130
		iterator __for_begin; // 29140
		iterator __for_end; // 29150
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 29130
		iterator __for_begin; // 29140
		iterator __for_end; // 29150
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 1842, inline expansions: 105 (5370 bytes) */

// <028F0A90> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 29162
		iterator __for_begin; // 42597
		iterator __for_end; // 42597
	}
} /* size: 0 */

// <01255D11> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 56250
		iterator __for_begin; // 56260
		iterator __for_end; // 56270
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 56250
		iterator __for_begin; // 56260
		iterator __for_end; // 56270
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 1842, inline expansions: 105 (5370 bytes) */

// <01255CC2> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 56282
		iterator __for_begin; // 4181
		iterator __for_end; // 4181
	}
} /* size: 0 */

// <002D1487> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 42449
		iterator __for_begin; // 55884
		iterator __for_end; // 55884
	}
} /* size: 0 */

// <006366D8> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 2867
		iterator __for_begin; // 2877
		iterator __for_end; // 2887
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 2867
		iterator __for_begin; // 2877
		iterator __for_end; // 2887
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 1842, inline expansions: 105 (5370 bytes) */

// <00636689> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 2899
		iterator __for_begin; // 16334
		iterator __for_end; // 16334
	}
} /* size: 0 */

// <00A0E35F> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 9018
		iterator __for_begin; // 9028
		iterator __for_end; // 9038
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 9018
		iterator __for_begin; // 9028
		iterator __for_end; // 9038
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 1842, inline expansions: 105 (5370 bytes) */

// <00A0E310> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 9050
		iterator __for_begin; // 22485
		iterator __for_end; // 22485
	}
} /* size: 0 */

// <0011AEE0> kv3lib/keyvalues3.cpp:726
// variables: 16
// function calls: 157
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 1515
		iterator __for_begin; // 1525
		iterator __for_end; // 1535
	}
	{
		int i; // 517
		{
			uint64 nMask; // 519
			KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
			KeyValues3::Internal_SetType(
					KeyValues3InternalType_t nType);  // 3887
			KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
		}
	}
	CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 728
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 1515
		iterator __for_begin; // 1525
		iterator __for_end; // 1535
		CUtlMemory<CKeyValues3Cluster::Base(); // 112
		CUtlVectorBase<CKeyValues3Cluster::Base(); // 102
		CUtlVectorBase<CKeyValues3Cluster::begin(); // 730
		CUtlVectorBase<CKeyValues3Cluster::Count(); // 104
		CUtlVectorBase<CKeyValues3Cluster::end(); // 730
		{
			int i; // 517
			{
				uint64 nMask; // 519
				KeyValues3::Internal_ClearDataWithoutFreeing(); // 3886
				KeyValues3::Internal_SetType(
						KeyValues3InternalType_t nType);  // 3887
				KeyValues3::Internal_SetToNullAndFreeDirectlyOwnedMemory(); // 522
			}
		}
		CKeyValues3Cluster::FreeAllDireclyOwnedMemory(); // 732
		CBufferString::~CBufferString(); // 274
		CBufferString::~CBufferString(); // 274
		CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
		CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
		KeyValues3::~KeyValues3(); // 309
		CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
		CKeyValues3Cluster::~CKeyValues3Cluster(); // 733
	}
	{
		int i; // 1807
		CUtlMemory<CKeyValues3ArrayCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3ArrayCluster::Element(
			int i);  // 1809
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 577
		CUtlMemory<KeyValues3::ConvertToExternalMemory(
					KeyValues3** pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<KeyValues3::Purge_FixedGrowable(
					KeyValues3** pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<KeyValues3::Purge(
			int numElements);  // 1799
		CUtlMemory<KeyValues3::Base(); // 112
		CUtlVectorBase<KeyValues3::Base(); // 368
		CUtlVectorBase<KeyValues3::ResetDbgInfo(); // 1800
		CUtlVectorBase<KeyValues3::RemoveAll(); // 1798
		CUtlVectorBase<KeyValues3::Purge(); // 560
		CUtlMemory<KeyValues3::IsExternallyAllocated(); // 905
		CUtlMemory<KeyValues3::Purge(); // 903
		CUtlMemory<KeyValues3::Purge(); // 510
		ValidateAlignment<KeyValues3*>(void); // 508
		CUtlMemory<KeyValues3::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<KeyValues3::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<KeyValues3::~CUtlMemoryFixedGrowable(); // 562
		CUtlVectorBase<KeyValues3::~CUtlVectorBase(); // 478
		CUtlVectorFixedGrowable<KeyValues3::~CUtlVectorFixedGrowable(); // 155
		CKeyValues3Array::~CKeyValues3Array(); // 309
		CKV3ClusterAlloc<CKeyValues3Array, 63>::~CKV3ClusterAlloc(); // 563
		CKeyValues3ArrayCluster::~CKeyValues3ArrayCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3ArrayCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3ArrayCluster::PurgeAndDeleteElements(); // 736
	{
		int i; // 1807
		CUtlMemory<CKeyValues3TableCluster::operator[](
				int i);  // 602
		CUtlVectorBase<CKeyValues3TableCluster::Element(
			int i);  // 1809
		CKV3ClusterAlloc<CKeyValues3Table, 63>::~CKV3ClusterAlloc(); // 616
		CKeyValues3TableCluster::~CKeyValues3TableCluster(); // 1809
	}
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<4, CKeyValues3TableCluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 1811
	CUtlVectorBase<CKeyValues3TableCluster::PurgeAndDeleteElements(); // 737
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 55
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<unsigned int, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<unsigned int, empty_t>::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<unsigned int, empty_t> >(CUtlKeyValuePair<unsigned int, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 188
	ValidateAlignment<CUtlHashtableEntry<unsigned int, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<unsigned int, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<unsigned int, empty_t, CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::Hash_t, CUtlSymbolTab this); // 55
	CUtlSymbolTableLargeBase<false, 2048, CThreadNullMutex>::~CUtlSymbolTableLargeBase(); // 738
	CUtlVectorBase<CKeyValues3TableCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3TableCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3TableCluster::ConvertToExternalMemory(
				CKeyValues3TableCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::Purge_FixedGrowable(
				CKeyValues3TableCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3TableCluster::Base(); // 112
	CUtlVectorBase<CKeyValues3TableCluster::Base(); // 368
	CUtlVectorBase<CKeyValues3TableCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3TableCluster::Purge(); // 560
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 903
	CUtlMemory<CKeyValues3TableCluster::Purge(); // 510
	ValidateAlignment<CKeyValues3TableCluster*>(void); // 508
	CUtlMemory<CKeyValues3TableCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3TableCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3TableCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3TableCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3ArrayCluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3ArrayCluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3ArrayCluster::ConvertToExternalMemory(
				CKeyValues3ArrayCluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::Purge_FixedGrowable(
				CKeyValues3ArrayCluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::Purge(
		int numElements);  // 1799
	CUtlVectorBase<CKeyValues3ArrayCluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3ArrayCluster::Purge(); // 560
	ValidateAlignment<CKeyValues3ArrayCluster*>(void); // 508
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 903
	CUtlMemory<CKeyValues3ArrayCluster::Purge(); // 510
	CUtlMemory<CKeyValues3ArrayCluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3ArrayCluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3ArrayCluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3ArrayCluster::~CUtlVectorFixedGrowable(); // 738
	CUtlVectorBase<CKeyValues3Cluster::RemoveAll(); // 1798
	CUtlMemory<CKeyValues3Cluster::IsExternallyAllocated(); // 577
	CUtlMemory<CKeyValues3Cluster::ConvertToExternalMemory(
				CKeyValues3Cluster** pMemory,
				int numElements,
				int nCopyElements,
				bool bSetGrowable,
				uint32 nGrowable_GrowSize);  // 207
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 203
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::Purge_FixedGrowable(
				CKeyValues3Cluster** pFixedMemory,
				int nFixedElements,
				int nPurgeToCount);  // 237
	AlignedByteArrayExplicit_t<8, CKeyValues3Cluster::Base(); // 237
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::Purge(
		int numElements);  // 1799
	CUtlMemory<CKeyValues3Cluster::Base(); // 112
	CUtlVectorBase<CKeyValues3Cluster::Base(); // 368
	CUtlVectorBase<CKeyValues3Cluster::ResetDbgInfo(); // 1800
	CUtlVectorBase<CKeyValues3Cluster::Purge(); // 560
	CUtlMemory<CKeyValues3Cluster::Purge(); // 903
	CUtlMemory<CKeyValues3Cluster::Purge(); // 510
	ValidateAlignment<CKeyValues3Cluster*>(void); // 508
	CUtlMemory<CKeyValues3Cluster::~CUtlMemory(); // 191
	CUtlMemoryFixedGrowable_Base<CKeyValues3Cluster::~CUtlMemoryFixedGrowable_Base(); // 223
	CUtlMemoryFixedGrowable<CKeyValues3Cluster::~CUtlMemoryFixedGrowable(); // 562
	CUtlVectorBase<CKeyValues3Cluster::~CUtlVectorBase(); // 478
	CUtlVectorFixedGrowable<CKeyValues3Cluster::~CUtlVectorFixedGrowable(); // 738
	CBufferString::~CBufferString(); // 274
	CBufferString::~CBufferString(); // 274
	CKeyValues3Metadata::~CKeyValues3Metadata(); // 286
	CKeyValues3MetadataCluster::~CKeyValues3MetadataCluster(); // 460
	KeyValues3::~KeyValues3(); // 309
	CKV3ClusterAlloc<KeyValues3, 63>::~CKV3ClusterAlloc(); // 462
	CKeyValues3Cluster::~CKeyValues3Cluster(); // 738
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 738
} /* size: 0, inline expansions: 105 (0 bytes) */

// <0011AE91> kv3lib/keyvalues3.cpp:726
// variables: 4
void CKeyValues3ContextImpl::~CKeyValues3ContextImpl()
{
	{
		CKeyValues3Cluster* pCluster; // 730
		CUtlVectorFixedGrowable<CKeyValues3Cluster*, 8>& __for_range; // 1547
		iterator __for_begin; // 14982
		iterator __for_end; // 14982
	}
} /* size: 0 */

// <05578E0B> kv3lib/keyvalues3.cpp:750
// function calls: 10
void CKeyValues3Iterator::CKeyValues3Iterator()
{
	CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::CUtlMemory(
			StackEntry_t* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::CUtlMemoryFixedGrowable_Base(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	{
	}
	AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<4, CKeyValues3Iterator::StackEntry_t>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 231
	CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 530
	CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::CUtlVectorFixedGrowable(
				int growSize);  // 750
} /* size: 0, inline expansions: 10 (0 bytes) */

// <05578DEE> kv3lib/keyvalues3.cpp:750
void CKeyValues3Iterator::CKeyValues3Iterator()
{
} /* size: 0 */

// <05578968> kv3lib/keyvalues3.cpp:757
// variable: 1
// function calls: 19
void CKeyValues3Iterator::CKeyValues3Iterator(KeyValues3* pKV3)
{
	CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::CUtlMemory(
			StackEntry_t* pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::CUtlMemoryFixedGrowable_Base(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	{
	}
	AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<4, CKeyValues3Iterator::StackEntry_t>::AlignedByteArray_t(); // 228
	AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 231
	CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 530
	CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::CUtlVectorFixedGrowable(
				int growSize);  // 757
	RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 767
	{
		StackEntry_t& e; // 770
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
		GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
				int num);  // 1145
		AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 770
	}
	CKeyValues3Iterator::Init(
		KeyValues3* pKV3);  // 765
	CKeyValues3Iterator::Init(
		KeyValues3* pKV3);  // 759
} /* size: 197, inline expansions: 13 (416 bytes) */

// <0557893E> kv3lib/keyvalues3.cpp:757
void CKeyValues3Iterator::CKeyValues3Iterator(KeyValues3* pKV3)
{
} /* size: 0 */

// <055892C2> kv3lib/keyvalues3.cpp:765
// variable: 1
// function calls: 10
void CKeyValues3Iterator::Init(KeyValues3* pKV3)
{
	RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 767
	{
		StackEntry_t& e; // 770
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
		GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
				int num);  // 1145
		AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 770
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
				int i);  // 770
	}
	CKeyValues3Iterator::Init(
		KeyValues3* pKV3);  // 765
} /* size: 0, inline expansions: 2 (0 bytes) */

// <05578907> kv3lib/keyvalues3.cpp:765
// variable: 1
void CKeyValues3Iterator::Init(KeyValues3* pKV3)
{
	{
		StackEntry_t& e; // 770
	}
} /* size: 0 */

// <05582B03> kv3lib/keyvalues3.cpp:779
// function call: 1
void CKeyValues3Iterator::IsValid()
{
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
} /* size: 13, inline expansions: 1 (0 bytes) */

// <055788EA> kv3lib/keyvalues3.cpp:779
void CKeyValues3Iterator::IsValid()
{
} /* size: 0 */

// <05577E80> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 35591
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <028EF87A> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 54262
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <01254AAC> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 15846
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <002D0271> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 2013
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <00635473> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 27999
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <00A0D0FA> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 34150
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <00119C7B> kv3lib/keyvalues3.cpp:787
// variables: 9
// function calls: 48
void CKeyValues3Iterator::Advance()
{
	const char   __FUNCTION__; // 26647
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 789
	}
	{
		StackEntry_t& e; // 799
		KeyValues3* pCurrent; // 800
		{
			int nIndex; // 809
			StackEntry_t& e2; // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 810
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 810
		}
		{
			int nIndex; // 829
			StackEntry_t& e2; // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::NumAllocated(); // 1143
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
			Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
			ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 824
			GrowMemory(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 1145
			AddToTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 830
			CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int i);  // 830
			KeyValues3::Internal_Type(); // 90
			KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
			KeyValues3::GetType(); // 2554
			KeyValues3::GetTable(); // 2557
			CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
			CKeyValues3Table::Count(); // 2558
			CUtlMemory<KeyValues3::operator[](
					int i);  // 588
			CUtlVectorBase<KeyValues3::operator[](
					int i);  // 3345
			CKeyValues3Table::MemberData(
					int nIndex);  // 2561
			KeyValues3::GetMember(
					int nIndex);  // 832
		}
		{
			int i; // 1696
		}
		RemoveMultipleFromTail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this,
					int num);  // 838
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 2543
		KeyValues3::GetTable(); // 2546
		CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 210
		CKeyValues3Table::Count(); // 2546
		KeyValues3::GetMemberCount(); // 826
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 801
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1200
		CUtlVectorBase<KeyValues3::Count(); // 164
		CKeyValues3Array::GetElementCount(); // 1208
		KeyValues3::GetArrayElementCount(); // 806
		Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 793
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
				int i);  // 630
		Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 799
	}
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 781
	CKeyValues3Iterator::IsValid(); // 789
} /* size: 0, variables: 1, inline expansions: 2 (6 bytes) */

// <05577DB4> kv3lib/keyvalues3.cpp:852
// function calls: 3
void CKeyValues3Iterator::Get()
{
	Count(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 854
	CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::operator[](
			int i);  // 637
	Tail(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, this); // 857
} /* size: 35, inline expansions: 3 (10 bytes) */

// <05582B5D> kv3lib/keyvalues3.cpp:863
// function calls: 3
void KeyValues3::GetTable()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 865
} /* size: 0, inline expansions: 3 (0 bytes) */

// <05577D97> kv3lib/keyvalues3.cpp:863
void KeyValues3::GetTable()
{
} /* size: 0 */

// <05588367> kv3lib/keyvalues3.cpp:893
// function calls: 3
void KeyValues3::SetToEmptyTable()
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 903
	KeyValues3::ReserveTableCapacity(
				uint nTableSize);  // 895
} /* size: 60, inline expansions: 3 (104 bytes) */

// <05577D5D> kv3lib/keyvalues3.cpp:893
void KeyValues3::SetToEmptyTable()
{
} /* size: 0 */

// <05588269> kv3lib/keyvalues3.cpp:901
// function calls: 2
void KeyValues3::ReserveTableCapacity(uint nTableSize)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 903
} /* size: 87, inline expansions: 2 (66 bytes) */

// <05577D33> kv3lib/keyvalues3.cpp:901
void KeyValues3::ReserveTableCapacity(uint nTableSize)
{
} /* size: 0 */

// <05577787> kv3lib/keyvalues3.cpp:910
// variable: 1
// function calls: 22
void KeyValues3::GetMemberInt(CKV3MemberName memberName, int defaultValue)
{
	const KeyValues3* pMember; // 912
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 912
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 912
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	{
	}
	KV3Helper_StringToNumber<int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<int>(); // 694
	KeyValues3::GetValueAsNumeric<int>(); // 184
	KeyValues3::GetValueInt(); // 916
} /* size: 0, variables: 1, inline expansions: 22 (997 bytes) */

// <055771B5> kv3lib/keyvalues3.cpp:922
// variable: 1
// function calls: 23
void KeyValues3::GetMemberBool(CKV3MemberName memberName, bool defaultValue)
{
	const KeyValues3* pMember; // 924
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 924
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 924
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1333
	{
	}
	KV3Helper_StringToNumber<int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<int>(); // 694
	KeyValues3::GetValueAsNumeric<int>(); // 1335
	KeyValues3::GetValueBool(); // 1331
	KeyValues3::GetValueBool(); // 928
} /* size: 0, variables: 1, inline expansions: 23 (1021 bytes) */

// <05576C20> kv3lib/keyvalues3.cpp:934
// variable: 1
// function calls: 22
void KeyValues3::GetMemberUint64(CKV3MemberName memberName, uint64 defaultValue)
{
	const KeyValues3* pMember; // 936
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 936
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 936
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	{
	}
	KV3Helper_StringToNumber<long long unsigned int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 694
	KeyValues3::GetValueAsNumeric<long long unsigned int>(); // 194
	KeyValues3::GetValueUint64(); // 940
} /* size: 0, variables: 1, inline expansions: 22 (0 bytes) */

// <0557668B> kv3lib/keyvalues3.cpp:946
// variable: 1
// function calls: 22
void KeyValues3::GetMemberInt64(CKV3MemberName memberName, int64 defaultValue)
{
	const KeyValues3* pMember; // 948
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 948
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 948
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	{
	}
	KV3Helper_StringToNumber<long long int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<long long int>(); // 694
	KeyValues3::GetValueAsNumeric<long long int>(); // 189
	KeyValues3::GetValueInt64(); // 952
} /* size: 0, variables: 1, inline expansions: 22 (0 bytes) */

// <055760ED> kv3lib/keyvalues3.cpp:958
// variable: 1
// function calls: 22
void KeyValues3::GetMemberFloat(CKV3MemberName memberName, float defaultValue)
{
	const KeyValues3* pMember; // 960
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 960
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 960
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	KV3Helper_StringToNumber<float>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<float>(); // 694
	{
	}
	KeyValues3::GetValueAsNumeric<float>(); // 199
	KeyValues3::GetValueFloat(); // 964
} /* size: 0, variables: 1, inline expansions: 22 (1155 bytes) */

// <05575B66> kv3lib/keyvalues3.cpp:970
// variable: 1
// function calls: 22
void KeyValues3::GetMemberDouble(CKV3MemberName memberName, double defaultValue)
{
	const KeyValues3* pMember; // 972
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 972
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 972
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	KV3Helper_StringToNumber<double>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<double>(); // 694
	{
	}
	KeyValues3::GetValueAsNumeric<double>(); // 204
	KeyValues3::GetValueDouble(); // 976
} /* size: 0, variables: 1, inline expansions: 22 (0 bytes) */

// <055756E1> kv3lib/keyvalues3.cpp:982
// variable: 1
// function calls: 16
void KeyValues3::GetMemberAsString(CKV3MemberName memberName, char* pOutData, int nBufSize, const char* defaultValue)
{
	const KeyValues3* pMember; // 984
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 984
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 984
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 987
} /* size: 0, variables: 1, inline expansions: 16 (681 bytes) */

// <05575276> kv3lib/keyvalues3.cpp:997
// variable: 1
// function calls: 16
void KeyValues3::GetMemberAsString(CKV3MemberName memberName, CUtlString* pOutData, const char* defaultValue)
{
	const KeyValues3* pMember; // 999
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 999
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 999
	CUtlString::operator=(
			const char* src);  // 1002
} /* size: 0, variables: 1, inline expansions: 16 (639 bytes) */

// <05574DD9> kv3lib/keyvalues3.cpp:1012
// variable: 1
// function calls: 18
void KeyValues3::GetMemberString(CKV3MemberName memberName, const char* defaultValue)
{
	const KeyValues3* pMember; // 1014
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 2528
	KeyValues3::GetTable(); // 2531
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 2531
	CUtlVectorBase<CUtlStringToken, CUtlMemoryFixedGrowable<CUtlStringToken, 8, int> >::Count(); // 3338
	{
	}
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 3345
	CKeyValues3Table::MemberData(
			int nIndex);  // 2535
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nextPropertyHint,
				KeyValues3* pDefaultValue);  // 943
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 943
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				uint& nNextPropertyHint,
				const KeyValues3* pDefaultValue);  // 941
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 941
	KeyValues3::Internal_FindMember(
				CKV3MemberName memberName,
				const KeyValues3* pDefaultValue);  // 1014
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 1014
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1015
} /* size: 0, variables: 1, inline expansions: 18 (566 bytes) */

// <05582BEF> kv3lib/keyvalues3.cpp:1026
// function calls: 8
void KeyValues3::GetBinaryBlobBase()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1028
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1034
	{
	}
	KeyValues3::GetBinaryBlobBase(); // 1026
} /* size: 0, inline expansions: 8 (113 bytes) */

// <05574D98> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 35856
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <028EC792> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 54527
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <012519C4> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 16111
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <002CD189> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 2278
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <0063238B> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 28264
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <00A0A012> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 34415
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <00116B93> kv3lib/keyvalues3.cpp:1026
// variables: 2
void KeyValues3::GetBinaryBlobBase()
{
	const char   __FUNCTION__; // 26912
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1030
	}
} /* size: 0, variables: 1 */

// <05574A9C> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 36170
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (355 bytes) */

// <028EC496> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 54841
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (355 bytes) */

// <012516C8> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 16425
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (0 bytes) */

// <002CCE8D> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 2592
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (0 bytes) */

// <0063208F> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 28578
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (0 bytes) */

// <00A09D16> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 34729
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (0 bytes) */

// <00116897> kv3lib/keyvalues3.cpp:1039
// variables: 2
// function calls: 11
void KeyValues3::TransferOwnershipOfBinaryBlob(CUtlBinaryBlock& destBlock)
{
	const char   __FUNCTION__; // 27226
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1056
	}
	KeyValues3::Internal_Type(); // 1041
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 645
	CUtlMemory<unsigned char, int>::AssumeMemory(
			unsigned char* pMemory,
			int numElements);  // 158
	CUtlBinaryBlock::AssumeExternalMemory(
				void* pExternalMemory,
				uint nExternalMemorySize);  // 1052
	CUtlMemory<unsigned char, int>::IsReadOnly(); // 127
	CUtlBinaryBlock::IsReadOnly(); // 1056
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 250
	KeyValues3::SetToNull(); // 1058
} /* size: 0, variables: 1, inline expansions: 11 (0 bytes) */

// <05582DC6> kv3lib/keyvalues3.cpp:1066
// function calls: 4
void KeyValues3::Internal_BinaryBlobBase()
{
	KeyValues3::Internal_Type(); // 1068
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
} /* size: 0, inline expansions: 4 (0 bytes) */

// <05574A7F> kv3lib/keyvalues3.cpp:1066
void KeyValues3::Internal_BinaryBlobBase()
{
} /* size: 0 */

// <05574888> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 36067
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <028EC282> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 54738
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <012514B4> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 16322
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (87 bytes) */

// <002CCC79> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 2489
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <00631E7B> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 28475
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <00A09B02> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 34626
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <00116683> kv3lib/keyvalues3.cpp:1096
// variables: 2
// function calls: 7
void KeyValues3::GetBinaryBlobBaseForWrite()
{
	const char   __FUNCTION__; // 27123
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1100
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1098
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1104
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <05582EA2> kv3lib/keyvalues3.cpp:1110
// function calls: 2
void KeyValues3::Internal_BinaryBlobSize()
{
	KeyValues3::Internal_Type(); // 1112
	KeyValues3::Internal_BinaryBlobSize(); // 1110
} /* size: 0, inline expansions: 2 (0 bytes) */

// <0557486B> kv3lib/keyvalues3.cpp:1110
void KeyValues3::Internal_BinaryBlobSize()
{
} /* size: 0 */

// <05582F20> kv3lib/keyvalues3.cpp:1125
// function calls: 6
void KeyValues3::GetBinaryBlobSize()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1127
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1133
	{
	}
	KeyValues3::GetBinaryBlobSize(); // 1125
} /* size: 0, inline expansions: 6 (89 bytes) */

// <0557482A> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 35856
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <028EC224> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 54527
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <01251456> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 16111
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <002CCC1B> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 2278
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <00631E1D> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 28264
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <00A09AA4> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 34415
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <00116625> kv3lib/keyvalues3.cpp:1125
// variables: 2
void KeyValues3::GetBinaryBlobSize()
{
	const char   __FUNCTION__; // 26912
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1129
	}
} /* size: 0, variables: 1 */

// <055745B9> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 35856
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <028EBFB3> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 54527
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <012511E5> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 16111
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <002CC9AA> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 2278
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <00631BAC> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 28264
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <00A09833> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 34415
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <001163B4> kv3lib/keyvalues3.cpp:1139
// variables: 4
// function calls: 9
void KeyValues3::GetBinaryBlobByte(int nIndex)
{
	const char   __FUNCTION__; // 26912
	int nCount; // 1147
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1143
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1150
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1141
	KeyValues3::Internal_BinaryBlobSize(); // 1110
	KeyValues3::Internal_BinaryBlobSize(); // 1147
	KeyValues3BinaryBlob_t::AsByteArray(); // 1074
	KeyValues3BinaryBlobExternal_t::AsByteArray(); // 1070
	KeyValues3::Internal_BinaryBlobBase(); // 1066
	KeyValues3::Internal_BinaryBlobBase(); // 1154
} /* size: 0, variables: 2, inline expansions: 9 (0 bytes) */

// <05574479> kv3lib/keyvalues3.cpp:1160
// function calls: 2
void KeyValues3::Internal_AimAtExternalBinaryBlob(byte* pData, int nSize, bool bOwnData)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 1162
	AllocBlobExternal(KeyValues3* pParent,
				byte* pData,
				int nSize,
				bool bOwnsData);  // 1163
} /* size: 88, inline expansions: 2 (48 bytes) */

// <055872A7> kv3lib/keyvalues3.cpp:1169
// function calls: 2
void KeyValues3::SetToBinaryBlob(const byte* pData, int nSize)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
} /* size: 75, inline expansions: 2 (70 bytes) */

// <05574442> kv3lib/keyvalues3.cpp:1169
void KeyValues3::SetToBinaryBlob(const byte* pData, int nSize)
{
} /* size: 0 */

// <05587386> kv3lib/keyvalues3.cpp:1178
// function calls: 2
void KeyValues3::SetToZeroedBinaryBlob(int nSize)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1180
} /* size: 0, inline expansions: 2 (0 bytes) */

// <05574418> kv3lib/keyvalues3.cpp:1178
void KeyValues3::SetToZeroedBinaryBlob(int nSize)
{
} /* size: 0 */

// <0558A10E> kv3lib/keyvalues3.cpp:1187
// function calls: 3
void KeyValues3::SetToEmptyArray()
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1189
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1190
} /* size: 69, inline expansions: 3 (69 bytes) */

// <055743FB> kv3lib/keyvalues3.cpp:1187
void KeyValues3::SetToEmptyArray()
{
} /* size: 0 */

// <05583079> kv3lib/keyvalues3.cpp:1196
// function calls: 10
void KeyValues3::GetArrayElementCount()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 3906
	{
	}
	{
	}
	KeyValues3::Internal_AssertIsTable(
				const char* pFuncName,
				bool bAllowNull);  // 3893
	KeyValues3::Internal_AssertIsArray(
				const char* pFuncName,
				bool bAllowNull);  // 1198
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1200
	CUtlVectorBase<KeyValues3::Count(); // 164
	CKeyValues3Array::GetElementCount(); // 1208
} /* size: 174, inline expansions: 10 (149 bytes) */

// <055743D3> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 35937
} /* size: 0, variables: 1 */

// <028EBDCD> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 54608
} /* size: 0, variables: 1 */

// <01250FFF> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 16192
} /* size: 0, variables: 1 */

// <002CC7C4> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 2359
} /* size: 0, variables: 1 */

// <006319C6> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 28345
} /* size: 0, variables: 1 */

// <00A0964D> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 34496
} /* size: 0, variables: 1 */

// <001161CE> kv3lib/keyvalues3.cpp:1196
// variable: 1
void KeyValues3::GetArrayElementCount()
{
	const char   __FUNCTION__; // 26993
} /* size: 0, variables: 1 */

// <0558A22A> kv3lib/keyvalues3.cpp:1219
// function calls: 6
void KeyValues3::SetArrayElementCount(int nCount, KeyValues3Type_t nType)
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1222
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1224
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1226
} /* size: 111, inline expansions: 6 (106 bytes) */

// <0557439C> kv3lib/keyvalues3.cpp:1219
void KeyValues3::SetArrayElementCount(int nCount, KeyValues3Type_t nType)
{
} /* size: 0 */

// <05589500> kv3lib/keyvalues3.cpp:1232
void KeyValues3::Internal_SetArrayCount(int nCount, KeyValues3Type_t nType)
{
} /* size: 0 */

// <0555012C> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<double const, KeyValues3::double>(KeyValues3Type_t elementType, double KeyValues3::* pBackingStore, int nElementCount, const double* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 39222
		iterator __for_begin; // 21131
		iterator __for_end; // 21131
	}
} /* size: 0, variables: 1 */

// <05550074> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 39222
		iterator __for_begin; // 21131
		iterator __for_end; // 21131
	}
} /* size: 0, variables: 1 */

// <028C7A6E> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 57893
		iterator __for_begin; // 39802
		iterator __for_end; // 39802
	}
} /* size: 0, variables: 1 */

// <0122CD58> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<double const, KeyValues3::double>(KeyValues3Type_t elementType, double KeyValues3::* pBackingStore, int nElementCount, const double* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 19477
		iterator __for_begin; // 1386
		iterator __for_end; // 1386
	}
} /* size: 0, variables: 1 */

// <0122CCA0> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 19477
		iterator __for_begin; // 1386
		iterator __for_end; // 1386
	}
} /* size: 0, variables: 1 */

// <002A851D> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<double const, KeyValues3::double>(KeyValues3Type_t elementType, double KeyValues3::* pBackingStore, int nElementCount, const double* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 5644
		iterator __for_begin; // 53089
		iterator __for_end; // 53089
	}
} /* size: 0, variables: 1 */

// <002A8465> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 5644
		iterator __for_begin; // 53089
		iterator __for_end; // 53089
	}
} /* size: 0, variables: 1 */

// <0060D71F> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<double const, KeyValues3::double>(KeyValues3Type_t elementType, double KeyValues3::* pBackingStore, int nElementCount, const double* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 31630
		iterator __for_begin; // 13539
		iterator __for_end; // 13539
	}
} /* size: 0, variables: 1 */

// <0060D667> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 31630
		iterator __for_begin; // 13539
		iterator __for_end; // 13539
	}
} /* size: 0, variables: 1 */

// <000F1F27> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<double const, KeyValues3::double>(KeyValues3Type_t elementType, double KeyValues3::* pBackingStore, int nElementCount, const double* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 30278
		iterator __for_begin; // 12187
		iterator __for_end; // 12187
	}
} /* size: 0, variables: 1 */

// <000F1E6F> kv3lib/keyvalues3.cpp:1243
// variables: 5
void Internal_ExpandCompactArray<int const, long long KeyValues3::int>(KeyValues3Type_t elementType, long long int KeyValues3::* pBackingStore, int nElementCount, const int* pElementValues, bool bFree)
{
	int nElement; // 1250
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 30278
		iterator __for_begin; // 12187
		iterator __for_end; // 12187
	}
} /* size: 0, variables: 1 */

// <05573B4A> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 36116
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 39190
		iterator __for_begin; // 39200
		iterator __for_end; // 39210
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 39374
		iterator __for_begin; // 39384
		iterator __for_end; // 39394
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <028EB544> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 54787
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 57861
		iterator __for_begin; // 57871
		iterator __for_end; // 57881
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 58045
		iterator __for_begin; // 58055
		iterator __for_end; // 58065
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <01250776> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 16371
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 19445
		iterator __for_begin; // 19455
		iterator __for_end; // 19465
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 19629
		iterator __for_begin; // 19639
		iterator __for_end; // 19649
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <002CBF3B> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 2538
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 5612
		iterator __for_begin; // 5622
		iterator __for_end; // 5632
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 5796
		iterator __for_begin; // 5806
		iterator __for_end; // 5816
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <0063113D> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 28524
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 31598
		iterator __for_begin; // 31608
		iterator __for_end; // 31618
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 31782
		iterator __for_begin; // 31792
		iterator __for_end; // 31802
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <00A08DC4> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 34675
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 37749
		iterator __for_begin; // 37759
		iterator __for_end; // 37769
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 37933
		iterator __for_begin; // 37943
		iterator __for_end; // 37953
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <00115945> kv3lib/keyvalues3.cpp:1264
// variables: 10
// function calls: 25
void KeyValues3::Internal_ExpandCompactArray()
{
	const char   __FUNCTION__; // 27172
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1279
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1266
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 30246
		iterator __for_begin; // 30256
		iterator __for_end; // 30266
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<int const, long long int>(
								KeyValues3Type_t elementType,
								long long int KeyValues3::* pBackingStore,
								int nElementCount,
								const int* pElementValues,
								bool bFree);  // 1275
	KeyValues3::Internal_SetType(
			KeyValues3InternalType_t nType);  // 1246
	KeyValues3::Internal_ClearDataWithoutFreeing(); // 1245
	KeyValues3::Internal_SetArrayCount(
				int nCount,
				KeyValues3Type_t nType);  // 1248
	{
		KeyValues3* pElement; // 1251
		CKV3ArrayIteratorView<false>& __for_range; // 30430
		iterator __for_begin; // 30440
		iterator __for_end; // 30450
		KeyValues3::IterateArray(); // 1251
		iterator::operator!=(
				const iterator& rhs);  // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 396
		CKV3ArrayIteratorView<false>::begin(); // 1251
		iterator::iterator(
			const KV3Pointer_t* pArrayElements,
			int nStartingIndex,
			int nArrayElementCount);  // 401
		CKV3ArrayIteratorView<false>::end(); // 1251
		{
		}
		iterator::operator*(); // 1251
	}
	KeyValues3::Internal_ExpandCompactArray<double const, double>(
								KeyValues3Type_t elementType,
								double KeyValues3::* pBackingStore,
								int nElementCount,
								const double* pElementValues,
								bool bFree);  // 1271
} /* size: 0, variables: 1, inline expansions: 11 (559 bytes) */

// <0558958A> kv3lib/keyvalues3.cpp:1287
// function calls: 8
void KeyValues3::Internal_GetArrayElementsArray()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 3906
	{
	}
	{
	}
	KeyValues3::Internal_AssertIsTable(
				const char* pFuncName,
				bool bAllowNull);  // 3893
	KeyValues3::Internal_AssertIsArray(
				const char* pFuncName,
				bool bAllowNull);  // 1290
	KeyValues3::Internal_Type(); // 1292
	CUtlMemory<KeyValues3::Base(); // 112
	CUtlVectorBase<KeyValues3::Base(); // 1294
} /* size: 116, inline expansions: 8 (116 bytes) */

// <05573B22> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 36197
} /* size: 0, variables: 1 */

// <028EB51C> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 54868
} /* size: 0, variables: 1 */

// <0125074E> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 16452
} /* size: 0, variables: 1 */

// <002CBF13> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 2619
} /* size: 0, variables: 1 */

// <00631115> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 28605
} /* size: 0, variables: 1 */

// <00A08D9C> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 34756
} /* size: 0, variables: 1 */

// <0011591D> kv3lib/keyvalues3.cpp:1287
// variable: 1
void KeyValues3::Internal_GetArrayElementsArray()
{
	const char   __FUNCTION__; // 27253
} /* size: 0, variables: 1 */

// <055897B8> kv3lib/keyvalues3.cpp:1305
// function calls: 14
void KeyValues3::GetArrayElement(int nIndex)
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 3906
	{
	}
	{
	}
	KeyValues3::Internal_AssertIsTable(
				const char* pFuncName,
				bool bAllowNull);  // 3893
	KeyValues3::Internal_AssertIsArray(
				const char* pFuncName,
				bool bAllowNull);  // 1308
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1310
	CUtlVectorBase<KeyValues3::IsValidIndex(
			int i);  // 171
	CUtlMemory<KeyValues3::operator[](
			int i);  // 588
	CUtlVectorBase<KeyValues3::operator[](
			int i);  // 173
	{
	}
	CKeyValues3Array::GetElement(
			int nIndex);  // 167
	CKeyValues3Array::GetElement(
			int nIndex);  // 1312
	KeyValues3::GetArrayElement(
			int nIndex);  // 1305
} /* size: 0, inline expansions: 14 (298 bytes) */

// <05573AED> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 35802
} /* size: 0, variables: 1 */

// <028EB4E7> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 54473
} /* size: 0, variables: 1 */

// <01250719> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 16057
} /* size: 0, variables: 1 */

// <002CBEDE> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 2224
} /* size: 0, variables: 1 */

// <006310E0> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 28210
} /* size: 0, variables: 1 */

// <00A08D67> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 34361
} /* size: 0, variables: 1 */

// <001158E8> kv3lib/keyvalues3.cpp:1305
// variable: 1
void KeyValues3::GetArrayElement(int nIndex)
{
	const char   __FUNCTION__; // 26858
} /* size: 0, variables: 1 */

// <05589B91> kv3lib/keyvalues3.cpp:1323
void KeyValues3::GetArrayElement(int nIndex)
{
} /* size: 9 */

// <055832C7> kv3lib/keyvalues3.cpp:1331
// function calls: 7
void KeyValues3::GetValueBool()
{
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1333
	KV3Helper_StringToNumber<int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<int>(); // 694
	{
	}
	KeyValues3::GetValueAsNumeric<int>(); // 1335
	KeyValues3::GetValueBool(); // 1331
} /* size: 0, inline expansions: 7 (216 bytes) */

// <05573AA6> kv3lib/keyvalues3.cpp:1331
void KeyValues3::GetValueBool()
{
} /* size: 0 */

// <055737B8> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 35829
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (156 bytes) */

// <028EB1B2> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 54500
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (156 bytes) */

// <012503E4> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 16084
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <002CBBA9> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 2251
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <00630DAB> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 28237
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (156 bytes) */

// <00A08A32> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 34388
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <001155B3> kv3lib/keyvalues3.cpp:1343
// variables: 2
// function calls: 4
void KeyValues3::GetValueAsString(char* pOutData, int nBufSize)
{
	const char   __FUNCTION__; // 26885
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1379
	}
	KeyValues3::Internal_Type(); // 1345
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1367
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1380
	V_strncpy<int>(char* pDest,
			const char* pSrc,
			int maxLenInChars);  // 1363
} /* size: 0, variables: 1, inline expansions: 4 (0 bytes) */

// <05573582> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 35829
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <028EAF7C> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 54500
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <012501AE> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 16084
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <002CB973> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 2251
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <00630B75> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 28237
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <00A087FC> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 34388
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <0011537D> kv3lib/keyvalues3.cpp:1387
// variables: 2
// function calls: 3
void KeyValues3::GetValueAsString(CUtlString* pOutString)
{
	const char   __FUNCTION__; // 26885
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1419
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1389
} /* size: 0, variables: 1, inline expansions: 3 (24 bytes) */

// <055730AE> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 35829
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <028EAAA8> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 54500
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (349 bytes) */

// <0124FCDA> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 16084
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <002CB49F> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 2251
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <006306A1> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 28237
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <00A08328> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 34388
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <00114EA9> kv3lib/keyvalues3.cpp:1430
// variables: 2
// function calls: 15
void KeyValues3::GetValueAsString(CBufferString* pOutString)
{
	const char   __FUNCTION__; // 26885
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1474
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1432
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1470
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1451
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1475
} /* size: 0, variables: 1, inline expansions: 15 (0 bytes) */

// <05572FA9> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 35775
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <028EA9A3> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 54446
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <0124FBD5> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 16030
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <002CB39A> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 2197
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <0063059C> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 28183
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <00A08223> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 34334
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <00114DA4> kv3lib/keyvalues3.cpp:1482
// variables: 3
// function calls: 2
void KeyValues3::GetValueString(const char* pDefaultValue)
{
	const char   __FUNCTION__; // 26831
	{
		bool bLooksLikeABug; // 1497
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1498
		}
		V_isempty(const char* pszString); // 1497
	}
	KeyValues3::Internal_Type(); // 1484
} /* size: 0, variables: 1, inline expansions: 1 (7 bytes) */

// <05572D6F> kv3lib/keyvalues3.cpp:1508
// function calls: 7
void KeyValues3::SetValueString(const char* value)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1521
	V_strlen(const char* str); // 1515
	AllocString(KeyValues3* pParent,
			const char* pStr);  // 1522
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 1554
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 1556
	KeyValues3::Internal_SetToShortString(
					const char* value);  // 1517
} /* size: 159, inline expansions: 7 (169 bytes) */

// <05587536> kv3lib/keyvalues3.cpp:1528
// function call: 1
void KeyValues3::SetValueResourceString(const char* value)
{
	KeyValues3::SetFlag(
		KeyValues3Flag_t nFlag,
		bool bSet);  // 1531
} /* size: 33, inline expansions: 1 (6 bytes) */

// <05572D45> kv3lib/keyvalues3.cpp:1528
void KeyValues3::SetValueResourceString(const char* value)
{
} /* size: 0 */

// <05572B80> kv3lib/keyvalues3.cpp:1537
// function calls: 5
void KeyValues3::Internal_AimAtExternalString(const char* value)
{
	V_strlen(const char* str); // 1539
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 1545
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 1554
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 1556
	KeyValues3::Internal_SetToShortString(
					const char* value);  // 1541
} /* size: 158, inline expansions: 5 (109 bytes) */

// <05587458> kv3lib/keyvalues3.cpp:1552
// function calls: 2
void KeyValues3::Internal_SetToShortString(const char* value)
{
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 1554
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 1556
} /* size: 0, inline expansions: 2 (0 bytes) */

// <05572B56> kv3lib/keyvalues3.cpp:1552
void KeyValues3::Internal_SetToShortString(const char* value)
{
} /* size: 0 */

// <055727F4> kv3lib/keyvalues3.cpp:1562
// variable: 1
// function calls: 12
void KeyValues3::SetValueIntFromString(const char* pString)
{
	{
		uint64 nValue; // 1587
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 227
		KeyValues3::SetValueUint64(
				uint64 value);  // 1590
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 233
		KeyValues3::SetValueInt64(
				int64 value);  // 1594
	}
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1573
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 209
	KeyValues3::SetValueInt(
			int value);  // 1566
} /* size: 230, inline expansions: 6 (122 bytes) */

// <0558347F> kv3lib/keyvalues3.cpp:1602
// function calls: 8
void KeyValues3::GetValueIntAsString(CUtlString* pOutString)
{
	KeyValues3::Internal_Type(); // 1604
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 696
	{
	}
	KV3Helper_StringToNumber<long long int>(const char* pString); // 715
	KeyValues3::GetValueAsNumeric<long long int>(); // 694
	KeyValues3::GetValueAsNumeric<long long int>(); // 189
	KeyValues3::GetValueInt64(); // 1610
	KeyValues3::GetValueIntAsString(
				CUtlString* pOutString);  // 1602
} /* size: 0, inline expansions: 8 (0 bytes) */

// <055727CA> kv3lib/keyvalues3.cpp:1602
void KeyValues3::GetValueIntAsString(CUtlString* pOutString)
{
} /* size: 0 */

// <05571964> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 35937
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <028E935E> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 54608
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <0124E590> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 16192
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <002C9D55> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 2359
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <0062EF57> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 28345
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <00A06BDE> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 34496
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1645
} /* size: 0, variables: 1, inline expansions: 25 (790 bytes) */

// <0011375F> kv3lib/keyvalues3.cpp:1617
// variables: 5
// function calls: 52
void KeyValues3::ParseValueFromString(const char* pString)
{
	const char   __FUNCTION__; // 26993
	{
		CSplitString split; // 1631
		int nSplitLen; // 1632
		{
			int i; // 1634
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 1636
		}
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 30
		CSplitString::CSplitString(
				const char* pString,
				const char* pSeparator);  // 1631
		CUtlVectorBase<char::Count(); // 1632
		KeyValues3::Internal_Type(); // 90
		KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
		KeyValues3::GetType(); // 1222
		KeyValues3::Internal_PrepareForInternalType(
						KeyValues3InternalType_t newType);  // 950
		KeyValues3::Internal_PrepareForType(
					KeyValues3Type_t newType);  // 1224
		KeyValues3::Internal_SetArrayCount(
					int nCount,
					KeyValues3Type_t nType);  // 1226
		KeyValues3::SetArrayElementCount(
					int nCount,
					KeyValues3Type_t nType);  // 1633
		CUtlVectorBase<char::RemoveAll(); // 1798
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 40
		CSplitString::~CSplitString(); // 1638
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1676
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 1624
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 233
	KeyValues3::SetValueInt64(
			int64 value);  // 1641
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1663
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1667
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 215
	KeyValues3::SetValueBool(
			bool value);  // 1671
	V_strlen(const char* str); // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 1171
	KeyValues3::SetToBinaryBlob(
			const byte* pData,
			int nSize);  // 1657
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
				KeyValues3Type_t newType);  // 239
	KeyValues3::SetValueDouble(
			double value);  // 1649
	KeyValues3::Internal_PrepareForInternalType(
					KeyValues3InternalType_t newType);  // 950
	KeyValues3::Internal_PrepareForType(
