
//
// kv3lib/kv3formats_modeldoc.cpp
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   liblocalize.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//				   librendersystemvulkan.so
//				   libschemasystem.so
//
//	functions: 84
//	class: 1
//

// <05775D90> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 65022
		const KV3ID_t* __for_begin; // 20311
		const KV3ID_t* __for_end; // 20311
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <02AB649D> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 54272
		const KV3ID_t* __for_begin; // 9561
		const KV3ID_t* __for_end; // 9561
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <013BE46D> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 27534
		const KV3ID_t* __for_begin; // 48359
		const KV3ID_t* __for_end; // 48359
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <00439C32> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 13701
		const KV3ID_t* __for_begin; // 34526
		const KV3ID_t* __for_end; // 34526
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <007BA0DF> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 19890
		const KV3ID_t* __for_begin; // 40715
		const KV3ID_t* __for_end; // 40715
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <00B91D66> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 26041
		const KV3ID_t* __for_begin; // 46866
		const KV3ID_t* __for_end; // 46866
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <0028363C> kv3lib/kv3formats_modeldoc.cpp:19
// variables: 5
// function calls: 35
bool IsModelDocFormat(const KV3ID_t& id)
{
	const KV3ID_t  FORMATS; // 21
	{
		const KV3ID_t& f; // 56
		const KV3ID_t& __for_range; // 38335
		const KV3ID_t* __for_begin; // 59160
		const KV3ID_t* __for_end; // 59160
		V_memcmp(const void* m1,
			const void* m2,
			size_t count);  // 1563
		Plat_CompareUUIDs(const V_uuid_t* pLhs,
					const V_uuid_t* pRhs);  // 1588
		operator==(const V_uuid_t& lhs,
				const V_uuid_t& rhs);  // 57
		KV3ID_t::operator==(
				const KV3ID_t& rhs);  // 58
	}
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
	KV3ID_t::KV3ID_t(
		const KV3ID_t& other);  // 54
} /* size: 1056, variables: 1, inline expansions: 31 (899 bytes) */

// <057542D7> kv3lib/kv3formats_modeldoc.cpp:67
// member functions: 2
// class size: 1
class CCheck_IsModelDocFormat {
	/* kv3lib/kv3formats_modeldoc.cpp:70 */
	void CCheck_IsModelDocFormat(CCheck_IsModelDocFormat* );
	void CCheck_IsModelDocFormat(class CCheck_IsModelDocFormat *); /* linkage=_ZN23CCheck_IsModelDocFormatC4Ev */
};

// <05775D72> kv3lib/kv3formats_modeldoc.cpp:70
void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	{
		{
		}
	}
} /* size: 0 */

// <05775D30> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 12844
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <02AB643D> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 2094
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <013BE40D> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 40892
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <007BA07F> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 33248
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <00B91D06> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 39399
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <002835DC> kv3lib/kv3formats_modeldoc.cpp:70
// variables: 2
inline void CCheck_IsModelDocFormat::CCheck_IsModelDocFormat()
{
	const char   __FUNCTION__; // 51693
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 72
	}
} /* size: 0, variables: 1 */

// <05775CE9> kv3lib/kv3formats_modeldoc.cpp:79
// variables: 2
KeyValues3* AddChildOfType(KeyValues3* pNode, const char* pClassName)
{
	KeyValues3* pChildren; // 81
	KeyValues3* pChild; // 83
} /* size: 0, variables: 2 */

// <05759CEA> kv3lib/kv3formats_modeldoc.cpp:93
// variables: 3
bool HasImmediateChildOfType<6>(const KeyValues3* pNode, const char *& pClassList)
{
	const KeyValues3* pChildren; // 95
	{
		int iChild; // 99
		{
			const KeyValues3* pChild; // 101
		}
	}
} /* size: 0, variables: 1 */

// <05775989> kv3lib/kv3formats_modeldoc.cpp:134
// variables: 10
// function calls: 6
KeyValues3* FindOrCreateSingleton(KV3FormatConversionContext_t& conversionCtx, const char* pClassName, bool bCreate)
{
	KeyValues3* pRootNode; // 136
	KeyValues3* pChildren; // 137
	const int  nNumChildren; // 139
	KeyValues3* pNewSingleton; // 153
	{
		int i; // 140
		{
			KeyValues3* pChild; // 142
		}
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 136
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 136
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 137
} /* size: 254, variables: 4, inline expansions: 6 (83 bytes) */

// <05775657> kv3lib/kv3formats_modeldoc.cpp:163
// variables: 6
// function calls: 5
void RemoveKV3NodesOfClass_R(KeyValues3* pKeyValues3, const char* pClass)
{
	int nCount; // 182
	{
		int nCount; // 167
		{
			int i; // 168
			{
				KeyValues3* pElement; // 170
			}
		}
	}
	{
		int i; // 183
		{
			KeyValues3* pMember; // 185
			{
				_DebuggerBreakInlineExpressionWrapper(void); // 188
			}
		}
	}
	KeyValues3::Internal_Type(); // 90
	KV3InternalTypeToExternal(KeyValues3InternalType_t nType); // 90
	KeyValues3::GetType(); // 255
	KeyValues3::IsArray(); // 165
} /* size: 0, variables: 1, inline expansions: 4 (30 bytes) */

// <05774B70> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 46703
		iterator __for_begin; // 58546
		iterator __for_end; // 58546
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <02AB527D> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 35953
		iterator __for_begin; // 47796
		iterator __for_end; // 47796
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <013BD24D> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 9215
		iterator __for_begin; // 21058
		iterator __for_end; // 21058
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <00438A12> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 60918
		iterator __for_begin; // 7225
		iterator __for_end; // 7225
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <007B8EBF> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 1571
		iterator __for_begin; // 13414
		iterator __for_end; // 13414
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <0028241C> kv3lib/kv3formats_modeldoc.cpp:243
// variables: 20
// function calls: 37
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC0_To_KV3_FORMAT_MODELDOC1(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 245
	KeyValues3* pRootNodeChildren; // 246
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > procedureCopies; // 251
	KeyValues3* pProcedureList; // 270
	KeyValues3* pProcedureListChildren; // 272
	{
		int iRootChild; // 252
		{
			KeyValues3* pRootChild; // 254
			CUtlMemory<KeyValues3, int>::operator[](
					int i);  // 602
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
				int i);  // 1148
			Construct<KeyValues3>(KeyValues3* pMemory); // 1148
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
					int num);  // 1145
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 257
		}
	}
	{
		const KeyValues3& procedure; // 275
		CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 20016
		iterator __for_begin; // 31859
		iterator __for_end; // 31859
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 275
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 245
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 246
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 246
	CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
	CUtlMemory<KeyValues3, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 251
	{
		const uint32  m; // 101
		uint32 h; // 102
		uint32 k; // 103
		const int  r; // 104
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<7>(
				const char& str);  // 271
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 272
	{
		int i; // 1721
		CUtlMemory<KeyValues3, int>::operator[](
				int i);  // 602
		CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
			int i);  // 1723
		Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
	}
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
	CUtlMemory<KeyValues3, int>::Purge(); // 903
	CUtlMemory<KeyValues3, int>::Purge(); // 1799
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
	ValidateAlignment<KeyValues3>(void); // 508
	CUtlMemory<KeyValues3, int>::Purge(); // 510
	CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
	CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
	CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 281
} /* size: 668, variables: 5, inline expansions: 26 (609 bytes) */

// <057742FE> kv3lib/kv3formats_modeldoc.cpp:287
// variables: 4
// function calls: 28
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC1_To_KV3_FORMAT_MODELDOC2(KV3FormatConversionContext_t& conversionCtx)
{
	const char* PHYS_NODE_TYPES; // 289
	{
		CKeyValues3Iterator it; // 299
		{
			KeyValues3* pSurfaceProp; // 304
			CKeyValues3Iterator::operator->(); // 304
			CKV3MemberName::CKV3MemberName<13>(
						const char& str);  // 304
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 304
		}
		{
			KeyValues3* pCollisionProp; // 312
			CKeyValues3Iterator::operator->(); // 312
			CKV3MemberName::CKV3MemberName<15>(
						const char& str);  // 312
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 312
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 319
	}
} /* size: 681, variables: 1 */

// <05773BBD> kv3lib/kv3formats_modeldoc.cpp:327
// variables: 6
// function calls: 28
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC2_To_KV3_FORMAT_MODELDOC3(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 329
		{
			KeyValues3* pLoop; // 334
			CKeyValues3Iterator::operator->(); // 334
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 334
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 334
		}
		CKeyValues3Iterator::operator->(); // 333
		{
			const uint32  m; // 101
			uint32 h; // 102
			uint32 k; // 103
			const int  r; // 104
		}
		CUtlStringToken::CUtlStringToken(
				const char& str);  // 13
		CKV3MemberName::CKV3MemberName<7>(
					const char& str);  // 333
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 342
	}
} /* size: 371 */

// <057736F9> kv3lib/kv3formats_modeldoc.cpp:350
// variable: 1
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC3_To_KV3_FORMAT_MODELDOC4(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 352
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 358
	}
} /* size: 235 */

// <05772C7C> kv3lib/kv3formats_modeldoc.cpp:367
// variables: 18
// function calls: 32
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC4_To_KV3_FORMAT_MODELDOC5(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 379
	KeyValues3* pRootNodeChildren; // 380
	int nSequenceMarkupListIndex; // 384
	int nAnimationListIndex; // 388
	KeyValues3* pSequenceMarkupListChildren; // 390
	KeyValues3* pAnimationListChildren; // 391
	int nNumMarkup; // 393
	{
		CKeyValues3Iterator it; // 370
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 376
	}
	{
		int iMarkup; // 394
		{
			KeyValues3* pMarkup; // 396
		}
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 379
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 379
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 380
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 380
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 390
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 391
} /* size: 689, variables: 7, inline expansions: 12 (225 bytes) */

// <05771F51> kv3lib/kv3formats_modeldoc.cpp:412
// variables: 9
// function calls: 44
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC5_To_KV3_FORMAT_MODELDOC6(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 415
		{
			KeyValues3* pSequenceName; // 419
			{
				CUtlString sAnimName; // 423
				CUtlString::CUtlString(); // 423
				CUtlString::IsEmpty(); // 425
				CKeyValues3Iterator::operator->(); // 427
				{
					const uint32  m; // 61
					uint32 h; // 62
					uint32 k; // 63
					const int  r; // 64
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<5>(
							const char& str);  // 427
				CKeyValues3Iterator::operator->(); // 429
				CUtlString::Get(); // 429
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 429
				CKeyValues3Iterator::operator->(); // 430
				CUtlString::~CUtlString(); // 431
			}
			CKeyValues3Iterator::operator->(); // 419
			CKV3MemberName::CKV3MemberName<14>(
						const char& str);  // 419
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 419
		}
		{
			KeyValues3* pSequenceName; // 436
			{
				CUtlString sAnimName; // 440
				CUtlString::CUtlString(); // 440
				CKeyValues3Iterator::operator->(); // 442
				CUtlString::Get(); // 442
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 442
				CKeyValues3Iterator::operator->(); // 443
				CUtlString::~CUtlString(); // 444
			}
			CKeyValues3Iterator::operator->(); // 436
			CKV3MemberName::CKV3MemberName<14>(
						const char& str);  // 436
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 436
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 447
	}
} /* size: 958 */

// <05771952> kv3lib/kv3formats_modeldoc.cpp:455
// variables: 13
// function calls: 14
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC6_To_KV3_FORMAT_MODELDOC7(KV3FormatConversionContext_t& conversionCtx)
{
	KeyValues3* pRootNode; // 457
	KeyValues3* pRootNodeChildren; // 458
	int nBlendListIndex; // 462
	KeyValues3* pBlendListChildren; // 466
	int nAnimationListIndex; // 470
	KeyValues3* pAnimationListChildren; // 471
	const int  nBlendListChildCount; // 473
	{
		int nBlendListChild; // 474
		{
			KeyValues3* pBlendListChild; // 476
		}
	}
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 457
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 457
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 458
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 458
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 466
	CKV3MemberName::CKV3MemberName(
			const CKV3MemberName& rhs);  // 96
	KeyValues3::FindMember(
			CKV3MemberName memberName,
			KeyValues3* pDefaultValue);  // 466
	{
		const uint32  m; // 146
		uint32 h; // 147
		uint32 k; // 148
		const int  r; // 149
	}
	CUtlStringToken::CUtlStringToken(
			const char& str);  // 13
	CKV3MemberName::CKV3MemberName<9>(
				const char& str);  // 471
} /* size: 411, variables: 7, inline expansions: 14 (190 bytes) */

// <05770FD1> kv3lib/kv3formats_modeldoc.cpp:489
// variables: 13
// function calls: 32
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC7_To_KV3_FORMAT_MODELDOC8(KV3FormatConversionContext_t& conversionCtx)
{
	const char* ANIM_NODE_TYPES; // 491
	{
		CKeyValues3Iterator it; // 500
		{
			KeyValues3* pAnimName; // 504
			CKeyValues3Iterator::operator->(); // 504
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 504
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 504
			CKeyValues3Iterator::operator->(); // 506
			{
				const uint32  m; // 61
				uint32 h; // 62
				uint32 k; // 63
				const int  r; // 64
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 506
			CKeyValues3Iterator::operator->(); // 507
		}
		{
			const uint32  m; // 101
			uint32 h; // 102
			uint32 k; // 103
			const int  r; // 104
		}
		CUtlStringToken::CUtlStringToken(
				const char& str);  // 13
		CKV3MemberName::CKV3MemberName<7>(
					const char& str);  // 136
		{
			int iClass; // 137
			{
				const char* pCheckClass; // 139
				V_strcmp(const char* s1,
					const char* s2);  // 140
			}
		}
		IsKV3InClassList<5>(const KeyValues3* pKV3,
					const char  *& pClassList);  // 502
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 510
	}
} /* size: 673, variables: 1 */

// <0576F336> kv3lib/kv3formats_modeldoc.cpp:518
// variables: 43
// function calls: 94
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC8_To_KV3_FORMAT_MODELDOC9(KV3FormatConversionContext_t& conversionCtx)
{
	 FindNodeByNmameAndClass; // 520
	{
		CKeyValues3Iterator it; // 542
		{
			KeyValues3* pNode; // 546
			KeyValues3* pAnimA; // 550
			KeyValues3* pAnimB; // 551
			KeyValues3* pChildren; // 556
			KeyValues3* pSubtract; // 557
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 550
			{
				KeyValues3* pRet; // 522
				CUtlString sName; // 524
				{
					CKeyValues3Iterator it; // 526
					CKeyValues3Iterator::operator->(); // 531
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 531
					CUtlString::Get(); // 532
					RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
					AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
								StackEntry_t* pMemory,
								int numElements,
								int nCopyElements,
								bool bSetGrowable,
								uint32 nGrowable_GrowSize);  // 207
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
								StackEntry_t* pFixedMemory,
								int nFixedElements,
								int nPurgeToCount);  // 203
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
								StackEntry_t* pFixedMemory,
								int nFixedElements,
								int nPurgeToCount);  // 237
					CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
						int numElements);  // 1799
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
					ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
					Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
					ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
					CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
					~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
					CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
					CKeyValues3Iterator::~CKeyValues3Iterator(); // 537
				}
				CUtlString::CUtlString(); // 524
				CUtlString::~CUtlString(); // 540
			}
			operator()(const class* __closure,
					KeyValues3* pKV3,
					const char* pszName,
					const char* pszClass); // 550
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 551
			{
				KeyValues3* pRet; // 522
				CUtlString sName; // 524
				{
					CKeyValues3Iterator it; // 526
					CKeyValues3Iterator::operator->(); // 531
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 531
					CUtlString::Get(); // 532
					RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
					AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
								StackEntry_t* pMemory,
								int numElements,
								int nCopyElements,
								bool bSetGrowable,
								uint32 nGrowable_GrowSize);  // 207
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
								StackEntry_t* pFixedMemory,
								int nFixedElements,
								int nPurgeToCount);  // 203
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
								StackEntry_t* pFixedMemory,
								int nFixedElements,
								int nPurgeToCount);  // 237
					CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
						int numElements);  // 1799
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
					Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
					ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
					Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
					ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
					CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
					CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
					CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
					~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
					CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
					CKeyValues3Iterator::~CKeyValues3Iterator(); // 537
				}
				CUtlString::CUtlString(); // 524
				CUtlString::~CUtlString(); // 540
			}
			operator()(const class* __closure,
					KeyValues3* pKV3,
					const char* pszName,
					const char* pszClass); // 551
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 553
			{
				const uint32  m; // 80
				uint32 h; // 81
				uint32 k; // 82
				const int  r; // 83
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<6>(
						const char& str);  // 553
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 554
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 554
			CKeyValues3Iterator::operator->(); // 556
			{
				const uint32  m; // 146
				uint32 h; // 147
				uint32 k; // 148
				const int  r; // 149
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<9>(
						const char& str);  // 556
			{
				const uint32  m; // 61
				uint32 h; // 62
				uint32 k; // 63
				const int  r; // 64
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 559
			{
				const uint32  m; // 61
				uint32 h; // 62
				uint32 k; // 63
				const int  r; // 64
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 560
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 560
			{
				const uint32  m; // 80
				uint32 h; // 81
				uint32 k; // 82
				const int  r; // 83
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<6>(
						const char& str);  // 561
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 563
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 564
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 565
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 567
	}
} /* size: 1805, variables: 1 */

// <0576EDB8> kv3lib/kv3formats_modeldoc.cpp:575
// variable: 1
// function calls: 22
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC9_To_KV3_FORMAT_MODELDOC10(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 577
		CKeyValues3Iterator::operator->(); // 581
		CKV3MemberName::CKV3MemberName<24>(
					const char& str);  // 581
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 583
	}
} /* size: 310 */

// <0576E764> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 32982
			Rename_t* __for_begin; // 32740
			Rename_t* __for_end; // 32740
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <02AAEE71> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 22232
			Rename_t* __for_begin; // 21990
			Rename_t* __for_end; // 21990
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <013B6E41> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 61030
			Rename_t* __for_begin; // 60788
			Rename_t* __for_end; // 60788
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <00432606> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 47197
			Rename_t* __for_begin; // 46955
			Rename_t* __for_end; // 46955
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <007B2AB3> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 53386
			Rename_t* __for_begin; // 53144
			Rename_t* __for_end; // 53144
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <00B8A73A> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 59537
			Rename_t* __for_begin; // 59295
			Rename_t* __for_end; // 59295
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <0027C010> kv3lib/kv3formats_modeldoc.cpp:591
// variables: 6
// function calls: 20
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC10_To_KV3_FORMAT_MODELDOC11(KV3FormatConversionContext_t& conversionCtx)
{
	Rename_t RENAMES; // 599
	{
		CKeyValues3Iterator it; // 620
		{
			const Rename_t& r; // 622
			Rename_t& __for_range; // 6295
			Rename_t* __for_begin; // 6053
			Rename_t* __for_end; // 6053
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 629
	}
} /* size: 353, variables: 1 */

// <0576DE72> kv3lib/kv3formats_modeldoc.cpp:638
// variables: 4
// function calls: 29
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC11_To_KV3_FORMAT_MODELDOC12(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 640
		{
			KeyValues3* pNode; // 642
			{
				CUtlString shapeType; // 646
				{
					int nMaxVertices; // 657
					CKV3MemberName::CKV3MemberName<19>(
								const char& str);  // 657
					CKV3MemberName::CKV3MemberName<16>(
								const char& str);  // 658
				}
				CUtlString::CUtlString(); // 646
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 647
				CUtlString::Get(); // 649
				CKV3MemberName::CKV3MemberName<15>(
							const char& str);  // 652
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 661
				CKV3MemberName::CKV3MemberName<19>(
							const char& str);  // 662
				CUtlString::~CUtlString(); // 663
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 664
	}
} /* size: 721 */

// <0576C348> kv3lib/kv3formats_modeldoc.cpp:673
// variables: 41
// function calls: 78
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC12_To_KV3_FORMAT_MODELDOC13(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 675
		{
			KeyValues3* pNode; // 677
			KeyValues3* pClothShape; // 678
			{
				KeyValues3* pShapeList; // 686
				Vector KV3_VEC_ORIGIN; // 692
				Vector vPoint0; // 693
				Vector vPoint1; // 697
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 689
				{
					const uint32  m; // 123
					uint32 h; // 124
					uint32 k; // 125
					const int  r; // 126
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<8>(
							const char& str);  // 689
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 690
				{
					const uint32  m; // 123
					uint32 h; // 124
					uint32 k; // 125
					const int  r; // 126
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<8>(
							const char& str);  // 690
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 842
				KeyValues3::GetMemberVector(
						CKV3MemberName memberName,
						Vector* pOutValue);  // 694
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 694
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 695
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 862
				KeyValues3::SetMemberVector(
						CKV3MemberName memberName,
						const Vector& value);  // 695
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 842
				KeyValues3::GetMemberVector(
						CKV3MemberName memberName,
						Vector* pOutValue);  // 698
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 698
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 699
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 862
				KeyValues3::SetMemberVector(
						CKV3MemberName memberName,
						const Vector& value);  // 699
			}
			{
				KeyValues3* pShapeList; // 703
				Vector vCenter; // 708
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 862
				KeyValues3::SetMemberVector(
						CKV3MemberName memberName,
						const Vector& value);  // 710
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 706
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 706
				Vector::Vector(); // 708
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 709
				CKV3MemberName::CKV3MemberName(
						const CKV3MemberName& rhs);  // 842
				KeyValues3::GetMemberVector(
						CKV3MemberName memberName,
						Vector* pOutValue);  // 709
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 710
			}
			CKV3MemberName::CKV3MemberName<14>(
						const char& str);  // 730
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 731
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 732
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 733
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 734
			CKV3MemberName::CKV3MemberName<14>(
						const char& str);  // 682
			{
				const uint32  m; // 61
				uint32 h; // 62
				uint32 k; // 63
				const int  r; // 64
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 718
			{
				const uint32  m; // 61
				uint32 h; // 62
				uint32 k; // 63
				const int  r; // 64
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<5>(
						const char& str);  // 718
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 719
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 719
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 720
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 720
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 721
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 721
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 722
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 722
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 723
			CKV3MemberName::CKV3MemberName<23>(
						const char& str);  // 723
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 740
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 742
	}
} /* size: 2037 */

// <0576B42A> kv3lib/kv3formats_modeldoc.cpp:754
// variables: 23
// function calls: 41
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC13_To_KV3_FORMAT_MODELDOC14(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 756
		{
			KeyValues3* pNode; // 758
			int nHealth; // 767
			float flBurstScale; // 775
			float flBurstRandomize; // 776
			{
				KeyValues3* pHealth; // 770
				{
					const uint32  m; // 146
					uint32 h; // 147
					uint32 k; // 148
					const int  r; // 149
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<9>(
							const char& str);  // 81
				AddChildOfType(KeyValues3* pNode,
						const char* pClassName);  // 770
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 771
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 772
				{
					const uint32  m; // 101
					uint32 h; // 102
					uint32 k; // 103
					const int  r; // 104
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<7>(
							const char& str);  // 772
			}
			{
				KeyValues3* pBurst; // 779
				{
					const uint32  m; // 146
					uint32 h; // 147
					uint32 k; // 148
					const int  r; // 149
				}
				CUtlStringToken::CUtlStringToken(
						const char& str);  // 13
				CKV3MemberName::CKV3MemberName<9>(
							const char& str);  // 81
				AddChildOfType(KeyValues3* pNode,
						const char* pClassName);  // 779
				CKV3MemberName::CKV3MemberName<11>(
							const char& str);  // 780
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 781
				CKV3MemberName::CKV3MemberName<12>(
							const char& str);  // 781
				CKV3MemberName::CKV3MemberName<10>(
							const char& str);  // 782
				CKV3MemberName::CKV3MemberName<16>(
							const char& str);  // 782
			}
			{
				const uint32  m; // 101
				uint32 h; // 102
				uint32 k; // 103
				const int  r; // 104
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<7>(
						const char& str);  // 767
			CKV3MemberName::CKV3MemberName<12>(
						const char& str);  // 775
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 776
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 762
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 764
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 784
	}
} /* size: 1182 */

// <0576A8F5> kv3lib/kv3formats_modeldoc.cpp:793
// variables: 12
// function calls: 34
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC14_To_KV3_FORMAT_MODELDOC15(KV3FormatConversionContext_t& conversionCtx)
{
	const char* PHYS_NODE_TYPES; // 795
	{
		CKeyValues3Iterator it; // 805
		{
			KeyValues3* pBreakPiece; // 807
			const char* pSurfaceProp; // 814
			const char* pCollisionProp; // 815
			KeyValues3* pHullFromRender; // 819
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<9>(
						const char& str);  // 95
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 101
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 101
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					const KeyValues3* pDefaultValue);  // 95
			{
				int iChild; // 99
				{
					const KeyValues3* pChild; // 101
				}
			}
			HasImmediateChildOfType<6>(const KeyValues3* pNode,
							const char  *& pClassList);  // 811
			CKV3MemberName::CKV3MemberName<13>(
						const char& str);  // 814
			CKV3MemberName::CKV3MemberName<15>(
						const char& str);  // 815
			{
				const uint32  m; // 146
				uint32 h; // 147
				uint32 k; // 148
				const int  r; // 149
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<9>(
						const char& str);  // 81
			AddChildOfType(KeyValues3* pNode,
					const char* pClassName);  // 819
			CKV3MemberName::CKV3MemberName<13>(
						const char& str);  // 820
			CKV3MemberName::CKV3MemberName<15>(
						const char& str);  // 821
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 822
	}
} /* size: 830, variables: 1 */

// <057631BE> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 53533
				Fmt16Fixup_t* __for_begin; // 51853
				Fmt16Fixup_t* __for_end; // 51853
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <02AA38CB> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 42783
				Fmt16Fixup_t* __for_begin; // 41103
				Fmt16Fixup_t* __for_end; // 41103
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <013AB89B> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 16045
				Fmt16Fixup_t* __for_begin; // 14365
				Fmt16Fixup_t* __for_end; // 14365
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <00427060> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 2212
				Fmt16Fixup_t* __for_begin; // 532
				Fmt16Fixup_t* __for_end; // 532
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <007A750D> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 8401
				Fmt16Fixup_t* __for_begin; // 6721
				Fmt16Fixup_t* __for_end; // 6721
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <00B7F194> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 14552
				Fmt16Fixup_t* __for_begin; // 12872
				Fmt16Fixup_t* __for_end; // 12872
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <00270A6A> kv3lib/kv3formats_modeldoc.cpp:831
// variables: 9
// function calls: 368
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC15_To_KV3_FORMAT_MODELDOC16(KV3FormatConversionContext_t& conversionCtx)
{
	Fmt16Fixup_t FIXUP_LIST; // 892
	{
		CKeyValues3Iterator it; // 982
		{
			KeyValues3* pNode; // 984
			{
				const Fmt16Fixup_t& fixup; // 986
				Fmt16Fixup_t& __for_range; // 26846
				Fmt16Fixup_t* __for_begin; // 25166
				Fmt16Fixup_t* __for_end; // 25166
				{
					KeyValues3* pData; // 988
					CUtlString strValue; // 992
					CUtlString::CUtlString(); // 992
					KeyValues3::Internal_PrepareForInternalType(
									KeyValues3InternalType_t newType);  // 950
					KeyValues3::Internal_PrepareForType(
								KeyValues3Type_t newType);  // 250
					KeyValues3::SetToNull(); // 994
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 998
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1010
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1007
					CUtlString::~CUtlString(); // 1017
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1001
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1004
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1014
				}
			}
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1018
	}
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
	{
	}
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 151
	KV3MakeLowerHash(const char* pStr); // 23
	CKV3MemberName::CKV3MemberName(
			const char* pString);  // 980
} /* size: 0, variables: 1, inline expansions: 331 (22192 bytes) */

// <05762749> kv3lib/kv3formats_modeldoc.cpp:1029
// variables: 15
// function calls: 34
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC16_To_KV3_FORMAT_MODELDOC17(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 1031
		{
			KeyValues3* pBodyGroup; // 1033
			KeyValues3* pOldMeshes; // 1037
			{
				int i; // 1041
				{
					KeyValues3* pChoice; // 1043
					KeyValues3* pNewChoiceMeshes; // 1044
					CUtlString oldMeshName; // 1046
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 81
					AddChildOfType(KeyValues3* pNode,
							const char* pClassName);  // 1043
					{
						const uint32  m; // 101
						uint32 h; // 102
						uint32 k; // 103
						const int  r; // 104
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<7>(
								const char& str);  // 1044
					CUtlString::CUtlString(
							const char* pString);  // 1046
					CUtlString::IsEmpty(); // 1047
					CUtlString::Get(); // 441
					CUtlString::operator char const*(); // 1049
					CUtlString::~CUtlString(); // 1051
				}
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<7>(
						const char& str);  // 1037
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 1037
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1054
	}
} /* size: 638 */

// <057626ED> kv3lib/kv3formats_modeldoc.cpp:1064
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC17_To_KV3_FORMAT_MODELDOC18(KV3FormatConversionContext_t& conversionCtx)
{
} /* size: 31 */

// <05761E59> kv3lib/kv3formats_modeldoc.cpp:1075
// variables: 7
// function calls: 29
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC18_To_KV3_FORMAT_MODELDOC19(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 1077
		{
			KeyValues3* pGameData; // 1079
			KeyValues3* pGameKeys; // 1086
			{
				const uint32  m; // 198
				uint32 h; // 199
				uint32 k; // 200
				const int  r; // 201
			}
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<11>(
						const char& str);  // 1083
			V_strcmp(const char* s1,
				const char* s2);  // 1083
			CKV3MemberName::CKV3MemberName<10>(
						const char& str);  // 1086
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 1086
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 1089
			CKV3MemberName::CKV3MemberName<15>(
						const char& str);  // 1090
			CKV3MemberName::CKV3MemberName<16>(
						const char& str);  // 1091
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
		ValidateAlignment<CKeyValues3Iterator::StackEntry_t>(void); // 508
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 903
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Purge(); // 510
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemory(); // 191
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::~CUtlMemoryFixedGrowable_Base(); // 223
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::~CUtlMemoryFixedGrowable(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 478
		CUtlVectorFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4>::~CUtlVectorFixedGrowable(); // 284
		CKeyValues3Iterator::~CKeyValues3Iterator(); // 1092
	}
} /* size: 566 */

// <0575FC86> kv3lib/kv3formats_modeldoc.cpp:1104
// variables: 36
// function calls: 103
KV3FormatConversionResult_t KV3Convert_KV3_FORMAT_MODELDOC19_To_KV3_FORMAT_MODELDOC20(KV3FormatConversionContext_t& conversionCtx)
{
	{
		CKeyValues3Iterator it; // 1106
		{
			KeyValues3* pChildren; // 1108
			CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> > newChildrenToAdd; // 1112
			{
				int iChild; // 1113
				{
					KeyValues3* pGameDataChild; // 1115
					KeyValues3* pGameKeys; // 1122
					const char* pCarryTypeStr; // 1126
					const char* p_explosion_type; // 1135
					float fl_explosive_damage; // 1136
					float fl_explosive_radius; // 1137
					float fl_explosion_delay; // 1138
					const char* p_explosion_buildup; // 1139
					{
						KeyValues3* pVRCarryType; // 1129
						CUtlMemory<KeyValues3, int>::operator[](
								int i);  // 602
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
							int i);  // 1148
						Construct<KeyValues3>(KeyValues3* pMemory); // 1148
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
								int num);  // 1145
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 1129
						{
							const uint32  m; // 101
							uint32 h; // 102
							uint32 k; // 103
							const int  r; // 104
						}
						CUtlStringToken::CUtlStringToken(
								const char& str);  // 13
						CKV3MemberName::CKV3MemberName<7>(
									const char& str);  // 1130
						CKV3MemberName::CKV3MemberName<11>(
									const char& str);  // 1131
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1132
						CKV3MemberName::CKV3MemberName<11>(
									const char& str);  // 1132
					}
					{
						KeyValues3* pExplosionBehavior; // 1146
						CUtlMemory<KeyValues3, int>::operator[](
								int i);  // 602
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
							int i);  // 1148
						Construct<KeyValues3>(KeyValues3* pMemory); // 1148
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 824
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::GrowMemory(
								int num);  // 1145
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTail(); // 1156
						CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::AddToTailGetPtr(); // 1146
						{
							const uint32  m; // 101
							uint32 h; // 102
							uint32 k; // 103
							const int  r; // 104
						}
						CUtlStringToken::CUtlStringToken(
								const char& str);  // 13
						CKV3MemberName::CKV3MemberName<7>(
									const char& str);  // 1147
						CKV3MemberName::CKV3MemberName<11>(
									const char& str);  // 1148
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1149
						CKV3MemberName::CKV3MemberName<15>(
									const char& str);  // 1149
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1150
						CKV3MemberName::CKV3MemberName<17>(
									const char& str);  // 1150
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1151
						CKV3MemberName::CKV3MemberName<17>(
									const char& str);  // 1151
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1152
						CKV3MemberName::CKV3MemberName<16>(
									const char& str);  // 1152
						CKV3MemberName::CKV3MemberName<10>(
									const char& str);  // 1153
						CKV3MemberName::CKV3MemberName<18>(
									const char& str);  // 1153
					}
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 1119
					V_strcmp(const char* s1,
						const char* s2);  // 1119
					CKV3MemberName::CKV3MemberName<10>(
								const char& str);  // 1122
					CKV3MemberName::CKV3MemberName(
							const CKV3MemberName& rhs);  // 96
					KeyValues3::FindMember(
							CKV3MemberName memberName,
							KeyValues3* pDefaultValue);  // 1122
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 1126
					V_isempty(const char* pszString); // 1127
					V_strcmp(const char* s1,
						const char* s2);  // 1127
					CKV3MemberName::CKV3MemberName<15>(
								const char& str);  // 1135
					CKV3MemberName::CKV3MemberName<17>(
								const char& str);  // 1136
					CKV3MemberName::CKV3MemberName<17>(
								const char& str);  // 1137
					CKV3MemberName::CKV3MemberName<16>(
								const char& str);  // 1138
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 1139
					V_isempty(const char* pszString); // 1140
					V_isempty(const char* pszString); // 1144
					{
						const uint32  m; // 61
						uint32 h; // 62
						uint32 k; // 63
						const int  r; // 64
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<5>(
								const char& str);  // 1157
					{
						const uint32  m; // 146
						uint32 h; // 147
						uint32 k; // 148
						const int  r; // 149
					}
					CUtlStringToken::CUtlStringToken(
							const char& str);  // 13
					CKV3MemberName::CKV3MemberName<9>(
								const char& str);  // 1159
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 1160
					CKV3MemberName::CKV3MemberName<11>(
								const char& str);  // 1161
					CKV3MemberName::CKV3MemberName<15>(
								const char& str);  // 1162
					CKV3MemberName::CKV3MemberName<17>(
								const char& str);  // 1163
					CKV3MemberName::CKV3MemberName<17>(
								const char& str);  // 1164
					CKV3MemberName::CKV3MemberName<16>(
								const char& str);  // 1165
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 1166
					CKV3MemberName::CKV3MemberName<12>(
								const char& str);  // 1169
					CKV3MemberName::CKV3MemberName<18>(
								const char& str);  // 1170
				}
			}
			{
				const KeyValues3& childToCopy; // 1173
				CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >& __for_range; // 46703
				iterator __for_begin; // 58546
				iterator __for_end; // 58546
				{
					KeyValues3* pTargetChild; // 1175
				}
				CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::end(); // 1173
			}
			CKeyValues3Iterator::operator->(); // 1108
			CKV3MemberName::CKV3MemberName(
					const CKV3MemberName& rhs);  // 96
			KeyValues3::FindMember(
					CKV3MemberName memberName,
					KeyValues3* pDefaultValue);  // 1108
			CUtlStringToken::CUtlStringToken(
					const char& str);  // 13
			CKV3MemberName::CKV3MemberName<9>(
						const char& str);  // 1108
			CUtlMemory<KeyValues3, int>::ValidateGrowSize(); // 475
			CUtlMemory<KeyValues3, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::ResetDbgInfo(); // 530
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::CUtlVector(); // 1112
			{
				int i; // 1721
				CUtlMemory<KeyValues3, int>::operator[](
						int i);  // 602
				CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Element(
					int i);  // 1723
				Destruct<KeyValues3>(KeyValues3* pMemory); // 1723
			}
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::RemoveAll(); // 1798
			CUtlMemory<KeyValues3, int>::Purge(); // 903
			CUtlMemory<KeyValues3, int>::Purge(); // 1799
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::Purge(); // 560
			ValidateAlignment<KeyValues3>(void); // 508
			CUtlMemory<KeyValues3, int>::Purge(); // 510
			CUtlMemory<KeyValues3, int>::~CUtlMemory(); // 562
			CUtlVectorBase<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVectorBase(); // 410
			CUtlVector<KeyValues3, CUtlMemory<KeyValues3, int> >::~CUtlVector(); // 1178
		}
		RemoveAll(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1798
		AlignedByteArrayExplicit_t<4, CKeyValues3Iterator::StackEntry_t, 8>::Base(); // 237
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::IsExternallyAllocated(); // 577
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::ConvertToExternalMemory(
					StackEntry_t* pMemory,
					int numElements,
					int nCopyElements,
					bool bSetGrowable,
					uint32 nGrowable_GrowSize);  // 207
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 203
		CUtlMemoryFixedGrowable_Base<CKeyValues3Iterator::StackEntry_t, int>::Purge_FixedGrowable(
					StackEntry_t* pFixedMemory,
					int nFixedElements,
					int nPurgeToCount);  // 237
		CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int>::Purge(
			int numElements);  // 1799
		CUtlMemory<CKeyValues3Iterator::StackEntry_t, int>::Base(); // 112
		Base(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 368
		ResetDbgInfo(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 1800
		Purge(const CUtlVectorBase<CKeyValues3Iterator::StackEntry_t, CUtlMemoryFixedGrowable<CKeyValues3Iterator::StackEntry_t, 4, int this); // 560
