
//
// public/modellib/model_old_disk.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 57
//	class: 1
//	structs: 35
//

// <051A424E> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
inline void MaterialGroup_t::operator=(const MaterialGroup_t &)
{
} /* size: 0 */

// <051A4203> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
void MaterialGroup_t::MaterialGroup_t()
{
} /* size: 0 */

// <051A41E7> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
inline void MaterialGroup_t::MaterialGroup_t()
{
} /* size: 0 */

// <051A41D0> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
void MaterialGroup_t::~MaterialGroup_t()
{
} /* size: 0 */

// <051A41B4> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
inline void MaterialGroup_t::~MaterialGroup_t()
{
} /* size: 0 */

// <01827E9C> ../public/modellib/model_old_disk.h:20
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 40
struct MaterialGroup_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	MaterialGroup_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_CompileTimeVerificationFunction(MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:23 */
	MaterialGroup_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad(MaterialGroup_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave_MaterialGroup_t(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad_MaterialGroup_t(MaterialGroup_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void ~MaterialGroup_t(MaterialGroup_t* );
};

// <04B69FF1> ../public/modellib/model_old_disk.h:20
// member functions: 15
// member variables: 2
// static member variable: 1
// struct size: 40
struct MaterialGroup_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	MaterialGroup_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_CompileTimeVerificationFunction(MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:23 */
	MaterialGroup_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad(MaterialGroup_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave_MaterialGroup_t(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad_MaterialGroup_t(MaterialGroup_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void MaterialGroup_t(MaterialGroup_t* );
	void ~MaterialGroup_t(MaterialGroup_t* );
};

// <04E11236> ../public/modellib/model_old_disk.h:20
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 40
struct MaterialGroup_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	MaterialGroup_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_CompileTimeVerificationFunction(MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:23 */
	MaterialGroup_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad(MaterialGroup_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave_MaterialGroup_t(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad_MaterialGroup_t(MaterialGroup_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
};

// <04F88667> ../public/modellib/model_old_disk.h:20
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 40
struct MaterialGroup_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	MaterialGroup_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:22 */
	void Schema_CompileTimeVerificationFunction(MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialGroup_t* );
	/* ../public/modellib/model_old_disk.h:23 */
	MaterialGroup_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad(MaterialGroup_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave_MaterialGroup_t(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad_MaterialGroup_t(MaterialGroup_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	MaterialGroup_t& operator=(MaterialGroup_t* , const MaterialGroup_t& );
	void MaterialGroup_t(MaterialGroup_t* );
	void ~MaterialGroup_t(MaterialGroup_t* );
};

// <05148398> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:20
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 40
struct MaterialGroup_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	MaterialGroup_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	void Schema_CompileTimeVerificationFunction(MaterialGroup_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialGroup_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	MaterialGroup_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad(MaterialGroup_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	void KV3TransferSave_MaterialGroup_t(const MaterialGroup_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:23 */
	void KV3TransferLoad_MaterialGroup_t(MaterialGroup_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void ~MaterialGroup_t(MaterialGroup_t* );
	void MaterialGroup_t(MaterialGroup_t* );
	MaterialGroup_t& operator=(MaterialGroup_t* , const MaterialGroup_t& );
};

// <051A69B7> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <051A69B1> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <051A6998> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:22
inline void MaterialGroup_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <051A91EB> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
// function calls: 91
void ModelSkeletonData_t::operator=(const ModelSkeletonData_t &)
{
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Count(); // 573
	CUtlMemory<CUtlString, int>::Base(); // 112
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Base(); // 102
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::begin(); // 574
	CUtlMemory<CUtlString, int>::Base(); // 113
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Base(); // 105
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Count(); // 105
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::end(); // 574
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 209
	UtlTraitsCopyRange<CUtlString>(const CUtlString* pFrom,
					const CUtlString* pFromEnd,
					CUtlString* pTo);  // 200
	UtlTraitsCopyRange<CUtlString>(const CUtlString* pFrom,
					const CUtlString* pFromEnd,
					CUtlString* pTo);  // 574
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator=(
			const CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >& other);  // 565
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator=(
			const CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >& other);  // 452
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::operator=(
			const CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >& src);  // 29
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 573
	CUtlMemory<short int, int>::Base(); // 112
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 102
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::begin(); // 574
	CUtlMemory<short int, int>::Base(); // 113
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Base(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Count(); // 105
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 173
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 574
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 565
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVectorBase<short int, CUtlMemory<short int, int> >& other);  // 452
	CUtlVector<short int, CUtlMemory<short int, int> >::operator=(
			const CUtlVector<short int, CUtlMemory<short int, int> >& src);  // 29
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
	CUtlMemory<float, int>::Base(); // 112
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 102
	CUtlVectorBase<float, CUtlMemory<float, int> >::begin(); // 574
	CUtlMemory<float, int>::Base(); // 113
	CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
	CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 173
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 574
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
	CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
			const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
	CUtlVector<float, CUtlMemory<float, int> >::operator=(
			const CUtlVector<float, CUtlMemory<float, int> >& src);  // 29
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 573
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 102
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::begin(); // 574
	CUtlMemory<unsigned int, int>::Base(); // 113
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 173
	UtlTraitsCopyRange<unsigned int>(const unsigned int* pFrom,
					const unsigned int* pFromEnd,
					unsigned int* pTo);  // 574
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 565
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 452
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& src);  // 29
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Count(); // 573
	CUtlMemory<Vector, int>::Base(); // 112
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 102
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::begin(); // 574
	CUtlMemory<Vector, int>::Base(); // 113
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Base(); // 105
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Count(); // 105
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::end(); // 574
	Vector::operator=(
			const Vector& vOther);  // 209
	UtlTraitsCopyRange<Vector>(const Vector* pFrom,
					const Vector* pFromEnd,
					Vector* pTo);  // 200
	UtlTraitsCopyRange<Vector>(const Vector* pFrom,
					const Vector* pFromEnd,
					Vector* pTo);  // 574
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator=(
			const CUtlVectorBase<Vector, CUtlMemory<Vector, int> >& other);  // 565
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::operator=(
			const CUtlVectorBase<Vector, CUtlMemory<Vector, int> >& other);  // 452
	CUtlVector<Vector, CUtlMemory<Vector, int> >::operator=(
			const CUtlVector<Vector, CUtlMemory<Vector, int> >& src);  // 29
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Count(); // 573
	CUtlMemory<Quaternion, int>::Base(); // 112
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Base(); // 102
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::begin(); // 574
	CUtlMemory<Quaternion, int>::Base(); // 113
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Base(); // 105
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Count(); // 105
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<short int>(const short int* pFrom,
					const short int* pFromEnd,
					short int* pTo);  // 173
	UtlTraitsCopyRange<Quaternion>(const Quaternion* pFrom,
					const Quaternion* pFromEnd,
					Quaternion* pTo);  // 574
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::operator=(
			const CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >& other);  // 565
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::operator=(
			const CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >& other);  // 452
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> >::operator=(
			const CUtlVector<Quaternion, CUtlMemory<Quaternion, int> >& src);  // 29
} /* size: 659, inline expansions: 91 (2906 bytes) */

// <051A65EA> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
void ModelSkeletonData_t::ModelSkeletonData_t()
{
} /* size: 0 */

// <051A65CE> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
inline void ModelSkeletonData_t::ModelSkeletonData_t()
{
} /* size: 0 */

// <051A5A37> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
// variable: 1
// function calls: 61
void ModelSkeletonData_t::~ModelSkeletonData_t()
{
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::RemoveAll(); // 1798
	CUtlMemory<Quaternion, int>::IsExternallyAllocated(); // 905
	CUtlMemory<Quaternion, int>::Purge(); // 903
	CUtlMemory<Quaternion, int>::Purge(); // 1799
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Purge(); // 560
	ValidateAlignment<Quaternion>(void); // 508
	CUtlMemory<Quaternion, int>::Purge(); // 510
	CUtlMemory<Quaternion, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> >::~CUtlVector(); // 29
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::RemoveAll(); // 1798
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 905
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 29
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 29
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 29
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 29
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 29
} /* size: 339, inline expansions: 57 (1294 bytes) */

// <051A5A1B> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
inline void ModelSkeletonData_t::~ModelSkeletonData_t()
{
} /* size: 0 */

// <051A1E60> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
inline void ModelSkeletonData_t::operator=(const ModelSkeletonData_t &)
{
} /* size: 0 */

// <04BDDEAF> ../public/modellib/model_old_disk.h:29
void ModelSkeletonData_t::~ModelSkeletonData_t()
{
} /* size: 0 */

// <0180FADE> ../public/modellib/model_old_disk.h:29
// member functions: 15
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
	void ~ModelSkeletonData_t(ModelSkeletonData_t* );
	void ModelSkeletonData_t(ModelSkeletonData_t* );
};

// <04B50176> ../public/modellib/model_old_disk.h:29
// member functions: 15
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
	/* ../public/modellib/model_old_disk.h:39 */
	enum BoneFlags_t {
		FLAG_NO_BONE_FLAGS = 0,
		FLAG_BONEFLEXDRIVER = 4,
		FLAG_CLOTH = 8,
		FLAG_PHYSICS = 16,
		FLAG_ATTACHMENT = 32,
		FLAG_ANIMATION = 64,
		FLAG_MESH = 128,
		FLAG_HITBOX = 256,
		FLAG_RETARGET_SRC = 512,
		FLAG_BONE_USED_BY_VERTEX_LOD0 = 1024,
		FLAG_BONE_USED_BY_VERTEX_LOD1 = 2048,
		FLAG_BONE_USED_BY_VERTEX_LOD2 = 4096,
		FLAG_BONE_USED_BY_VERTEX_LOD3 = 8192,
		FLAG_BONE_USED_BY_VERTEX_LOD4 = 16384,
		FLAG_BONE_USED_BY_VERTEX_LOD5 = 32768,
		FLAG_BONE_USED_BY_VERTEX_LOD6 = 65536,
		FLAG_BONE_HIDDEN = 131072,
		FLAG_BONE_MERGE_READ = 262144,
		FLAG_BONE_MERGE_WRITE = 524288,
		FLAG_ALL_BONE_FLAGS = 1048575,
		BLEND_PREALIGNED = 1048576,
		FLAG_RIGIDLENGTH = 2097152,
		FLAG_PROCEDURAL = 4194304,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
	void ~ModelSkeletonData_t(ModelSkeletonData_t* );
	void ModelSkeletonData_t(ModelSkeletonData_t* );
};

// <04E06D41> ../public/modellib/model_old_disk.h:29
// member functions: 13
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
	/* ../public/modellib/model_old_disk.h:39 */
	enum BoneFlags_t {
		FLAG_NO_BONE_FLAGS = 0,
		FLAG_BONEFLEXDRIVER = 4,
		FLAG_CLOTH = 8,
		FLAG_PHYSICS = 16,
		FLAG_ATTACHMENT = 32,
		FLAG_ANIMATION = 64,
		FLAG_MESH = 128,
		FLAG_HITBOX = 256,
		FLAG_RETARGET_SRC = 512,
		FLAG_BONE_USED_BY_VERTEX_LOD0 = 1024,
		FLAG_BONE_USED_BY_VERTEX_LOD1 = 2048,
		FLAG_BONE_USED_BY_VERTEX_LOD2 = 4096,
		FLAG_BONE_USED_BY_VERTEX_LOD3 = 8192,
		FLAG_BONE_USED_BY_VERTEX_LOD4 = 16384,
		FLAG_BONE_USED_BY_VERTEX_LOD5 = 32768,
		FLAG_BONE_USED_BY_VERTEX_LOD6 = 65536,
		FLAG_BONE_HIDDEN = 131072,
		FLAG_BONE_MERGE_READ = 262144,
		FLAG_BONE_MERGE_WRITE = 524288,
		FLAG_ALL_BONE_FLAGS = 1048575,
		BLEND_PREALIGNED = 1048576,
		FLAG_RIGIDLENGTH = 2097152,
		FLAG_PROCEDURAL = 4194304,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
};

// <04F385DD> ../public/modellib/model_old_disk.h:29
// member functions: 13
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
};

// <05145188> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:29
// member functions: 16
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:39 */
	enum BoneFlags_t {
		FLAG_NO_BONE_FLAGS = 0,
		FLAG_BONEFLEXDRIVER = 4,
		FLAG_CLOTH = 8,
		FLAG_PHYSICS = 16,
		FLAG_ATTACHMENT = 32,
		FLAG_ANIMATION = 64,
		FLAG_MESH = 128,
		FLAG_HITBOX = 256,
		FLAG_RETARGET_SRC = 512,
		FLAG_BONE_USED_BY_VERTEX_LOD0 = 1024,
		FLAG_BONE_USED_BY_VERTEX_LOD1 = 2048,
		FLAG_BONE_USED_BY_VERTEX_LOD2 = 4096,
		FLAG_BONE_USED_BY_VERTEX_LOD3 = 8192,
		FLAG_BONE_USED_BY_VERTEX_LOD4 = 16384,
		FLAG_BONE_USED_BY_VERTEX_LOD5 = 32768,
		FLAG_BONE_USED_BY_VERTEX_LOD6 = 65536,
		FLAG_BONE_HIDDEN = 131072,
		FLAG_BONE_MERGE_READ = 262144,
		FLAG_BONE_MERGE_WRITE = 524288,
		FLAG_ALL_BONE_FLAGS = 1048575,
		BLEND_PREALIGNED = 1048576,
		FLAG_RIGIDLENGTH = 2097152,
		FLAG_PROCEDURAL = 4194304,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
	ModelSkeletonData_t& operator=(ModelSkeletonData_t* , const ModelSkeletonData_t& );
	void ~ModelSkeletonData_t(ModelSkeletonData_t* );
	void ModelSkeletonData_t(ModelSkeletonData_t* );
};

// <000FD00F> ../public/modellib/model_old_disk.h:29
// member functions: 14
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
	/* ../public/modellib/model_old_disk.h:39 */
	enum BoneFlags_t {
		FLAG_NO_BONE_FLAGS = 0,
		FLAG_BONEFLEXDRIVER = 4,
		FLAG_CLOTH = 8,
		FLAG_PHYSICS = 16,
		FLAG_ATTACHMENT = 32,
		FLAG_ANIMATION = 64,
		FLAG_MESH = 128,
		FLAG_HITBOX = 256,
		FLAG_RETARGET_SRC = 512,
		FLAG_BONE_USED_BY_VERTEX_LOD0 = 1024,
		FLAG_BONE_USED_BY_VERTEX_LOD1 = 2048,
		FLAG_BONE_USED_BY_VERTEX_LOD2 = 4096,
		FLAG_BONE_USED_BY_VERTEX_LOD3 = 8192,
		FLAG_BONE_USED_BY_VERTEX_LOD4 = 16384,
		FLAG_BONE_USED_BY_VERTEX_LOD5 = 32768,
		FLAG_BONE_USED_BY_VERTEX_LOD6 = 65536,
		FLAG_BONE_HIDDEN = 131072,
		FLAG_BONE_MERGE_READ = 262144,
		FLAG_BONE_MERGE_WRITE = 524288,
		FLAG_ALL_BONE_FLAGS = 1048575,
		BLEND_PREALIGNED = 1048576,
		FLAG_RIGIDLENGTH = 2097152,
		FLAG_PROCEDURAL = 4194304,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
	void ~ModelSkeletonData_t(ModelSkeletonData_t* );
};

// <0029CD89> ../public/modellib/model_old_disk.h:29
// member functions: 14
// member variables: 6
// static member variable: 1
// struct size: 192
struct ModelSkeletonData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	ModelSkeletonData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:31 */
	void Schema_CompileTimeVerificationFunction(ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:31 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelSkeletonData_t* );
	/* ../public/modellib/model_old_disk.h:32 */
	ModelSkeletonData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferSave_ModelSkeletonData_t(const ModelSkeletonData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:32 */
	void KV3TransferLoad_ModelSkeletonData_t(ModelSkeletonData_t* , CKV3TransferLoadContext* );
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 0 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParent; /* 32 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 64 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nFlag; /* 96 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 128 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 160 32 */
	void ~ModelSkeletonData_t(ModelSkeletonData_t* );
};

// <051A6973> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:31
inline void ModelSkeletonData_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <051A688C> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
void PermModelInfo_t::PermModelInfo_t()
{
} /* size: 0 */

// <051A6870> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
inline void PermModelInfo_t::PermModelInfo_t()
{
} /* size: 0 */

// <051A6859> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
void PermModelInfo_t::~PermModelInfo_t()
{
} /* size: 0 */

// <051A683D> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
inline void PermModelInfo_t::~PermModelInfo_t()
{
} /* size: 0 */

// <0519918E> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
inline void PermModelInfo_t::operator=(const PermModelInfo_t &)
{
} /* size: 0 */

// <0181A9C1> ../public/modellib/model_old_disk.h:81
// member functions: 15
// member variables: 10
// static member variable: 1
// struct size: 88
struct PermModelInfo_t {
	uint32 m_nFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	PermModelInfo_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_CompileTimeVerificationFunction(PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:131 */
	PermModelInfo_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad(PermModelInfo_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave_PermModelInfo_t(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad_PermModelInfo_t(PermModelInfo_t* , CKV3TransferLoadContext* );
	void ~PermModelInfo_t(PermModelInfo_t* );
	void PermModelInfo_t(PermModelInfo_t* );
};

// <04B5F361> ../public/modellib/model_old_disk.h:81
// member functions: 14
// member variables: 10
// static member variable: 1
// struct size: 88
struct PermModelInfo_t {
	/* ../public/modellib/model_old_disk.h:83 */
	enum FlagEnum {
		FLAG_TRANSLUCENT = 1,
		FLAG_TRANSLUCENT_TWO_PASS = 2,
		FLAG_MODEL_IS_RUNTIME_COMBINED = 4,
		FLAG_SOURCE1_IMPORT = 8,
		FLAG_MODEL_PART_CHILD = 16,
		FLAG_NAV_GEN_NONE = 32,
		FLAG_NAV_GEN_HULL = 64,
		FLAG_NO_FORCED_FADE = 2048,
		FLAG_HAS_SKINNED_MESHES = 1024,
		FLAG_DO_NOT_CAST_SHADOWS = 131072,
		FLAG_FORCE_PHONEME_CROSSFADE = 4096,
		FLAG_NO_ANIM_EVENTS = 1048576,
		FLAG_ANIMATION_DRIVEN_FLEXES = 2097152,
		FLAG_IMPLICIT_BIND_POSE_SEQUENCE = 4194304,
		FLAG_MODEL_DOC = 8388608,
	};
	uint32 m_nFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	PermModelInfo_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_CompileTimeVerificationFunction(PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:131 */
	PermModelInfo_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad(PermModelInfo_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave_PermModelInfo_t(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad_PermModelInfo_t(PermModelInfo_t* , CKV3TransferLoadContext* );
	void PermModelInfo_t(PermModelInfo_t* );
};

// <04E113E7> ../public/modellib/model_old_disk.h:81
// member functions: 13
// member variables: 10
// static member variable: 1
// struct size: 88
struct PermModelInfo_t {
	/* ../public/modellib/model_old_disk.h:83 */
	enum FlagEnum {
		FLAG_TRANSLUCENT = 1,
		FLAG_TRANSLUCENT_TWO_PASS = 2,
		FLAG_MODEL_IS_RUNTIME_COMBINED = 4,
		FLAG_SOURCE1_IMPORT = 8,
		FLAG_MODEL_PART_CHILD = 16,
		FLAG_NAV_GEN_NONE = 32,
		FLAG_NAV_GEN_HULL = 64,
		FLAG_NO_FORCED_FADE = 2048,
		FLAG_HAS_SKINNED_MESHES = 1024,
		FLAG_DO_NOT_CAST_SHADOWS = 131072,
		FLAG_FORCE_PHONEME_CROSSFADE = 4096,
		FLAG_NO_ANIM_EVENTS = 1048576,
		FLAG_ANIMATION_DRIVEN_FLEXES = 2097152,
		FLAG_IMPLICIT_BIND_POSE_SEQUENCE = 4194304,
		FLAG_MODEL_DOC = 8388608,
	};
	uint32 m_nFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	PermModelInfo_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_CompileTimeVerificationFunction(PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:131 */
	PermModelInfo_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad(PermModelInfo_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave_PermModelInfo_t(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad_PermModelInfo_t(PermModelInfo_t* , CKV3TransferLoadContext* );
};

// <051485C5> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:81
// member functions: 16
// member variables: 10
// static member variable: 1
// struct size: 88
struct PermModelInfo_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:83 */
	enum FlagEnum {
		FLAG_TRANSLUCENT = 1,
		FLAG_TRANSLUCENT_TWO_PASS = 2,
		FLAG_MODEL_IS_RUNTIME_COMBINED = 4,
		FLAG_SOURCE1_IMPORT = 8,
		FLAG_MODEL_PART_CHILD = 16,
		FLAG_NAV_GEN_NONE = 32,
		FLAG_NAV_GEN_HULL = 64,
		FLAG_NO_FORCED_FADE = 2048,
		FLAG_HAS_SKINNED_MESHES = 1024,
		FLAG_DO_NOT_CAST_SHADOWS = 131072,
		FLAG_FORCE_PHONEME_CROSSFADE = 4096,
		FLAG_NO_ANIM_EVENTS = 1048576,
		FLAG_ANIMATION_DRIVEN_FLEXES = 2097152,
		FLAG_IMPLICIT_BIND_POSE_SEQUENCE = 4194304,
		FLAG_MODEL_DOC = 8388608,
	};
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
	uint32 m_nFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	PermModelInfo_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	void Schema_CompileTimeVerificationFunction(PermModelInfo_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelInfo_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	PermModelInfo_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad(PermModelInfo_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave_PermModelInfo_t(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad_PermModelInfo_t(PermModelInfo_t* , CKV3TransferLoadContext* );
	PermModelInfo_t& operator=(PermModelInfo_t* , const PermModelInfo_t& );
	void ~PermModelInfo_t(PermModelInfo_t* );
	void PermModelInfo_t(PermModelInfo_t* );
};

// <0012392F> ../public/modellib/model_old_disk.h:81
// member functions: 14
// member variables: 10
// static member variable: 1
// struct size: 88
struct PermModelInfo_t {
	/* ../public/modellib/model_old_disk.h:83 */
	enum FlagEnum {
		FLAG_TRANSLUCENT = 1,
		FLAG_TRANSLUCENT_TWO_PASS = 2,
		FLAG_MODEL_IS_RUNTIME_COMBINED = 4,
		FLAG_SOURCE1_IMPORT = 8,
		FLAG_MODEL_PART_CHILD = 16,
		FLAG_NAV_GEN_NONE = 32,
		FLAG_NAV_GEN_HULL = 64,
		FLAG_NO_FORCED_FADE = 2048,
		FLAG_HAS_SKINNED_MESHES = 1024,
		FLAG_DO_NOT_CAST_SHADOWS = 131072,
		FLAG_FORCE_PHONEME_CROSSFADE = 4096,
		FLAG_NO_ANIM_EVENTS = 1048576,
		FLAG_ANIMATION_DRIVEN_FLEXES = 2097152,
		FLAG_IMPLICIT_BIND_POSE_SEQUENCE = 4194304,
		FLAG_MODEL_DOC = 8388608,
	};
	uint32 m_nFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	PermModelInfo_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:130 */
	void Schema_CompileTimeVerificationFunction(PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:130 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelInfo_t* );
	/* ../public/modellib/model_old_disk.h:131 */
	PermModelInfo_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad(PermModelInfo_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferSave_PermModelInfo_t(const PermModelInfo_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:131 */
	void KV3TransferLoad_PermModelInfo_t(PermModelInfo_t* , CKV3TransferLoadContext* );
	void ~PermModelInfo_t(PermModelInfo_t* );
};

// <051A694E> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:130
inline void PermModelInfo_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <0519342A> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
inline void PermModelExtPart_t::operator=(const PermModelExtPart_t &)
{
} /* size: 0 */

// <05193413> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
void PermModelExtPart_t::PermModelExtPart_t()
{
} /* size: 0 */

// <051933F7> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
inline void PermModelExtPart_t::PermModelExtPart_t()
{
} /* size: 0 */

// <051933E0> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
void PermModelExtPart_t::~PermModelExtPart_t()
{
} /* size: 0 */

// <051933C4> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
inline void PermModelExtPart_t::~PermModelExtPart_t()
{
} /* size: 0 */

// <01828069> ../public/modellib/model_old_disk.h:137
// member functions: 14
// member variables: 4
// static member variable: 1
// struct size: 64
struct PermModelExtPart_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	PermModelExtPart_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_CompileTimeVerificationFunction(PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:140 */
	PermModelExtPart_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad(PermModelExtPart_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave_PermModelExtPart_t(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad_PermModelExtPart_t(PermModelExtPart_t* , CKV3TransferLoadContext* );
	CTransform m_Transform __attribute__((__aligned__(16))); /* 0 32 */
	CUtlString m_Name; /* 32 8 */
	int32 m_nParent; /* 40 4 */
	HModelStrong m_refModel; /* 48 8 */
	void ~PermModelExtPart_t(PermModelExtPart_t* );
} __attribute__((__aligned__(16)));

// <04B6A1D9> ../public/modellib/model_old_disk.h:137
// member functions: 13
// member variables: 4
// static member variable: 1
// struct size: 64
struct PermModelExtPart_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	PermModelExtPart_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_CompileTimeVerificationFunction(PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:140 */
	PermModelExtPart_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad(PermModelExtPart_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave_PermModelExtPart_t(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad_PermModelExtPart_t(PermModelExtPart_t* , CKV3TransferLoadContext* );
	CTransform m_Transform __attribute__((__aligned__(16))); /* 0 32 */
	CUtlString m_Name; /* 32 8 */
	int32 m_nParent; /* 40 4 */
	HModelStrong m_refModel; /* 48 8 */
} __attribute__((__aligned__(16)));

// <04F88A93> ../public/modellib/model_old_disk.h:137
// member functions: 16
// member variables: 4
// static member variable: 1
// struct size: 64
struct PermModelExtPart_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	PermModelExtPart_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:139 */
	void Schema_CompileTimeVerificationFunction(PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelExtPart_t* );
	/* ../public/modellib/model_old_disk.h:140 */
	PermModelExtPart_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad(PermModelExtPart_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave_PermModelExtPart_t(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad_PermModelExtPart_t(PermModelExtPart_t* , CKV3TransferLoadContext* );
	CTransform m_Transform __attribute__((__aligned__(16))); /* 0 32 */
	CUtlString m_Name; /* 32 8 */
	int32 m_nParent; /* 40 4 */
	HModelStrong m_refModel; /* 48 8 */
	PermModelExtPart_t& operator=(PermModelExtPart_t* , const PermModelExtPart_t& );
	void PermModelExtPart_t(PermModelExtPart_t* );
	void ~PermModelExtPart_t(PermModelExtPart_t* );
} __attribute__((__aligned__(16)));

// <051488DF> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:137
// member functions: 16
// member variables: 4
// static member variable: 1
// struct size: 64
struct PermModelExtPart_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	PermModelExtPart_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	void Schema_CompileTimeVerificationFunction(PermModelExtPart_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelExtPart_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	PermModelExtPart_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad(PermModelExtPart_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	void KV3TransferSave_PermModelExtPart_t(const PermModelExtPart_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:140 */
	void KV3TransferLoad_PermModelExtPart_t(PermModelExtPart_t* , CKV3TransferLoadContext* );
	CTransform m_Transform __attribute__((__aligned__(16))); /* 0 32 */
	CUtlString m_Name; /* 32 8 */
	int32 m_nParent; /* 40 4 */
	HModelStrong m_refModel; /* 48 8 */
	void ~PermModelExtPart_t(PermModelExtPart_t* );
	void PermModelExtPart_t(PermModelExtPart_t* );
	PermModelExtPart_t& operator=(PermModelExtPart_t* , const PermModelExtPart_t& );
} __attribute__((__aligned__(16)));

// <051A6929> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:139
inline void PermModelExtPart_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <051A6912> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:160
inline void Get(ISchemaSystemTypeScope* pTypeScope)
{
} /* size: 0 */

// <04F88CE7> ../public/modellib/model_old_disk.h:160
// member functions: 2
// class size: 1
class CSchemaTypeOf<ModelBoneFlexComponent_t> {
	/* ../public/modellib/model_old_disk.h:160 */
	CSchemaType* Get(ISchemaSystemTypeScope* );
	/* ../public/modellib/model_old_disk.h:160 */
	const char* GetEnumName(void);
};

// <05190928> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
inline void ModelBoneFlexDriverControl_t::operator=(const ModelBoneFlexDriverControl_t &)
{
} /* size: 0 */

// <05190911> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
void ModelBoneFlexDriverControl_t::ModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <051908F5> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
inline void ModelBoneFlexDriverControl_t::ModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <051908DE> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
void ModelBoneFlexDriverControl_t::~ModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <051908C2> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
inline void ModelBoneFlexDriverControl_t::~ModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <018282A5> ../public/modellib/model_old_disk.h:165
// member functions: 14
// member variables: 5
// static member variable: 1
// struct size: 32
struct ModelBoneFlexDriverControl_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	ModelBoneFlexDriverControl_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:168 */
	ModelBoneFlexDriverControl_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave_ModelBoneFlexDriverControl_t(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad_ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	ModelBoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	uint32 m_flexControllerToken; /* 16 4 */
	float m_flMin; /* 20 4 */
	float m_flMax; /* 24 4 */
	void ~ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
};

// <04B6A3F0> ../public/modellib/model_old_disk.h:165
// member functions: 15
// member variables: 5
// static member variable: 1
// struct size: 32
struct ModelBoneFlexDriverControl_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	ModelBoneFlexDriverControl_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:168 */
	ModelBoneFlexDriverControl_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave_ModelBoneFlexDriverControl_t(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad_ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	ModelBoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	uint32 m_flexControllerToken; /* 16 4 */
	float m_flMin; /* 20 4 */
	float m_flMax; /* 24 4 */
	void ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
	void ~ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
};

// <04E1189D> ../public/modellib/model_old_disk.h:165
// member functions: 13
// member variables: 5
// static member variable: 1
// struct size: 32
struct ModelBoneFlexDriverControl_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	ModelBoneFlexDriverControl_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:168 */
	ModelBoneFlexDriverControl_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave_ModelBoneFlexDriverControl_t(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad_ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	ModelBoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	uint32 m_flexControllerToken; /* 16 4 */
	float m_flMin; /* 20 4 */
	float m_flMax; /* 24 4 */
};

// <04F88D2A> ../public/modellib/model_old_disk.h:165
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 32
struct ModelBoneFlexDriverControl_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	ModelBoneFlexDriverControl_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:167 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriverControl_t* );
	/* ../public/modellib/model_old_disk.h:168 */
	ModelBoneFlexDriverControl_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave_ModelBoneFlexDriverControl_t(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad_ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	ModelBoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	uint32 m_flexControllerToken; /* 16 4 */
	float m_flMin; /* 20 4 */
	float m_flMax; /* 24 4 */
	ModelBoneFlexDriverControl_t& operator=(ModelBoneFlexDriverControl_t* , const ModelBoneFlexDriverControl_t& );
	void ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
	void ~ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
};

// <05148BBA> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:165
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 32
struct ModelBoneFlexDriverControl_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	ModelBoneFlexDriverControl_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriverControl_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriverControl_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	ModelBoneFlexDriverControl_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	void KV3TransferSave_ModelBoneFlexDriverControl_t(const ModelBoneFlexDriverControl_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:168 */
	void KV3TransferLoad_ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* , CKV3TransferLoadContext* );
	ModelBoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	uint32 m_flexControllerToken; /* 16 4 */
	float m_flMin; /* 20 4 */
	float m_flMax; /* 24 4 */
	void ~ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
	void ModelBoneFlexDriverControl_t(ModelBoneFlexDriverControl_t* );
	ModelBoneFlexDriverControl_t& operator=(ModelBoneFlexDriverControl_t* , const ModelBoneFlexDriverControl_t& );
};

// <051A68ED> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:167
inline void ModelBoneFlexDriverControl_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <0518CF6D> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
inline void ModelBoneFlexDriver_t::operator=(const ModelBoneFlexDriver_t &)
{
} /* size: 0 */

// <0518CF22> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
void ModelBoneFlexDriver_t::ModelBoneFlexDriver_t()
{
} /* size: 0 */

// <0518CF06> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
inline void ModelBoneFlexDriver_t::ModelBoneFlexDriver_t()
{
} /* size: 0 */

// <0518CEEF> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
void ModelBoneFlexDriver_t::~ModelBoneFlexDriver_t()
{
} /* size: 0 */

// <0518CED3> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
inline void ModelBoneFlexDriver_t::~ModelBoneFlexDriver_t()
{
} /* size: 0 */

// <01828499> ../public/modellib/model_old_disk.h:181
// member functions: 14
// member variables: 3
// static member variable: 1
// struct size: 48
struct ModelBoneFlexDriver_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	ModelBoneFlexDriver_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:184 */
	ModelBoneFlexDriver_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave_ModelBoneFlexDriver_t(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad_ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	uint32 m_boneNameToken; /* 8 4 */
	CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> > m_controls; /* 16 32 */
	void ~ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
};

// <04B6A5FF> ../public/modellib/model_old_disk.h:181
// member functions: 15
// member variables: 3
// static member variable: 1
// struct size: 48
struct ModelBoneFlexDriver_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	ModelBoneFlexDriver_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:184 */
	ModelBoneFlexDriver_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave_ModelBoneFlexDriver_t(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad_ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	uint32 m_boneNameToken; /* 8 4 */
	CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> > m_controls; /* 16 32 */
	void ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
	void ~ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
};

// <04E11A75> ../public/modellib/model_old_disk.h:181
// member functions: 13
// member variables: 3
// static member variable: 1
// struct size: 48
struct ModelBoneFlexDriver_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	ModelBoneFlexDriver_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:184 */
	ModelBoneFlexDriver_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave_ModelBoneFlexDriver_t(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad_ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	uint32 m_boneNameToken; /* 8 4 */
	CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> > m_controls; /* 16 32 */
};

// <04F88F5D> ../public/modellib/model_old_disk.h:181
// member functions: 16
// member variables: 3
// static member variable: 1
// struct size: 48
struct ModelBoneFlexDriver_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	ModelBoneFlexDriver_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:183 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriver_t* );
	/* ../public/modellib/model_old_disk.h:184 */
	ModelBoneFlexDriver_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave_ModelBoneFlexDriver_t(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad_ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	uint32 m_boneNameToken; /* 8 4 */
	CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> > m_controls; /* 16 32 */
	ModelBoneFlexDriver_t& operator=(ModelBoneFlexDriver_t* , const ModelBoneFlexDriver_t& );
	void ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
	void ~ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
};

// <05148E09> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:181
// member functions: 16
// member variables: 3
// static member variable: 1
// struct size: 48
struct ModelBoneFlexDriver_t {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	ModelBoneFlexDriver_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	void Schema_CompileTimeVerificationFunction(ModelBoneFlexDriver_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183 */
	const CSchemaClassInfo* Schema_DynamicBinding(const ModelBoneFlexDriver_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	ModelBoneFlexDriver_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	void KV3TransferSave_ModelBoneFlexDriver_t(const ModelBoneFlexDriver_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:184 */
	void KV3TransferLoad_ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	uint32 m_boneNameToken; /* 8 4 */
	CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> > m_controls; /* 16 32 */
	void ~ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
	void ModelBoneFlexDriver_t(ModelBoneFlexDriver_t* );
	ModelBoneFlexDriver_t& operator=(ModelBoneFlexDriver_t* , const ModelBoneFlexDriver_t& );
};

// <051A68C8> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:183
inline void ModelBoneFlexDriver_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05189E59> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:195
inline void PermModelData_t::operator=(const PermModelData_t &)
{
} /* size: 0 */

// <05186F7E> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:195
// variables: 12
// function calls: 237
void PermModelData_t::~PermModelData_t()
{
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<ModelBoneFlexDriver_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::Element(
			int i);  // 1723
		{
			int i; // 1721
			CUtlMemory<ModelBoneFlexDriverControl_t, int>::operator[](
					int i);  // 602
			CUtlVectorBase<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> >::Element(
				int i);  // 1723
			CUtlString::~CUtlString(); // 165
			ModelBoneFlexDriverControl_t::~ModelBoneFlexDriverControl_t(); // 1526
			Destruct<ModelBoneFlexDriverControl_t>(ModelBoneFlexDriverControl_t* pMemory); // 1723
		}
		CUtlVectorBase<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> >::RemoveAll(); // 1798
		CUtlMemory<ModelBoneFlexDriverControl_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<ModelBoneFlexDriverControl_t, int>::Purge(); // 903
		CUtlMemory<ModelBoneFlexDriverControl_t, int>::Purge(); // 1799
		CUtlVectorBase<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> >::Purge(); // 560
		ValidateAlignment<ModelBoneFlexDriverControl_t>(void); // 508
		CUtlMemory<ModelBoneFlexDriverControl_t, int>::Purge(); // 510
		CUtlMemory<ModelBoneFlexDriverControl_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<ModelBoneFlexDriverControl_t, CUtlMemory<ModelBoneFlexDriverControl_t, int> >::~CUtlVector(); // 181
		CUtlString::~CUtlString(); // 181
		ModelBoneFlexDriver_t::~ModelBoneFlexDriver_t(); // 1526
		Destruct<ModelBoneFlexDriver_t>(ModelBoneFlexDriver_t* pMemory); // 1723
	}
	CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::RemoveAll(); // 1798
	CUtlMemory<ModelBoneFlexDriver_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 903
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 1799
	CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::Purge(); // 560
	ValidateAlignment<ModelBoneFlexDriver_t>(void); // 508
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 510
	CUtlMemory<ModelBoneFlexDriver_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::~CUtlVector(); // 195
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<short unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short unsigned int, int>::Purge(); // 903
	CUtlMemory<short unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::Purge(); // 560
	ValidateAlignment<short unsigned int>(void); // 508
	CUtlMemory<short unsigned int, int>::Purge(); // 510
	CUtlMemory<short unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> >::~CUtlVector(); // 195
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<MaterialGroup_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::Element(
			int i);  // 1723
		{
			int i; // 1721
			CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::operator[](
					int i);  // 602
			Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2 this,
				int i);  // 1723
			CStrongHandle<InfoForResourceTypeIMaterial2>::~CStrongHandle(); // 1526
			Destruct<CStrongHandle<InfoForResourceTypeIMaterial2> >(CStrongHandle<InfoForResourceTypeIMaterial2>* pMemory); // 1723
		}
		RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2 this); // 1798
		CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::Purge(); // 903
		CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::Purge(); // 1799
		Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2 this); // 560
		ValidateAlignment<CStrongHandle<InfoForResourceTypeIMaterial2> >(void); // 508
		CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::Purge(); // 510
		CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int>::~CUtlMemory(); // 562
		~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2 this); // 410
		~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, i this); // 20
		CUtlString::~CUtlString(); // 20
		MaterialGroup_t::~MaterialGroup_t(); // 1526
		Destruct<MaterialGroup_t>(MaterialGroup_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialGroup_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 903
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialGroup_t>(void); // 508
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 510
	CUtlMemory<MaterialGroup_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCSequenceGroupData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCSequenceGroupData> >(CStrongHandle<InfoForResourceTypeCSequenceGroupData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCSequenceGroupData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSeque this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCAnimationGroup>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCAnimationGroup> >(CStrongHandle<InfoForResourceTypeCAnimationGroup>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCAnimationGroup> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimatio this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCPhysAggregateData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(CStrongHandle<InfoForResourceTypeCPhysAggregateData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysA this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCPhysAggregateData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(CStrongHandle<InfoForResourceTypeCPhysAggregateData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysA this); // 195
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 195
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 1799
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::Purge(); // 560
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> >::~CUtlVector(); // 195
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 195
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCRenderMesh>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCRenderMesh> >(CStrongHandle<InfoForResourceTypeCRenderMesh>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCRenderMesh> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, this); // 195
	{
		int i; // 1721
		CUtlMemory<PermModelExtPart_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCModel>::~CStrongHandle(); // 137
		CUtlString::~CUtlString(); // 137
		PermModelExtPart_t::~PermModelExtPart_t(); // 1526
		Destruct<PermModelExtPart_t>(PermModelExtPart_t* pMemory); // 1723
	}
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::RemoveAll(); // 1798
	CUtlMemory<PermModelExtPart_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 903
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 1799
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::Purge(); // 560
	ValidateAlignment<PermModelExtPart_t>(void); // 508
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 510
	CUtlMemory<PermModelExtPart_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::~CUtlVector(); // 195
	CUtlString::~CUtlString(); // 81
	CUtlString::~CUtlString(); // 81
	PermModelInfo_t::~PermModelInfo_t(); // 195
	CUtlString::~CUtlString(); // 195
} /* size: 1757, inline expansions: 164 (6922 bytes) */

// <05186F62> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:195
inline void PermModelData_t::~PermModelData_t()
{
} /* size: 0 */

// <01861B84> ../public/modellib/model_old_disk.h:195
void PermModelData_t::~PermModelData_t()
{
} /* size: 0 */

// <003691CE> ../public/modellib/model_old_disk.h:195
// variables: 9
// function calls: 261
void PermModelData_t::~PermModelData_t()
{
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 195
	CUtlMemory<ModelBoneFlexDriver_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 903
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 1799
	CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::Purge(); // 560
	ValidateAlignment<ModelBoneFlexDriver_t>(void); // 508
	CUtlMemory<ModelBoneFlexDriver_t, int>::Purge(); // 510
	CUtlMemory<ModelBoneFlexDriver_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> >::~CUtlVector(); // 195
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<short unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short unsigned int, int>::Purge(); // 903
	CUtlMemory<short unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::Purge(); // 560
	ValidateAlignment<short unsigned int>(void); // 508
	CUtlMemory<short unsigned int, int>::Purge(); // 510
	CUtlMemory<short unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short unsigned int, CUtlMemory<short unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> >::~CUtlVector(); // 195
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 195
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::RemoveAll(); // 1798
	CUtlMemory<Quaternion, int>::IsExternallyAllocated(); // 905
	CUtlMemory<Quaternion, int>::Purge(); // 903
	CUtlMemory<Quaternion, int>::Purge(); // 1799
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::Purge(); // 560
	ValidateAlignment<Quaternion>(void); // 508
	CUtlMemory<Quaternion, int>::Purge(); // 510
	CUtlMemory<Quaternion, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Quaternion, CUtlMemory<Quaternion, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> >::~CUtlVector(); // 29
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::RemoveAll(); // 1798
	CUtlMemory<Vector, int>::IsExternallyAllocated(); // 905
	CUtlMemory<Vector, int>::Purge(); // 903
	CUtlMemory<Vector, int>::Purge(); // 1799
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::Purge(); // 560
	ValidateAlignment<Vector>(void); // 508
	CUtlMemory<Vector, int>::Purge(); // 510
	CUtlMemory<Vector, int>::~CUtlMemory(); // 562
	CUtlVectorBase<Vector, CUtlMemory<Vector, int> >::~CUtlVectorBase(); // 410
	CUtlVector<Vector, CUtlMemory<Vector, int> >::~CUtlVector(); // 29
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 29
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 29
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::RemoveAll(); // 1798
	CUtlMemory<short int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<short int, int>::Purge(); // 903
	CUtlMemory<short int, int>::Purge(); // 1799
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::Purge(); // 560
	ValidateAlignment<short int>(void); // 508
	CUtlMemory<short int, int>::Purge(); // 510
	CUtlMemory<short int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<short int, CUtlMemory<short int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<short int, CUtlMemory<short int, int> >::~CUtlVector(); // 29
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 29
	ModelSkeletonData_t::~ModelSkeletonData_t(); // 195
	CUtlMemory<MaterialGroup_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 903
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialGroup_t>(void); // 508
	CUtlMemory<MaterialGroup_t, int>::Purge(); // 510
	CUtlMemory<MaterialGroup_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCSequenceGroupData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCSequenceGroupData> >(CStrongHandle<InfoForResourceTypeCSequenceGroupData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCSequenceGroupData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCS this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSeque this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCAnimationGroup>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCAnimationGroup> >(CStrongHandle<InfoForResourceTypeCAnimationGroup>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCAnimationGroup> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnim this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimatio this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCPhysAggregateData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(CStrongHandle<InfoForResourceTypeCPhysAggregateData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysA this); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCPhysAggregateData>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(CStrongHandle<InfoForResourceTypeCPhysAggregateData>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCPhysAggregateData> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCP this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysA this); // 195
	CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
	CUtlMemory<float, int>::IsExternallyAllocated(); // 905
	CUtlMemory<float, int>::Purge(); // 903
	CUtlMemory<float, int>::Purge(); // 1799
	CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
	ValidateAlignment<float>(void); // 508
	CUtlMemory<float, int>::Purge(); // 510
	CUtlMemory<float, int>::~CUtlMemory(); // 562
	CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
	CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 195
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 1799
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::Purge(); // 560
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> >::~CUtlVector(); // 195
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 195
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<long long unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<long long unsigned int, int>::Purge(); // 903
	CUtlMemory<long long unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::Purge(); // 560
	ValidateAlignment<long long unsigned int>(void); // 508
	CUtlMemory<long long unsigned int, int>::Purge(); // 510
	CUtlMemory<long long unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> >::~CUtlVector(); // 195
	{
		int i; // 1721
		CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this,
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCRenderMesh>::~CStrongHandle(); // 1526
		Destruct<CStrongHandle<InfoForResourceTypeCRenderMesh> >(CStrongHandle<InfoForResourceTypeCRenderMesh>* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 1798
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 903
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 560
	ValidateAlignment<CStrongHandle<InfoForResourceTypeCRenderMesh> >(void); // 508
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::Purge(); // 510
	CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMe this); // 410
	~CUtlVector(const CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, this); // 195
	{
		int i; // 1721
		CUtlMemory<PermModelExtPart_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCModel>::~CStrongHandle(); // 137
		CUtlString::~CUtlString(); // 137
		PermModelExtPart_t::~PermModelExtPart_t(); // 1526
		Destruct<PermModelExtPart_t>(PermModelExtPart_t* pMemory); // 1723
	}
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::RemoveAll(); // 1798
	CUtlMemory<PermModelExtPart_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 903
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 1799
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::Purge(); // 560
	ValidateAlignment<PermModelExtPart_t>(void); // 508
	CUtlMemory<PermModelExtPart_t, int>::Purge(); // 510
	CUtlMemory<PermModelExtPart_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::~CUtlVector(); // 195
	CUtlString::~CUtlString(); // 81
	CUtlString::~CUtlString(); // 81
	PermModelInfo_t::~PermModelInfo_t(); // 195
	CUtlString::~CUtlString(); // 195
} /* size: 1545, inline expansions: 223 (6550 bytes) */

// <01827B67> ../public/modellib/model_old_disk.h:195
// member functions: 15
// member variables: 20
// static member variable: 1
// struct size: 808
struct PermModelData_t {
	/* ../public/modellib/model_old_disk.h:198 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	PermModelData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_CompileTimeVerificationFunction(PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:198 */
	PermModelData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave_PermModelData_t(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad_PermModelData_t(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:200 */
	void PermModelData_t(PermModelData_t* );
	CUtlString m_name; /* 0 8 */
	PermModelInfo_t m_modelInfo; /* 8 88 */
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> > m_ExtParts; /* 96 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int> > m_refMeshes; /* 128 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 160 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refPhysGroupMasks; /* 192 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 224 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 256 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsData; /* 288 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsHitboxData; /* 320 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_refAnimGroups; /* 352 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int> > m_refSequenceGroups; /* 384 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 416 32 */
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> > m_materialGroups; /* 448 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask __attribute__((__aligned__(8))); /* 480 8 */
	ModelSkeletonData_t m_modelSkeleton; /* 488 192 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_remappingTable; /* 680 32 */
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> > m_remappingTableStarts; /* 712 32 */
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 744 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 776 32 */
	void ~PermModelData_t(PermModelData_t* );
} __attribute__((__aligned__(8)));

// <04B69CE9> ../public/modellib/model_old_disk.h:195
// member functions: 14
// member variables: 20
// static member variable: 1
// struct size: 808
struct PermModelData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	PermModelData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_CompileTimeVerificationFunction(PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:198 */
	PermModelData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave_PermModelData_t(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad_PermModelData_t(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:200 */
	void PermModelData_t(PermModelData_t* );
	CUtlString m_name; /* 0 8 */
	PermModelInfo_t m_modelInfo; /* 8 88 */
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> > m_ExtParts; /* 96 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int> > m_refMeshes; /* 128 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 160 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refPhysGroupMasks; /* 192 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 224 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 256 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsData; /* 288 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsHitboxData; /* 320 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_refAnimGroups; /* 352 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int> > m_refSequenceGroups; /* 384 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 416 32 */
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> > m_materialGroups; /* 448 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask __attribute__((__aligned__(8))); /* 480 8 */
	ModelSkeletonData_t m_modelSkeleton; /* 488 192 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_remappingTable; /* 680 32 */
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> > m_remappingTableStarts; /* 712 32 */
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 744 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 776 32 */
} __attribute__((__aligned__(8)));

// <0514A751> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:195
// member functions: 16
// member variables: 20
// static member variable: 1
// struct size: 808
struct PermModelData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	PermModelData_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	void Schema_CompileTimeVerificationFunction(PermModelData_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelData_t* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:198 */
	PermModelData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave_PermModelData_t(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad_PermModelData_t(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:200 */
	void PermModelData_t(PermModelData_t* );
	CUtlString m_name; /* 0 8 */
	PermModelInfo_t m_modelInfo; /* 8 88 */
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> > m_ExtParts; /* 96 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int> > m_refMeshes; /* 128 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 160 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refPhysGroupMasks; /* 192 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 224 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 256 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsData; /* 288 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsHitboxData; /* 320 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_refAnimGroups; /* 352 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int> > m_refSequenceGroups; /* 384 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 416 32 */
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> > m_materialGroups; /* 448 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask __attribute__((__aligned__(8))); /* 480 8 */
	ModelSkeletonData_t m_modelSkeleton; /* 488 192 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_remappingTable; /* 680 32 */
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> > m_remappingTableStarts; /* 712 32 */
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 744 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 776 32 */
	void ~PermModelData_t(PermModelData_t* );
	PermModelData_t& operator=(PermModelData_t* , const PermModelData_t& );
} __attribute__((__aligned__(8)));

// <002FADE0> ../public/modellib/model_old_disk.h:195
// member functions: 15
// member variables: 20
// static member variable: 1
// struct size: 808
struct PermModelData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	PermModelData_t* Schema_MarkHelperFn(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/model_old_disk.h:197 */
	void Schema_CompileTimeVerificationFunction(PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/model_old_disk.h:197 */
	const CSchemaClassInfo* Schema_DynamicBinding(const PermModelData_t* );
	/* ../public/modellib/model_old_disk.h:198 */
	PermModelData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferSave_PermModelData_t(const PermModelData_t* , CKV3TransferSaveContext* );
	/* ../public/modellib/model_old_disk.h:198 */
	void KV3TransferLoad_PermModelData_t(PermModelData_t* , CKV3TransferLoadContext* );
	/* ../public/modellib/model_old_disk.h:200 */
	void PermModelData_t(PermModelData_t* );
	CUtlString m_name; /* 0 8 */
	PermModelInfo_t m_modelInfo; /* 8 88 */
	CUtlVector<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> > m_ExtParts; /* 96 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCRenderMesh>, CUtlMemory<CStrongHandle<InfoForResourceTypeCRenderMesh>, int> > m_refMeshes; /* 128 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 160 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refPhysGroupMasks; /* 192 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 224 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 256 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsData; /* 288 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCPhysAggregateData>, int> > m_refPhysicsHitboxData; /* 320 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_refAnimGroups; /* 352 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCSequenceGroupData>, int> > m_refSequenceGroups; /* 384 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 416 32 */
	CUtlVector<MaterialGroup_t, CUtlMemory<MaterialGroup_t, int> > m_materialGroups; /* 448 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask __attribute__((__aligned__(8))); /* 480 8 */
	ModelSkeletonData_t m_modelSkeleton; /* 488 192 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_remappingTable; /* 680 32 */
	CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> > m_remappingTableStarts; /* 712 32 */
	CUtlVector<ModelBoneFlexDriver_t, CUtlMemory<ModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 744 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 776 32 */
	void ~PermModelData_t(PermModelData_t* );
} __attribute__((__aligned__(8)));

// <051A68A3> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:197
inline void PermModelData_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <00187E6D> ../public/modellib/model_old_disk.h:198
inline void KV3TransferAllocateClassInstance(const char* pDerivedClassName)
{
} /* size: 0 */

// <051A42A4> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/model_old_disk.h:200
// function calls: 115
void PermModelData_t::PermModelData_t()
{
	CUtlString::CUtlString(); // 201
	CUtlString::CUtlString(); // 81
	CUtlString::CUtlString(); // 81
	PermModelInfo_t::PermModelInfo_t(); // 201
	CUtlVectorBase<PermModelExtPart_t, CUtlMemory<PermModelExtPart_t, int> >::ResetDbgInfo(); // 530
	CUtlMemory<PermModelExtPart_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<PermModelExtPart_t, int>::CUtlMemory(
			int nGrowSize,
