
//
// public/appframework/appsystemdict.h
//
//	referenced by: libengine2.so
//
//	functions: 58
//	class: 1
//

// <04620A61> ../public/appframework/appsystemdict.h:77
// member functions: 147
// member variables: 31
// vtable entries: 5
// class size: 424
class CAppSystemDict {
	/* ../public/appframework/appsystemdict.h:249 */
	struct AppSystemRequest_t {
		const char * m_pRequestingModuleName; /* 0 8 */
		const char * m_pRequestingInterfaceName; /* 8 8 */
		const char * m_pModuleName; /* 16 8 */
		const char * m_pInterfaceName; /* 24 8 */
		IAppSystem * m_pSystem; /* 32 8 */
		PlatModule_t m_hModule; /* 40 8 */
		CreateInterfaceFn m_pModuleFactory; /* 48 8 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/appframework/appsystemdict.h:260 */
	struct ModuleInfo_t {
		char * m_pModuleName; /* 0 8 */
		PlatModule_t m_hModule; /* 8 8 */
		int m_nRefCount; /* 16 4 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/appframework/appsystemdict.h:267 */
	struct AppSystem_t {
		const char * m_pModuleName; /* 0 8 */
		const char * m_pInterfaceName; /* 8 8 */
		IAppSystem * m_pSystem; /* 16 8 */
		PlatModule_t m_hModule; /* 24 8 */
		int m_nPhase; /* 32 4 */
		bool m_bInvisible; /* 36 1 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/appframework/appsystemdict.h:277 */
	struct InterfaceInfo_t {
		AppSystemTier_t m_Tier; /* 0 4 */
		const char * m_pModuleName; /* 8 8 */
		const char * m_pInterfaceName; /* 16 8 */
		IAppSystem * m_pSystem; /* 24 8 */
		PlatModule_t m_hModule; /* 32 8 */
		CUtlSymbolTable m_Dependencies; /* 40 144 */
		void InterfaceInfo_t(InterfaceInfo_t* );
		void ~InterfaceInfo_t(InterfaceInfo_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	void CAppSystemDict(CAppSystemDict* , const CAppSystemDict& );
	int ()(void) * * _vptr.CAppSystemDict; /* 0 8 */
	/* appframework/appsystemdict.cpp:74 */
	void CAppSystemDict(CAppSystemDict* , bool, void* , void* , int, bool, bool);
	/* appframework/appsystemdict.cpp:135 */
	virtual void ~CAppSystemDict(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:401 */
	void SetModuleSearchPath(CAppSystemDict* , const char* );
	/* appframework/appsystemdict.cpp:413 */
	void SetInitializationPhase(CAppSystemDict* , int);
	/* appframework/appsystemdict.cpp:420 */
	int GetInitializationPhase(const CAppSystemDict* );
	/* appframework/appsystemdict.cpp:429 */
	IAppSystem* AddSystem(CAppSystemDict* , IAppSystem* , const char* );
	/* appframework/appsystemdict.cpp:466 */
	IAppSystem* AddSystem(CAppSystemDict* , CreateInterfaceFn, const char* );
	/* appframework/appsystemdict.cpp:529 */
	IAppSystem* AddSystem(CAppSystemDict* , const char* , const char* , ErrorResponse_t);
	/* appframework/appsystemdict.cpp:498 */
	IAppSystem* AddSystem(CAppSystemDict* , PlatModule_t, const char* , ErrorResponse_t);
	/* appframework/appsystemdict.cpp:636 */
	void RemoveSystem(CAppSystemDict* , IAppSystem* );
	/* appframework/appsystemdict.cpp:692 */
	IAppSystem* ReplaceSystem(CAppSystemDict* , IAppSystem* , const char* , bool);
	/* appframework/appsystemdict.cpp:570 */
	bool AddSystems(CAppSystemDict* , int, const AppSystemInfo_t* );
	/* appframework/appsystemdict.cpp:786 */
	void AddNonAppSystemFactory(CAppSystemDict* , CreateInterfaceFn);
	/* appframework/appsystemdict.cpp:795 */
	void RemoveNonAppSystemFactory(CAppSystemDict* , CreateInterfaceFn);
	/* appframework/appsystemdict.cpp:747 */
	void* FindSystem(CAppSystemDict* , const char* );
	/* appframework/appsystemdict.cpp:804 */
	void ReconnectSystems(CAppSystemDict* , const char* );
	/* appframework/appsystemdict.cpp:1436 */
	CreateInterfaceFn GetFactory(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:210 */
	virtual bool Init(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:237 */
	void PreShutdown(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:252 */
	void Shutdown(CAppSystemDict* , int);
	/* appframework/appsystemdict.cpp:300 */
	bool InitSDL(CAppSystemDict* , uint32);
	/* appframework/appsystemdict.cpp:315 */
	void ShutdownSDL(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:384 */
	bool IsConsoleApp(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:419 */
	bool IsGameApp(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:409 */
	void SetDedicatedServer(CAppSystemDict* , bool);
	/* ../public/appframework/appsystemdict.h:414 */
	bool IsDedicatedServer(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:393 */
	KeyValues* GetGameInfo(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:424 */
	const char* GetContentPath(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:429 */
	const char* GetModGameSubdir(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:443 */
	void SetInToolsMode(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:454 */
	bool IsInToolsMode(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:463 */
	bool IsInDeveloperMode(const CAppSystemDict* );
	/* appframework/appsystemdict.cpp:392 */
	bool IsInVRMode(const CAppSystemDict* );
	/* appframework/appsystemdict.cpp:1344 */
	PlatWindow_t CreateAppWindow(CAppSystemDict* , const char* , int, int, int, int, int, int);
	/* ../public/appframework/appsystemdict.h:434 */
	const char* GetExecutablePath(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:398 */
	KeyValues* GetApplicationInfo(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:403 */
	void* GetAppInstance(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:183 */
	void SuppressCOMInitialization(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:189 */
	virtual CUtlString GetConsoleLogFilename(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:194 */
	virtual void ChangeLogFileSuffix(CAppSystemDict* , const char* );
	/* ../public/appframework/appsystemdict.h:199 */
	void SetStartupManifestsDisabled(CAppSystemDict* , bool);
	/* ../public/appframework/appsystemdict.h:472 */
	bool IsRunningOnCustomerMachine(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:477 */
	bool IsLowViolence(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:482 */
	void SetLowViolence(CAppSystemDict* , bool);
	/* ../public/appframework/appsystemdict.h:490 */
	int GetTestGroup(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:495 */
	void SetTestGroup(CAppSystemDict* , int);
	/* appframework/appsystemdict.cpp:343 */
	AppSystemBuildType_t GetBuildType(const CAppSystemDict* );
protected:
	/* appframework/appsystemdict.cpp:201 */
	virtual IApplication* CreateApplication(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:231 */
	virtual void OnAppSystemLoaded(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:321 */
	void SetGameInfo(CAppSystemDict* , KeyValues* , const char* );
	/* appframework/appsystemdict.cpp:378 */
	void SetInDeveloperMode(CAppSystemDict* , bool);
	/* ../public/appframework/appsystemdict.h:240 */
	bool AreStartupManifestsDisabled(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:246 */
	void SetExecutablePath(CAppSystemDict* , const char* );
private:
	/* ../public/appframework/appsystemdict.h:289 */
	void UnloadAllModules(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:290 */
	void RemoveAllSystems(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:1067 */
	bool LoadSystemAndDependencies(CAppSystemDict* , CUtlVector<CAppSystemDict::AppSystemRequest_t, CUtlMemory<CAppSystemDict::AppSystemRequest_t, int> >& , ErrorResponse_t);
	/* appframework/appsystemdict.cpp:818 */
	void ComputeDependencies(CAppSystemDict* , LibraryDependencies_t& );
	/* ../public/appframework/appsystemdict.h:287 */
	typedef struct CUtlStringMap<CAppSystemDict::InterfaceInfo_t, CUtlSymbolTable> LibraryDependencies_t;
	/* appframework/appsystemdict.cpp:887 */
	void SortDependentLibraries(CAppSystemDict* , LibraryDependencies_t& , CUtlVector<short unsigned int, CUtlMemory<short unsigned int, int> >* );
	/* appframework/appsystemdict.cpp:865 */
	bool DictSortLessFunc(LibraryDependencies_t& , const int& , const int& );
	/* ../public/appframework/appsystemdict.h:302 */
	void ReportStartupFailure(CAppSystemDict* , int, int);
	/* appframework/appsystemdict.cpp:966 */
	PlatModule_t LoadModuleInPath(CAppSystemDict* , const char* , int* );
	/* appframework/appsystemdict.cpp:1045 */
	void UnloadModule(CAppSystemDict* , PlatModule_t);
	/* appframework/appsystemdict.cpp:616 */
	void FreeSystemEntry(CAppSystemDict* , AppSystem_t* );
	/* appframework/appsystemdict.cpp:669 */
	void RebuildSystemDictionary(CAppSystemDict* );
	/* appframework/appsystemdict.cpp:949 */
	void GenerateModuleFullPath(CAppSystemDict* , const char* , const char* , CBufferString* );
	CUtlVector<CAppSystemDict::ModuleInfo_t, CUtlMemory<CAppSystemDict::ModuleInfo_t, int> > m_modules; /* 8 32 */
	CUtlVector<CAppSystemDict::AppSystem_t, CUtlMemory<CAppSystemDict::AppSystem_t, int> > m_Systems; /* 40 32 */
	CUtlVector<void* (*)(char const*, int*), CUtlMemory<void* (*)(char const*, int*), int> > m_NonAppSystemFactories; /* 72 32* /
	CUtlStringList m_ModuleSearchPath; /* 104 32 */
	CUtlStringMap<short unsigned int, CUtlSymbolTable> m_SystemDict; /* 136 176 */
	int m_nExpectedShutdownLoggingStateIndex; /* 312 4 */
	ILoggingListener * m_pDefaultLoggingListener; /* 320 8 */
	KeyValues * m_pGameInfo; /* 328 8 */
	KeyValues * m_pApplicationInfo; /* 336 8 */
	void * m_hInstance; /* 344 8 */
	bool m_bIsConsoleApp; /* 352 1 */
	bool m_bInToolsMode; /* 353 1 */
	bool m_bIsInDeveloperMode; /* 354 1 */
	bool m_bIsGameApp; /* 355 1 */
	bool m_bIsDedicatedServer; /* 356 1 */
	bool m_bIsStandaloneApp; /* 357 1 */
	CUtlString m_ExecutablePath; /* 360 8 */
	CUtlString m_ModSubDir; /* 368 8 */
	CUtlString m_ContentPath; /* 376 8 */
	IApplication * m_pApplication; /* 384 8 */
	bool m_bInitialized; /* 392 1 */
	bool m_bSuppressCOMInitialization; /* 393 1 */
	int m_nStartupManifestsDisabledCount; /* 396 4 */
	int m_nAppSystemPhase; /* 400 4 */
	bool m_bIsRetail; /* 404 1 */
	bool m_bIsLowViolence; /* 405 1 */
	bool m_bInvokedPreShutdown; /* 406 1 */
	int m_iTestGroup; /* 408 4 */
	bool m_bTestMode; /* 412 1 */
	uint32 m_nSteamAppId; /* 416 4 */
	/* ../public/appframework/appsystemdict.h:349 */
	void SetInTestMode(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:354 */
	bool IsInTestMode(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:359 */
	void SetInStandaloneApp(CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:364 */
	bool IsStandaloneApp(const CAppSystemDict* );
	/* ../public/appframework/appsystemdict.h:369 */
	void SetSteamAppId(CAppSystemDict* , uint32);
	/* ../public/appframework/appsystemdict.h:374 */
	uint32 GetSteamAppId(const CAppSystemDict* );
	/* <464c0be> appframework/appsystemdict.cpp:201 */
	virtual class IApplication * CreateApplication(class CAppSystemDict *); /* linkage=_ZN14CAppSystemDict17CreateApplicationEv */
	virtual void ~CAppSystemDict(class CAppSystemDict *); /* linkage=_ZN14CAppSystemDictD4Ev */
	/* <464ccbe> appframework/appsystemdict.cpp:378 */
