
//
// public/tier0/eventdispatcher.h
//
//	referenced by: libengine2.so
//				   libtier0.so
//
//	functions: 76
//	classes: 44
//

// <0009BB79> ../public/tier0/eventdispatcher.h:49
// member functions: 19
// member variables: 2
// class size: 32
class CEventDispatcher_Base {
	/* ../public/tier0/eventdispatcher.h:57 */
	struct EventListenerInfo_t {
		CUtlAbstractDelegate m_Delegate; /* 0 24 */
		const char * m_pszName; /* 24 8 */
		int32 m_nPriority; /* 32 4 */
		uint8 m_nDelegateParamCount; /* 36 1 */
		bool m_bDelegateReturnsVoid; /* 37 1 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:79 */
	struct DelegateIterator_Base_t {
		const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> pListeners; /* 0 8 */
		CUtlVectorFixedGrowable<int, 4> skipListeners __attribute__((__aligned__(8))); /* 8 48 */
		int nCurrent; /* 56 4 */
		DelegateIterator_Base_t * pNext; /* 64 8 */
		bool bIteratingForward; /* 72 1 */
		void ~DelegateIterator_Base_t(DelegateIterator_Base_t* );
		void DelegateIterator_Base_t(DelegateIterator_Base_t* );
	} __attribute__((__aligned__(8)));
protected:
	/* ../public/tier0/eventdispatcher.h:55 */
	void CEventDispatcher_Base(CEventDispatcher_Base* );
	/* ../public/tier0/eventdispatcher.h:73 */
	void RegisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , unsigned int, bool, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& , int, const char* );
	/* ../public/tier0/eventdispatcher.h:74 */
	bool UnregisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& );
	/* ../public/tier0/eventdispatcher.h:77 */
	void GetListenerNames_Base(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:88 */
	bool IterateListeners_Start(CEventDispatcher_Base* , DelegateIterator_Base_t& , bool);
	/* ../public/tier0/eventdispatcher.h:89 */
	const EventListenerInfo_t* IterateListener(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:90 */
	void IterateListeners_End(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:93 */
	int FindInsertionPoint(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int);
	CThreadFastMutex m_Lock; /* 0 24 */
	DelegateIterator_Base_t * m_pActiveIterators; /* 24 8 */
	void CEventDispatcher_Base(class CEventDispatcher_Base *); /* linkage=_ZN21CEventDispatcher_BaseC4Ev */
	void RegisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, unsigned int, bool, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &, int, const char  *); /* linkage=_ZN21CEventDispatcher_Base26RegisterEventListener_BaseERK20CUtlAbstractDelegatejbR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEEiPKc */
	bool UnregisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &); /* linkage=_ZN21CEventDispatcher_Base28UnregisterEventListener_BaseERK20CUtlAbstractDelegateR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEE */
	void GetListenerNames_Base(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN21CEventDispatcher_Base21GetListenerNames_BaseERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEPS0_I10CUtlStringS2_IS7_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Base *, class DelegateIterator_Base_t &, bool); /* linkage=_ZN21CEventDispatcher_Base22IterateListeners_StartERNS_23DelegateIterator_Base_tEb */
	const class EventListenerInfo_t  * IterateListener(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base15IterateListenerERNS_23DelegateIterator_Base_tE */
	void IterateListeners_End(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base20IterateListeners_EndERNS_23DelegateIterator_Base_tE */
	int FindInsertionPoint(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int); /* linkage=_ZN21CEventDispatcher_Base18FindInsertionPointERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEi */
};

// <0019D13D> ../public/tier0/eventdispatcher.h:49
// member functions: 17
// member variables: 2
// class size: 32
class CEventDispatcher_Base {
	/* ../public/tier0/eventdispatcher.h:57 */
	struct EventListenerInfo_t {
		CUtlAbstractDelegate m_Delegate; /* 0 24 */
		const char * m_pszName; /* 24 8 */
		int32 m_nPriority; /* 32 4 */
		uint8 m_nDelegateParamCount; /* 36 1 */
		bool m_bDelegateReturnsVoid; /* 37 1 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:79 */
	struct DelegateIterator_Base_t {
		const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> pListeners; /* 0 8 */
		CUtlVectorFixedGrowable<int, 4> skipListeners __attribute__((__aligned__(8))); /* 8 48 */
		int nCurrent; /* 56 4 */
		DelegateIterator_Base_t * pNext; /* 64 8 */
		bool bIteratingForward; /* 72 1 */
	} __attribute__((__aligned__(8)));
protected:
	/* ../public/tier0/eventdispatcher.h:55 */
	void CEventDispatcher_Base(CEventDispatcher_Base* );
	/* ../public/tier0/eventdispatcher.h:73 */
	void RegisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , unsigned int, bool, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& , int, const char* );
	/* ../public/tier0/eventdispatcher.h:74 */
	bool UnregisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& );
	/* ../public/tier0/eventdispatcher.h:77 */
	void GetListenerNames_Base(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:88 */
	bool IterateListeners_Start(CEventDispatcher_Base* , DelegateIterator_Base_t& , bool);
	/* ../public/tier0/eventdispatcher.h:89 */
	const EventListenerInfo_t* IterateListener(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:90 */
	void IterateListeners_End(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:93 */
	int FindInsertionPoint(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int);
	CThreadFastMutex m_Lock; /* 0 24 */
	DelegateIterator_Base_t * m_pActiveIterators; /* 24 8 */
	void CEventDispatcher_Base(class CEventDispatcher_Base *); /* linkage=_ZN21CEventDispatcher_BaseC4Ev */
	void RegisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, unsigned int, bool, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &, int, const char  *); /* linkage=_ZN21CEventDispatcher_Base26RegisterEventListener_BaseERK20CUtlAbstractDelegatejbR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEEiPKc */
	bool UnregisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &); /* linkage=_ZN21CEventDispatcher_Base28UnregisterEventListener_BaseERK20CUtlAbstractDelegateR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEE */
	void GetListenerNames_Base(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN21CEventDispatcher_Base21GetListenerNames_BaseERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEPS0_I10CUtlStringS2_IS7_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Base *, class DelegateIterator_Base_t &, bool); /* linkage=_ZN21CEventDispatcher_Base22IterateListeners_StartERNS_23DelegateIterator_Base_tEb */
	const class EventListenerInfo_t  * IterateListener(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base15IterateListenerERNS_23DelegateIterator_Base_tE */
	void IterateListeners_End(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base20IterateListeners_EndERNS_23DelegateIterator_Base_tE */
	int FindInsertionPoint(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int); /* linkage=_ZN21CEventDispatcher_Base18FindInsertionPointERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEi */
};

// <0042188A> ../public/tier0/eventdispatcher.h:49
// member functions: 19
// member variables: 2
// class size: 32
class CEventDispatcher_Base {
	/* ../public/tier0/eventdispatcher.h:57 */
	struct EventListenerInfo_t {
		CUtlAbstractDelegate m_Delegate; /* 0 24 */
		const char * m_pszName; /* 24 8 */
		int32 m_nPriority; /* 32 4 */
		uint8 m_nDelegateParamCount; /* 36 1 */
		bool m_bDelegateReturnsVoid; /* 37 1 */
		void EventListenerInfo_t(EventListenerInfo_t* );
		EventListenerInfo_t& operator=(EventListenerInfo_t* , const EventListenerInfo_t& );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:79 */
	struct DelegateIterator_Base_t {
		const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> pListeners; /* 0 8 */
		CUtlVectorFixedGrowable<int, 4> skipListeners __attribute__((__aligned__(8))); /* 8 48 */
		int nCurrent; /* 56 4 */
		DelegateIterator_Base_t * pNext; /* 64 8 */
		bool bIteratingForward; /* 72 1 */
	} __attribute__((__aligned__(8)));
protected:
	/* ../public/tier0/eventdispatcher.h:55 */
	void CEventDispatcher_Base(CEventDispatcher_Base* );
	/* ../public/tier0/eventdispatcher.h:73 */
	void RegisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , unsigned int, bool, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& , int, const char* );
	/* ../public/tier0/eventdispatcher.h:74 */
	bool UnregisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& );
	/* ../public/tier0/eventdispatcher.h:77 */
	void GetListenerNames_Base(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:88 */
	bool IterateListeners_Start(CEventDispatcher_Base* , DelegateIterator_Base_t& , bool);
	/* ../public/tier0/eventdispatcher.h:89 */
	const EventListenerInfo_t* IterateListener(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:90 */
	void IterateListeners_End(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:93 */
	int FindInsertionPoint(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int);
	CThreadFastMutex m_Lock; /* 0 24 */
	DelegateIterator_Base_t * m_pActiveIterators; /* 24 8 */
	void CEventDispatcher_Base(class CEventDispatcher_Base *); /* linkage=_ZN21CEventDispatcher_BaseC4Ev */
	void RegisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, unsigned int, bool, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &, int, const char  *); /* linkage=_ZN21CEventDispatcher_Base26RegisterEventListener_BaseERK20CUtlAbstractDelegatejbR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEEiPKc */
	bool UnregisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &); /* linkage=_ZN21CEventDispatcher_Base28UnregisterEventListener_BaseERK20CUtlAbstractDelegateR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEE */
	void GetListenerNames_Base(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN21CEventDispatcher_Base21GetListenerNames_BaseERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEPS0_I10CUtlStringS2_IS7_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Base *, class DelegateIterator_Base_t &, bool); /* linkage=_ZN21CEventDispatcher_Base22IterateListeners_StartERNS_23DelegateIterator_Base_tEb */
	const class EventListenerInfo_t  * IterateListener(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base15IterateListenerERNS_23DelegateIterator_Base_tE */
	void IterateListeners_End(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base20IterateListeners_EndERNS_23DelegateIterator_Base_tE */
	int FindInsertionPoint(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int); /* linkage=_ZN21CEventDispatcher_Base18FindInsertionPointERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEi */
};

// <0010B065> ../public/tier0/eventdispatcher.h:49
// member functions: 18
// member variables: 2
// class size: 32
class CEventDispatcher_Base {
	/* ../public/tier0/eventdispatcher.h:57 */
	struct EventListenerInfo_t {
		/* ../public/tier0/eventdispatcher.h:60 */
		enum {
			PARAMETER_COUNT_BITS = 8,
		};
		CUtlAbstractDelegate m_Delegate; /* 0 24 */
		const char * m_pszName; /* 24 8 */
		int32 m_nPriority; /* 32 4 */
		uint8 m_nDelegateParamCount; /* 36 1 */
		bool m_bDelegateReturnsVoid; /* 37 1 */
		void EventListenerInfo_t(EventListenerInfo_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:79 */
	struct DelegateIterator_Base_t {
		const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> pListeners; /* 0 8 */
		CUtlVectorFixedGrowable<int, 4> skipListeners __attribute__((__aligned__(8))); /* 8 48 */
		int nCurrent; /* 56 4 */
		DelegateIterator_Base_t * pNext; /* 64 8 */
		bool bIteratingForward; /* 72 1 */
	} __attribute__((__aligned__(8)));
protected:
	/* ../public/tier0/eventdispatcher.h:55 */
	void CEventDispatcher_Base(CEventDispatcher_Base* );
	/* ../public/tier0/eventdispatcher.h:73 */
	void RegisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , unsigned int, bool, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& , int, const char* );
	/* ../public/tier0/eventdispatcher.h:74 */
	bool UnregisterEventListener_Base(CEventDispatcher_Base* , const CUtlAbstractDelegate& , CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >& );
	/* ../public/tier0/eventdispatcher.h:77 */
	void GetListenerNames_Base(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:88 */
	bool IterateListeners_Start(CEventDispatcher_Base* , DelegateIterator_Base_t& , bool);
	/* ../public/tier0/eventdispatcher.h:89 */
	const EventListenerInfo_t* IterateListener(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:90 */
	void IterateListeners_End(CEventDispatcher_Base* , DelegateIterator_Base_t& );
	/* ../public/tier0/eventdispatcher.h:93 */
	int FindInsertionPoint(CEventDispatcher_Base* , const CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int);
	CThreadFastMutex m_Lock; /* 0 24 */
	DelegateIterator_Base_t * m_pActiveIterators; /* 24 8 */
	void CEventDispatcher_Base(class CEventDispatcher_Base *); /* linkage=_ZN21CEventDispatcher_BaseC4Ev */
	void RegisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, unsigned int, bool, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &, int, const char  *); /* linkage=_ZN21CEventDispatcher_Base26RegisterEventListener_BaseERK20CUtlAbstractDelegatejbR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEEiPKc */
	bool UnregisterEventListener_Base(class CEventDispatcher_Base *, const class CUtlAbstractDelegate  &, class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> > &); /* linkage=_ZN21CEventDispatcher_Base28UnregisterEventListener_BaseERK20CUtlAbstractDelegateR10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS4_iEE */
	void GetListenerNames_Base(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN21CEventDispatcher_Base21GetListenerNames_BaseERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEPS0_I10CUtlStringS2_IS7_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Base *, class DelegateIterator_Base_t &, bool); /* linkage=_ZN21CEventDispatcher_Base22IterateListeners_StartERNS_23DelegateIterator_Base_tEb */
	const class EventListenerInfo_t  * IterateListener(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base15IterateListenerERNS_23DelegateIterator_Base_tE */
	void IterateListeners_End(class CEventDispatcher_Base *, class DelegateIterator_Base_t &); /* linkage=_ZN21CEventDispatcher_Base20IterateListeners_EndERNS_23DelegateIterator_Base_tE */
	int FindInsertionPoint(class CEventDispatcher_Base *, const class CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> , int); /* linkage=_ZN21CEventDispatcher_Base18FindInsertionPointERK10CUtlVectorINS_19EventListenerInfo_tE10CUtlMemoryIS1_iEEi */
};

// <00228FCD> ../public/tier0/eventdispatcher.h:55
void CEventDispatcher_Base::CEventDispatcher_Base()
{
} /* size: 0 */

// <0066DCF7> ../public/tier0/eventdispatcher.h:57
inline void EventListenerInfo_t::operator=(const EventListenerInfo_t &)
{
} /* size: 0 */

// <0066DB63> ../public/tier0/eventdispatcher.h:57
void EventListenerInfo_t::EventListenerInfo_t()
{
} /* size: 0 */

// <0066DB47> ../public/tier0/eventdispatcher.h:57
inline void EventListenerInfo_t::EventListenerInfo_t()
{
} /* size: 0 */

// <0035FBF0> ../public/tier0/eventdispatcher.h:79
void DelegateIterator_Base_t::DelegateIterator_Base_t()
{
} /* size: 0 */

// <0035FBD4> ../public/tier0/eventdispatcher.h:79
inline void DelegateIterator_Base_t::DelegateIterator_Base_t()
{
} /* size: 0 */

// <0035FBBD> ../public/tier0/eventdispatcher.h:79
void DelegateIterator_Base_t::~DelegateIterator_Base_t()
{
} /* size: 0 */

// <0035FBA1> ../public/tier0/eventdispatcher.h:79
inline void DelegateIterator_Base_t::~DelegateIterator_Base_t()
{
} /* size: 0 */

// <0023BFE3> ../public/tier0/eventdispatcher.h:100
void CEventDispatcher_Identified<CEventIDManager_Default>::~CEventDispatcher_Identified()
{
} /* size: 0 */

// <0023BFC7> ../public/tier0/eventdispatcher.h:100
inline void CEventDispatcher_Identified<CEventIDManager_Default>::~CEventDispatcher_Identified()
{
} /* size: 0 */

// <0009F7D8> ../public/tier0/eventdispatcher.h:100
// member functions: 27
// member variables: 2
// class size: 80
class CEventDispatcher_Identified<CEventIDManager_Default> : public CEventDispatcher_Base {
public:
	/* class CEventDispatcher_Base <ancestor>; */ /* 0 32 */
	/* ../public/tier0/eventdispatcher.h:1127 */
	void CEventDispatcher_Identified(CEventDispatcher_Identified<CEventIDManager_Default>* , int);
	/* ../public/tier0/eventdispatcher.h:1140 */
	const char* GetEventName(EventID_t, char* , size_t);
	/* ../public/tier0/eventdispatcher.h:104 */
	typedef EventID_t EventID_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:1196 */
	bool HasListeners(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t);
	/* ../public/tier0/eventdispatcher.h:1220 */
	void GetListenerNames(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t, CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:1235 */
	bool IterateListeners_Start(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& , EventID_t, bool);
	/* ../public/tier0/eventdispatcher.h:106 */
	struct DelegateIterator_t : public DelegateIterator_Base_t {
	public:
		/* struct DelegateIterator_Base_t <ancestor>; */ /* 0 80 */
		EventID_t EventID; /* 80 8 */
		void ~DelegateIterator_t(DelegateIterator_t* );
		void DelegateIterator_t(DelegateIterator_t* );
	} __attribute__((__aligned__(8)));
	/* ../public/tier0/eventdispatcher.h:1260 */
	void IterateListeners_End(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& );
	/* ../public/tier0/eventdispatcher.h:1267 */
	bool IDLessFunc(const EventID_t& , const EventID_t& );
	/* ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , EventID_t);
protected:
	/* ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , unsigned int, bool, EventID_t, int, const char* );
	/* ../public/tier0/eventdispatcher.h:134 */
	void RegisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
	/* ../public/tier0/eventdispatcher.h:135 */
	void UnregisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
private:
	CUtlMap<const CSchemaClassInfo*, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >, unsigned int, bool (*)(const CSchemaClassInfo* const&, const CSchemaClassInfo* const&)> m_EventListenerMap; /* 32 48* /
	void CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *, int); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultEC4Ei */
	const char  * GetEventName(EventID_t, char *, size_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12GetEventNameEPK16CSchemaClassInfoPcm */
	bool HasListeners(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12HasListenersEPK16CSchemaClassInfo */
	void GetListenerNames(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t, class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE16GetListenerNamesEPK16CSchemaClassInfoP10CUtlVectorI10CUtlString10CUtlMemoryIS6_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &, EventID_t, bool); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE22IterateListeners_StartERNS1_18DelegateIterator_tEPK16CSchemaClassInfob */
	void IterateListeners_End(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE20IterateListeners_EndERNS1_18DelegateIterator_tE */
	bool IDLessFunc(const EventID_t  &, const EventID_t  &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE10IDLessFuncERKPK16CSchemaClassInfoS6_ */
	/* <5b2152> ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE32UnregisterEventListener_AbstractERK20CUtlAbstractDelegatePK16CSchemaClassInfo */
	/* <6918bb> ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, unsigned int, bool, EventID_t, int, const char  *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE30RegisterEventListener_AbstractERK20CUtlAbstractDelegatejbPK16CSchemaClassInfoiPKc */
	void RegisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE21RegisterEventListenerEv */
	void UnregisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE23UnregisterEventListenerEv */
	void ~CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultED4Ev */
};

// <001A0795> ../public/tier0/eventdispatcher.h:100
// member functions: 25
// member variables: 2
// class size: 80
class CEventDispatcher_Identified<CEventIDManager_Default> : public CEventDispatcher_Base {
public:
	/* class CEventDispatcher_Base <ancestor>; */ /* 0 32 */
	/* ../public/tier0/eventdispatcher.h:1127 */
	void CEventDispatcher_Identified(CEventDispatcher_Identified<CEventIDManager_Default>* , int);
	/* ../public/tier0/eventdispatcher.h:1140 */
	const char* GetEventName(EventID_t, char* , size_t);
	/* ../public/tier0/eventdispatcher.h:104 */
	typedef EventID_t EventID_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:1196 */
	bool HasListeners(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t);
	/* ../public/tier0/eventdispatcher.h:1220 */
	void GetListenerNames(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t, CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:1235 */
	bool IterateListeners_Start(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& , EventID_t, bool);
	struct DelegateIterator_t {
	};
	/* ../public/tier0/eventdispatcher.h:1260 */
	void IterateListeners_End(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& );
	/* ../public/tier0/eventdispatcher.h:1267 */
	bool IDLessFunc(const EventID_t& , const EventID_t& );
	/* ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , EventID_t);
protected:
	/* ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , unsigned int, bool, EventID_t, int, const char* );
	/* ../public/tier0/eventdispatcher.h:134 */
	void RegisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
	/* ../public/tier0/eventdispatcher.h:135 */
	void UnregisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
private:
	CUtlMap<const CSchemaClassInfo*, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >, unsigned int, bool (*)(const CSchemaClassInfo* const&, const CSchemaClassInfo* const&)> m_EventListenerMap; /* 32 48* /
	void ~CEventDispatcher_Identified(CEventDispatcher_Identified<CEventIDManager_Default>* );
	void CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *, int); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultEC4Ei */
	const char  * GetEventName(EventID_t, char *, size_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12GetEventNameEPK16CSchemaClassInfoPcm */
	bool HasListeners(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12HasListenersEPK16CSchemaClassInfo */
	void GetListenerNames(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t, class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE16GetListenerNamesEPK16CSchemaClassInfoP10CUtlVectorI10CUtlString10CUtlMemoryIS6_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &, EventID_t, bool); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE22IterateListeners_StartERNS1_18DelegateIterator_tEPK16CSchemaClassInfob */
	void IterateListeners_End(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE20IterateListeners_EndERNS1_18DelegateIterator_tE */
	bool IDLessFunc(const EventID_t  &, const EventID_t  &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE10IDLessFuncERKPK16CSchemaClassInfoS6_ */
	/* <5b2152> ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE32UnregisterEventListener_AbstractERK20CUtlAbstractDelegatePK16CSchemaClassInfo */
	/* <6918bb> ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, unsigned int, bool, EventID_t, int, const char  *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE30RegisterEventListener_AbstractERK20CUtlAbstractDelegatejbPK16CSchemaClassInfoiPKc */
	void RegisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE21RegisterEventListenerEv */
	void UnregisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE23UnregisterEventListenerEv */
	void ~CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultED4Ev */
};

// <0027B404> ../public/tier0/eventdispatcher.h:100
// member functions: 24
// member variables: 2
// class size: 80
class CEventDispatcher_Identified<CEventIDManager_Default> : public CEventDispatcher_Base {
public:
	/* class CEventDispatcher_Base <ancestor>; */ /* 0 32 */
	/* ../public/tier0/eventdispatcher.h:1127 */
	void CEventDispatcher_Identified(CEventDispatcher_Identified<CEventIDManager_Default>* , int);
	/* ../public/tier0/eventdispatcher.h:1140 */
	const char* GetEventName(EventID_t, char* , size_t);
	/* ../public/tier0/eventdispatcher.h:104 */
	typedef EventID_t EventID_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:1196 */
	bool HasListeners(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t);
	/* ../public/tier0/eventdispatcher.h:1220 */
	void GetListenerNames(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t, CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:1235 */
	bool IterateListeners_Start(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& , EventID_t, bool);
	struct DelegateIterator_t {
	};
	/* ../public/tier0/eventdispatcher.h:1260 */
	void IterateListeners_End(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& );
	/* ../public/tier0/eventdispatcher.h:1267 */
	bool IDLessFunc(const EventID_t& , const EventID_t& );
	/* ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , EventID_t);
protected:
	/* ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , unsigned int, bool, EventID_t, int, const char* );
	/* ../public/tier0/eventdispatcher.h:134 */
	void RegisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
	/* ../public/tier0/eventdispatcher.h:135 */
	void UnregisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
private:
	CUtlMap<const CSchemaClassInfo*, CUtlVector<CEventDispatcher_Base::EventListenerInfo_t, CUtlMemory<CEventDispatcher_Base::EventListenerInfo_t, int> >, unsigned int, bool (*)(const CSchemaClassInfo* const&, const CSchemaClassInfo* const&)> m_EventListenerMap; /* 32 48* /
	void CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *, int); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultEC4Ei */
	const char  * GetEventName(EventID_t, char *, size_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12GetEventNameEPK16CSchemaClassInfoPcm */
	bool HasListeners(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE12HasListenersEPK16CSchemaClassInfo */
	void GetListenerNames(class CEventDispatcher_Identified<CEventIDManager_Default> *, EventID_t, class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE16GetListenerNamesEPK16CSchemaClassInfoP10CUtlVectorI10CUtlString10CUtlMemoryIS6_iEE */
	bool IterateListeners_Start(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &, EventID_t, bool); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE22IterateListeners_StartERNS1_18DelegateIterator_tEPK16CSchemaClassInfob */
	void IterateListeners_End(class CEventDispatcher_Identified<CEventIDManager_Default> *, class DelegateIterator_t &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE20IterateListeners_EndERNS1_18DelegateIterator_tE */
	bool IDLessFunc(const EventID_t  &, const EventID_t  &); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE10IDLessFuncERKPK16CSchemaClassInfoS6_ */
	/* <5b2152> ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, EventID_t); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE32UnregisterEventListener_AbstractERK20CUtlAbstractDelegatePK16CSchemaClassInfo */
	/* <6918bb> ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(class CEventDispatcher_Identified<CEventIDManager_Default> *, const class CUtlAbstractDelegate  &, unsigned int, bool, EventID_t, int, const char  *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE30RegisterEventListener_AbstractERK20CUtlAbstractDelegatejbPK16CSchemaClassInfoiPKc */
	void RegisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE21RegisterEventListenerEv */
	void UnregisterEventListener(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultE23UnregisterEventListenerEv */
	void ~CEventDispatcher_Identified(class CEventDispatcher_Identified<CEventIDManager_Default> *); /* linkage=_ZN27CEventDispatcher_IdentifiedI23CEventIDManager_DefaultED4Ev */
};

// <00425495> ../public/tier0/eventdispatcher.h:100
// member functions: 25
// member variables: 2
// class size: 80
class CEventDispatcher_Identified<CEventIDManager_Default> : public CEventDispatcher_Base {
public:
	/* class CEventDispatcher_Base <ancestor>; */ /* 0 32 */
	/* ../public/tier0/eventdispatcher.h:1127 */
	void CEventDispatcher_Identified(CEventDispatcher_Identified<CEventIDManager_Default>* , int);
	/* ../public/tier0/eventdispatcher.h:1140 */
	const char* GetEventName(EventID_t, char* , size_t);
	/* ../public/tier0/eventdispatcher.h:104 */
	typedef EventID_t EventID_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/eventdispatcher.h:1196 */
	bool HasListeners(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t);
	/* ../public/tier0/eventdispatcher.h:1220 */
	void GetListenerNames(CEventDispatcher_Identified<CEventIDManager_Default>* , EventID_t, CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >* );
	/* ../public/tier0/eventdispatcher.h:1235 */
	bool IterateListeners_Start(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& , EventID_t, bool);
	/* ../public/tier0/eventdispatcher.h:106 */
	struct DelegateIterator_t : public DelegateIterator_Base_t {
	public:
		/* struct DelegateIterator_Base_t <ancestor>; */ /* 0 80 */
		EventID_t EventID; /* 80 8 */
	} __attribute__((__aligned__(8)));
	/* ../public/tier0/eventdispatcher.h:1260 */
	void IterateListeners_End(CEventDispatcher_Identified<CEventIDManager_Default>* , DelegateIterator_t& );
	/* ../public/tier0/eventdispatcher.h:1267 */
	bool IDLessFunc(const EventID_t& , const EventID_t& );
	/* ../public/tier0/eventdispatcher.h:1171 */
	void UnregisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , EventID_t);
protected:
	/* ../public/tier0/eventdispatcher.h:1146 */
	void RegisterEventListener_Abstract(CEventDispatcher_Identified<CEventIDManager_Default>* , const CUtlAbstractDelegate& , unsigned int, bool, EventID_t, int, const char* );
	/* ../public/tier0/eventdispatcher.h:134 */
	void RegisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
	/* ../public/tier0/eventdispatcher.h:135 */
	void UnregisterEventListener(CEventDispatcher_Identified<CEventIDManager_Default>* );
private:
