
//
// public/tier0/utlleanvector.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//				   libvfx_vulkan.so
//
//	functions: 706
//	classes: 154
//

// <0010D1C3> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <00FCABFF> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <011CF297> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<9, unsigned int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 36 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <01222F1C> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <01224EDE> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct VfxVariableIndexData_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
} __attribute__((__aligned__(8)));

// <0345767A> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 72
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 72 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <0345835C> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <03459032> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 24
class CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CWeakHandle<InfoForResourceTypeCTextureBase> ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 24 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <03459EE2> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 328
class CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassAttachmentDesc_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 320 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 328 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassAttachmentDesc_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassAttachmentDesc_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 320 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 328 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 328 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <0345AB4B> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 2,056
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPass_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 2056 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <0345B7A1> ../public/tier0/utlleanvector.h:36
// member functions: 22
// member variable: 1
// class size: 56
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPassDependency_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 56 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <03ADBF79> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 72
class CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CWeakHandle<InfoForResourceTypeCTextureBase> ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 72 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <03ADCBF4> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderImageLayout_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 32 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 36 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef enum RenderImageLayout_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderImageLayout_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 32 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 36 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <06898B79> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 2147483647,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct VfxVariableIndexData_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> ClassType_t;
} __attribute__((__aligned__(8)));

// <068B744C> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<short int, 6, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef short int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<short int, 6, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <06A2C42C> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <00164B29> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 72
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 72 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00165791> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <001663ED> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 24
class CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CWeakHandle<InfoForResourceTypeCTextureBase> ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 24 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00167EA8> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 2,056
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPass_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 2056 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00168B1E> ../public/tier0/utlleanvector.h:36
// member functions: 22
// member variable: 1
// class size: 56
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPassDependency_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 56 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <004FBCB1> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 1,160
class CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, VkImageMemoryBarrier> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 1152 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 1160 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct VkImageMemoryBarrier ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, VkImageMemoryBarrier> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 1152 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 1160 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 1160 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <0098DB0B> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 72
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 64 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 72 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 72 */
} __attribute__((__aligned__(8)));

// <0098E77C> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 40
class CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderSubPassAttachment_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, RenderSubPassAttachment_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 32 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 40 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 40 */
} __attribute__((__aligned__(8)));

// <0098F3E1> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 24
class CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CWeakHandle<InfoForResourceTypeCTextureBase> ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<2, CWeakHandle<InfoForResourceTypeCTextureBase> > m_FixedAlloc __attribute__((__aligned__(8))); /* 8 16 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 24 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 24 */
} __attribute__((__aligned__(8)));

// <009901F3> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 328
class CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassAttachmentDesc_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 320 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 328 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassAttachmentDesc_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassAttachmentDesc_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 320 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 328 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 328 */
} __attribute__((__aligned__(8)));

// <00990E9B> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 2,056
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPass_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<8, RenderPassSubPass_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 2048 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 2056 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 2056 */
} __attribute__((__aligned__(8)));

// <00991B15> ../public/tier0/utlleanvector.h:36
// member functions: 22
// member variable: 1
// class size: 56
class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderPassSubPassDependency_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<4, RenderPassSubPassDependency_t> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 48 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 52 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 56 */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI29RenderPassSubPassDependency_tLt4EsE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <0002C0E5> ../../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> {
	/* ../../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int);
	/* ../../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int, bool);
	/* ../../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
protected:
	/* ../../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <0002E12F> ../../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> {
	/* ../../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../../public/tier0/utlleanvector.h:40 */
	typedef struct VfxVariableIndexData_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int);
	/* ../../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int, bool);
	/* ../../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
protected:
	/* ../../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
} __attribute__((__aligned__(8)));

// <000791E7> ../../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> {
	/* ../../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int);
	/* ../../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int, bool);
	/* ../../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
protected:
	/* ../../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <00050917> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <0006ED52> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<short int, 6, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef short int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
} __attribute__((__aligned__(8)));

// <0007BFF7> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<int, 3, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<3, int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<3, int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
} __attribute__((__aligned__(8)));

// <0007CBF5> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 24
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 8 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 20 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 8 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 20 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 24 */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <0007F184> ../public/tier0/utlleanvector.h:36
// member functions: 22
// member variable: 1
// class size: 6,920
class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, CMaterialMode> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 6912 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 6920 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CMaterialMode ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, CMaterialMode> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 6912 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 6920 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 6920 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE4BaseEv */
	/* <1af142> ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <00103F7F> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> {
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct VfxVariableIndexData_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<2, VfxVariableIndexData_t> m_FixedAlloc __attribute__((__aligned__(2))); /* 8 8 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00121C02> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<short int, 6, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef short int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<short int, 6, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, short int> m_FixedAlloc __attribute__((__aligned__(2))); /* 4 12 */
		} __attribute__((__aligned__(2))) __attribute__((__aligned__(2))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<short int, 6, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00131124> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 16
class CUtlLeanVectorFixedGrowableBase<int, 3, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<3, int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<int, 3, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<3, int> m_FixedAlloc __attribute__((__aligned__(4))); /* 4 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 16 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 16 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<int, 3, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <00131DA4> ../public/tier0/utlleanvector.h:36
// member functions: 33
// member variable: 1
// class size: 24
class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 2147483647,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 8 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 20 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 4 */
			IndexType_t m_nAllocated; /* 4 4 */
		}; /* 0 8 */
		struct {
			IndexType_t m_nFixedCount; /* 0 4 */
			IndexType_t m_nFixedAllocated; /* 4 4 */
			AlignedByteArray_t<12, unsigned char> m_FixedAlloc __attribute__((__aligned__(1))); /* 8 12 */
		} __attribute__((__aligned__(4))) __attribute__((__aligned__(4))); /* 0 20 */
		struct {
			IndexType_t m_nAllocCount; /* 0 4 */
			IndexType_t m_nAllocAllocated; /* 4 4 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 24 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EsE19GetMinAllocElementsEv */
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseIhLt12EiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseIhLt12EiE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <001381B7> ../public/tier0/utlleanvector.h:36
// member functions: 22
// member variable: 1
// class size: 6,920
class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, CMaterialMode> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 6912 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 6920 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct CMaterialMode ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<6, CMaterialMode> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 6912 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 6920 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 6920 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> ClassType_t;
	void CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsEC4Ev */
	void ~CUtlLeanVectorFixedGrowableBase(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *, int); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE4BaseEv */
	/* <1af142> ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *, int, bool); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int> *); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>  *); /* linkage=_ZNK31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN31CUtlLeanVectorFixedGrowableBaseI13CMaterialModeLt6EsE19GetMinAllocElementsEv */
} __attribute__((__aligned__(8)));

// <0023ECA8> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 264
class CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, texture_use_info_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 256 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 264 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct texture_use_info_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, texture_use_info_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 256 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 264 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 264 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <0023F95B> ../public/tier0/utlleanvector.h:36
// member functions: 11
// member variable: 1
// class size: 776
class CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int> {
	/* ../public/tier0/utlleanvector.h:43 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:222 */
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, RenderDescriptorBinding_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 768 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 776 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	};
	/* ../public/tier0/utlleanvector.h:41 */
	typedef short int IndexType_t;
	/* ../public/tier0/utlleanvector.h:40 */
	typedef struct RenderDescriptorBinding_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:48 */
	void CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:53 */
	void ~CUtlLeanVectorFixedGrowableBase(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:58 */
	bool IsValidIndex(const CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* , int);
	/* ../public/tier0/utlleanvector.h:60 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:62 */
	ElemType_t* Base(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:66 */
	const ElemType_t* Base(const CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:83 */
	void EnsureCapacity(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:181 */
	void RemoveAll(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:188 */
	void Purge(CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
	/* ../public/tier0/utlleanvector.h:199 */
	size_t NonfixedAllocSize(const CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>* );
protected:
	/* ../public/tier0/utlleanvector.h:209 */
	IndexType_t GetMinAllocElements(void);
	union {
		struct {
			IndexType_t m_nCount; /* 0 2 */
			IndexType_t m_nAllocated; /* 2 2 */
		}; /* 0 4 */
		struct {
			IndexType_t m_nFixedCount; /* 0 2 */
			IndexType_t m_nFixedAllocated; /* 2 2 */
			AlignedByteArray_t<16, RenderDescriptorBinding_t> m_FixedAlloc __attribute__((__aligned__(8))); /* 8 768 */
		} __attribute__((__aligned__(8))) __attribute__((__aligned__(8))); /* 0 776 */
		struct {
			IndexType_t m_nAllocCount; /* 0 2 */
			IndexType_t m_nAllocAllocated; /* 2 2 */
			ElemType_t * m_pElements; /* 8 8 */
		}; /* 0 16 */
	} __attribute__((__aligned__(8))); /* 0 776 */
	/* ../public/tier0/utlleanvector.h:39 */
	typedef struct CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int> ClassType_t;
} __attribute__((__aligned__(8)));

// <069E560C> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <069E55F3> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <068EC935> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <068EC91C> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <067D140B> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <067D13F2> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE3482> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE3469> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE342D> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE3414> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03464A0D> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034649F4> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034649DD> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034649C4> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034649AD> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03464994> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00B6D253> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00B6D23A> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1BFA> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1BE1> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1BCA> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1BB1> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1B9A> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC1B81> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <002682BA> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <002682A1> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0026828A> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00268271> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0015DB3E> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0015DB25> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00158465> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0015844C> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00155D7E> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00155D65> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00155D4E> ../public/tier0/utlleanvector.h:48
void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00155D35> ../public/tier0/utlleanvector.h:48
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <069E7464> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <069E744B> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <068FCDA0> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <068FCD87> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <067D690E> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <067D68F5> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE815E> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE8145> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE80FE> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03AE80E5> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03469230> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03469217> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034691D0> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <034691B7> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03469170> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <03469157> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00B74FF8> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00B74FDF> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC71C9> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC71B0> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC7169> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC7150> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC7109> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00AC70F0> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0026B284> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0026B26B> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0026B224> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0026B20B> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0016BDB3> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <0016BD9A> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00169C3F> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00169C26> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00168D82> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00168D69> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00168D22> ../public/tier0/utlleanvector.h:53
void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00168D09> ../public/tier0/utlleanvector.h:53
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::~CUtlLeanVectorFixedGrowableBase()
{
} /* size: 0 */

// <00169B04> ../public/tier0/utlleanvector.h:58
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::IsValidIndex(int i)
{
} /* size: 0 */

// <068EDBC7> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::Base()
{
} /* size: 0 */

// <067D2A58> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::Base()
{
} /* size: 0 */

// <03AE8005> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Base()
{
} /* size: 0 */

// <03AE7FEC> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::Base()
{
} /* size: 0 */

// <034672AA> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base()
{
} /* size: 0 */

// <0346725F> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::Base()
{
} /* size: 0 */

// <03467246> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::Base()
{
} /* size: 0 */

// <00B74F87> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::Base()
{
} /* size: 0 */

// <0026AFD9> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::Base()
{
} /* size: 0 */

// <0026A99D> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::Base()
{
} /* size: 0 */

// <0015E364> ../public/tier0/utlleanvector.h:62
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::Base()
{
} /* size: 0 */

// <06A5DFBB> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::Base()
{
} /* size: 0 */

// <069E74C4> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base()
{
} /* size: 0 */

// <0346904C> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Base()
{
} /* size: 0 */

// <0346901A> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Base()
{
} /* size: 0 */

// <03469001> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::Base()
{
} /* size: 0 */

// <0016A226> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::Base()
{
} /* size: 0 */

// <0016044D> ../public/tier0/utlleanvector.h:66
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Base()
{
} /* size: 0 */

// <069E6545> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 26653
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <069E3FDA> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 26653
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <068FAADA> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62633
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <068F1C20> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62633
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <067D5B5B> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 6396
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<9, unsigned int, 4>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<unsigned int>(unsigned int* pFrom,
								unsigned int* pFromEnd,
								unsigned int* pTo);  // 170
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 517, variables: 2, inline expansions: 1 (29 bytes) */

// <03AE4B0D> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 17
void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 16073
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
		AlignedByteArrayExplicit_t<8, CWeakHandle<InfoForResourceTypeCTextureBase>, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Base(); // 148
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1514
		Construct<CWeakHandle<InfoForResourceTypeCTextureBase>, CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pMemory); // 100
		Destruct<CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pMemory); // 101
		UtlTraitsMoveRawMemoryRange<CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pFrom,
												CWeakHandle<InfoForResourceTypeCTextureBase>* pFromEnd,
												CWeakHandle<InfoForResourceTypeCTextureBase>* pTo);  // 149
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<8, CWeakHandle<InfoForResourceTypeCTextureBase>, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Base(); // 169
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 1514
		Construct<CWeakHandle<InfoForResourceTypeCTextureBase>, CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pMemory); // 100
		Destruct<CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pMemory); // 101
		UtlTraitsMoveRawMemoryRange<CWeakHandle<InfoForResourceTypeCTextureBase> >(CWeakHandle<InfoForResourceTypeCTextureBase>* pFrom,
												CWeakHandle<InfoForResourceTypeCTextureBase>* pFromEnd,
												CWeakHandle<InfoForResourceTypeCTextureBase>* pTo);  // 170
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 726, variables: 2, inline expansions: 1 (29 bytes) */

// <03AE4745> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 16073
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<8, RenderImageLayout_t, 4>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<RenderImageLayout_t>(RenderImageLayout_t* pFrom,
								RenderImageLayout_t* pFromEnd,
								RenderImageLayout_t* pTo);  // 170
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 517, variables: 2, inline expansions: 1 (29 bytes) */

// <03481E6F> ../public/tier0/utlleanvector.h:83
// variables: 6
// function calls: 19
void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 169
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 176
		RenderSubPassAttachment_t::RenderSubPassAttachment_t(
						RenderSubPassAttachment_t &);  // 1514
		Construct<RenderSubPassAttachment_t, RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pMemory); // 100
		Destruct<RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pMemory); // 101
		UtlTraitsMoveRawMemoryRange<RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pFrom,
									RenderSubPassAttachment_t* pFromEnd,
									RenderSubPassAttachment_t* pTo);  // 170
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 148
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 176
		RenderSubPassAttachment_t::RenderSubPassAttachment_t(
						RenderSubPassAttachment_t &);  // 1514
		Construct<RenderSubPassAttachment_t, RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pMemory); // 100
		Destruct<RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pMemory); // 101
		UtlTraitsMoveRawMemoryRange<RenderSubPassAttachment_t>(RenderSubPassAttachment_t* pFrom,
									RenderSubPassAttachment_t* pFromEnd,
									RenderSubPassAttachment_t* pTo);  // 149
	}
} /* size: 713, variables: 1, inline expansions: 1 (29 bytes) */

// <03466E50> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
		AlignedByteArrayExplicit_t<8, RenderPassAttachmentDesc_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Base(); // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<8, RenderPassAttachmentDesc_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Base(); // 169
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 574, variables: 2, inline expansions: 1 (29 bytes) */

// <03466AE5> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
		AlignedByteArrayExplicit_t<8, RenderPassSubPass_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Base(); // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<8, RenderPassSubPass_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Base(); // 169
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 561, variables: 2, inline expansions: 1 (29 bytes) */

// <03466750> ../public/tier0/utlleanvector.h:83
// variables: 7
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<4, RenderPassSubPassDependency_t, 4>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<RenderPassSubPassDependency_t>(RenderPassSubPassDependency_t* pFrom,
										RenderPassSubPassDependency_t* pFromEnd,
										RenderPassSubPassDependency_t* pTo);  // 170
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
} /* size: 517, variables: 2, inline expansions: 1 (29 bytes) */

// <03465B8D> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0345EED3> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0345EE3E> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 27500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0126C0C8> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 46884
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00FFF60D> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 21860
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <016831C7> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 6994
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <01680C5C> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 6994
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0159775C> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 42974
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0158E8A2> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 42974
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00B6D183> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 26848
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AC46F2> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AC45BC> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AC44F8> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AB826A> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AB81A6> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00AB8114> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 14534
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <004FE6CC> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 35249
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0054DA64> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 7500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0054B4F9> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 7500
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00461FF9> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 43480
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0045913F> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 43480
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <000BE204> ../../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 15096
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <008A1E76> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 51507
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0089F90B> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 51507
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00269434> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 35153
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00268175> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 35153
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <001AF142> ../public/tier0/utlleanvector.h:83
// variables: 6
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<6, CMaterialMode, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Base(); // 169
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
		AlignedByteArrayExplicit_t<6, CMaterialMode, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Base(); // 148
	}
} /* size: 574, variables: 1, inline expansions: 1 (29 bytes) */

// <001AD4C2> ../public/tier0/utlleanvector.h:83
// variables: 4
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<3, int, 4>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<int, 3, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<int, 3, short int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<int>(int* pFrom,
						int* pFromEnd,
						int* pTo);  // 170
	}
} /* size: 517, variables: 1, inline expansions: 1 (29 bytes) */

// <001AD1CD> ../public/tier0/utlleanvector.h:83
// variables: 4
// function calls: 7
void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 109
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<6, short int, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<short int>(short int* pFrom,
							short int* pFromEnd,
							short int* pTo);  // 170
	}
} /* size: 485, variables: 1, inline expansions: 1 (29 bytes) */

// <001670D8> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <00160012> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0015E0C4> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <0015DFFE> ../public/tier0/utlleanvector.h:83
// variables: 7
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 97
	{
		int* _pCrash; // 109
	}
	{
		ElemType_t* pNew; // 147
		ElemType_t* pBase; // 148
	}
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
	}
} /* size: 0, variables: 2 */

// <069E6124> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <068FAB85> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <068EDBE0> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <067D2A71> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <03AE3444> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <03AE33EF> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <03469132> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0346910D> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <034690E8> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <00B6D215> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <00AC6EEE> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <00AC6EC9> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <00AC6EA4> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0026B1CD> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0026824C> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0016012B> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0015E37D> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <0015E33F> ../public/tier0/utlleanvector.h:181
// variable: 1
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::RemoveAll()
{
	ElemType_t* pBase; // 183
} /* size: 0, variables: 1 */

// <069E6FA1> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>::Purge()
{
} /* size: 0 */

// <068FBE72> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Purge()
{
} /* size: 0 */

// <068F4E14> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<short int, 6, short int>::Purge()
{
} /* size: 0 */

// <067D687C> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>::Purge()
{
} /* size: 0 */

// <03AE5097> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>::Purge()
{
} /* size: 0 */

// <03AE504E> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>::Purge()
{
} /* size: 0 */

// <03467355> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Purge()
{
} /* size: 0 */

// <0346730C> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::Purge()
{
} /* size: 0 */

// <034672C3> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::Purge()
{
} /* size: 0 */

// <00B7128B> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>::Purge()
{
} /* size: 0 */

// <00AC49FF> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>::Purge()
{
} /* size: 0 */

// <00AC49B6> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>::Purge()
{
} /* size: 0 */

// <00AC496D> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>::Purge()
{
} /* size: 0 */

// <00269766> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<texture_use_info_t, 16, short int>::Purge()
{
} /* size: 0 */

// <0026971D> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<RenderDescriptorBinding_t, 16, short int>::Purge()
{
} /* size: 0 */

// <00169682> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<CMaterialMode, 6, short int>::Purge()
{
} /* size: 0 */

// <0016861F> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<int, 3, short int>::Purge()
{
} /* size: 0 */

// <00168606> ../public/tier0/utlleanvector.h:188
inline void CUtlLeanVectorFixedGrowableBase<unsigned char, 12, int>::Purge()
{
} /* size: 0 */

// <069E55EC> ../public/tier0/utlleanvector.h:209
inline void GetMinAllocElements(void)
{
} /* size: 0 */

// <0010DE3F> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct KeyValueInfo_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00462C77> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct AsyncConfigFile_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00FCB850> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct KeyValueInfo_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <068D2526> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct VfxStaticComboLoadRequest_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <000481A8> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<int, short int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<int, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<int, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00048CC4> ../public/tier0/utlleanvector.h:249
// member functions: 22
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<const IIKRuleDescription*, short int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef const class IIKRuleDescription * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
	void CUtlLeanVectorBase(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsEC4Ev */
	void ~CUtlLeanVectorBase(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *, int); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *, int, bool); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE19GetMinAllocElementsEv */
};

// <000C8A31> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<int, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<int, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef int ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<int, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<int, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <000C9536> ../public/tier0/utlleanvector.h:249
// member functions: 22
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<const IIKRuleDescription*, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef const class IIKRuleDescription * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<const IIKRuleDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
	void CUtlLeanVectorBase(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsEC4Ev */
	void ~CUtlLeanVectorBase(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *, int); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *, int, bool); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE9RemoveAllEv */
	void Purge(class CUtlLeanVectorBase<const IIKRuleDescription*, short int> *); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorBase<const IIKRuleDescription*, short int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN18CUtlLeanVectorBaseIPK18IIKRuleDescriptionsE19GetMinAllocElementsEv */
};

// <000CDA9A> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CIKChainDescription*, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CIKChainDescription*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef class CIKChainDescription * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CIKChainDescription*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <000E14B8> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<JointTreeNode*, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<JointTreeNode*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef class JointTreeNode * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<JointTreeNode*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<JointTreeNode*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00136C8C> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CIKChainDescription*, short int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CIKChainDescription*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef class CIKChainDescription * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CIKChainDescription*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CIKChainDescription*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00D9E257> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CTransform, short int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CTransform, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct CTransform ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CTransform, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00EEF9F1> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CTransform, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CTransform, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct CTransform ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CTransform, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CTransform, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00EF07AD> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CCachedPose, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CCachedPose, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct CCachedPose ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CCachedPose, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CCachedPose, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <0007B525> ../public/tier0/utlleanvector.h:249
// member functions: 22
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<unsigned char, int> {
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<unsigned char, int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<unsigned char, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 4 */
	IndexType_t m_nAllocated; /* 4 4 */
	ElemType_t * m_pElements; /* 8 8 */
	void CUtlLeanVectorBase(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiEC4Ev */
	void ~CUtlLeanVectorBase(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorBase<unsigned char, int>  *, int); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN18CUtlLeanVectorBaseIhiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorBase<unsigned char, int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorBase<unsigned char, int> *, int, bool); /* linkage=_ZN18CUtlLeanVectorBaseIhiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorBase<unsigned char, int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN18CUtlLeanVectorBaseIhiE19GetMinAllocElementsEv */
};

// <001305E3> ../public/tier0/utlleanvector.h:249
// member functions: 22
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<unsigned char, int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 2147483647,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<unsigned char, int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef unsigned char ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<unsigned char, int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<unsigned char, int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 4 */
	IndexType_t m_nAllocated; /* 4 4 */
	ElemType_t * m_pElements; /* 8 8 */
	void CUtlLeanVectorBase(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiEC4Ev */
	void ~CUtlLeanVectorBase(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiED4Ev */
	bool IsValidIndex(const class CUtlLeanVectorBase<unsigned char, int>  *, int); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE12IsValidIndexEi */
	int InvalidIndex(void); /* linkage=_ZN18CUtlLeanVectorBaseIhiE12InvalidIndexEv */
	ElemType_t * Base(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE4BaseEv */
	const ElemType_t  * Base(const class CUtlLeanVectorBase<unsigned char, int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE4BaseEv */
	void EnsureCapacity(class CUtlLeanVectorBase<unsigned char, int> *, int, bool); /* linkage=_ZN18CUtlLeanVectorBaseIhiE14EnsureCapacityEib */
	void RemoveAll(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE9RemoveAllEv */
	void Purge(class CUtlLeanVectorBase<unsigned char, int> *); /* linkage=_ZN18CUtlLeanVectorBaseIhiE5PurgeEv */
	size_t NonfixedAllocSize(const class CUtlLeanVectorBase<unsigned char, int>  *); /* linkage=_ZNK18CUtlLeanVectorBaseIhiE17NonfixedAllocSizeEv */
	IndexType_t GetMinAllocElements(void); /* linkage=_ZN18CUtlLeanVectorBaseIhiE19GetMinAllocElementsEv */
};

// <0013764E> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef class StaticComboVcsLoad_t * ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t*, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <00149E74> ../public/tier0/utlleanvector.h:249
// member functions: 11
// member variables: 3
// class size: 16
class CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int> {
	/* ../public/tier0/utlleanvector.h:256 */
	enum {
		IsUtlVector = 1,
		MaxElements = 32767,
	};
	/* ../public/tier0/utlleanvector.h:262 */
	void CUtlLeanVectorBase(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:268 */
	void ~CUtlLeanVectorBase(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:273 */
	bool IsValidIndex(const CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* , int);
	/* ../public/tier0/utlleanvector.h:275 */
	int InvalidIndex(void);
	/* ../public/tier0/utlleanvector.h:253 */
	typedef struct MaterialStaticComboLoadRequest_t ElemType_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/tier0/utlleanvector.h:277 */
	ElemType_t* Base(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:281 */
	const ElemType_t* Base(const CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:294 */
	void EnsureCapacity(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* , int, bool);
	/* ../public/tier0/utlleanvector.h:361 */
	void RemoveAll(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:368 */
	void Purge(CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:380 */
	size_t NonfixedAllocSize(const CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>* );
	/* ../public/tier0/utlleanvector.h:254 */
	typedef short int IndexType_t;
protected:
	/* ../public/tier0/utlleanvector.h:386 */
	IndexType_t GetMinAllocElements(void);
	IndexType_t m_nCount; /* 0 2 */
	IndexType_t m_nAllocated; /* 2 2 */
	ElemType_t * m_pElements; /* 8 8 */
};

// <067D13DB> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <067D13C2> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <004B1EAE> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <004B1E95> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F4E852> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CTransform, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F4E839> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CTransform, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F499EA> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CCachedPose, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F499D1> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CCachedPose, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00C4BFC8> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CIKChainDescription::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00C4BFAF> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CIKChainDescription::CUtlLeanVectorBase()
{
} /* size: 0 */

// <000EDED9> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<JointTreeNode::CUtlLeanVectorBase()
{
} /* size: 0 */

// <000EDEC0> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<JointTreeNode::CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E057> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<int, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E03E> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<int, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004DFE7> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<const IIKRuleDescription::CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004DFCE> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<const IIKRuleDescription::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00158495> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::CUtlLeanVectorBase()
{
} /* size: 0 */

// <0015847C> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00156B32> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00156B19> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00155DAE> ../public/tier0/utlleanvector.h:262
void CUtlLeanVectorBase<unsigned char, int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <00155D95> ../public/tier0/utlleanvector.h:262
inline void CUtlLeanVectorBase<unsigned char, int>::CUtlLeanVectorBase()
{
} /* size: 0 */

// <067D68AE> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <067D6895> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <004B65C9> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <004B65B0> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F607A9> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CTransform, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F60790> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CTransform, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F55320> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CCachedPose, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00F55307> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CCachedPose, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00C71E3F> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CIKChainDescription::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00C71E26> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CIKChainDescription::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <000F1AB5> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<JointTreeNode::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <000F1A9C> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<JointTreeNode::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E2AC> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<int, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E293> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<int, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E24C> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<const IIKRuleDescription::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <0004E233> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<const IIKRuleDescription::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00169C9F> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00169C86> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <001694F0> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <001694D7> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00168DE2> ../public/tier0/utlleanvector.h:268
void CUtlLeanVectorBase<unsigned char, int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <00168DC9> ../public/tier0/utlleanvector.h:268
inline void CUtlLeanVectorBase<unsigned char, int>::~CUtlLeanVectorBase()
{
} /* size: 0 */

// <068E87BD> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>::Base()
{
} /* size: 0 */

// <067D2A19> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::Base()
{
} /* size: 0 */

// <004B3343> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::Base()
{
} /* size: 0 */

// <00F4F75F> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<CCachedPose, short int>::Base()
{
} /* size: 0 */

// <000F0906> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<JointTreeNode::Base()
{
} /* size: 0 */

// <0015FE4E> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::Base()
{
} /* size: 0 */

// <0015FE03> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::Base()
{
} /* size: 0 */

// <0015E63E> ../public/tier0/utlleanvector.h:277
inline void CUtlLeanVectorBase<unsigned char, int>::Base()
{
} /* size: 0 */

// <01AED6B1> ../public/tier0/utlleanvector.h:281
inline void CUtlLeanVectorBase<const IIKRuleDescription::Base()
{
} /* size: 0 */

// <01722ADE> ../public/tier0/utlleanvector.h:281
inline void CUtlLeanVectorBase<CTransform, short int>::Base()
{
} /* size: 0 */

// <00C584EE> ../public/tier0/utlleanvector.h:281
inline void CUtlLeanVectorBase<CIKChainDescription::Base()
{
} /* size: 0 */

// <000F1363> ../public/tier0/utlleanvector.h:281
inline void CUtlLeanVectorBase<int, short int>::Base()
{
} /* size: 0 */

// <068E87D6> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62633
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <067D5AC8> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 6396
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <00FFF547> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 21860
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <004B1E19> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 37423
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <00F5528C> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CCachedPose, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 37700
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <00F4F82D> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CTransform, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 37700
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <00C4BEF7> ../public/tier0/utlleanvector.h:294
// variables: 5
void CUtlLeanVectorBase<CIKChainDescription::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 22033
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <000F1A21> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<JointTreeNode::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 31437
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <000EF7D0> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<const IIKRuleDescription::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 31437
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <000EF164> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CIKChainDescription::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 31437
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <000ED25D> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<int, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 31437
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <01585458> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 42974
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <0044FCF5> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 43480
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <007A4107> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<VfxStaticComboLoadRequest_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 21951
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <0016836D> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<unsigned char, int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <00156978> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <001568CB> ../public/tier0/utlleanvector.h:294
// variables: 5
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::EnsureCapacity(int nCapacity, bool bConservative)
{
	const char   __FUNCTION__; // 62934
	IndexType_t nNew; // 307
	{
		int* _pCrash; // 313
	}
	{
		ElemType_t* pNew; // 347
		ElemType_t* pBase; // 348
	}
} /* size: 0, variables: 2 */

// <067D2A32> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <004B335C> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <00F4E813> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CTransform, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <00F499AB> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CCachedPose, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <00C4BF89> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CIKChainDescription::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <000EDE9A> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<JointTreeNode::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <0004E0F4> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<const IIKRuleDescription::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <0004E017> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<int, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <001693AA> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <0015E657> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<unsigned char, int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <00156AF3> ../public/tier0/utlleanvector.h:361
// variable: 1
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::RemoveAll()
{
	ElemType_t* pBase; // 363
} /* size: 0, variables: 1 */

// <067D6863> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>::Purge()
{
} /* size: 0 */

// <004B5420> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>::Purge()
{
} /* size: 0 */

// <00F5473C> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CTransform, short int>::Purge()
{
} /* size: 0 */

// <00F4F77E> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CCachedPose, short int>::Purge()
{
} /* size: 0 */

// <00C5E0BD> ../public/tier0/utlleanvector.h:368
void CUtlLeanVectorBase<CIKChainDescription::Purge()
{
} /* size: 0 */

// <000F112E> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CIKChainDescription::Purge()
{
} /* size: 0 */

// <000F0926> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<JointTreeNode::Purge()
{
} /* size: 0 */

// <0004E21A> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<const IIKRuleDescription::Purge()
{
} /* size: 0 */

// <0004E14B> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<int, short int>::Purge()
{
} /* size: 0 */

// <00168FD0> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<CMaterial2::StaticComboVcsLoad_t::Purge()
{
} /* size: 0 */

// <00168CF0> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<unsigned char, int>::Purge()
{
} /* size: 0 */

// <0015FEC1> ../public/tier0/utlleanvector.h:368
inline void CUtlLeanVectorBase<MaterialStaticComboLoadRequest_t, short int>::Purge()
{
} /* size: 0 */

// <00C37F16> ../public/tier0/utlleanvector.h:386
void GetMinAllocElements(void)
{
} /* size: 0 */

// <069F7135> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>, unsigned char, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <069F7118> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<unsigned char, 12, short int>, unsigned char, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <069712DC> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <069712BF> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <067DF8F5> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>, unsigned int, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <067DF8D7> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<unsigned int, 9, short int>, unsigned int, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <067DF88B> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>, CEntityKeyValues::KeyValueInfo_ this)
{
} /* size: 0 */

// <067DF86D> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorBase<CEntityKeyValues::KeyValueInfo_t, short int>, CEntityKeyValues::KeyValueInfo_ this)
{
} /* size: 0 */

// <03AECD6C> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>, CWe this)
{
} /* size: 0 */

// <03AECD4F> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 8, short int>, CWe this)
{
} /* size: 0 */

// <03AECD04> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>, RenderImageLayout_t, short i this)
{
} /* size: 0 */

// <03AECCE7> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderImageLayout_t, 8, short int>, RenderImageLayout_t, short i this)
{
} /* size: 0 */

// <034754E6> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAttachmen this)
{
} /* size: 0 */

// <034754C9> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAttachmen this)
{
} /* size: 0 */

// <0347547E> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAttachmen this)
{
} /* size: 0 */

// <03475461> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAttachmen this)
{
} /* size: 0 */

// <03475416> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>, CWe this)
{
} /* size: 0 */

// <034753F9> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>, CWe this)
{
} /* size: 0 */

// <004C47F7> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>, CInputService::AsyncConfigFile_ this)
{
} /* size: 0 */

// <004C47DA> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorBase<CInputService::AsyncConfigFile_t, short int>, CInputService::AsyncConfigFile_ this)
{
} /* size: 0 */

// <00F95C59> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<CTransform, short int>, CTransform, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00F95C3C> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<CTransform, short int>, CTransform, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00F63F94> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<CCachedPose, short int>, CCachedPose, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00F63F77> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<CCachedPose, short int>, CCachedPose, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00CE392E> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<CIKChainDescription::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00CE3911> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<CIKChainDescription::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <000F5BDE> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<JointTreeNode::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <000F5BC1> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<JointTreeNode::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <0004EB06> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<int, short int>, int, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <0004EAE8> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<int, short int>, int, short int>::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <0004EA9C> ../public/tier0/utlleanvector.h:399
void CUtlLeanVectorImpl<CUtlLeanVectorBase<const IIKRuleDescription::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <0004EA7E> ../public/tier0/utlleanvector.h:399
inline void CUtlLeanVectorImpl<CUtlLeanVectorBase<const IIKRuleDescription::~CUtlLeanVectorImpl()
{
} /* size: 0 */

// <00B82B9A> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>, VkImageMemoryBarrier, shor this)
{
} /* size: 0 */

// <00B82B7D> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VkImageMemoryBarrier, 16, short int>, VkImageMemoryBarrier, shor this)
{
} /* size: 0 */

// <00ADB613> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>, RenderPassAttachmentD this)
{
} /* size: 0 */

// <00ADB5F6> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderPassAttachmentDesc_t, 8, short int>, RenderPassAttachmentD this)
{
} /* size: 0 */

// <00ADB5AB> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>, RenderPassSubPass_t, short i this)
{
} /* size: 0 */

// <00ADB58E> ../public/tier0/utlleanvector.h:399
inline void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderPassSubPass_t, 8, short int>, RenderPassSubPass_t, short i this)
{
} /* size: 0 */

// <00ADB543> ../public/tier0/utlleanvector.h:399
void ~CUtlLeanVectorImpl(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderPassSubPassDependency_t, 4, short int>, RenderPassSubPassD this)
{
} /* size: 0 */

// <00ADB526> ../public/tier0/utlleanvector.h:399
