
//
// resourcesystem/resourcesystem.h
//
//	referenced by: libengine2.so
//
//	functions: 35
//	class: 1
//	structs: 3
//

// <02345D36> resourcesystem/resourcesystem.h:50
void InstallManifestTypeManager(void)
{
} /* size: 0 */

// <02345D09> resourcesystem/resourcesystem.h:51
void RemoveManifestTypeManager(void)
{
} /* size: 0 */

// <02314408> resourcesystem/resourcesystem.h:62
// member variables: 2
// struct size: 16
struct ExtRefList_t {
	int m_nCount; /* 0 4 */
	ResourceId_t m_pIds[1]; /* 8 8 */
};

// <022C0ACF> resourcesystem/resourcesystem.h:94
inline ResourceHandleWritable_t MakeWritableHandle(ResourceHandle_t hResource)
{
} /* size: 0 */

// <02354187> resourcesystem/resourcesystem.h:99
void ResourceTypeRegistration_t::ResourceTypeRegistration_t()
{
} /* size: 0 */

// <0235416B> resourcesystem/resourcesystem.h:99
inline void ResourceTypeRegistration_t::ResourceTypeRegistration_t()
{
} /* size: 0 */

// <0224898A> resourcesystem/resourcesystem.h:99
// member variables: 20
// struct size: 152
struct ResourceTypeRegistration_t {
	ResourceType_t m_nResourceType; /* 0 8 */
	IResourceTypeManager * m_pTypeManager; /* 8 8 */
	ResourceData_t m_ErrorResource __attribute__((__aligned__(8))); /* 16 40 */
	const char * m_pResourceTypeName; /* 56 8 */
	HResourceManifest m_hErrorManifest; /* 64 8 */
	ResourceManifestPriority_t m_nTypeManifestPriority; /* 72 4 */
	int m_nLongUpdates; /* 76 4 */
	bool m_bUsesData; /* 80 1 */
	bool m_bIsPlaceholderEntry; /* 81 1 */
	bool m_bRequiresFinalizeResourceCall; /* 82 1 */
	bool m_bMemoryMappedFileDataIsAcceptable; /* 83 1 */
	uint m_nLoadedResources; /* 84 4 */
	int64 m_nAllocationUs; /* 88 8 */
	int64 m_nFinalizeUs; /* 96 8 */
	int64 m_nAsyncProcessDataUs; /* 104 8 */
	int64 m_nBytesLoaded; /* 112 8 */
	uint m_nStreamingRequests; /* 120 4 */
	int64 m_nBytesStreaming; /* 128 8 */
	int64 m_nStreamingUs; /* 136 8 */
	int64 m_nAsyncStreamingUs; /* 144 8 */
} __attribute__((__aligned__(8)));

// <0229AC91> resourcesystem/resourcesystem.h:133
void DebugResourceId(ResourceId_t)
{
} /* size: 0 */

// <02248E68> resourcesystem/resourcesystem.h:138
// member function: 1
// struct size: 1
struct ExtRefHashFunc_t {
	/* resourcesystem/resourcesystem.h:140 */
	unsigned int operator()(const ExtRefHashFunc_t* , const ResourceId_t& );
};

// <023827B2> resourcesystem/resourcesystem.h:140
inline void ExtRefHashFunc_t::operator(const ResourceId_t& s)
{
} /* size: 0 */

// <023157E6> resourcesystem/resourcesystem.h:150
// member functions: 307
// member variables: 37
// vtable entries: 82
// class size: 99,248
class CResourceSystem : public CTier2AppSystem<IResourceSystem, 0>, public IResourceSystemUtils, public IResourceHandleUtils, public IResourceManifestRegistry {
	/* resourcesystem/resourcesystem.h:322 */
	enum ResourceBindingFlagsInternal_t {
		RESOURCE_BINDING_HAS_ATTEMPTED_DELETION = 512,
		RESOURCE_BINDING_NEEDS_FINALIZATION = 1024,
		RESOURCE_BINDING_HAS_MOUNTED_VPK = 2048,
		RESOURCE_BINDING_LAST_UNUSED_FLAG = 4096,
	};
	/* resourcesystem/resourcesystem.h:332 */
	struct ForcedSynchronizationCallbackInfo_t {
		/* resourcesystem/resourcesystem.h:334 */
		bool operator==(const ForcedSynchronizationCallbackInfo_t* , const ForcedSynchronizationCallbackInfo_t& );
		ResourceSystemForcedSynchronizationCallback_t m_pCallback; /* 0 8 */
		void * m_pContext; /* 8 8 */
	};
	/* tag__fprintf: const_type tag not supported! */;
public:
	/* class CTier2AppSystem<IResourceSystem, 0> <ancestor>; */ /* 0 48 */
	/* class IResourceSystemUtils <ancestor>; */ /* 48 8 */
	/* class IResourceHandleUtils <ancestor>; */ /* 56 8 */
	/* class IResourceManifestRegistry <ancestor>; */ /* 64 8 */
	void CResourceSystem(CResourceSystem* , const CResourceSystem& );
	/* resourcesystem/resourcesystem.cpp:675 */
	virtual InitReturnVal_t Init(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1976 */
	virtual void PreShutdown(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:758 */
	virtual void Shutdown(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:205 */
	virtual const AppSystemInfo_t* GetDependencies(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:210 */
	virtual void* QueryInterface(CResourceSystem* , const char* );
	/* resourcesystem/resourcesystem.cpp:418 */
	virtual void InstallTypeManager(CResourceSystem* , ResourceType_t, IResourceTypeManager* , const char* , const char* );
	/* resourcesystem/resourcesystem.cpp:366 */
	virtual void InstallNullTypeManager(CResourceSystem* , ResourceType_t, const char* );
	/* resourcesystem/resourcesystem.cpp:529 */
	virtual void RemoveResourceTypeManager(CResourceSystem* , IResourceTypeManager* );
	/* resourcesystem/resourcesystem.cpp:399 */
	virtual void RemoveNullTypeManager(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:654 */
	virtual IResourceTypeManager* GetTypeManager(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:2068 */
	virtual HResourceManifest LoadResourceManifestFile(CResourceSystem* , const char* , ResourceManifestLoadBehavior_t, const char* , ResourceManifestLoadPriority_t);
	/* resourcesystem/resourcesystem.cpp:2042 */
	virtual HResourceManifest LoadResourceManifestGroup(CResourceSystem* , const char* , ResourceManifestLoadBehavior_t, const char* , ResourceManifestLoadPriority_t);
	/* resourcesystem/resourcesystem.cpp:2055 */
	virtual HResourceManifest LoadResourceManifestNamed(CResourceSystem* , const char* , ResourceManifestLoadBehavior_t, const char* , ResourceManifestLoadPriority_t);
	/* resourcesystem/resourcesystem.cpp:2078 */
	virtual HResourceManifest CreateResourceManifest(CResourceSystem* , const ResourceManifestCreationInfo_t& );
	/* resourcesystem/resourcesystem.cpp:2217 */
	virtual void SetManifestCompletionCallback(CResourceSystem* , HResourceManifest, ResourceManifestLoadCompletionCallback_t, void* );
	/* resourcesystem/resourcesystem.cpp:1599 */
	virtual bool IsManifestLoaded(CResourceSystem* , HResourceManifest);
	/* resourcesystem/resourcesystem.cpp:2229 */
	virtual const char* GetResourceManifestDebugName(CResourceSystem* , HResourceManifest);
	/* resourcesystem/resourcesystem.cpp:2184 */
	virtual void DestroyResourceManifest(CResourceSystem* , HResourceManifest);
	/* resourcesystem/resourcesystem.cpp:2399 */
	virtual void Update(CResourceSystem* , int, ResourceSystemUpdateMode_t);
	/* resourcesystem/resourcesystem.cpp:2407 */
	virtual void UpdateSimple(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2648 */
	virtual bool HasPendingWork(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2705 */
	virtual void RegisterFinishedFrameCounter(CResourceSystem* , uint32* );
	/* resourcesystem/resourcesystem.cpp:2714 */
	virtual void UnregisterFinishedFrameCounter(CResourceSystem* , uint32* );
	/* resourcesystem/resourcesystem.cpp:980 */
	virtual int GetNamedResourceCount(const CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:985 */
	virtual int GetNamedResources(CResourceSystem* , int, int, ResourceHandle_t* , ResourceSystemGetNamedResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:990 */
	virtual void GetAllNamedResourcesByType(CResourceSystem* , ResourceType_t, CUtlVector<const ResourceBindingBase_t*, CUtlMemory<const ResourceBindingBase_t*, int> >& , ResourceSystemGetNamedResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:995 */
	virtual int GetAllResourceCount(const CResourceSystem* , ResourceSystemGetResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:1009 */
	virtual int GetAllResources(CResourceSystem* , int, int, ResourceHandle_t* , ResourceSystemGetResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:1049 */
	virtual void GetAllResourcesByType(CResourceSystem* , ResourceType_t, CUtlVector<const ResourceBindingBase_t*, CUtlMemory<const ResourceBindingBase_t*, int> >& , ResourceSystemGetResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:1112 */
	virtual ResourceHandle_t FindOrRegisterResourceByName(CResourceSystem* , const CResourceName& , bool);
	/* resourcesystem/resourcesystem.cpp:1309 */
	virtual ResourceHandle_t FindResourceById(CResourceSystem* , ResourceId_t, ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:1417 */
	virtual ResourceHandle_t FindOrCreateProceduralResource(CResourceSystem* , const CResourceName& , void* , ProceduralResourceType_t);
	/* resourcesystem/resourcesystem.h:506 */
	virtual void GetResourceName(CResourceSystem* , ResourceHandle_t, CBufferString* , bool);
	/* resourcesystem/resourcesystem.h:521 */
	virtual void GetResourceName(CResourceSystem* , ResourceHandle_t, CResourceName* );
	/* resourcesystem/resourcesystem.h:526 */
	virtual ResourceType_t GetResourceType(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:1481 */
	virtual void DeleteResource(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.h:538 */
	virtual ResourceHandle_t GetErrorResource(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:3040 */
	virtual const char* GetResourceTypeName(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:789 */
	virtual void MarkErrorResourcesReloaded(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1443 */
	virtual ResourceHandle_t CreateEmptyResource(CResourceSystem* , const CResourceName& );
	/* resourcesystem/resourcesystem.cpp:1184 */
	virtual ResourceHandle_t BlockingLoadResourceByName(CResourceSystem* , const CResourceName& , const char* );
	/* resourcesystem/resourcesystem.cpp:1237 */
	virtual ResourceHandle_t BlockingLoadResourceByNameIntoJustInTimeManifest(CResourceSystem* , const CResourceName& , const char* );
	/* resourcesystem/resourcesystem.cpp:1280 */
	virtual void FreeJustInTimeManifests(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1289 */
	virtual int GetJustInTimeManifestCount(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1294 */
	virtual void GetJustInTimeManifestResources(CResourceSystem* , CUtlVector<const ResourceBindingBase_t*, CUtlMemory<const ResourceBindingBase_t*, int> >& );
	/* resourcesystem/resourcesystem.cpp:1205 */
	virtual void EnsureResourceByNameIntoJustInTimeManifest(CResourceSystem* , const CResourceName& , const char* );
	/* resourcesystem/resourcesystem.cpp:3054 */
	virtual void InstallResourceUpdater(CResourceSystem* , IResourceUpdater* );
	/* resourcesystem/resourcesystem.cpp:3063 */
	virtual void UninstallResourceUpdater(CResourceSystem* , IResourceUpdater* );
	/* resourcesystem/resourcesystem.cpp:3093 */
	virtual void GetActualFileName(CResourceSystem* , ResourceHandle_t, CBufferString* , bool);
	/* resourcesystem/resourcesystem.cpp:1385 */
	virtual ResourceStatus_t GetResourceStatus(CResourceSystem* , ResourceId_t);
	/* resourcesystem/resourcesystem.cpp:1361 */
	virtual ResourceStatus_t GetResourceStatus(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:1356 */
	virtual ResourceStatus_t GetResourceStatus(CResourceSystem* , const CResourceName& );
	/* resourcesystem/resourcesystem.h:217 */
	virtual ResourceType_t GetResourceHandleType(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:3141 */
	virtual void RegisterForcedSynchronizationCallback(CResourceSystem* , ResourceSystemForcedSynchronizationCallback_t, void* );
	/* resourcesystem/resourcesystem.cpp:3151 */
	virtual void UnregisterForcedSynchronizationCallback(CResourceSystem* , ResourceSystemForcedSynchronizationCallback_t, void* );
	/* resourcesystem/resourcesystem.cpp:2241 */
	virtual void GetResourcesNamesInManifest(const CResourceSystem* , HResourceManifest, CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >& );
	/* resourcesystem/resourcesystem.cpp:2804 */
	virtual void ForceSynchronizationAndBlockUntilManifestLoaded(CResourceSystem* , HResourceManifest);
	/* resourcesystem/resourcesystem.cpp:2772 */
	virtual void BlockingFinishAllCurrentlyLoadingManifests(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2910 */
	virtual void RegisterToolsResourceListener(CResourceSystem* , IToolsResourceListener* );
	/* resourcesystem/resourcesystem.cpp:2921 */
	virtual void UnregisterToolsResourceListener(CResourceSystem* , IToolsResourceListener* );
	/* resourcesystem/resourcesystem.cpp:2949 */
	virtual ICodeResourceManifestManager* GetCodeResourceManifestManager(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2957 */
	virtual IResourceSystemLeakTracker* GetLeakTracker(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2453 */
	virtual bool HasCompletedIORequests(CResourceSystem* );
	/* resourcesystem/resourcesystem.h:580 */
	virtual void EnableDebugMode(CResourceSystem* , ResourceSystemDebugMode_t, bool);
	/* resourcesystem/resourcesystem.cpp:1965 */
	virtual AsyncRequestPriority_t GetAsyncFileRequestPriority(const CResourceSystem* , ResourceManifestLoadPriority_t);
	/* resourcesystem/resourcesystem.h:236 */
	virtual IGenericDataTypeManager* GetGenericDataTypeManager(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:3178 */
	virtual void ReloadSymlinkedResidentResources(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2672 */
	virtual void RegisterResourceSystemUser(CResourceSystem* , uint32* );
	/* resourcesystem/resourcesystem.cpp:2681 */
	virtual void UnregisterResourceSystemUser(CResourceSystem* , uint32* );
	/* resourcesystem/resourcesystem.cpp:2689 */
	virtual void RegisterNamedManifest(CResourceSystem* , ResourceManifestDesc_t* );
	/* resourcesystem/resourcesystem.cpp:2697 */
	virtual void UnregisterNamedManifest(CResourceSystem* , ResourceManifestDesc_t* );
	/* resourcesystem/resourcesystem.cpp:1613 */
	virtual void ResourceReferenceLeakTracking_AddRef(CResourceSystem* , ResourceHandle_t, ResourceLeakTrackingGroup_t, uintp);
	/* resourcesystem/resourcesystem.cpp:1621 */
	virtual void ResourceReferenceLeakTracking_Release(CResourceSystem* , ResourceHandle_t, ResourceLeakTrackingGroup_t, uintp);
	/* resourcesystem/resourcesystem.cpp:1629 */
	virtual void ResourceReferenceLeakTracking_ReportReferences(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:1638 */
	virtual void MarkLoadingWorkPending(CResourceSystem* , ResourceHandle_t, bool);
	/* resourcesystem/resourcesystem.cpp:1671 */
	virtual IAsyncResourceDataRequest* CreateAsyncResourceDataRequest(CResourceSystem* , ResourceHandle_t, int64, size_t, const char* );
	/* resourcesystem/resourcesystem.cpp:1680 */
	virtual void SubmitAsyncResourceDataRequest(CResourceSystem* , IAsyncResourceDataRequest* );
	/* resourcesystem/resourcesystem.h:258 */
	virtual bool IsBlockingOnManifestLoad(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1948 */
	virtual void SetResourceTypeManifestPriority(CResourceSystem* , ResourceType_t, ResourceManifestPriority_t);
	/* resourcesystem/resourcesystem.cpp:160 */
	void CResourceSystem(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:188 */
	virtual void ~CResourceSystem(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2979 */
	bool RegisterResourceExternalReference(CResourceSystem* , ResourceHandle_t, const CResourceName& , CStrongHandleVoid* );
	/* resourcesystem/resourcesystem.cpp:2086 */
	HResourceManifest CreateResourceManifestInternal(CResourceSystem* , const ResourceManifestCreationInfo_t& , bool);
	/* resourcesystem/resourcesystem.cpp:945 */
	int GetResourcesInMap(CResourceSystem* , ResourceIdMap_t* , int, int, ResourceHandle_t* , ResourceSystemGetNamedResourcesFlags_t);
	/* resourcesystem/resourcesystem.h:262 */
	typedef struct CUtlTSHash<ResourceBindingBase_t, 1021, long long unsigned int, CUtlTSHashGenericHashMethod<long long unsigned int> > ResourceIdMap_t;
	/* resourcesystem/resourcesystem.cpp:961 */
	void GetAllResourcesByTypeInMap(CResourceSystem* , ResourceIdMap_t* , ResourceType_t, CUtlVector<const ResourceBindingBase_t*, CUtlMemory<const ResourceBindingBase_t*, int> >& , ResourceSystemGetNamedResourcesFlags_t);
	/* resourcesystem/resourcesystem.cpp:3120 */
	ResourceNameHandleInternal_t MakeResourceNameSymbol(CResourceSystem* , const char* );
	/* resourcesystem/resourcesystem.cpp:1526 */
	void MaybeExitBecauseOfResourceLoadFailure(CResourceSystem* , const char* );
	/* resourcesystem/resourcesystem.h:555 */
	LoadingResourceManifestIndex_t AllocateLoadingManifestIndex(CResourceSystem* , CResourceManifest* );
	/* resourcesystem/resourcesystem.h:561 */
	void FreeLoadingManifestIndex(CResourceSystem* , LoadingResourceManifestIndex_t);
	/* resourcesystem/resourcesystem.h:571 */
	CResourceManifest* GetLoadingManifest(CResourceSystem* , LoadingResourceManifestIndex_t);
	/* resourcesystem/resourcesystem.h:282 */
	IResourceUpdater* GetResourceUpdater(CResourceSystem* );
	/* resourcesystem/resourcesystem.h:489 */
	virtual ResourceId_t ResourceHandleToResourceId(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:1100 */
	const ResourceTypeRegistration_t* GetRegistrationForResource(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.h:288 */
	CThreadEvent* GetResourceProgresEvent(CResourceSystem* );
	/* resourcesystem/resourcesystem.h:290 */
	int GetFrameCount(CResourceSystem* );
	/* resourcesystem/resourcesystem.h:291 */
	virtual bool IsShuttingDown(CResourceSystem* );
	/* resourcesystem/resourcesystem.h:473 */
	bool InFrameUpdate(const CResourceSystem* );
	/* resourcesystem/resourcesystem.h:293 */
	virtual bool IsInFrameUpdate(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2385 */
	void MarkResourceNeedingFinalization(CResourceSystem* , ResourceHandleWritable_t, bool);
	/* resourcesystem/resourcesystem.h:596 */
	bool DoesResourceNeedFinalization(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:2931 */
	void NotifyToolsResourceListenersForPreReload(CResourceSystem* , ResourceId_t, ResourceHandle_t, ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:878 */
	void AllocExtRefs(CResourceSystem* , ResourceHandleWritable_t, int, ResourceHandle_t* );
	/* resourcesystem/resourcesystem.cpp:908 */
	void FreeExtRefs(CResourceSystem* , ResourceHandleWritable_t);
	/* resourcesystem/resourcesystem.cpp:919 */
	void BuildExtRefListForResource(CResourceSystem* , ResourceHandle_t, ExtRefHashTable_t* );
	/* resourcesystem/resourcesystem.cpp:1342 */
	ResourceHandle_t FindResourceByIdNoFallbacks(CResourceSystem* , ResourceId_t);
	/* resourcesystem/resourcesystem.cpp:1957 */
	bool HasResourceTypeManifestPriorityBeenSet(const CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2898 */
	bool IsCurrentlyProcessingReloadManifest(const CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2903 */
	bool IsCurrentReloadingResource(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:2144 */
	void EnqueueResourceManifest(CResourceSystem* , CResourceManifest* );
	/* resourcesystem/resourcesystem.cpp:2171 */
	void NotifyResourceManifestDeleted(CResourceSystem* , CResourceManifest* );
	/* resourcesystem/resourcesystem.h:587 */
	bool IsDebugModeEnabled(const CResourceSystem* , ResourceSystemDebugMode_t);
	/* resourcesystem/resourcesystem.cpp:3286 */
	void LogAllocateTimes(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:3373 */
	void ResetAllocateTimes(CResourceSystem* );
private:
	/* resourcesystem/resourcesystem.cpp:2252 */
	void GetResourcesNamesInManifestInternal(const CResourceSystem* , const CResourceManifest* , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >& );
	/* resourcesystem/resourcesystem.cpp:1403 */
	ResourceHandle_t CreateAnonymousProceduralResource(CResourceSystem* , const CResourceName& , void* );
	/* resourcesystem/resourcesystem.cpp:3072 */
	void GetFileName(CResourceSystem* , ResourceHandle_t, CBufferString* , bool);
	/* resourcesystem/resourcesystem.cpp:1066 */
	ResourceTypeIndex_t ResourceTypeToTypeIndex_DoNotCreatePlaceholder(const CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:1077 */
	ResourceTypeIndex_t ResourceTypeToTypeIndex_CreatePlaceholder(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:2462 */
	void Update_Internal(CResourceSystem* , int, ResourceSystemUpdateMode_t, bool, bool);
	/* resourcesystem/resourcesystem.h:352 */
	void Update_Internal_FastSpin(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2415 */
	void FrameUpdateForTypeManager(CResourceSystem* , int, int);
	/* resourcesystem/resourcesystem.cpp:1687 */
	void GetActiveManifestState(const CResourceSystem* , bool* , bool* );
	/* resourcesystem/resourcesystem.cpp:3129 */
	ResourceType_t ResourceHandleToResourceType(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.h:544 */
	void* GetErrorResourceData(const CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.h:549 */
	void* GetErrorResourceData(const CResourceSystem* , ResourceTypeIndex_t);
	/* resourcesystem/resourcesystem.cpp:2966 */
	ResourceDeallocationType_t ComputeDeallocationType(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.h:481 */
	ResourceHandle_t HashHandleToResourceHandle(const CResourceSystem* , UtlTSHashHandle_t);
	/* resourcesystem/resourcesystem.cpp:857 */
	void AllocResourceName(CResourceSystem* , ResourceHandleWritable_t, const CResourceName& );
	/* resourcesystem/resourcesystem.cpp:870 */
	void FreeResourceName(CResourceSystem* , ResourceHandleWritable_t);
	/* resourcesystem/resourcesystem.cpp:2737 */
	void UpdateFrameCounters(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:2722 */
	uint32 ComputeFinishedFrameCount(const CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1882 */
	void ExecuteResourceManifestRequests(CResourceSystem* , bool);
	/* resourcesystem/resourcesystem.cpp:2747 */
	bool RemoveManifestFromPendingLoadQueue(CResourceSystem* , CResourceManifest* );
	/* resourcesystem/resourcesystem.cpp:2318 */
	void MN_DeleteRequestedResources(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1545 */
	void MN_DeallocateResourceData(CResourceSystem* , ResourceHandleWritable_t);
	/* resourcesystem/resourcesystem.cpp:2277 */
	bool MN_PotentiallyDeleteResource(CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:2353 */
	void MN_UpdateErrorResources(CResourceSystem* , bool);
	/* resourcesystem/resourcesystem.cpp:1451 */
	ResourceHandle_t CreateEmptyResourceInternal(CResourceSystem* , const CResourceName& , bool);
	/* resourcesystem/resourcesystem.cpp:536 */
	void WarnAboutResourceTypeLeaks(CResourceSystem* , ResourceIdMap_t* , ResourceTypeIndex_t, const char* );
	/* resourcesystem/resourcesystem.cpp:587 */
	void RemoveResourceTypeManagerInternal(CResourceSystem* , IResourceTypeManager* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:715 */
	void WarnAboutLiveResourceLeaks(CResourceSystem* , ResourceIdMap_t* );
	/* resourcesystem/resourcesystem.cpp:742 */
	void HaltAndCleanupPendingResources(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:332 */
	ResourceTypeIndex_t Internal_InstallPlaceholderTypeManager(CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:663 */
	void LoadMissingResourceWhitelist(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1996 */
	void ImmediatelyProcessAllAsyncRequestsOnShutdown(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:1847 */
	bool GetManifestToStartLoading(CResourceSystem* , CResourceManifest** );
	/* resourcesystem/resourcesystem.cpp:1730 */
	void FinalizeOrAdvanceLoadingManifests(CResourceSystem* , int, CResourceManifest** );
	/* resourcesystem/resourcesystem.cpp:1091 */
	const ResourceTypeRegistration_t* GetRegistrationForType(const CResourceSystem* , ResourceTypeIndex_t);
	/* resourcesystem/resourcesystem.cpp:1086 */
	const ResourceTypeRegistration_t* GetRegistrationForType(const CResourceSystem* , ResourceType_t);
	/* resourcesystem/resourcesystem.cpp:1713 */
	bool IsResourceCurrentlyLoading(const CResourceSystem* , ResourceHandle_t);
	/* resourcesystem/resourcesystem.cpp:3169 */
	void ForceSynchronization(CResourceSystem* );
	/* resourcesystem/resourcesystem.cpp:900 */
	ExtRefList_t* GetExtRefsForResource(CResourceSystem* , ResourceHandle_t);
	CUtlVector<ResourceTypeRegistration_t, CUtlMemory<ResourceTypeRegistration_t, int> > m_ResourceType; /* 72 32 */
	int m_nFrameCount; /* 104 4 */
	int m_nBlockingLoadCount; /* 108 4 */
	CUtlVector<unsigned int*, CUtlMemory<unsigned int*, int> > m_FrameCounters; /* 112 32 */
	CUtlVector<unsigned int*, CUtlMemory<unsigned int*, int> > m_FinishedFrameCounters; /* 144 32 */
	CInterlockedInt m_nPendingGlobalStreamingDataRequests __attribute__((__aligned__(4))); /* 176 4 */
	CTSQueue<CResourceManifest*, false> m_PendingResourceManifests __attribute__((__aligned__(16))); /* 192 64 */
	CTSQueue<CResourceManifest*, false> m_PendingResourceManifestDeletions __attribute__((__aligned__(16))); /* 256 64 */
	CResourceManifest * m_pActiveBlockingManifest; /* 320 8 */
	CUtlLinkedList<CResourceManifest*, short unsigned int, false, short unsigned int, CUtlMemory<UtlLinkedListElem_t<CResourceManifest*, short unsigned int>, short unsigned int> > m_activeResourceManifests; /* 328 40 */
	CUtlBlockLinkedList<ExtRefList_t*, unsigned int> m_extRefs; /* 368 48 */
	CTSQueue<const ResourceBindingBase_t*, false> m_DeletionRequests __attribute__((__aligned__(16))); /* 416 64 */
	CUtlVector<HResourceManifest__*, CUtlMemory<HResourceManifest__*, int> > m_JustInTimeManifests; /* 480 32 */
	IResourceUpdater * m_pResourceUpdater; /* 512 8 */
	uint64 m_nLongTypeManagerUpdateRelativeTicks; /* 520 8 */
	ResourceIdMap_t m_IdMap __attribute__((__aligned__(16))); /* 528 49088 */
	ResourceIdMap_t m_AnonymousMap __attribute__((__aligned__(16))); /* 49616 49088 */
	CInterlockedUInt64 m_nNextAnonymousId __attribute__((__aligned__(8))); /* 98704 8 */
	bool m_bErrorResourcesReloaded; /* 98712 1 */
	bool m_bInFrameUpdate; /* 98713 1 */
	bool m_bDisallowNewManifestsStarting; /* 98714 1 */
	bool m_bShuttingDown; /* 98715 1 */
	bool m_bDrainingAllAsyncRequests; /* 98716 1 */
	bool m_bExitOnResourceLoadFailure; /* 98717 1 */
	bool m_bTypeManifestPriorityHasBeenSpecified; /* 98718 1 */
	bool m_bSpewBlockingLoads; /* 98719 1 */
	CThreadEvent m_ResourceProgressEvent; /* 98720 128 */
	CUtlSymbolTableLarge m_ResourceNameSymbols; /* 98848 144 */
	CThreadFastMutex m_ResourceNameSymbolMutex; /* 98992 24 */
	CUtlStringList m_whiteListedMissingResourceNames; /* 99016 32 */
	CUtlVectorFixedGrowable<CResourceSystem::ForcedSynchronizationCallbackInfo_t, 8> m_ForcedSynchronizationCallbacks __attribute__((__aligned__(8))); /* 99048 160 */
	CUtlVector<IToolsResourceListener*, CUtlMemory<IToolsResourceListener*, int> > m_ToolsResourceListeners; /* 99208 32 */
	bool m_pDebugModeEnabled[3]; /* 99240 3 */
	class CThreadEvent * GetResourceProgresEvent(class CResourceSystem *); /* linkage=_ZN15CResourceSystem23GetResourceProgresEventEv */
	class IResourceUpdater * GetResourceUpdater(class CResourceSystem *); /* linkage=_ZN15CResourceSystem18GetResourceUpdaterEv */
	/* <22c2eea> resourcesystem/resourcesystem.h:291 */
	virtual bool IsShuttingDown(class CResourceSystem *); /* linkage=_ZN15CResourceSystem14IsShuttingDownEv */
	virtual class IGenericDataTypeManager * GetGenericDataTypeManager(class CResourceSystem *); /* linkage=_ZN15CResourceSystem25GetGenericDataTypeManagerEv */
	void AllocExtRefs(class CResourceSystem *, ResourceHandleWritable_t, int, ResourceHandle_t *); /* linkage=_ZN15CResourceSystem12AllocExtRefsEP21ResourceBindingBase_tiPPKS0_ */
	/* <238ada3> resourcesystem/resourcesystem.cpp:1526 */
	void MaybeExitBecauseOfResourceLoadFailure(class CResourceSystem *, const char  *); /* linkage=_ZN15CResourceSystem37MaybeExitBecauseOfResourceLoadFailureEPKc */
