
//
// thirdparty/vulkan/volk/volk.h
//
//	referenced by: librendersystemvulkan.so
//
//	functions: 3
//	struct: 1
//

// <008BF99A> ../thirdparty/vulkan/volk/volk.h:65
VkResult volkInitialize(void)
{
} /* size: 0 */

// <008BF8E5> ../thirdparty/vulkan/volk/volk.h:94
void volkLoadInstance(VkInstance)
{
} /* size: 0 */

// <009A6614> ../thirdparty/vulkan/volk/volk.h:107
void volkLoadDevice(VkDevice)
{
} /* size: 0 */

// <00D36CDB> ../thirdparty/vulkan/volk/volk.h:130
// member variables: 575
// struct size: 4,600
struct VolkDeviceTable {
	PFN_vkAllocateCommandBuffers vkAllocateCommandBuffers; /* 0 8 */
	PFN_vkAllocateDescriptorSets vkAllocateDescriptorSets; /* 8 8 */
	PFN_vkAllocateMemory vkAllocateMemory; /* 16 8 */
	PFN_vkBeginCommandBuffer vkBeginCommandBuffer; /* 24 8 */
	PFN_vkBindBufferMemory vkBindBufferMemory; /* 32 8 */
	PFN_vkBindImageMemory vkBindImageMemory; /* 40 8 */
	PFN_vkCmdBeginQuery vkCmdBeginQuery; /* 48 8 */
	PFN_vkCmdBeginRenderPass vkCmdBeginRenderPass; /* 56 8 */
	PFN_vkCmdBindDescriptorSets vkCmdBindDescriptorSets; /* 64 8 */
	PFN_vkCmdBindIndexBuffer vkCmdBindIndexBuffer; /* 72 8 */
	PFN_vkCmdBindPipeline vkCmdBindPipeline; /* 80 8 */
	PFN_vkCmdBindVertexBuffers vkCmdBindVertexBuffers; /* 88 8 */
	PFN_vkCmdBlitImage vkCmdBlitImage; /* 96 8 */
	PFN_vkCmdClearAttachments vkCmdClearAttachments; /* 104 8 */
	PFN_vkCmdClearColorImage vkCmdClearColorImage; /* 112 8 */
	PFN_vkCmdClearDepthStencilImage vkCmdClearDepthStencilImage; /* 120 8 */
	PFN_vkCmdCopyBuffer vkCmdCopyBuffer; /* 128 8 */
	PFN_vkCmdCopyBufferToImage vkCmdCopyBufferToImage; /* 136 8 */
	PFN_vkCmdCopyImage vkCmdCopyImage; /* 144 8 */
	PFN_vkCmdCopyImageToBuffer vkCmdCopyImageToBuffer; /* 152 8 */
	PFN_vkCmdCopyQueryPoolResults vkCmdCopyQueryPoolResults; /* 160 8 */
	PFN_vkCmdDispatch vkCmdDispatch; /* 168 8 */
	PFN_vkCmdDispatchIndirect vkCmdDispatchIndirect; /* 176 8 */
	PFN_vkCmdDraw vkCmdDraw; /* 184 8 */
	PFN_vkCmdDrawIndexed vkCmdDrawIndexed; /* 192 8 */
	PFN_vkCmdDrawIndexedIndirect vkCmdDrawIndexedIndirect; /* 200 8 */
	PFN_vkCmdDrawIndirect vkCmdDrawIndirect; /* 208 8 */
	PFN_vkCmdEndQuery vkCmdEndQuery; /* 216 8 */
	PFN_vkCmdEndRenderPass vkCmdEndRenderPass; /* 224 8 */
	PFN_vkCmdExecuteCommands vkCmdExecuteCommands; /* 232 8 */
	PFN_vkCmdFillBuffer vkCmdFillBuffer; /* 240 8 */
	PFN_vkCmdNextSubpass vkCmdNextSubpass; /* 248 8 */
	PFN_vkCmdPipelineBarrier vkCmdPipelineBarrier; /* 256 8 */
	PFN_vkCmdPushConstants vkCmdPushConstants; /* 264 8 */
	PFN_vkCmdResetEvent vkCmdResetEvent; /* 272 8 */
	PFN_vkCmdResetQueryPool vkCmdResetQueryPool; /* 280 8 */
	PFN_vkCmdResolveImage vkCmdResolveImage; /* 288 8 */
	PFN_vkCmdSetBlendConstants vkCmdSetBlendConstants; /* 296 8 */
	PFN_vkCmdSetDepthBias vkCmdSetDepthBias; /* 304 8 */
	PFN_vkCmdSetDepthBounds vkCmdSetDepthBounds; /* 312 8 */
	PFN_vkCmdSetEvent vkCmdSetEvent; /* 320 8 */
	PFN_vkCmdSetLineWidth vkCmdSetLineWidth; /* 328 8 */
	PFN_vkCmdSetScissor vkCmdSetScissor; /* 336 8 */
	PFN_vkCmdSetStencilCompareMask vkCmdSetStencilCompareMask; /* 344 8 */
	PFN_vkCmdSetStencilReference vkCmdSetStencilReference; /* 352 8 */
	PFN_vkCmdSetStencilWriteMask vkCmdSetStencilWriteMask; /* 360 8 */
	PFN_vkCmdSetViewport vkCmdSetViewport; /* 368 8 */
	PFN_vkCmdUpdateBuffer vkCmdUpdateBuffer; /* 376 8 */
	PFN_vkCmdWaitEvents vkCmdWaitEvents; /* 384 8 */
	PFN_vkCmdWriteTimestamp vkCmdWriteTimestamp; /* 392 8 */
	PFN_vkCreateBuffer vkCreateBuffer; /* 400 8 */
	PFN_vkCreateBufferView vkCreateBufferView; /* 408 8 */
	PFN_vkCreateCommandPool vkCreateCommandPool; /* 416 8 */
	PFN_vkCreateComputePipelines vkCreateComputePipelines; /* 424 8 */
	PFN_vkCreateDescriptorPool vkCreateDescriptorPool; /* 432 8 */
	PFN_vkCreateDescriptorSetLayout vkCreateDescriptorSetLayout; /* 440 8 */
	PFN_vkCreateEvent vkCreateEvent; /* 448 8 */
	PFN_vkCreateFence vkCreateFence; /* 456 8 */
	PFN_vkCreateFramebuffer vkCreateFramebuffer; /* 464 8 */
	PFN_vkCreateGraphicsPipelines vkCreateGraphicsPipelines; /* 472 8 */
	PFN_vkCreateImage vkCreateImage; /* 480 8 */
	PFN_vkCreateImageView vkCreateImageView; /* 488 8 */
	PFN_vkCreatePipelineCache vkCreatePipelineCache; /* 496 8 */
	PFN_vkCreatePipelineLayout vkCreatePipelineLayout; /* 504 8 */
	PFN_vkCreateQueryPool vkCreateQueryPool; /* 512 8 */
	PFN_vkCreateRenderPass vkCreateRenderPass; /* 520 8 */
	PFN_vkCreateSampler vkCreateSampler; /* 528 8 */
	PFN_vkCreateSemaphore vkCreateSemaphore; /* 536 8 */
	PFN_vkCreateShaderModule vkCreateShaderModule; /* 544 8 */
	PFN_vkDestroyBuffer vkDestroyBuffer; /* 552 8 */
	PFN_vkDestroyBufferView vkDestroyBufferView; /* 560 8 */
	PFN_vkDestroyCommandPool vkDestroyCommandPool; /* 568 8 */
	PFN_vkDestroyDescriptorPool vkDestroyDescriptorPool; /* 576 8 */
	PFN_vkDestroyDescriptorSetLayout vkDestroyDescriptorSetLayout; /* 584 8 */
	PFN_vkDestroyDevice vkDestroyDevice; /* 592 8 */
	PFN_vkDestroyEvent vkDestroyEvent; /* 600 8 */
	PFN_vkDestroyFence vkDestroyFence; /* 608 8 */
	PFN_vkDestroyFramebuffer vkDestroyFramebuffer; /* 616 8 */
	PFN_vkDestroyImage vkDestroyImage; /* 624 8 */
	PFN_vkDestroyImageView vkDestroyImageView; /* 632 8 */
	PFN_vkDestroyPipeline vkDestroyPipeline; /* 640 8 */
	PFN_vkDestroyPipelineCache vkDestroyPipelineCache; /* 648 8 */
	PFN_vkDestroyPipelineLayout vkDestroyPipelineLayout; /* 656 8 */
	PFN_vkDestroyQueryPool vkDestroyQueryPool; /* 664 8 */
	PFN_vkDestroyRenderPass vkDestroyRenderPass; /* 672 8 */
	PFN_vkDestroySampler vkDestroySampler; /* 680 8 */
	PFN_vkDestroySemaphore vkDestroySemaphore; /* 688 8 */
	PFN_vkDestroyShaderModule vkDestroyShaderModule; /* 696 8 */
	PFN_vkDeviceWaitIdle vkDeviceWaitIdle; /* 704 8 */
	PFN_vkEndCommandBuffer vkEndCommandBuffer; /* 712 8 */
	PFN_vkFlushMappedMemoryRanges vkFlushMappedMemoryRanges; /* 720 8 */
	PFN_vkFreeCommandBuffers vkFreeCommandBuffers; /* 728 8 */
	PFN_vkFreeDescriptorSets vkFreeDescriptorSets; /* 736 8 */
	PFN_vkFreeMemory vkFreeMemory; /* 744 8 */
	PFN_vkGetBufferMemoryRequirements vkGetBufferMemoryRequirements; /* 752 8 */
	PFN_vkGetDeviceMemoryCommitment vkGetDeviceMemoryCommitment; /* 760 8 */
	PFN_vkGetDeviceQueue vkGetDeviceQueue; /* 768 8 */
	PFN_vkGetEventStatus vkGetEventStatus; /* 776 8 */
	PFN_vkGetFenceStatus vkGetFenceStatus; /* 784 8 */
	PFN_vkGetImageMemoryRequirements vkGetImageMemoryRequirements; /* 792 8 */
	PFN_vkGetImageSparseMemoryRequirements vkGetImageSparseMemoryRequirements; /* 800 8 */
	PFN_vkGetImageSubresourceLayout vkGetImageSubresourceLayout; /* 808 8 */
	PFN_vkGetPipelineCacheData vkGetPipelineCacheData; /* 816 8 */
	PFN_vkGetQueryPoolResults vkGetQueryPoolResults; /* 824 8 */
	PFN_vkGetRenderAreaGranularity vkGetRenderAreaGranularity; /* 832 8 */
	PFN_vkInvalidateMappedMemoryRanges vkInvalidateMappedMemoryRanges; /* 840 8 */
	PFN_vkMapMemory vkMapMemory; /* 848 8 */
	PFN_vkMergePipelineCaches vkMergePipelineCaches; /* 856 8 */
	PFN_vkQueueBindSparse vkQueueBindSparse; /* 864 8 */
	PFN_vkQueueSubmit vkQueueSubmit; /* 872 8 */
	PFN_vkQueueWaitIdle vkQueueWaitIdle; /* 880 8 */
	PFN_vkResetCommandBuffer vkResetCommandBuffer; /* 888 8 */
	PFN_vkResetCommandPool vkResetCommandPool; /* 896 8 */
	PFN_vkResetDescriptorPool vkResetDescriptorPool; /* 904 8 */
	PFN_vkResetEvent vkResetEvent; /* 912 8 */
	PFN_vkResetFences vkResetFences; /* 920 8 */
	PFN_vkSetEvent vkSetEvent; /* 928 8 */
	PFN_vkUnmapMemory vkUnmapMemory; /* 936 8 */
	PFN_vkUpdateDescriptorSets vkUpdateDescriptorSets; /* 944 8 */
	PFN_vkWaitForFences vkWaitForFences; /* 952 8 */
	PFN_vkBindBufferMemory2 vkBindBufferMemory2; /* 960 8 */
	PFN_vkBindImageMemory2 vkBindImageMemory2; /* 968 8 */
	PFN_vkCmdDispatchBase vkCmdDispatchBase; /* 976 8 */
	PFN_vkCmdSetDeviceMask vkCmdSetDeviceMask; /* 984 8 */
	PFN_vkCreateDescriptorUpdateTemplate vkCreateDescriptorUpdateTemplate; /* 992 8 */
	PFN_vkCreateSamplerYcbcrConversion vkCreateSamplerYcbcrConversion; /* 1000 8 */
	PFN_vkDestroyDescriptorUpdateTemplate vkDestroyDescriptorUpdateTemplate; /* 1008 8 */
	PFN_vkDestroySamplerYcbcrConversion vkDestroySamplerYcbcrConversion; /* 1016 8 */
	PFN_vkGetBufferMemoryRequirements2 vkGetBufferMemoryRequirements2; /* 1024 8 */
	PFN_vkGetDescriptorSetLayoutSupport vkGetDescriptorSetLayoutSupport; /* 1032 8 */
	PFN_vkGetDeviceGroupPeerMemoryFeatures vkGetDeviceGroupPeerMemoryFeatures; /* 1040 8 */
	PFN_vkGetDeviceQueue2 vkGetDeviceQueue2; /* 1048 8 */
	PFN_vkGetImageMemoryRequirements2 vkGetImageMemoryRequirements2; /* 1056 8 */
	PFN_vkGetImageSparseMemoryRequirements2 vkGetImageSparseMemoryRequirements2; /* 1064 8 */
	PFN_vkTrimCommandPool vkTrimCommandPool; /* 1072 8 */
	PFN_vkUpdateDescriptorSetWithTemplate vkUpdateDescriptorSetWithTemplate; /* 1080 8 */
	PFN_vkCmdBeginRenderPass2 vkCmdBeginRenderPass2; /* 1088 8 */
	PFN_vkCmdDrawIndexedIndirectCount vkCmdDrawIndexedIndirectCount; /* 1096 8 */
	PFN_vkCmdDrawIndirectCount vkCmdDrawIndirectCount; /* 1104 8 */
	PFN_vkCmdEndRenderPass2 vkCmdEndRenderPass2; /* 1112 8 */
	PFN_vkCmdNextSubpass2 vkCmdNextSubpass2; /* 1120 8 */
	PFN_vkCreateRenderPass2 vkCreateRenderPass2; /* 1128 8 */
	PFN_vkGetBufferDeviceAddress vkGetBufferDeviceAddress; /* 1136 8 */
	PFN_vkGetBufferOpaqueCaptureAddress vkGetBufferOpaqueCaptureAddress; /* 1144 8 */
	PFN_vkGetDeviceMemoryOpaqueCaptureAddress vkGetDeviceMemoryOpaqueCaptureAddress; /* 1152 8 */
	PFN_vkGetSemaphoreCounterValue vkGetSemaphoreCounterValue; /* 1160 8 */
	PFN_vkResetQueryPool vkResetQueryPool; /* 1168 8 */
	PFN_vkSignalSemaphore vkSignalSemaphore; /* 1176 8 */
	PFN_vkWaitSemaphores vkWaitSemaphores; /* 1184 8 */
	PFN_vkCmdBeginRendering vkCmdBeginRendering; /* 1192 8 */
	PFN_vkCmdBindVertexBuffers2 vkCmdBindVertexBuffers2; /* 1200 8 */
	PFN_vkCmdBlitImage2 vkCmdBlitImage2; /* 1208 8 */
	PFN_vkCmdCopyBuffer2 vkCmdCopyBuffer2; /* 1216 8 */
	PFN_vkCmdCopyBufferToImage2 vkCmdCopyBufferToImage2; /* 1224 8 */
	PFN_vkCmdCopyImage2 vkCmdCopyImage2; /* 1232 8 */
	PFN_vkCmdCopyImageToBuffer2 vkCmdCopyImageToBuffer2; /* 1240 8 */
	PFN_vkCmdEndRendering vkCmdEndRendering; /* 1248 8 */
	PFN_vkCmdPipelineBarrier2 vkCmdPipelineBarrier2; /* 1256 8 */
	PFN_vkCmdResetEvent2 vkCmdResetEvent2; /* 1264 8 */
	PFN_vkCmdResolveImage2 vkCmdResolveImage2; /* 1272 8 */
	PFN_vkCmdSetCullMode vkCmdSetCullMode; /* 1280 8 */
	PFN_vkCmdSetDepthBiasEnable vkCmdSetDepthBiasEnable; /* 1288 8 */
	PFN_vkCmdSetDepthBoundsTestEnable vkCmdSetDepthBoundsTestEnable; /* 1296 8 */
	PFN_vkCmdSetDepthCompareOp vkCmdSetDepthCompareOp; /* 1304 8 */
	PFN_vkCmdSetDepthTestEnable vkCmdSetDepthTestEnable; /* 1312 8 */
	PFN_vkCmdSetDepthWriteEnable vkCmdSetDepthWriteEnable; /* 1320 8 */
	PFN_vkCmdSetEvent2 vkCmdSetEvent2; /* 1328 8 */
	PFN_vkCmdSetFrontFace vkCmdSetFrontFace; /* 1336 8 */
	PFN_vkCmdSetPrimitiveRestartEnable vkCmdSetPrimitiveRestartEnable; /* 1344 8 */
	PFN_vkCmdSetPrimitiveTopology vkCmdSetPrimitiveTopology; /* 1352 8 */
	PFN_vkCmdSetRasterizerDiscardEnable vkCmdSetRasterizerDiscardEnable; /* 1360 8 */
	PFN_vkCmdSetScissorWithCount vkCmdSetScissorWithCount; /* 1368 8 */
	PFN_vkCmdSetStencilOp vkCmdSetStencilOp; /* 1376 8 */
	PFN_vkCmdSetStencilTestEnable vkCmdSetStencilTestEnable; /* 1384 8 */
	PFN_vkCmdSetViewportWithCount vkCmdSetViewportWithCount; /* 1392 8 */
	PFN_vkCmdWaitEvents2 vkCmdWaitEvents2; /* 1400 8 */
	PFN_vkCmdWriteTimestamp2 vkCmdWriteTimestamp2; /* 1408 8 */
	PFN_vkCreatePrivateDataSlot vkCreatePrivateDataSlot; /* 1416 8 */
	PFN_vkDestroyPrivateDataSlot vkDestroyPrivateDataSlot; /* 1424 8 */
	PFN_vkGetDeviceBufferMemoryRequirements vkGetDeviceBufferMemoryRequirements; /* 1432 8 */
	PFN_vkGetDeviceImageMemoryRequirements vkGetDeviceImageMemoryRequirements; /* 1440 8 */
	PFN_vkGetDeviceImageSparseMemoryRequirements vkGetDeviceImageSparseMemoryRequirements; /* 1448 8 */
	PFN_vkGetPrivateData vkGetPrivateData; /* 1456 8 */
	PFN_vkQueueSubmit2 vkQueueSubmit2; /* 1464 8 */
	PFN_vkSetPrivateData vkSetPrivateData; /* 1472 8 */
	PFN_vkCmdBindDescriptorSets2 vkCmdBindDescriptorSets2; /* 1480 8 */
	PFN_vkCmdBindIndexBuffer2 vkCmdBindIndexBuffer2; /* 1488 8 */
	PFN_vkCmdPushConstants2 vkCmdPushConstants2; /* 1496 8 */
	PFN_vkCmdPushDescriptorSet vkCmdPushDescriptorSet; /* 1504 8 */
	PFN_vkCmdPushDescriptorSet2 vkCmdPushDescriptorSet2; /* 1512 8 */
	PFN_vkCmdPushDescriptorSetWithTemplate vkCmdPushDescriptorSetWithTemplate; /* 1520 8 */
	PFN_vkCmdPushDescriptorSetWithTemplate2 vkCmdPushDescriptorSetWithTemplate2; /* 1528 8 */
	PFN_vkCmdSetLineStipple vkCmdSetLineStipple; /* 1536 8 */
	PFN_vkCmdSetRenderingAttachmentLocations vkCmdSetRenderingAttachmentLocations; /* 1544 8 */
	PFN_vkCmdSetRenderingInputAttachmentIndices vkCmdSetRenderingInputAttachmentIndices; /* 1552 8 */
	PFN_vkCopyImageToImage vkCopyImageToImage; /* 1560 8 */
	PFN_vkCopyImageToMemory vkCopyImageToMemory; /* 1568 8 */
	PFN_vkCopyMemoryToImage vkCopyMemoryToImage; /* 1576 8 */
	PFN_vkGetDeviceImageSubresourceLayout vkGetDeviceImageSubresourceLayout; /* 1584 8 */
	PFN_vkGetImageSubresourceLayout2 vkGetImageSubresourceLayout2; /* 1592 8 */
	PFN_vkGetRenderingAreaGranularity vkGetRenderingAreaGranularity; /* 1600 8 */
	PFN_vkMapMemory2 vkMapMemory2; /* 1608 8 */
	PFN_vkTransitionImageLayout vkTransitionImageLayout; /* 1616 8 */
	PFN_vkUnmapMemory2 vkUnmapMemory2; /* 1624 8 */
	PFN_vkCmdDispatchGraphAMDX vkCmdDispatchGraphAMDX; /* 1632 8 */
	PFN_vkCmdDispatchGraphIndirectAMDX vkCmdDispatchGraphIndirectAMDX; /* 1640 8 */
	PFN_vkCmdDispatchGraphIndirectCountAMDX vkCmdDispatchGraphIndirectCountAMDX; /* 1648 8 */
	PFN_vkCmdInitializeGraphScratchMemoryAMDX vkCmdInitializeGraphScratchMemoryAMDX; /* 1656 8 */
	PFN_vkCreateExecutionGraphPipelinesAMDX vkCreateExecutionGraphPipelinesAMDX; /* 1664 8 */
	PFN_vkGetExecutionGraphPipelineNodeIndexAMDX vkGetExecutionGraphPipelineNodeIndexAMDX; /* 1672 8 */
	PFN_vkGetExecutionGraphPipelineScratchSizeAMDX vkGetExecutionGraphPipelineScratchSizeAMDX; /* 1680 8 */
	PFN_vkAntiLagUpdateAMD vkAntiLagUpdateAMD; /* 1688 8 */
	PFN_vkCmdWriteBufferMarkerAMD vkCmdWriteBufferMarkerAMD; /* 1696 8 */
	PFN_vkCmdWriteBufferMarker2AMD vkCmdWriteBufferMarker2AMD; /* 1704 8 */
	PFN_vkSetLocalDimmingAMD vkSetLocalDimmingAMD; /* 1712 8 */
	PFN_vkCmdDrawIndexedIndirectCountAMD vkCmdDrawIndexedIndirectCountAMD; /* 1720 8 */
	PFN_vkCmdDrawIndirectCountAMD vkCmdDrawIndirectCountAMD; /* 1728 8 */
	PFN_vkGetShaderInfoAMD vkGetShaderInfoAMD; /* 1736 8 */
	PFN_vkCmdSetAttachmentFeedbackLoopEnableEXT vkCmdSetAttachmentFeedbackLoopEnableEXT; /* 1744 8 */
	PFN_vkGetBufferDeviceAddressEXT vkGetBufferDeviceAddressEXT; /* 1752 8 */
	PFN_vkGetCalibratedTimestampsEXT vkGetCalibratedTimestampsEXT; /* 1760 8 */
	PFN_vkCmdSetColorWriteEnableEXT vkCmdSetColorWriteEnableEXT; /* 1768 8 */
	PFN_vkCmdBeginConditionalRenderingEXT vkCmdBeginConditionalRenderingEXT; /* 1776 8 */
	PFN_vkCmdEndConditionalRenderingEXT vkCmdEndConditionalRenderingEXT; /* 1784 8 */
	PFN_vkCmdDebugMarkerBeginEXT vkCmdDebugMarkerBeginEXT; /* 1792 8 */
	PFN_vkCmdDebugMarkerEndEXT vkCmdDebugMarkerEndEXT; /* 1800 8 */
	PFN_vkCmdDebugMarkerInsertEXT vkCmdDebugMarkerInsertEXT; /* 1808 8 */
	PFN_vkDebugMarkerSetObjectNameEXT vkDebugMarkerSetObjectNameEXT; /* 1816 8 */
	PFN_vkDebugMarkerSetObjectTagEXT vkDebugMarkerSetObjectTagEXT; /* 1824 8 */
	PFN_vkCmdSetDepthBias2EXT vkCmdSetDepthBias2EXT; /* 1832 8 */
	PFN_vkCmdBindDescriptorBufferEmbeddedSamplersEXT vkCmdBindDescriptorBufferEmbeddedSamplersEXT; /* 1840 8 */
	PFN_vkCmdBindDescriptorBuffersEXT vkCmdBindDescriptorBuffersEXT; /* 1848 8 */
	PFN_vkCmdSetDescriptorBufferOffsetsEXT vkCmdSetDescriptorBufferOffsetsEXT; /* 1856 8 */
	PFN_vkGetBufferOpaqueCaptureDescriptorDataEXT vkGetBufferOpaqueCaptureDescriptorDataEXT; /* 1864 8 */
	PFN_vkGetDescriptorEXT vkGetDescriptorEXT; /* 1872 8 */
	PFN_vkGetDescriptorSetLayoutBindingOffsetEXT vkGetDescriptorSetLayoutBindingOffsetEXT; /* 1880 8 */
	PFN_vkGetDescriptorSetLayoutSizeEXT vkGetDescriptorSetLayoutSizeEXT; /* 1888 8 */
	PFN_vkGetImageOpaqueCaptureDescriptorDataEXT vkGetImageOpaqueCaptureDescriptorDataEXT; /* 1896 8 */
	PFN_vkGetImageViewOpaqueCaptureDescriptorDataEXT vkGetImageViewOpaqueCaptureDescriptorDataEXT; /* 1904 8 */
	PFN_vkGetSamplerOpaqueCaptureDescriptorDataEXT vkGetSamplerOpaqueCaptureDescriptorDataEXT; /* 1912 8 */
	PFN_vkGetAccelerationStructureOpaqueCaptureDescriptorDataEXT vkGetAccelerationStructureOpaqueCaptureDescriptorDataEXT; /* 1920 8 */
	PFN_vkGetDeviceFaultInfoEXT vkGetDeviceFaultInfoEXT; /* 1928 8 */
	PFN_vkCmdExecuteGeneratedCommandsEXT vkCmdExecuteGeneratedCommandsEXT; /* 1936 8 */
	PFN_vkCmdPreprocessGeneratedCommandsEXT vkCmdPreprocessGeneratedCommandsEXT; /* 1944 8 */
	PFN_vkCreateIndirectCommandsLayoutEXT vkCreateIndirectCommandsLayoutEXT; /* 1952 8 */
	PFN_vkCreateIndirectExecutionSetEXT vkCreateIndirectExecutionSetEXT; /* 1960 8 */
	PFN_vkDestroyIndirectCommandsLayoutEXT vkDestroyIndirectCommandsLayoutEXT; /* 1968 8 */
	PFN_vkDestroyIndirectExecutionSetEXT vkDestroyIndirectExecutionSetEXT; /* 1976 8 */
	PFN_vkGetGeneratedCommandsMemoryRequirementsEXT vkGetGeneratedCommandsMemoryRequirementsEXT; /* 1984 8 */
	PFN_vkUpdateIndirectExecutionSetPipelineEXT vkUpdateIndirectExecutionSetPipelineEXT; /* 1992 8 */
	PFN_vkUpdateIndirectExecutionSetShaderEXT vkUpdateIndirectExecutionSetShaderEXT; /* 2000 8 */
	PFN_vkCmdSetDiscardRectangleEXT vkCmdSetDiscardRectangleEXT; /* 2008 8 */
	PFN_vkCmdSetDiscardRectangleEnableEXT vkCmdSetDiscardRectangleEnableEXT; /* 2016 8 */
	PFN_vkCmdSetDiscardRectangleModeEXT vkCmdSetDiscardRectangleModeEXT; /* 2024 8 */
	PFN_vkDisplayPowerControlEXT vkDisplayPowerControlEXT; /* 2032 8 */
	PFN_vkGetSwapchainCounterEXT vkGetSwapchainCounterEXT; /* 2040 8 */
	PFN_vkRegisterDeviceEventEXT vkRegisterDeviceEventEXT; /* 2048 8 */
	PFN_vkRegisterDisplayEventEXT vkRegisterDisplayEventEXT; /* 2056 8 */
	PFN_vkGetMemoryHostPointerPropertiesEXT vkGetMemoryHostPointerPropertiesEXT; /* 2064 8 */
	PFN_vkSetHdrMetadataEXT vkSetHdrMetadataEXT; /* 2072 8 */
	PFN_vkCopyImageToImageEXT vkCopyImageToImageEXT; /* 2080 8 */
	PFN_vkCopyImageToMemoryEXT vkCopyImageToMemoryEXT; /* 2088 8 */
	PFN_vkCopyMemoryToImageEXT vkCopyMemoryToImageEXT; /* 2096 8 */
	PFN_vkTransitionImageLayoutEXT vkTransitionImageLayoutEXT; /* 2104 8 */
	PFN_vkResetQueryPoolEXT vkResetQueryPoolEXT; /* 2112 8 */
	PFN_vkGetImageDrmFormatModifierPropertiesEXT vkGetImageDrmFormatModifierPropertiesEXT; /* 2120 8 */
	PFN_vkCmdSetLineStippleEXT vkCmdSetLineStippleEXT; /* 2128 8 */
	PFN_vkCmdDrawMeshTasksEXT vkCmdDrawMeshTasksEXT; /* 2136 8 */
	PFN_vkCmdDrawMeshTasksIndirectEXT vkCmdDrawMeshTasksIndirectEXT; /* 2144 8 */
	PFN_vkCmdDrawMeshTasksIndirectCountEXT vkCmdDrawMeshTasksIndirectCountEXT; /* 2152 8 */
	PFN_vkCmdDrawMultiEXT vkCmdDrawMultiEXT; /* 2160 8 */
	PFN_vkCmdDrawMultiIndexedEXT vkCmdDrawMultiIndexedEXT; /* 2168 8 */
	PFN_vkBuildMicromapsEXT vkBuildMicromapsEXT; /* 2176 8 */
	PFN_vkCmdBuildMicromapsEXT vkCmdBuildMicromapsEXT; /* 2184 8 */
	PFN_vkCmdCopyMemoryToMicromapEXT vkCmdCopyMemoryToMicromapEXT; /* 2192 8 */
	PFN_vkCmdCopyMicromapEXT vkCmdCopyMicromapEXT; /* 2200 8 */
	PFN_vkCmdCopyMicromapToMemoryEXT vkCmdCopyMicromapToMemoryEXT; /* 2208 8 */
	PFN_vkCmdWriteMicromapsPropertiesEXT vkCmdWriteMicromapsPropertiesEXT; /* 2216 8 */
	PFN_vkCopyMemoryToMicromapEXT vkCopyMemoryToMicromapEXT; /* 2224 8 */
	PFN_vkCopyMicromapEXT vkCopyMicromapEXT; /* 2232 8 */
	PFN_vkCopyMicromapToMemoryEXT vkCopyMicromapToMemoryEXT; /* 2240 8 */
	PFN_vkCreateMicromapEXT vkCreateMicromapEXT; /* 2248 8 */
	PFN_vkDestroyMicromapEXT vkDestroyMicromapEXT; /* 2256 8 */
	PFN_vkGetDeviceMicromapCompatibilityEXT vkGetDeviceMicromapCompatibilityEXT; /* 2264 8 */
	PFN_vkGetMicromapBuildSizesEXT vkGetMicromapBuildSizesEXT; /* 2272 8 */
	PFN_vkWriteMicromapsPropertiesEXT vkWriteMicromapsPropertiesEXT; /* 2280 8 */
	PFN_vkSetDeviceMemoryPriorityEXT vkSetDeviceMemoryPriorityEXT; /* 2288 8 */
	PFN_vkGetPipelinePropertiesEXT vkGetPipelinePropertiesEXT; /* 2296 8 */
	PFN_vkCreatePrivateDataSlotEXT vkCreatePrivateDataSlotEXT; /* 2304 8 */
	PFN_vkDestroyPrivateDataSlotEXT vkDestroyPrivateDataSlotEXT; /* 2312 8 */
	PFN_vkGetPrivateDataEXT vkGetPrivateDataEXT; /* 2320 8 */
	PFN_vkSetPrivateDataEXT vkSetPrivateDataEXT; /* 2328 8 */
	PFN_vkCmdSetSampleLocationsEXT vkCmdSetSampleLocationsEXT; /* 2336 8 */
	PFN_vkGetShaderModuleCreateInfoIdentifierEXT vkGetShaderModuleCreateInfoIdentifierEXT; /* 2344 8 */
	PFN_vkGetShaderModuleIdentifierEXT vkGetShaderModuleIdentifierEXT; /* 2352 8 */
	PFN_vkCmdBindShadersEXT vkCmdBindShadersEXT; /* 2360 8 */
	PFN_vkCreateShadersEXT vkCreateShadersEXT; /* 2368 8 */
	PFN_vkDestroyShaderEXT vkDestroyShaderEXT; /* 2376 8 */
	PFN_vkGetShaderBinaryDataEXT vkGetShaderBinaryDataEXT; /* 2384 8 */
	PFN_vkReleaseSwapchainImagesEXT vkReleaseSwapchainImagesEXT; /* 2392 8 */
	PFN_vkCmdBeginQueryIndexedEXT vkCmdBeginQueryIndexedEXT; /* 2400 8 */
	PFN_vkCmdBeginTransformFeedbackEXT vkCmdBeginTransformFeedbackEXT; /* 2408 8 */
	PFN_vkCmdBindTransformFeedbackBuffersEXT vkCmdBindTransformFeedbackBuffersEXT; /* 2416 8 */
	PFN_vkCmdDrawIndirectByteCountEXT vkCmdDrawIndirectByteCountEXT; /* 2424 8 */
	PFN_vkCmdEndQueryIndexedEXT vkCmdEndQueryIndexedEXT; /* 2432 8 */
	PFN_vkCmdEndTransformFeedbackEXT vkCmdEndTransformFeedbackEXT; /* 2440 8 */
	PFN_vkCreateValidationCacheEXT vkCreateValidationCacheEXT; /* 2448 8 */
	PFN_vkDestroyValidationCacheEXT vkDestroyValidationCacheEXT; /* 2456 8 */
	PFN_vkGetValidationCacheDataEXT vkGetValidationCacheDataEXT; /* 2464 8 */
	PFN_vkMergeValidationCachesEXT vkMergeValidationCachesEXT; /* 2472 8 */
	PFN_vkGetPastPresentationTimingGOOGLE vkGetPastPresentationTimingGOOGLE; /* 2480 8 */
	PFN_vkGetRefreshCycleDurationGOOGLE vkGetRefreshCycleDurationGOOGLE; /* 2488 8 */
	PFN_vkCmdDrawClusterHUAWEI vkCmdDrawClusterHUAWEI; /* 2496 8 */
	PFN_vkCmdDrawClusterIndirectHUAWEI vkCmdDrawClusterIndirectHUAWEI; /* 2504 8 */
	PFN_vkCmdBindInvocationMaskHUAWEI vkCmdBindInvocationMaskHUAWEI; /* 2512 8 */
	PFN_vkGetDeviceSubpassShadingMaxWorkgroupSizeHUAWEI vkGetDeviceSubpassShadingMaxWorkgroupSizeHUAWEI; /* 2520 8 */
	PFN_vkCmdSubpassShadingHUAWEI vkCmdSubpassShadingHUAWEI; /* 2528 8 */
	PFN_vkAcquirePerformanceConfigurationINTEL vkAcquirePerformanceConfigurationINTEL; /* 2536 8 */
	PFN_vkCmdSetPerformanceMarkerINTEL vkCmdSetPerformanceMarkerINTEL; /* 2544 8 */
	PFN_vkCmdSetPerformanceOverrideINTEL vkCmdSetPerformanceOverrideINTEL; /* 2552 8 */
	PFN_vkCmdSetPerformanceStreamMarkerINTEL vkCmdSetPerformanceStreamMarkerINTEL; /* 2560 8 */
	PFN_vkGetPerformanceParameterINTEL vkGetPerformanceParameterINTEL; /* 2568 8 */
	PFN_vkInitializePerformanceApiINTEL vkInitializePerformanceApiINTEL; /* 2576 8 */
	PFN_vkQueueSetPerformanceConfigurationINTEL vkQueueSetPerformanceConfigurationINTEL; /* 2584 8 */
	PFN_vkReleasePerformanceConfigurationINTEL vkReleasePerformanceConfigurationINTEL; /* 2592 8 */
	PFN_vkUninitializePerformanceApiINTEL vkUninitializePerformanceApiINTEL; /* 2600 8 */
	PFN_vkBuildAccelerationStructuresKHR vkBuildAccelerationStructuresKHR; /* 2608 8 */
	PFN_vkCmdBuildAccelerationStructuresIndirectKHR vkCmdBuildAccelerationStructuresIndirectKHR; /* 2616 8 */
	PFN_vkCmdBuildAccelerationStructuresKHR vkCmdBuildAccelerationStructuresKHR; /* 2624 8 */
	PFN_vkCmdCopyAccelerationStructureKHR vkCmdCopyAccelerationStructureKHR; /* 2632 8 */
	PFN_vkCmdCopyAccelerationStructureToMemoryKHR vkCmdCopyAccelerationStructureToMemoryKHR; /* 2640 8 */
	PFN_vkCmdCopyMemoryToAccelerationStructureKHR vkCmdCopyMemoryToAccelerationStructureKHR; /* 2648 8 */
	PFN_vkCmdWriteAccelerationStructuresPropertiesKHR vkCmdWriteAccelerationStructuresPropertiesKHR; /* 2656 8 */
	PFN_vkCopyAccelerationStructureKHR vkCopyAccelerationStructureKHR; /* 2664 8 */
	PFN_vkCopyAccelerationStructureToMemoryKHR vkCopyAccelerationStructureToMemoryKHR; /* 2672 8 */
	PFN_vkCopyMemoryToAccelerationStructureKHR vkCopyMemoryToAccelerationStructureKHR; /* 2680 8 */
	PFN_vkCreateAccelerationStructureKHR vkCreateAccelerationStructureKHR; /* 2688 8 */
	PFN_vkDestroyAccelerationStructureKHR vkDestroyAccelerationStructureKHR; /* 2696 8 */
	PFN_vkGetAccelerationStructureBuildSizesKHR vkGetAccelerationStructureBuildSizesKHR; /* 2704 8 */
	PFN_vkGetAccelerationStructureDeviceAddressKHR vkGetAccelerationStructureDeviceAddressKHR; /* 2712 8 */
	PFN_vkGetDeviceAccelerationStructureCompatibilityKHR vkGetDeviceAccelerationStructureCompatibilityKHR; /* 2720 8 */
	PFN_vkWriteAccelerationStructuresPropertiesKHR vkWriteAccelerationStructuresPropertiesKHR; /* 2728 8 */
	PFN_vkBindBufferMemory2KHR vkBindBufferMemory2KHR; /* 2736 8 */
	PFN_vkBindImageMemory2KHR vkBindImageMemory2KHR; /* 2744 8 */
	PFN_vkGetBufferDeviceAddressKHR vkGetBufferDeviceAddressKHR; /* 2752 8 */
	PFN_vkGetBufferOpaqueCaptureAddressKHR vkGetBufferOpaqueCaptureAddressKHR; /* 2760 8 */
	PFN_vkGetDeviceMemoryOpaqueCaptureAddressKHR vkGetDeviceMemoryOpaqueCaptureAddressKHR; /* 2768 8 */
	PFN_vkGetCalibratedTimestampsKHR vkGetCalibratedTimestampsKHR; /* 2776 8 */
	PFN_vkCmdBlitImage2KHR vkCmdBlitImage2KHR; /* 2784 8 */
	PFN_vkCmdCopyBuffer2KHR vkCmdCopyBuffer2KHR; /* 2792 8 */
	PFN_vkCmdCopyBufferToImage2KHR vkCmdCopyBufferToImage2KHR; /* 2800 8 */
	PFN_vkCmdCopyImage2KHR vkCmdCopyImage2KHR; /* 2808 8 */
	PFN_vkCmdCopyImageToBuffer2KHR vkCmdCopyImageToBuffer2KHR; /* 2816 8 */
	PFN_vkCmdResolveImage2KHR vkCmdResolveImage2KHR; /* 2824 8 */
	PFN_vkCmdBeginRenderPass2KHR vkCmdBeginRenderPass2KHR; /* 2832 8 */
	PFN_vkCmdEndRenderPass2KHR vkCmdEndRenderPass2KHR; /* 2840 8 */
	PFN_vkCmdNextSubpass2KHR vkCmdNextSubpass2KHR; /* 2848 8 */
	PFN_vkCreateRenderPass2KHR vkCreateRenderPass2KHR; /* 2856 8 */
	PFN_vkCreateDeferredOperationKHR vkCreateDeferredOperationKHR; /* 2864 8 */
	PFN_vkDeferredOperationJoinKHR vkDeferredOperationJoinKHR; /* 2872 8 */
	PFN_vkDestroyDeferredOperationKHR vkDestroyDeferredOperationKHR; /* 2880 8 */
	PFN_vkGetDeferredOperationMaxConcurrencyKHR vkGetDeferredOperationMaxConcurrencyKHR; /* 2888 8 */
	PFN_vkGetDeferredOperationResultKHR vkGetDeferredOperationResultKHR; /* 2896 8 */
	PFN_vkCreateDescriptorUpdateTemplateKHR vkCreateDescriptorUpdateTemplateKHR; /* 2904 8 */
	PFN_vkDestroyDescriptorUpdateTemplateKHR vkDestroyDescriptorUpdateTemplateKHR; /* 2912 8 */
	PFN_vkUpdateDescriptorSetWithTemplateKHR vkUpdateDescriptorSetWithTemplateKHR; /* 2920 8 */
	PFN_vkCmdDispatchBaseKHR vkCmdDispatchBaseKHR; /* 2928 8 */
	PFN_vkCmdSetDeviceMaskKHR vkCmdSetDeviceMaskKHR; /* 2936 8 */
	PFN_vkGetDeviceGroupPeerMemoryFeaturesKHR vkGetDeviceGroupPeerMemoryFeaturesKHR; /* 2944 8 */
	PFN_vkCreateSharedSwapchainsKHR vkCreateSharedSwapchainsKHR; /* 2952 8 */
	PFN_vkCmdDrawIndexedIndirectCountKHR vkCmdDrawIndexedIndirectCountKHR; /* 2960 8 */
	PFN_vkCmdDrawIndirectCountKHR vkCmdDrawIndirectCountKHR; /* 2968 8 */
	PFN_vkCmdBeginRenderingKHR vkCmdBeginRenderingKHR; /* 2976 8 */
	PFN_vkCmdEndRenderingKHR vkCmdEndRenderingKHR; /* 2984 8 */
	PFN_vkCmdSetRenderingAttachmentLocationsKHR vkCmdSetRenderingAttachmentLocationsKHR; /* 2992 8 */
	PFN_vkCmdSetRenderingInputAttachmentIndicesKHR vkCmdSetRenderingInputAttachmentIndicesKHR; /* 3000 8 */
	PFN_vkGetFenceFdKHR vkGetFenceFdKHR; /* 3008 8 */
	PFN_vkImportFenceFdKHR vkImportFenceFdKHR; /* 3016 8 */
	PFN_vkGetMemoryFdKHR vkGetMemoryFdKHR; /* 3024 8 */
	PFN_vkGetMemoryFdPropertiesKHR vkGetMemoryFdPropertiesKHR; /* 3032 8 */
	PFN_vkGetSemaphoreFdKHR vkGetSemaphoreFdKHR; /* 3040 8 */
	PFN_vkImportSemaphoreFdKHR vkImportSemaphoreFdKHR; /* 3048 8 */
	PFN_vkCmdSetFragmentShadingRateKHR vkCmdSetFragmentShadingRateKHR; /* 3056 8 */
	PFN_vkGetBufferMemoryRequirements2KHR vkGetBufferMemoryRequirements2KHR; /* 3064 8 */
	PFN_vkGetImageMemoryRequirements2KHR vkGetImageMemoryRequirements2KHR; /* 3072 8 */
	PFN_vkGetImageSparseMemoryRequirements2KHR vkGetImageSparseMemoryRequirements2KHR; /* 3080 8 */
	PFN_vkCmdSetLineStippleKHR vkCmdSetLineStippleKHR; /* 3088 8 */
	PFN_vkTrimCommandPoolKHR vkTrimCommandPoolKHR; /* 3096 8 */
	PFN_vkGetDescriptorSetLayoutSupportKHR vkGetDescriptorSetLayoutSupportKHR; /* 3104 8 */
	PFN_vkGetDeviceBufferMemoryRequirementsKHR vkGetDeviceBufferMemoryRequirementsKHR; /* 3112 8 */
	PFN_vkGetDeviceImageMemoryRequirementsKHR vkGetDeviceImageMemoryRequirementsKHR; /* 3120 8 */
	PFN_vkGetDeviceImageSparseMemoryRequirementsKHR vkGetDeviceImageSparseMemoryRequirementsKHR; /* 3128 8 */
	PFN_vkCmdBindIndexBuffer2KHR vkCmdBindIndexBuffer2KHR; /* 3136 8 */
	PFN_vkGetDeviceImageSubresourceLayoutKHR vkGetDeviceImageSubresourceLayoutKHR; /* 3144 8 */
	PFN_vkGetImageSubresourceLayout2KHR vkGetImageSubresourceLayout2KHR; /* 3152 8 */
	PFN_vkGetRenderingAreaGranularityKHR vkGetRenderingAreaGranularityKHR; /* 3160 8 */
	PFN_vkCmdBindDescriptorSets2KHR vkCmdBindDescriptorSets2KHR; /* 3168 8 */
	PFN_vkCmdPushConstants2KHR vkCmdPushConstants2KHR; /* 3176 8 */
	PFN_vkCmdPushDescriptorSet2KHR vkCmdPushDescriptorSet2KHR; /* 3184 8 */
	PFN_vkCmdPushDescriptorSetWithTemplate2KHR vkCmdPushDescriptorSetWithTemplate2KHR; /* 3192 8 */
	PFN_vkCmdBindDescriptorBufferEmbeddedSamplers2EXT vkCmdBindDescriptorBufferEmbeddedSamplers2EXT; /* 3200 8 */
	PFN_vkCmdSetDescriptorBufferOffsets2EXT vkCmdSetDescriptorBufferOffsets2EXT; /* 3208 8 */
	PFN_vkMapMemory2KHR vkMapMemory2KHR; /* 3216 8 */
	PFN_vkUnmapMemory2KHR vkUnmapMemory2KHR; /* 3224 8 */
	PFN_vkAcquireProfilingLockKHR vkAcquireProfilingLockKHR; /* 3232 8 */
	PFN_vkReleaseProfilingLockKHR vkReleaseProfilingLockKHR; /* 3240 8 */
	PFN_vkCreatePipelineBinariesKHR vkCreatePipelineBinariesKHR; /* 3248 8 */
	PFN_vkDestroyPipelineBinaryKHR vkDestroyPipelineBinaryKHR; /* 3256 8 */
	PFN_vkGetPipelineBinaryDataKHR vkGetPipelineBinaryDataKHR; /* 3264 8 */
	PFN_vkGetPipelineKeyKHR vkGetPipelineKeyKHR; /* 3272 8 */
	PFN_vkReleaseCapturedPipelineDataKHR vkReleaseCapturedPipelineDataKHR; /* 3280 8 */
	PFN_vkGetPipelineExecutableInternalRepresentationsKHR vkGetPipelineExecutableInternalRepresentationsKHR; /* 3288 8 */
	PFN_vkGetPipelineExecutablePropertiesKHR vkGetPipelineExecutablePropertiesKHR; /* 3296 8 */
	PFN_vkGetPipelineExecutableStatisticsKHR vkGetPipelineExecutableStatisticsKHR; /* 3304 8 */
	PFN_vkWaitForPresentKHR vkWaitForPresentKHR; /* 3312 8 */
	PFN_vkCmdPushDescriptorSetKHR vkCmdPushDescriptorSetKHR; /* 3320 8 */
	PFN_vkCmdTraceRaysIndirect2KHR vkCmdTraceRaysIndirect2KHR; /* 3328 8 */
	PFN_vkCmdSetRayTracingPipelineStackSizeKHR vkCmdSetRayTracingPipelineStackSizeKHR; /* 3336 8 */
	PFN_vkCmdTraceRaysIndirectKHR vkCmdTraceRaysIndirectKHR; /* 3344 8 */
	PFN_vkCmdTraceRaysKHR vkCmdTraceRaysKHR; /* 3352 8 */
	PFN_vkCreateRayTracingPipelinesKHR vkCreateRayTracingPipelinesKHR; /* 3360 8 */
	PFN_vkGetRayTracingCaptureReplayShaderGroupHandlesKHR vkGetRayTracingCaptureReplayShaderGroupHandlesKHR; /* 3368 8 */
	PFN_vkGetRayTracingShaderGroupHandlesKHR vkGetRayTracingShaderGroupHandlesKHR; /* 3376 8 */
	PFN_vkGetRayTracingShaderGroupStackSizeKHR vkGetRayTracingShaderGroupStackSizeKHR; /* 3384 8 */
	PFN_vkCreateSamplerYcbcrConversionKHR vkCreateSamplerYcbcrConversionKHR; /* 3392 8 */
	PFN_vkDestroySamplerYcbcrConversionKHR vkDestroySamplerYcbcrConversionKHR; /* 3400 8 */
	PFN_vkGetSwapchainStatusKHR vkGetSwapchainStatusKHR; /* 3408 8 */
	PFN_vkAcquireNextImageKHR vkAcquireNextImageKHR; /* 3416 8 */
	PFN_vkCreateSwapchainKHR vkCreateSwapchainKHR; /* 3424 8 */
	PFN_vkDestroySwapchainKHR vkDestroySwapchainKHR; /* 3432 8 */
	PFN_vkGetSwapchainImagesKHR vkGetSwapchainImagesKHR; /* 3440 8 */
	PFN_vkQueuePresentKHR vkQueuePresentKHR; /* 3448 8 */
	PFN_vkCmdPipelineBarrier2KHR vkCmdPipelineBarrier2KHR; /* 3456 8 */
	PFN_vkCmdResetEvent2KHR vkCmdResetEvent2KHR; /* 3464 8 */
	PFN_vkCmdSetEvent2KHR vkCmdSetEvent2KHR; /* 3472 8 */
	PFN_vkCmdWaitEvents2KHR vkCmdWaitEvents2KHR; /* 3480 8 */
	PFN_vkCmdWriteTimestamp2KHR vkCmdWriteTimestamp2KHR; /* 3488 8 */
	PFN_vkQueueSubmit2KHR vkQueueSubmit2KHR; /* 3496 8 */
	PFN_vkGetSemaphoreCounterValueKHR vkGetSemaphoreCounterValueKHR; /* 3504 8 */
	PFN_vkSignalSemaphoreKHR vkSignalSemaphoreKHR; /* 3512 8 */
	PFN_vkWaitSemaphoresKHR vkWaitSemaphoresKHR; /* 3520 8 */
	PFN_vkCmdDecodeVideoKHR vkCmdDecodeVideoKHR; /* 3528 8 */
	PFN_vkCmdEncodeVideoKHR vkCmdEncodeVideoKHR; /* 3536 8 */
	PFN_vkGetEncodedVideoSessionParametersKHR vkGetEncodedVideoSessionParametersKHR; /* 3544 8 */
	PFN_vkBindVideoSessionMemoryKHR vkBindVideoSessionMemoryKHR; /* 3552 8 */
	PFN_vkCmdBeginVideoCodingKHR vkCmdBeginVideoCodingKHR; /* 3560 8 */
	PFN_vkCmdControlVideoCodingKHR vkCmdControlVideoCodingKHR; /* 3568 8 */
	PFN_vkCmdEndVideoCodingKHR vkCmdEndVideoCodingKHR; /* 3576 8 */
	PFN_vkCreateVideoSessionKHR vkCreateVideoSessionKHR; /* 3584 8 */
	PFN_vkCreateVideoSessionParametersKHR vkCreateVideoSessionParametersKHR; /* 3592 8 */
	PFN_vkDestroyVideoSessionKHR vkDestroyVideoSessionKHR; /* 3600 8 */
	PFN_vkDestroyVideoSessionParametersKHR vkDestroyVideoSessionParametersKHR; /* 3608 8 */
	PFN_vkGetVideoSessionMemoryRequirementsKHR vkGetVideoSessionMemoryRequirementsKHR; /* 3616 8 */
	PFN_vkUpdateVideoSessionParametersKHR vkUpdateVideoSessionParametersKHR; /* 3624 8 */
	PFN_vkCmdCuLaunchKernelNVX vkCmdCuLaunchKernelNVX; /* 3632 8 */
	PFN_vkCreateCuFunctionNVX vkCreateCuFunctionNVX; /* 3640 8 */
	PFN_vkCreateCuModuleNVX vkCreateCuModuleNVX; /* 3648 8 */
	PFN_vkDestroyCuFunctionNVX vkDestroyCuFunctionNVX; /* 3656 8 */
	PFN_vkDestroyCuModuleNVX vkDestroyCuModuleNVX; /* 3664 8 */
	PFN_vkGetImageViewHandleNVX vkGetImageViewHandleNVX; /* 3672 8 */
	PFN_vkGetImageViewHandle64NVX vkGetImageViewHandle64NVX; /* 3680 8 */
	PFN_vkGetImageViewAddressNVX vkGetImageViewAddressNVX; /* 3688 8 */
	PFN_vkCmdSetViewportWScalingNV vkCmdSetViewportWScalingNV; /* 3696 8 */
	PFN_vkCmdCopyMemoryIndirectNV vkCmdCopyMemoryIndirectNV; /* 3704 8 */
	PFN_vkCmdCopyMemoryToImageIndirectNV vkCmdCopyMemoryToImageIndirectNV; /* 3712 8 */
	PFN_vkCmdCudaLaunchKernelNV vkCmdCudaLaunchKernelNV; /* 3720 8 */
	PFN_vkCreateCudaFunctionNV vkCreateCudaFunctionNV; /* 3728 8 */
	PFN_vkCreateCudaModuleNV vkCreateCudaModuleNV; /* 3736 8 */
	PFN_vkDestroyCudaFunctionNV vkDestroyCudaFunctionNV; /* 3744 8 */
	PFN_vkDestroyCudaModuleNV vkDestroyCudaModuleNV; /* 3752 8 */
	PFN_vkGetCudaModuleCacheNV vkGetCudaModuleCacheNV; /* 3760 8 */
	PFN_vkCmdSetCheckpointNV vkCmdSetCheckpointNV; /* 3768 8 */
	PFN_vkGetQueueCheckpointDataNV vkGetQueueCheckpointDataNV; /* 3776 8 */
	PFN_vkGetQueueCheckpointData2NV vkGetQueueCheckpointData2NV; /* 3784 8 */
	PFN_vkCmdBindPipelineShaderGroupNV vkCmdBindPipelineShaderGroupNV; /* 3792 8 */
	PFN_vkCmdExecuteGeneratedCommandsNV vkCmdExecuteGeneratedCommandsNV; /* 3800 8 */
	PFN_vkCmdPreprocessGeneratedCommandsNV vkCmdPreprocessGeneratedCommandsNV; /* 3808 8 */
	PFN_vkCreateIndirectCommandsLayoutNV vkCreateIndirectCommandsLayoutNV; /* 3816 8 */
	PFN_vkDestroyIndirectCommandsLayoutNV vkDestroyIndirectCommandsLayoutNV; /* 3824 8 */
	PFN_vkGetGeneratedCommandsMemoryRequirementsNV vkGetGeneratedCommandsMemoryRequirementsNV; /* 3832 8 */
	PFN_vkCmdUpdatePipelineIndirectBufferNV vkCmdUpdatePipelineIndirectBufferNV; /* 3840 8 */
	PFN_vkGetPipelineIndirectDeviceAddressNV vkGetPipelineIndirectDeviceAddressNV; /* 3848 8 */
	PFN_vkGetPipelineIndirectMemoryRequirementsNV vkGetPipelineIndirectMemoryRequirementsNV; /* 3856 8 */
	PFN_vkGetMemoryRemoteAddressNV vkGetMemoryRemoteAddressNV; /* 3864 8 */
	PFN_vkCmdSetFragmentShadingRateEnumNV vkCmdSetFragmentShadingRateEnumNV; /* 3872 8 */
	PFN_vkGetLatencyTimingsNV vkGetLatencyTimingsNV; /* 3880 8 */
	PFN_vkLatencySleepNV vkLatencySleepNV; /* 3888 8 */
	PFN_vkQueueNotifyOutOfBandNV vkQueueNotifyOutOfBandNV; /* 3896 8 */
	PFN_vkSetLatencyMarkerNV vkSetLatencyMarkerNV; /* 3904 8 */
	PFN_vkSetLatencySleepModeNV vkSetLatencySleepModeNV; /* 3912 8 */
	PFN_vkCmdDecompressMemoryIndirectCountNV vkCmdDecompressMemoryIndirectCountNV; /* 3920 8 */
	PFN_vkCmdDecompressMemoryNV vkCmdDecompressMemoryNV; /* 3928 8 */
	PFN_vkCmdDrawMeshTasksIndirectNV vkCmdDrawMeshTasksIndirectNV; /* 3936 8 */
	PFN_vkCmdDrawMeshTasksNV vkCmdDrawMeshTasksNV; /* 3944 8 */
	PFN_vkCmdDrawMeshTasksIndirectCountNV vkCmdDrawMeshTasksIndirectCountNV; /* 3952 8 */
	PFN_vkBindOpticalFlowSessionImageNV vkBindOpticalFlowSessionImageNV; /* 3960 8 */
	PFN_vkCmdOpticalFlowExecuteNV vkCmdOpticalFlowExecuteNV; /* 3968 8 */
	PFN_vkCreateOpticalFlowSessionNV vkCreateOpticalFlowSessionNV; /* 3976 8 */
	PFN_vkDestroyOpticalFlowSessionNV vkDestroyOpticalFlowSessionNV; /* 3984 8 */
	PFN_vkBindAccelerationStructureMemoryNV vkBindAccelerationStructureMemoryNV; /* 3992 8 */
	PFN_vkCmdBuildAccelerationStructureNV vkCmdBuildAccelerationStructureNV; /* 4000 8 */
	PFN_vkCmdCopyAccelerationStructureNV vkCmdCopyAccelerationStructureNV; /* 4008 8 */
	PFN_vkCmdTraceRaysNV vkCmdTraceRaysNV; /* 4016 8 */
	PFN_vkCmdWriteAccelerationStructuresPropertiesNV vkCmdWriteAccelerationStructuresPropertiesNV; /* 4024 8 */
	PFN_vkCompileDeferredNV vkCompileDeferredNV; /* 4032 8 */
	PFN_vkCreateAccelerationStructureNV vkCreateAccelerationStructureNV; /* 4040 8 */
	PFN_vkCreateRayTracingPipelinesNV vkCreateRayTracingPipelinesNV; /* 4048 8 */
	PFN_vkDestroyAccelerationStructureNV vkDestroyAccelerationStructureNV; /* 4056 8 */
	PFN_vkGetAccelerationStructureHandleNV vkGetAccelerationStructureHandleNV; /* 4064 8 */
	PFN_vkGetAccelerationStructureMemoryRequirementsNV vkGetAccelerationStructureMemoryRequirementsNV; /* 4072 8 */
	PFN_vkGetRayTracingShaderGroupHandlesNV vkGetRayTracingShaderGroupHandlesNV; /* 4080 8 */
	PFN_vkCmdSetExclusiveScissorEnableNV vkCmdSetExclusiveScissorEnableNV; /* 4088 8 */
	PFN_vkCmdSetExclusiveScissorNV vkCmdSetExclusiveScissorNV; /* 4096 8 */
	PFN_vkCmdBindShadingRateImageNV vkCmdBindShadingRateImageNV; /* 4104 8 */
	PFN_vkCmdSetCoarseSampleOrderNV vkCmdSetCoarseSampleOrderNV; /* 4112 8 */
	PFN_vkCmdSetViewportShadingRatePaletteNV vkCmdSetViewportShadingRatePaletteNV; /* 4120 8 */
	PFN_vkGetDynamicRenderingTilePropertiesQCOM vkGetDynamicRenderingTilePropertiesQCOM; /* 4128 8 */
	PFN_vkGetFramebufferTilePropertiesQCOM vkGetFramebufferTilePropertiesQCOM; /* 4136 8 */
	PFN_vkGetDescriptorSetHostMappingVALVE vkGetDescriptorSetHostMappingVALVE; /* 4144 8 */
	PFN_vkGetDescriptorSetLayoutHostMappingInfoVALVE vkGetDescriptorSetLayoutHostMappingInfoVALVE; /* 4152 8 */
	PFN_vkCmdSetDepthClampRangeEXT vkCmdSetDepthClampRangeEXT; /* 4160 8 */
	PFN_vkCmdBindVertexBuffers2EXT vkCmdBindVertexBuffers2EXT; /* 4168 8 */
	PFN_vkCmdSetCullModeEXT vkCmdSetCullModeEXT; /* 4176 8 */
	PFN_vkCmdSetDepthBoundsTestEnableEXT vkCmdSetDepthBoundsTestEnableEXT; /* 4184 8 */
	PFN_vkCmdSetDepthCompareOpEXT vkCmdSetDepthCompareOpEXT; /* 4192 8 */
	PFN_vkCmdSetDepthTestEnableEXT vkCmdSetDepthTestEnableEXT; /* 4200 8 */
	PFN_vkCmdSetDepthWriteEnableEXT vkCmdSetDepthWriteEnableEXT; /* 4208 8 */
	PFN_vkCmdSetFrontFaceEXT vkCmdSetFrontFaceEXT; /* 4216 8 */
	PFN_vkCmdSetPrimitiveTopologyEXT vkCmdSetPrimitiveTopologyEXT; /* 4224 8 */
	PFN_vkCmdSetScissorWithCountEXT vkCmdSetScissorWithCountEXT; /* 4232 8 */
	PFN_vkCmdSetStencilOpEXT vkCmdSetStencilOpEXT; /* 4240 8 */
	PFN_vkCmdSetStencilTestEnableEXT vkCmdSetStencilTestEnableEXT; /* 4248 8 */
	PFN_vkCmdSetViewportWithCountEXT vkCmdSetViewportWithCountEXT; /* 4256 8 */
	PFN_vkCmdSetDepthBiasEnableEXT vkCmdSetDepthBiasEnableEXT; /* 4264 8 */
	PFN_vkCmdSetLogicOpEXT vkCmdSetLogicOpEXT; /* 4272 8 */
	PFN_vkCmdSetPatchControlPointsEXT vkCmdSetPatchControlPointsEXT; /* 4280 8 */
	PFN_vkCmdSetPrimitiveRestartEnableEXT vkCmdSetPrimitiveRestartEnableEXT; /* 4288 8 */
	PFN_vkCmdSetRasterizerDiscardEnableEXT vkCmdSetRasterizerDiscardEnableEXT; /* 4296 8 */
	PFN_vkCmdSetAlphaToCoverageEnableEXT vkCmdSetAlphaToCoverageEnableEXT; /* 4304 8 */
	PFN_vkCmdSetAlphaToOneEnableEXT vkCmdSetAlphaToOneEnableEXT; /* 4312 8 */
	PFN_vkCmdSetColorBlendEnableEXT vkCmdSetColorBlendEnableEXT; /* 4320 8 */
	PFN_vkCmdSetColorBlendEquationEXT vkCmdSetColorBlendEquationEXT; /* 4328 8 */
	PFN_vkCmdSetColorWriteMaskEXT vkCmdSetColorWriteMaskEXT; /* 4336 8 */
	PFN_vkCmdSetDepthClampEnableEXT vkCmdSetDepthClampEnableEXT; /* 4344 8 */
	PFN_vkCmdSetLogicOpEnableEXT vkCmdSetLogicOpEnableEXT; /* 4352 8 */
	PFN_vkCmdSetPolygonModeEXT vkCmdSetPolygonModeEXT; /* 4360 8 */
	PFN_vkCmdSetRasterizationSamplesEXT vkCmdSetRasterizationSamplesEXT; /* 4368 8 */
	PFN_vkCmdSetSampleMaskEXT vkCmdSetSampleMaskEXT; /* 4376 8 */
	PFN_vkCmdSetTessellationDomainOriginEXT vkCmdSetTessellationDomainOriginEXT; /* 4384 8 */
	PFN_vkCmdSetRasterizationStreamEXT vkCmdSetRasterizationStreamEXT; /* 4392 8 */
	PFN_vkCmdSetConservativeRasterizationModeEXT vkCmdSetConservativeRasterizationModeEXT; /* 4400 8 */
	PFN_vkCmdSetExtraPrimitiveOverestimationSizeEXT vkCmdSetExtraPrimitiveOverestimationSizeEXT; /* 4408 8 */
	PFN_vkCmdSetDepthClipEnableEXT vkCmdSetDepthClipEnableEXT; /* 4416 8 */
	PFN_vkCmdSetSampleLocationsEnableEXT vkCmdSetSampleLocationsEnableEXT; /* 4424 8 */
	PFN_vkCmdSetColorBlendAdvancedEXT vkCmdSetColorBlendAdvancedEXT; /* 4432 8 */
	PFN_vkCmdSetProvokingVertexModeEXT vkCmdSetProvokingVertexModeEXT; /* 4440 8 */
	PFN_vkCmdSetLineRasterizationModeEXT vkCmdSetLineRasterizationModeEXT; /* 4448 8 */
	PFN_vkCmdSetLineStippleEnableEXT vkCmdSetLineStippleEnableEXT; /* 4456 8 */
	PFN_vkCmdSetDepthClipNegativeOneToOneEXT vkCmdSetDepthClipNegativeOneToOneEXT; /* 4464 8 */
	PFN_vkCmdSetViewportWScalingEnableNV vkCmdSetViewportWScalingEnableNV; /* 4472 8 */
	PFN_vkCmdSetViewportSwizzleNV vkCmdSetViewportSwizzleNV; /* 4480 8 */
	PFN_vkCmdSetCoverageToColorEnableNV vkCmdSetCoverageToColorEnableNV; /* 4488 8 */
	PFN_vkCmdSetCoverageToColorLocationNV vkCmdSetCoverageToColorLocationNV; /* 4496 8 */
	PFN_vkCmdSetCoverageModulationModeNV vkCmdSetCoverageModulationModeNV; /* 4504 8 */
	PFN_vkCmdSetCoverageModulationTableEnableNV vkCmdSetCoverageModulationTableEnableNV; /* 4512 8 */
	PFN_vkCmdSetCoverageModulationTableNV vkCmdSetCoverageModulationTableNV; /* 4520 8 */
	PFN_vkCmdSetShadingRateImageEnableNV vkCmdSetShadingRateImageEnableNV; /* 4528 8 */
	PFN_vkCmdSetRepresentativeFragmentTestEnableNV vkCmdSetRepresentativeFragmentTestEnableNV; /* 4536 8 */
	PFN_vkCmdSetCoverageReductionModeNV vkCmdSetCoverageReductionModeNV; /* 4544 8 */
	PFN_vkGetImageSubresourceLayout2EXT vkGetImageSubresourceLayout2EXT; /* 4552 8 */
	PFN_vkCmdSetVertexInputEXT vkCmdSetVertexInputEXT; /* 4560 8 */
	PFN_vkCmdPushDescriptorSetWithTemplateKHR vkCmdPushDescriptorSetWithTemplateKHR; /* 4568 8 */
	PFN_vkGetDeviceGroupPresentCapabilitiesKHR vkGetDeviceGroupPresentCapabilitiesKHR; /* 4576 8 */
	PFN_vkGetDeviceGroupSurfacePresentModesKHR vkGetDeviceGroupSurfacePresentModesKHR; /* 4584 8 */
	PFN_vkAcquireNextImage2KHR vkAcquireNextImage2KHR; /* 4592 8 */
};

