
//
// thirdparty/wuffs/wuffs-v0.4.c
//
//	referenced by: libengine2.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 1,164
//	structs: 88
//

// <048DD4B7> ../thirdparty/wuffs/wuffs-v0.4.c:24
wuffs_base__empty_wuffs_png__decoder__filter_4(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
} /* size: 0 */

// <048DD336> ../thirdparty/wuffs/wuffs-v0.4.c:33
// variables: 10
// function call: 1
wuffs_base__empty_wuffs_png__decoder__filter_4__choosy_default(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	uint64_t v_filter_distance; // 37
	uint64_t v_n; // 38
	uint64_t v_i; // 39
	uint32_t v_fa; // 40
	uint32_t v_fb; // 41
	uint32_t v_fc; // 42
	uint32_t v_pp; // 43
	uint32_t v_pa; // 44
	uint32_t v_pb; // 45
	uint32_t v_pc; // 46
	wuffs_base__u64__min(uint64_t x,
				uint64_t y);  // 49
} /* size: 0, variables: 10, inline expansions: 1 (0 bytes) */

// <048DCFFF> ../thirdparty/wuffs/wuffs-v0.4.c:89
// variables: 26
// function calls: 2
wuffs_base__empty_wuffs_png__decoder__filter_4_distance_3_fallback(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	wuffs_base__slice_u8 v_curr; // 93
	wuffs_base__slice_u8 v_prev; // 94
	uint32_t v_fa0; // 95
	uint32_t v_fa1; // 96
	uint32_t v_fa2; // 97
	uint32_t v_fb0; // 98
	uint32_t v_fb1; // 99
	uint32_t v_fb2; // 100
	uint32_t v_fc0; // 101
	uint32_t v_fc1; // 102
	uint32_t v_fc2; // 103
	uint32_t v_pp0; // 104
	uint32_t v_pp1; // 105
	uint32_t v_pp2; // 106
	uint32_t v_pa0; // 107
	uint32_t v_pa1; // 108
	uint32_t v_pa2; // 109
	uint32_t v_pb0; // 110
	uint32_t v_pb1; // 111
	uint32_t v_pb2; // 112
	uint32_t v_pc0; // 113
	uint32_t v_pc1; // 114
	uint32_t v_pc2; // 115
	{
		wuffs_base__slice_u8 i_slice_curr; // 118
		wuffs_base__slice_u8 i_slice_prev; // 120
		const uint8_t* i_end0_curr; // 125
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 122
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 125
	}
} /* size: 0, variables: 23 */

// <048DCC27> ../thirdparty/wuffs/wuffs-v0.4.c:209
// variables: 33
// function calls: 2
wuffs_base__empty_wuffs_png__decoder__filter_4_distance_4_fallback(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	wuffs_base__slice_u8 v_curr; // 213
	wuffs_base__slice_u8 v_prev; // 214
	uint32_t v_fa0; // 215
	uint32_t v_fa1; // 216
	uint32_t v_fa2; // 217
	uint32_t v_fa3; // 218
	uint32_t v_fb0; // 219
	uint32_t v_fb1; // 220
	uint32_t v_fb2; // 221
	uint32_t v_fb3; // 222
	uint32_t v_fc0; // 223
	uint32_t v_fc1; // 224
	uint32_t v_fc2; // 225
	uint32_t v_fc3; // 226
	uint32_t v_pp0; // 227
	uint32_t v_pp1; // 228
	uint32_t v_pp2; // 229
	uint32_t v_pp3; // 230
	uint32_t v_pa0; // 231
	uint32_t v_pa1; // 232
	uint32_t v_pa2; // 233
	uint32_t v_pa3; // 234
	uint32_t v_pb0; // 235
	uint32_t v_pb1; // 236
	uint32_t v_pb2; // 237
	uint32_t v_pb3; // 238
	uint32_t v_pc0; // 239
	uint32_t v_pc1; // 240
	uint32_t v_pc2; // 241
	uint32_t v_pc3; // 242
	{
		wuffs_base__slice_u8 i_slice_curr; // 245
		wuffs_base__slice_u8 i_slice_prev; // 247
		const uint8_t* i_end0_curr; // 252
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 249
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 252
	}
} /* size: 0, variables: 30 */

// <0492AAB4> ../thirdparty/wuffs/wuffs-v0.4.c:300
// variables: 10
// function calls: 6
bool wuffs_base__cpu_arch__have_x86_avx2(void)
{
	const unsigned int  avx2_ebx7; // 308
	const unsigned int  avx2_ecx1; // 313
	unsigned int eax7; // 317
	unsigned int ebx7; // 318
	unsigned int ecx7; // 319
	unsigned int edx7; // 320
	__get_cpuid_max(unsigned int __ext,
			unsigned int* __sig);  // 345
	__get_cpuid_count(unsigned int __leaf,
				unsigned int __subleaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 321
	{
		unsigned int eax1; // 323
		unsigned int ebx1; // 324
		unsigned int ecx1; // 325
		unsigned int edx1; // 326
		__get_cpuid_max(unsigned int __ext,
				unsigned int* __sig);  // 328
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 327
	}
	__get_cpuid(unsigned int __leaf,
			unsigned int* __eax,
			unsigned int* __ebx,
			unsigned int* __ecx,
			unsigned int* __edx);  // 403
	wuffs_base__cpu_arch__have_x86_sse42(void); // 386
} /* size: 0, variables: 6, inline expansions: 4 (0 bytes) */

// <04928F46> ../thirdparty/wuffs/wuffs-v0.4.c:300
// variables: 10
inline bool wuffs_base__cpu_arch__have_x86_avx2(void)
{
	const unsigned int  avx2_ebx7; // 308
	const unsigned int  avx2_ecx1; // 313
	unsigned int eax7; // 317
	unsigned int ebx7; // 318
	unsigned int ecx7; // 319
	unsigned int edx7; // 320
	{
		unsigned int eax1; // 323
		unsigned int ebx1; // 324
		unsigned int ecx1; // 325
		unsigned int edx1; // 326
	}
} /* size: 0, variables: 6 */

// <04928EF2> ../thirdparty/wuffs/wuffs-v0.4.c:352
// variables: 5
inline bool wuffs_base__cpu_arch__have_x86_bmi2(void)
{
	const unsigned int  bmi2_ebx7; // 359
	unsigned int eax7; // 363
	unsigned int ebx7; // 364
	unsigned int ecx7; // 365
	unsigned int edx7; // 366
} /* size: 0, variables: 5 */

// <048DC69D> ../thirdparty/wuffs/wuffs-v0.4.c:362
// variables: 6
// function calls: 22
wuffs_base__empty_wuffs_png__decoder__filter_1_distance_4_x86_sse42(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr)
{
	wuffs_base__slice_u8 v_curr; // 365
	__m128i v_x128; // 366
	__m128i v_a128; // 367
	{
		wuffs_base__slice_u8 i_slice_curr; // 370
		const uint8_t* i_end0_curr; // 373
		const uint8_t* i_end1_curr; // 387
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 373
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 375
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 375
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 376
		_mm_cvtsi128_si32(__m128i __A); // 378
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 380
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 378
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 380
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 381
		_mm_cvtsi128_si32(__m128i __A); // 383
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 387
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 389
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 389
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 390
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 392
		_mm_cvtsi128_si32(__m128i __A); // 392
	}
	wuffs_base__make_empty_struct(void); // 397
} /* size: 0, variables: 3, inline expansions: 1 (0 bytes) */

// <04931173> ../thirdparty/wuffs/wuffs-v0.4.c:386
// variables: 5
// function calls: 4
bool wuffs_base__cpu_arch__have_x86_sse42(void)
{
	const unsigned int  sse42_ecx1; // 395
	unsigned int eax1; // 399
	unsigned int ebx1; // 400
	unsigned int ecx1; // 401
	unsigned int edx1; // 402
	__get_cpuid_max(unsigned int __ext,
			unsigned int* __sig);  // 328
	__get_cpuid(unsigned int __leaf,
			unsigned int* __eax,
			unsigned int* __ebx,
			unsigned int* __ecx,
			unsigned int* __edx);  // 403
	__get_cpuid(unsigned int __leaf,
			unsigned int* __eax,
			unsigned int* __ebx,
			unsigned int* __ecx,
			unsigned int* __edx);  // 403
	wuffs_base__cpu_arch__have_x86_sse42(void); // 386
} /* size: 0, variables: 5, inline expansions: 4 (0 bytes) */

// <04928E9E> ../thirdparty/wuffs/wuffs-v0.4.c:386
// variables: 5
inline bool wuffs_base__cpu_arch__have_x86_sse42(void)
{
	const unsigned int  sse42_ecx1; // 395
	unsigned int eax1; // 399
	unsigned int ebx1; // 400
	unsigned int ecx1; // 401
	unsigned int edx1; // 402
} /* size: 0, variables: 5 */

// <048DB5F8> ../thirdparty/wuffs/wuffs-v0.4.c:409
// variables: 14
// function calls: 73
wuffs_base__empty_wuffs_png__decoder__filter_3_distance_4_x86_sse42(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	wuffs_base__slice_u8 v_curr; // 413
	wuffs_base__slice_u8 v_prev; // 414
	__m128i v_x128; // 415
	__m128i v_a128; // 416
	__m128i v_b128; // 417
	__m128i v_p128; // 418
	__m128i v_k128; // 419
	{
		wuffs_base__slice_u8 i_slice_curr; // 424
		const uint8_t* i_end0_curr; // 427
		const uint8_t* i_end1_curr; // 443
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 427
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 429
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 429
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 430
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 430
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 431
		_mm_cvtsi128_si32(__m128i __A); // 433
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 436
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 433
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 435
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 435
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 436
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 437
		_mm_cvtsi128_si32(__m128i __A); // 439
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 443
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 445
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 445
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 446
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 446
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 447
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 449
		_mm_cvtsi128_si32(__m128i __A); // 449
	}
	{
		wuffs_base__slice_u8 i_slice_curr; // 457
		wuffs_base__slice_u8 i_slice_prev; // 459
		const uint8_t* i_end0_curr; // 464
		const uint8_t* i_end1_curr; // 487
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 461
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 464
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 468
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 466
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 466
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 467
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 469
		_mm_xor_si128(__m128i __A,
				__m128i __B);  // 468
		_mm_sub_epi8(__m128i __A,
				__m128i __B);  // 468
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 469
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 470
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 478
		_mm_cvtsi128_si32(__m128i __A); // 472
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 472
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 476
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 475
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 475
		_mm_xor_si128(__m128i __A,
				__m128i __B);  // 477
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 477
		_mm_sub_epi8(__m128i __A,
				__m128i __B);  // 477
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 478
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 479
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 481
		_mm_cvtsi128_si32(__m128i __A); // 481
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 487
		_mm_and_si128(__m128i __A,
				__m128i __B);  // 491
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 489
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 489
		_mm_avg_epu8(__m128i __A,
				__m128i __B);  // 490
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 492
		_mm_xor_si128(__m128i __A,
				__m128i __B);  // 491
		_mm_sub_epi8(__m128i __A,
				__m128i __B);  // 491
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 492
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 493
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 495
		_mm_cvtsi128_si32(__m128i __A); // 495
	}
	wuffs_base__make_empty_struct(void); // 503
} /* size: 0, variables: 7, inline expansions: 1 (0 bytes) */

// <0483C173> ../common/../thirdparty/wuffs/wuffs-v0.4.c:499
// member function: 1
// struct size: 1
struct wuffs_unique_ptr_deleter {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:500 */
	void operator()(wuffs_unique_ptr_deleter* , void* );
};

// <04928E7A> ../thirdparty/wuffs/wuffs-v0.4.c:500
inline void wuffs_unique_ptr_deleter::operator(void* p)
{
} /* size: 0 */

// <04928E5A> ../thirdparty/wuffs/wuffs-v0.4.c:512
inline uint8_t* wuffs_base__strip_const_from_u8_ptr(const uint8_t* ptr)
{
} /* size: 0 */

// <048DA191> ../thirdparty/wuffs/wuffs-v0.4.c:515
// variables: 19
// function calls: 94
wuffs_base__empty_wuffs_png__decoder__filter_4_distance_3_x86_sse42(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	wuffs_base__slice_u8 v_curr; // 519
	wuffs_base__slice_u8 v_prev; // 520
	__m128i v_x128; // 521
	__m128i v_a128; // 522
	__m128i v_b128; // 523
	__m128i v_c128; // 524
	__m128i v_p128; // 525
	__m128i v_pa128; // 526
	__m128i v_pb128; // 527
	__m128i v_pc128; // 528
	__m128i v_smallest128; // 529
	__m128i v_z128; // 530
	{
		wuffs_base__slice_u8 i_slice_curr; // 533
		wuffs_base__slice_u8 i_slice_prev; // 535
		const uint8_t* i_end0_curr; // 540
		const uint8_t* i_end1_curr; // 583
		const uint8_t* i_end2_curr; // 607
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 537
		{
			size_t n; // 17186
		}
		wuffs_private_impl__iterate_total_advance(size_t total_len,
								size_t iter_len,
								size_t iter_advance);  // 540
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 540
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 542
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 542
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 543
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 545
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 571
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 544
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 552
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 550
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 546
		_mm_abs_epi16(__m128i __X); // 547
		_mm_abs_epi16(__m128i __X); // 548
		_mm_abs_epi16(__m128i __X); // 549
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 550
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 551
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 551
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 552
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 553
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 554
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 557
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 564
		_mm_cvtsi128_si32(__m128i __A); // 558
		wuffs_base__poke_u24le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 558
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 569
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 561
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 561
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 562
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 563
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 565
		_mm_abs_epi16(__m128i __X); // 566
		_mm_abs_epi16(__m128i __X); // 567
		_mm_abs_epi16(__m128i __X); // 568
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 569
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 570
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 570
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 571
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 572
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 573
		wuffs_base__poke_u24le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 577
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 576
		_mm_cvtsi128_si32(__m128i __A); // 577
		{
			size_t n; // 17186
		}
		wuffs_private_impl__iterate_total_advance(size_t total_len,
								size_t iter_len,
								size_t iter_advance);  // 583
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 607
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 612
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 611
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 617
		wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p); // 609
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 609
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 610
		wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p); // 619
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 613
		_mm_abs_epi16(__m128i __X); // 614
		_mm_abs_epi16(__m128i __X); // 615
		_mm_abs_epi16(__m128i __X); // 616
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 617
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 618
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 621
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 618
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 619
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 620
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 622
		_mm_cvtsi128_si32(__m128i __A); // 623
		wuffs_base__poke_u24le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 623
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 583
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 585
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 585
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 586
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 588
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 587
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 593
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 589
		_mm_abs_epi16(__m128i __X); // 590
		_mm_abs_epi16(__m128i __X); // 591
		_mm_abs_epi16(__m128i __X); // 592
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 593
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 594
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 595
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 596
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 594
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 595
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 597
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 600
		_mm_cvtsi128_si32(__m128i __A); // 601
		wuffs_base__poke_u24le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 601
	}
} /* size: 0, variables: 12 */

// <0483C1B1> ../common/../thirdparty/wuffs/wuffs-v0.4.c:540
// member variable: 1
// struct size: 1
struct wuffs_base__empty_struct__struct {
	uint8_t private_impl; /* 0 1 */
};

// <04928E3A> ../thirdparty/wuffs/wuffs-v0.4.c:554
// variable: 1
inline wuffs_base__empty_wuffs_base__make_empty_struct(void)
{
	wuffs_base__empty_ret; // 555
} /* size: 0, variables: 1 */

// <0483C1DD> ../common/../thirdparty/wuffs/wuffs-v0.4.c:575
// member variables: 2
// struct size: 16
struct wuffs_base__vtable__struct {
	const char * vtable_name; /* 0 8 */
	const void * function_pointers; /* 8 8 */
};

// <0483C219> ../common/../thirdparty/wuffs/wuffs-v0.4.c:583
// member functions: 7
// member variable: 1
// struct size: 8
struct wuffs_base__status__struct {
	const char * repr; /* 0 8 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:587 */
	bool is_complete(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:588 */
	bool is_error(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:589 */
	bool is_note(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:590 */
	bool is_ok(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:591 */
	bool is_suspension(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:592 */
	bool is_truncated_input_error(const wuffs_base__status__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:593 */
	const char* message(const wuffs_base__status__struct* );
};

// <04928E0F> ../thirdparty/wuffs/wuffs-v0.4.c:635
// variable: 1
inline wuffs_base__status wuffs_base__make_status(const char* repr)
{
	wuffs_base__status z; // 636
} /* size: 0, variables: 1 */

// <048D90AA> ../thirdparty/wuffs/wuffs-v0.4.c:642
// variables: 16
// function calls: 73
wuffs_base__empty_wuffs_png__decoder__filter_4_distance_4_x86_sse42(wuffs_png__decoder* self, wuffs_base__slice_u8 a_curr, wuffs_base__slice_u8 a_prev)
{
	wuffs_base__slice_u8 v_curr; // 646
	wuffs_base__slice_u8 v_prev; // 647
	__m128i v_x128; // 648
	__m128i v_a128; // 649
	__m128i v_b128; // 650
	__m128i v_c128; // 651
	__m128i v_p128; // 652
	__m128i v_pa128; // 653
	__m128i v_pb128; // 654
	__m128i v_pc128; // 655
	__m128i v_smallest128; // 656
	__m128i v_z128; // 657
	{
		wuffs_base__slice_u8 i_slice_curr; // 660
		wuffs_base__slice_u8 i_slice_prev; // 662
		const uint8_t* i_end0_curr; // 667
		const uint8_t* i_end1_curr; // 710
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 667
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 664
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 669
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 669
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 670
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 672
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 671
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 673
		_mm_abs_epi16(__m128i __X); // 674
		_mm_abs_epi16(__m128i __X); // 675
		_mm_abs_epi16(__m128i __X); // 676
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 677
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 677
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 678
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 678
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 679
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 679
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 680
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 681
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 684
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 691
		_mm_cvtsi128_si32(__m128i __A); // 685
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 685
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 688
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 688
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 689
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 690
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 692
		_mm_abs_epi16(__m128i __X); // 693
		_mm_abs_epi16(__m128i __X); // 694
		_mm_abs_epi16(__m128i __X); // 695
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 696
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 696
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 697
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 698
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 699
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 697
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 698
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 700
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 703
		_mm_cvtsi128_si32(__m128i __A); // 704
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 704
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 710
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 712
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 712
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 713
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 715
		_mm_sub_epi16(__m128i __A,
				__m128i __B);  // 714
		_mm_add_epi16(__m128i __A,
				__m128i __B);  // 716
		_mm_abs_epi16(__m128i __X); // 717
		_mm_abs_epi16(__m128i __X); // 718
		_mm_abs_epi16(__m128i __X); // 719
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 720
		_mm_min_epi16(__m128i __A,
				__m128i __B);  // 720
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 721
		_mm_set_epi32(int __q3,
				int __q2,
				int __q1,
				int __q0);  // 1569
		_mm_cvtsi32_si128(int __A); // 722
		_mm_unpacklo_epi8(__m128i __A,
					__m128i __B);  // 723
		_mm_cmpeq_epi16(__m128i __A,
				__m128i __B);  // 721
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 722
		_mm_add_epi8(__m128i __A,
				__m128i __B);  // 724
		_mm_packus_epi16(__m128i __A,
				__m128i __B);  // 727
		_mm_cvtsi128_si32(__m128i __A); // 728
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 1589
		wuffs_base__poke_u32le__no_bounds_check(uint8_t* p,
							uint32_t x);  // 728
	}
	wuffs_base__make_empty_struct(void); // 735
} /* size: 0, variables: 12, inline expansions: 1 (0 bytes) */

// <04928DF1> ../thirdparty/wuffs/wuffs-v0.4.c:647
inline bool wuffs_base__status__is_error(const wuffs_base__status* z)
{
} /* size: 0 */

// <04928DD3> ../thirdparty/wuffs/wuffs-v0.4.c:657
inline bool wuffs_base__status__is_ok(const wuffs_base__status* z)
{
} /* size: 0 */

// <04928DB5> ../thirdparty/wuffs/wuffs-v0.4.c:662
inline bool wuffs_base__status__is_suspension(const wuffs_base__status* z)
{
} /* size: 0 */

// <04931148> ../thirdparty/wuffs/wuffs-v0.4.c:685
const char* wuffs_base__status__message(const wuffs_base__status* z)
{
} /* size: 0 */

// <04928D74> ../thirdparty/wuffs/wuffs-v0.4.c:712
inline void wuffs_base__status__struct::is_ok()
{
} /* size: 0 */

// <04928D57> ../thirdparty/wuffs/wuffs-v0.4.c:727
inline void wuffs_base__status__struct::message()
{
} /* size: 0 */

// <048D9076> ../thirdparty/wuffs/wuffs-v0.4.c:744
uint64_t wuffs_png__decoder__get_quirk(const wuffs_png__decoder* self, uint32_t a_key)
{
} /* size: 0 */

// <04870358> ../thirdparty/wuffs/wuffs-v0.4.c:744
// member variables: 2
// struct size: 16
typedef struct {
	wuffs_base__status status; /* 0 8 */
	double value; /* 8 8 */
} wuffs_base__result_f64;

// <04870395> ../thirdparty/wuffs/wuffs-v0.4.c:745
// member variables: 2
// struct size: 16
typedef struct {
	wuffs_base__status status; /* 0 8 */
	int64_t value; /* 8 8 */
} wuffs_base__result_i64;

// <048703D2> ../thirdparty/wuffs/wuffs-v0.4.c:746
// member variables: 2
// struct size: 16
typedef struct {
	wuffs_base__status status; /* 0 8 */
	uint64_t value; /* 8 8 */
} wuffs_base__result_u64;

// <0487040F> ../thirdparty/wuffs/wuffs-v0.4.c:752
// member variables: 3
// struct size: 24
struct wuffs_base__transform__output__struct {
	wuffs_base__status status; /* 0 8 */
	size_t num_dst; /* 8 8 */
	size_t num_src; /* 16 8 */
};

// <048D9033> ../thirdparty/wuffs/wuffs-v0.4.c:765
wuffs_base__status wuffs_png__decoder__set_quirk(wuffs_png__decoder* self, uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <048D8F92> ../thirdparty/wuffs/wuffs-v0.4.c:791
// variables: 4
wuffs_base__status wuffs_png__decoder__decode_image_config(wuffs_png__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 841

ok: // 835

exit: // 846
	wuffs_base__status status; // 814
	wuffs_base__status v_status; // 816
	uint32_t coro_susp_point; // 818
	{
		wuffs_base__status t_0; // 824
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <048D7DD9> ../thirdparty/wuffs/wuffs-v0.4.c:857
// variables: 36
// function calls: 42
wuffs_base__status wuffs_png__decoder__do_decode_image_config(wuffs_png__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 1146

suspend: // 1152

exit: // 1157
	wuffs_base__status status; // 861
	uint64_t v_magic; // 863
	uint64_t v_mark; // 864
	uint32_t v_checksum_have; // 865
	uint32_t v_checksum_want; // 866
	wuffs_base__status v_status; // 867
	const uint8_t* iop_a_src; // 869
	const uint8_t* io0_a_src; // 870
	const uint8_t* io1_a_src; // 871
	const uint8_t* io2_a_src; // 872
	uint32_t coro_susp_point; // 880
	{
		uint64_t t_0; // 893
		{
			uint64_t* scratch; // 905
			uint32_t num_bits_0; // 906
		}
		wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p); // 895
	}
	{
		uint64_t t_1; // 926
		{
			uint64_t* scratch; // 938
			uint32_t num_bits_1; // 939
		}
		wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p); // 928
	}
	{
		wuffs_base__status t_2; // 974

ok: // 1349

exit: // 1359

suspend: // 1355
		{
			uint32_t t_0; // 1194
			{
				uint64_t* scratch; // 1206
				uint32_t num_bits_0; // 1207
			}
		}
		{
			uint32_t t_1; // 1231
			{
				uint64_t* scratch; // 1243
				uint32_t num_bits_1; // 1244
			}
		}
		{
			uint8_t t_2; // 1272
		}
		{
			uint8_t t_3; // 1286
		}
		{
			uint8_t t_4; // 1300
		}
		{
			uint8_t t_5; // 1313
		}
		{
			uint8_t t_6; // 1326
		}
		wuffs_png__decoder__assign_filter_distance(wuffs_png__decoder* self); // 1340
		wuffs_png__decoder__calculate_bytes_per_row(const wuffs_png__decoder* self,
								uint32_t a_width);  // 1345
		__get_cpuid_max(unsigned int __ext,
				unsigned int* __sig);  // 328
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		wuffs_base__cpu_arch__have_x86_sse42(void); // 386
		wuffs_base__cpu_arch__have_x86_sse42(void); // 1485
		__get_cpuid_max(unsigned int __ext,
				unsigned int* __sig);  // 328
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		wuffs_base__cpu_arch__have_x86_sse42(void); // 386
		wuffs_base__cpu_arch__have_x86_sse42(void); // 1494
		__get_cpuid_max(unsigned int __ext,
				unsigned int* __sig);  // 328
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		wuffs_base__cpu_arch__have_x86_sse42(void); // 386
		wuffs_base__cpu_arch__have_x86_sse42(void); // 1502
		__get_cpuid_max(unsigned int __ext,
				unsigned int* __sig);  // 328
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		__get_cpuid(unsigned int __leaf,
				unsigned int* __eax,
				unsigned int* __ebx,
				unsigned int* __ecx,
				unsigned int* __edx);  // 403
		wuffs_base__cpu_arch__have_x86_sse42(void); // 386
		wuffs_base__cpu_arch__have_x86_sse42(void); // 1510
		wuffs_png__decoder__choose_filter_implementations(wuffs_png__decoder* self); // 1346
		wuffs_png__decoder__decode_ihdr(wuffs_png__decoder* self,
						wuffs_base__io_buffer* a_src);  // 974
	}
	{
		uint32_t t_3; // 991
		{
			uint64_t* scratch; // 1003
			uint32_t num_bits_3; // 1004
		}
	}
	{
		wuffs_base__status t_4; // 1064
	}
	{
		uint32_t t_5; // 1086
		{
			uint64_t* scratch; // 1098
			uint32_t num_bits_5; // 1099
		}
	}
	wuffs_base__status__is_ok(const wuffs_base__status* z); // 983
	wuffs_private_impl__io__since(uint64_t mark,
					uint64_t index,
					const uint8_t* ptr);  // 981
	memset(void* __dest,
		int __ch,
		size_t __len);  // 38818
	wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 38784
	wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 965
	wuffs_base__make_slice_u8(uint8_t* ptr,
					size_t len);  // 967
	wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p); // 1035
	wuffs_private_impl__io__since(uint64_t mark,
					uint64_t index,
					const uint8_t* ptr);  // 1071
	memset(void* __dest,
		int __ch,
		size_t __len);  // 38818
	wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 38784
	wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 1054
	wuffs_base__make_slice_u8(uint8_t* ptr,
					size_t len);  // 1056
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 1122
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 4963
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 1125
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 1153
} /* size: 0, variables: 11, goto labels: 3, inline expansions: 16 (0 bytes) */

// <04928D2E> ../thirdparty/wuffs/wuffs-v0.4.c:1028
inline int32_t wuffs_base__i32__max(int32_t x, int32_t y)
{
} /* size: 0 */

// <04928D05> ../thirdparty/wuffs/wuffs-v0.4.c:1043
inline uint8_t wuffs_base__u8__min(uint8_t x, uint8_t y)
{
} /* size: 0 */

// <04928CDC> ../thirdparty/wuffs/wuffs-v0.4.c:1048
inline uint8_t wuffs_base__u8__max(uint8_t x, uint8_t y)
{
} /* size: 0 */

// <04928CB3> ../thirdparty/wuffs/wuffs-v0.4.c:1063
inline uint32_t wuffs_base__u32__min(uint32_t x, uint32_t y)
{
} /* size: 0 */

// <04928C8A> ../thirdparty/wuffs/wuffs-v0.4.c:1068
inline uint32_t wuffs_base__u32__max(uint32_t x, uint32_t y)
{
} /* size: 0 */

// <04928C61> ../thirdparty/wuffs/wuffs-v0.4.c:1073
inline uint64_t wuffs_base__u64__min(uint64_t x, uint64_t y)
{
} /* size: 0 */

// <04928C2B> ../thirdparty/wuffs/wuffs-v0.4.c:1169
// variable: 1
inline uint32_t wuffs_base__u32__sat_add(uint32_t x, uint32_t y)
{
	uint32_t res; // 1170
} /* size: 0, variables: 1 */

// <048D7C3F> ../thirdparty/wuffs/wuffs-v0.4.c:1169
// variables: 19
wuffs_base__status wuffs_png__decoder__decode_ihdr(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 1349

exit: // 1359

suspend: // 1355
	wuffs_base__status status; // 1172
	uint32_t v_a32; // 1174
	uint8_t v_a8; // 1175
	const uint8_t* iop_a_src; // 1177
	const uint8_t* io0_a_src; // 1178
	const uint8_t* io1_a_src; // 1179
	const uint8_t* io2_a_src; // 1180
	uint32_t coro_susp_point; // 1188
	{
		uint32_t t_0; // 1194
		{
			uint64_t* scratch; // 1206
			uint32_t num_bits_0; // 1207
		}
	}
	{
		uint32_t t_1; // 1231
		{
			uint64_t* scratch; // 1243
			uint32_t num_bits_1; // 1244
		}
	}
	{
		uint8_t t_2; // 1272
	}
	{
		uint8_t t_3; // 1286
	}
	{
		uint8_t t_4; // 1300
	}
	{
		uint8_t t_5; // 1313
	}
	{
		uint8_t t_6; // 1326
	}
} /* size: 0, variables: 8, goto labels: 3 */

// <04928BF5> ../thirdparty/wuffs/wuffs-v0.4.c:1176
// variable: 1
inline uint32_t wuffs_base__u32__sat_sub(uint32_t x, uint32_t y)
{
	uint32_t res; // 1177
} /* size: 0, variables: 1 */

// <04928BBF> ../thirdparty/wuffs/wuffs-v0.4.c:1183
// variable: 1
inline uint64_t wuffs_base__u64__sat_add(uint64_t x, uint64_t y)
{
	uint64_t res; // 1184
} /* size: 0, variables: 1 */

// <04928B89> ../thirdparty/wuffs/wuffs-v0.4.c:1190
// variable: 1
inline uint64_t wuffs_base__u64__sat_sub(uint64_t x, uint64_t y)
{
	uint64_t res; // 1191
} /* size: 0, variables: 1 */

// <04870468> ../thirdparty/wuffs/wuffs-v0.4.c:1198
// member variables: 2
// struct size: 16
struct wuffs_base__multiply_u64__output__struct {
	uint64_t lo; /* 0 8 */
	uint64_t hi; /* 8 8 */
};

// <04928B4A> ../thirdparty/wuffs/wuffs-v0.4.c:1207
// variables: 2
inline wuffs_base__multiply_u64__output wuffs_base__multiply_u64(uint64_t x, uint64_t y)
{
	__int128 unsigned z; // 1209
	wuffs_base__multiply_u64__output o; // 1210
} /* size: 0, variables: 2 */

// <048704A2> ../thirdparty/wuffs/wuffs-v0.4.c:1234
// member variable: 1
// struct size: 32
struct wuffs_base__bitvec256__struct {
	uint64_t elements_u64[4]; /* 0 32 */
};

// <04928AF6> ../thirdparty/wuffs/wuffs-v0.4.c:1241
// variable: 1
inline wuffs_base__bitvec256 wuffs_base__make_bitvec256(uint64_t e00, uint64_t e01, uint64_t e02, uint64_t e03)
{
	wuffs_base__bitvec256 res; // 1245
} /* size: 0, variables: 1 */

// <04928AC7> ../thirdparty/wuffs/wuffs-v0.4.c:1254
inline uint64_t wuffs_base__bitvec256__get_u64(const wuffs_base__bitvec256* b, uint32_t i)
{
} /* size: 0 */

// <0484D9F4> ../common/../thirdparty/wuffs/wuffs-v0.4.c:1264
// member functions: 3
// member variable: 1
// struct size: 8
struct wuffs_base__optional_u63__struct {
	uint64_t repr; /* 0 8 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:1268 */
	bool has_value(const wuffs_base__optional_u63__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:1269 */
	uint64_t value(const wuffs_base__optional_u63__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:1270 */
	uint64_t value_or(const wuffs_base__optional_u63__struct* , uint64_t);
};

// <04928A8D> ../thirdparty/wuffs/wuffs-v0.4.c:1280
// variable: 1
inline wuffs_base__optional_u63 wuffs_base__make_optional_u63(bool has_value, uint64_t value)
{
	wuffs_base__optional_u63 res; // 1281
} /* size: 0, variables: 1 */

// <04928A6F> ../thirdparty/wuffs/wuffs-v0.4.c:1329
inline uint32_t wuffs_base__count_leading_zeroes_u64(uint64_t u)
{
} /* size: 0 */

// <048D7C1B> ../thirdparty/wuffs/wuffs-v0.4.c:1371
wuffs_base__empty_wuffs_png__decoder__assign_filter_distance(wuffs_png__decoder* self)
{
} /* size: 0 */

// <04928A51> ../thirdparty/wuffs/wuffs-v0.4.c:1396
inline uint8_t wuffs_base__peek_u8__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <04928A33> ../thirdparty/wuffs/wuffs-v0.4.c:1401
inline uint16_t wuffs_base__peek_u16be__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <04928A15> ../thirdparty/wuffs/wuffs-v0.4.c:1412
inline uint16_t wuffs_base__peek_u16le__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <049289F7> ../thirdparty/wuffs/wuffs-v0.4.c:1423
inline uint32_t wuffs_base__peek_u24be__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <049289D9> ../thirdparty/wuffs/wuffs-v0.4.c:1429
inline uint32_t wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <049289BB> ../thirdparty/wuffs/wuffs-v0.4.c:1435
inline uint32_t wuffs_base__peek_u32be__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <0492899D> ../thirdparty/wuffs/wuffs-v0.4.c:1447
inline uint32_t wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <048D7BD9> ../thirdparty/wuffs/wuffs-v0.4.c:1453
// variable: 1
uint64_t wuffs_png__decoder__calculate_bytes_per_row(const wuffs_png__decoder* self, uint32_t a_width)
{
	uint64_t v_bytes_per_channel; // 1456
} /* size: 0, variables: 1 */

// <04928961> ../thirdparty/wuffs/wuffs-v0.4.c:1473
inline uint64_t wuffs_base__peek_u48be__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <048D7BB5> ../thirdparty/wuffs/wuffs-v0.4.c:1473
wuffs_base__empty_wuffs_png__decoder__choose_filter_implementations(wuffs_png__decoder* self)
{
} /* size: 0 */

// <04928943> ../thirdparty/wuffs/wuffs-v0.4.c:1480
inline uint64_t wuffs_base__peek_u48le__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <04928907> ../thirdparty/wuffs/wuffs-v0.4.c:1517
inline uint64_t wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p)
{
} /* size: 0 */

// <048D7056> ../thirdparty/wuffs/wuffs-v0.4.c:1521
// variables: 52
// function calls: 13
wuffs_base__status wuffs_png__decoder__decode_other_chunk(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src, bool a_framy)
{

ok: // 1742

suspend: // 1748

exit: // 1752
	wuffs_base__status status; // 1525
	const uint8_t* iop_a_src; // 1527
	const uint8_t* io0_a_src; // 1528
	const uint8_t* io1_a_src; // 1529
	const uint8_t* io2_a_src; // 1530
	uint32_t coro_susp_point; // 1538

ok: // 1856

suspend: // 1862

exit: // 1866
	{
		uint32_t t_0; // 1794
		{
			uint64_t* scratch; // 1806
			uint32_t num_bits_0; // 1807
		}
	}
	{
		uint32_t t_1; // 1827
		{
			uint64_t* scratch; // 1839
			uint32_t num_bits_1; // 1840
		}
	}
	wuffs_png__decoder__decode_actl(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1607

ok: // 2154

suspend: // 2160

exit: // 2164
	{
		uint64_t t_0; // 1912
		{
			uint64_t* scratch; // 1924
			uint32_t num_bits_0; // 1925
		}
	}
	{
		uint64_t t_6; // 2094
		{
			uint64_t* scratch; // 2106
			uint32_t num_bits_6; // 2107
		}
	}
	{
		uint64_t t_3; // 2003
		{
			uint64_t* scratch; // 2015
			uint32_t num_bits_3; // 2016
		}
	}
	{
		uint64_t t_7; // 2124
		{
			uint64_t* scratch; // 2136
			uint32_t num_bits_7; // 2137
		}
	}
	{
		uint64_t t_1; // 1942
		{
			uint64_t* scratch; // 1954
			uint32_t num_bits_1; // 1955
		}
	}
	{
		uint64_t t_2; // 1972
		{
			uint64_t* scratch; // 1984
			uint32_t num_bits_2; // 1985
		}
	}
	{
		uint64_t t_4; // 2033
		{
			uint64_t* scratch; // 2045
			uint32_t num_bits_4; // 2046
		}
	}
	{
		uint64_t t_5; // 2063
		{
			uint64_t* scratch; // 2075
			uint32_t num_bits_5; // 2076
		}
	}
	wuffs_png__decoder__decode_chrm(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1625

ok: // 2616

suspend: // 2622

exit: // 2626
	{
		uint64_t t_0; // 2585
		{
			uint64_t* scratch; // 2597
			uint32_t num_bits_0; // 2598
		}
	}
	wuffs_png__decoder__decode_gama(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1661

ok: // 2705

suspend: // 2711

exit: // 2715
	{
		uint8_t t_0; // 2672
	}
	{
		uint8_t t_1; // 2690
	}
	wuffs_png__decoder__decode_iccp(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1680

ok: // 3055

suspend: // 3061

exit: // 3067
	{
		uint64_t t_0; // 2938
		{
			uint64_t* scratch; // 2950
			uint32_t num_bits_0; // 2951
		}
	}
	{
		uint64_t t_1; // 2993
		wuffs_base__peek_u48be__no_bounds_check(const uint8_t* p); // 2995
		{
			uint64_t* scratch; // 3005
			uint32_t num_bits_1; // 3006
		}
	}
	{
		uint8_t t_2; // 3044
	}
	wuffs_png__decoder__decode_trns(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1718

ok: // 2871

suspend: // 2877

exit: // 2881
	{
		uint64_t t_0; // 2864
	}
	wuffs_png__decoder__decode_srgb(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1699

ok: // 2204

exit: // 2206
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 2199
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 2200
	wuffs_png__decoder__decode_exif(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1580
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 1749

ok: // 2807

suspend: // 2813

exit: // 2819
	{
		uint32_t t_0; // 2764
		wuffs_base__peek_u24be__no_bounds_check(const uint8_t* p); // 2766
		{
			uint64_t* scratch; // 2776
			uint32_t num_bits_0; // 2777
		}
	}
	wuffs_png__decoder__decode_plte(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 1551
} /* size: 0, variables: 6, goto labels: 26, inline expansions: 11 (0 bytes) */

// <049288E1> ../thirdparty/wuffs/wuffs-v0.4.c:1538
inline void wuffs_base__poke_u8__no_bounds_check(uint8_t* p, uint8_t x)
{
} /* size: 0 */

// <049288BB> ../thirdparty/wuffs/wuffs-v0.4.c:1543
inline void wuffs_base__poke_u16be__no_bounds_check(uint8_t* p, uint16_t x)
{
} /* size: 0 */

// <04928895> ../thirdparty/wuffs/wuffs-v0.4.c:1549
inline void wuffs_base__poke_u16le__no_bounds_check(uint8_t* p, uint16_t x)
{
} /* size: 0 */

// <0492886F> ../thirdparty/wuffs/wuffs-v0.4.c:1569
inline void wuffs_base__poke_u24le__no_bounds_check(uint8_t* p, uint32_t x)
{
} /* size: 0 */

// <04928849> ../thirdparty/wuffs/wuffs-v0.4.c:1584
inline void wuffs_base__poke_u32le__no_bounds_check(uint8_t* p, uint32_t x)
{
} /* size: 0 */

// <0492A9A3> ../thirdparty/wuffs/wuffs-v0.4.c:1671
// function call: 1
void wuffs_base__poke_u64le__no_bounds_check(uint8_t* p, uint64_t x)
{
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 1676
} /* size: 0, inline expansions: 1 (0 bytes) */

// <04928823> ../thirdparty/wuffs/wuffs-v0.4.c:1671
inline void wuffs_base__poke_u64le__no_bounds_check(uint8_t* p, uint64_t x)
{
} /* size: 0 */

// <0483C399> ../common/../thirdparty/wuffs/wuffs-v0.4.c:1716
// member variables: 2
// struct size: 16
typedef struct {
	uint8_t * ptr; /* 0 8 */
	size_t len; /* 8 8 */
} wuffs_base__slice_u8;

// <0483C3DC> ../common/../thirdparty/wuffs/wuffs-v0.4.c:1721
// member variables: 4
// struct size: 32
typedef struct {
	uint8_t * ptr; /* 0 8 */
	size_t width; /* 8 8 */
	size_t height; /* 16 8 */
	size_t stride; /* 24 8 */
} wuffs_base__table_u8;

// <049287E9> ../thirdparty/wuffs/wuffs-v0.4.c:1727
// variable: 1
inline wuffs_base__slice_u8 wuffs_base__make_slice_u8(uint8_t* ptr, size_t len)
{
	wuffs_base__slice_u8 ret; // 1728
} /* size: 0, variables: 1 */

// <049287A6> ../thirdparty/wuffs/wuffs-v0.4.c:1759
// variable: 1
inline wuffs_base__slice_u8 wuffs_base__make_slice_u8_ij(uint8_t* ptr, size_t i, size_t j)
{
	wuffs_base__slice_u8 ret; // 1760
} /* size: 0, variables: 1 */

// <048D6F43> ../thirdparty/wuffs/wuffs-v0.4.c:1764
// variables: 12
wuffs_base__status wuffs_png__decoder__decode_actl(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 1856

suspend: // 1862

exit: // 1866
	wuffs_base__status status; // 1767
	const uint8_t* iop_a_src; // 1769
	const uint8_t* io0_a_src; // 1770
	const uint8_t* io1_a_src; // 1771
	const uint8_t* io2_a_src; // 1772
	uint32_t coro_susp_point; // 1780
	{
		uint32_t t_0; // 1794
		{
			uint64_t* scratch; // 1806
			uint32_t num_bits_0; // 1807
		}
	}
	{
		uint32_t t_1; // 1827
		{
			uint64_t* scratch; // 1839
			uint32_t num_bits_1; // 1840
		}
	}
} /* size: 0, variables: 6, goto labels: 3 */

// <04928786> ../thirdparty/wuffs/wuffs-v0.4.c:1791
// variable: 1
inline wuffs_base__slice_u8 wuffs_base__empty_slice_u8(void)
{
	wuffs_base__slice_u8 ret; // 1792
} /* size: 0, variables: 1 */

// <04928732> ../thirdparty/wuffs/wuffs-v0.4.c:1823
// variable: 1
inline wuffs_base__table_u8 wuffs_base__make_table_u8(uint8_t* ptr, size_t width, size_t height, size_t stride)
{
	wuffs_base__table_u8 ret; // 1827
} /* size: 0, variables: 1 */

// <04928712> ../thirdparty/wuffs/wuffs-v0.4.c:1875
// variable: 1
inline wuffs_base__table_u8 wuffs_base__empty_table_u8(void)
{
	wuffs_base__table_u8 ret; // 1876
} /* size: 0, variables: 1 */

// <048D6CE3> ../thirdparty/wuffs/wuffs-v0.4.c:1878
// variables: 31
wuffs_base__status wuffs_png__decoder__decode_chrm(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2154

suspend: // 2160

exit: // 2164
	wuffs_base__status status; // 1881
	uint64_t v_u; // 1883
	const uint8_t* iop_a_src; // 1885
	const uint8_t* io0_a_src; // 1886
	const uint8_t* io1_a_src; // 1887
	const uint8_t* io2_a_src; // 1888
	uint32_t coro_susp_point; // 1896
	{
		uint64_t t_0; // 1912
		{
			uint64_t* scratch; // 1924
			uint32_t num_bits_0; // 1925
		}
	}
	{
		uint64_t t_1; // 1942
		{
			uint64_t* scratch; // 1954
			uint32_t num_bits_1; // 1955
		}
	}
	{
		uint64_t t_2; // 1972
		{
			uint64_t* scratch; // 1984
			uint32_t num_bits_2; // 1985
		}
	}
	{
		uint64_t t_3; // 2003
		{
			uint64_t* scratch; // 2015
			uint32_t num_bits_3; // 2016
		}
	}
	{
		uint64_t t_4; // 2033
		{
			uint64_t* scratch; // 2045
			uint32_t num_bits_4; // 2046
		}
	}
	{
		uint64_t t_5; // 2063
		{
			uint64_t* scratch; // 2075
			uint32_t num_bits_5; // 2076
		}
	}
	{
		uint64_t t_6; // 2094
		{
			uint64_t* scratch; // 2106
			uint32_t num_bits_6; // 2107
		}
	}
	{
		uint64_t t_7; // 2124
		{
			uint64_t* scratch; // 2136
			uint32_t num_bits_7; // 2137
		}
	}
} /* size: 0, variables: 7, goto labels: 3 */

// <049286E9> ../thirdparty/wuffs/wuffs-v0.4.c:1915
inline bool wuffs_base__slice_u8__overlaps(wuffs_base__slice_u8 s, wuffs_base__slice_u8 t)
{
} /* size: 0 */

// <049286C0> ../thirdparty/wuffs/wuffs-v0.4.c:1924
inline wuffs_base__slice_u8 wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s, uint64_t i)
{
} /* size: 0 */

// <04928697> ../thirdparty/wuffs/wuffs-v0.4.c:1935
inline wuffs_base__slice_u8 wuffs_base__slice_u8__subslice_j(wuffs_base__slice_u8 s, uint64_t j)
{
} /* size: 0 */

// <04928663> ../thirdparty/wuffs/wuffs-v0.4.c:1946
inline wuffs_base__slice_u8 wuffs_base__slice_u8__subslice_ij(wuffs_base__slice_u8 s, uint64_t i, uint64_t j)
{
} /* size: 0 */

// <04928615> ../thirdparty/wuffs/wuffs-v0.4.c:1959
inline wuffs_base__table_u8 wuffs_base__table_u8__subtable_ij(wuffs_base__table_u8 t, uint64_t ix, uint64_t iy, uint64_t jx, uint64_t jy)
{
} /* size: 0 */

// <048D6C50> ../thirdparty/wuffs/wuffs-v0.4.c:2176
// variables: 5
wuffs_base__status wuffs_png__decoder__decode_exif(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2204

exit: // 2206
	wuffs_base__status status; // 2179
	const uint8_t* iop_a_src; // 2181
	const uint8_t* io0_a_src; // 2182
	const uint8_t* io1_a_src; // 2183
	const uint8_t* io2_a_src; // 2184
} /* size: 0, variables: 5, goto labels: 2 */

// <0483C439> ../common/../thirdparty/wuffs/wuffs-v0.4.c:2313
// member functions: 6
// member variables: 2
// struct size: 16
struct wuffs_base__range_ii_u64__struct {
	uint64_t min_incl; /* 0 8 */
	uint64_t max_incl; /* 8 8 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2318 */
	bool is_empty(const wuffs_base__range_ii_u64__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2319 */
	bool equals(const wuffs_base__range_ii_u64__struct* , wuffs_base__range_ii_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2320 */
	wuffs_base__range_ii_u64__struct intersect(const wuffs_base__range_ii_u64__struct* , wuffs_base__range_ii_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2322 */
	wuffs_base__range_ii_u64__struct unite(const wuffs_base__range_ii_u64__struct* , wuffs_base__range_ii_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2324 */
	bool contains(const wuffs_base__range_ii_u64__struct* , uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2325 */
	bool contains_range(const wuffs_base__range_ii_u64__struct* , wuffs_base__range_ii_u64__struct);
};

// <049285F5> ../thirdparty/wuffs/wuffs-v0.4.c:2331
// variable: 1
inline wuffs_base__range_ii_u64 wuffs_base__empty_range_ii_u64(void)
{
	wuffs_base__range_ii_u64 ret; // 2332
} /* size: 0, variables: 1 */

// <049285BB> ../thirdparty/wuffs/wuffs-v0.4.c:2339
// variable: 1
inline wuffs_base__range_ii_u64 wuffs_base__make_range_ii_u64(uint64_t min_incl, uint64_t max_incl)
{
	wuffs_base__range_ii_u64 ret; // 2340
} /* size: 0, variables: 1 */

// <0483C561> ../common/../thirdparty/wuffs/wuffs-v0.4.c:2432
// member functions: 7
// member variables: 2
// struct size: 16
struct wuffs_base__range_ie_u64__struct {
	uint64_t min_incl; /* 0 8 */
	uint64_t max_excl; /* 8 8 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2437 */
	bool is_empty(const wuffs_base__range_ie_u64__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2438 */
	bool equals(const wuffs_base__range_ie_u64__struct* , wuffs_base__range_ie_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2439 */
	wuffs_base__range_ie_u64__struct intersect(const wuffs_base__range_ie_u64__struct* , wuffs_base__range_ie_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2441 */
	wuffs_base__range_ie_u64__struct unite(const wuffs_base__range_ie_u64__struct* , wuffs_base__range_ie_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2443 */
	bool contains(const wuffs_base__range_ie_u64__struct* , uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2444 */
	bool contains_range(const wuffs_base__range_ie_u64__struct* , wuffs_base__range_ie_u64__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2445 */
	uint64_t length(const wuffs_base__range_ie_u64__struct* );
};

// <0492859D> ../thirdparty/wuffs/wuffs-v0.4.c:2467
inline bool wuffs_base__range_ie_u64__is_empty(const wuffs_base__range_ie_u64* r)
{
} /* size: 0 */

// <04928579> ../thirdparty/wuffs/wuffs-v0.4.c:2517
inline uint64_t wuffs_base__range_ie_u64__length(const wuffs_base__range_ie_u64* r)
{
} /* size: 0 */

// <0492855C> ../thirdparty/wuffs/wuffs-v0.4.c:2524
inline void wuffs_base__range_ie_u64__struct::is_empty()
{
} /* size: 0 */

// <0492853F> ../thirdparty/wuffs/wuffs-v0.4.c:2554
inline void wuffs_base__range_ie_u64__struct::length()
{
} /* size: 0 */

// <048D6776> ../thirdparty/wuffs/wuffs-v0.4.c:2556
// variables: 9
wuffs_base__status wuffs_png__decoder__decode_gama(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2616

suspend: // 2622

exit: // 2626
	wuffs_base__status status; // 2559
	const uint8_t* iop_a_src; // 2561
	const uint8_t* io0_a_src; // 2562
	const uint8_t* io1_a_src; // 2563
	const uint8_t* io2_a_src; // 2564
	uint32_t coro_susp_point; // 2572
	{
		uint64_t t_0; // 2585
		{
			uint64_t* scratch; // 2597
			uint32_t num_bits_0; // 2598
		}
	}
} /* size: 0, variables: 6, goto labels: 3 */

// <048D6694> ../thirdparty/wuffs/wuffs-v0.4.c:2638
// variables: 9
wuffs_base__status wuffs_png__decoder__decode_iccp(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2705

suspend: // 2711

exit: // 2715
	wuffs_base__status status; // 2641
	uint8_t v_c8; // 2643
	const uint8_t* iop_a_src; // 2645
	const uint8_t* io0_a_src; // 2646
	const uint8_t* io1_a_src; // 2647
	const uint8_t* io2_a_src; // 2648
	uint32_t coro_susp_point; // 2656
	{
		uint8_t t_0; // 2672
	}
	{
		uint8_t t_1; // 2690
	}
} /* size: 0, variables: 7, goto labels: 3 */

// <0483C6AB> ../common/../thirdparty/wuffs/wuffs-v0.4.c:2697
// member functions: 8
// member variables: 4
// struct size: 16
struct wuffs_base__rect_ie_u32__struct {
	uint32_t min_incl_x; /* 0 4 */
	uint32_t min_incl_y; /* 4 4 */
	uint32_t max_excl_x; /* 8 4 */
	uint32_t max_excl_y; /* 12 4 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2704 */
	bool is_empty(const wuffs_base__rect_ie_u32__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2705 */
	bool equals(const wuffs_base__rect_ie_u32__struct* , wuffs_base__rect_ie_u32__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2706 */
	wuffs_base__rect_ie_u32__struct intersect(const wuffs_base__rect_ie_u32__struct* , wuffs_base__rect_ie_u32__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2708 */
	wuffs_base__rect_ie_u32__struct unite(const wuffs_base__rect_ie_u32__struct* , wuffs_base__rect_ie_u32__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2710 */
	bool contains(const wuffs_base__rect_ie_u32__struct* , uint32_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2711 */
	bool contains_rect(const wuffs_base__rect_ie_u32__struct* , wuffs_base__rect_ie_u32__struct);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2712 */
	uint32_t width(const wuffs_base__rect_ie_u32__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2713 */
	uint32_t height(const wuffs_base__rect_ie_u32__struct* );
};

// <0492851F> ../thirdparty/wuffs/wuffs-v0.4.c:2719
// variable: 1
inline wuffs_base__rect_ie_u32 wuffs_base__empty_rect_ie_u32(void)
{
	wuffs_base__rect_ie_u32 ret; // 2720
} /* size: 0, variables: 1 */

// <048D6589> ../thirdparty/wuffs/wuffs-v0.4.c:2727
// variables: 12
wuffs_base__status wuffs_png__decoder__decode_plte(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2807

suspend: // 2813

exit: // 2819
	wuffs_base__status status; // 2730
	uint32_t v_num_entries; // 2732
	uint32_t v_i; // 2733
	uint32_t v_argb; // 2734
	const uint8_t* iop_a_src; // 2736
	const uint8_t* io0_a_src; // 2737
	const uint8_t* io1_a_src; // 2738
	const uint8_t* io2_a_src; // 2739
	uint32_t coro_susp_point; // 2747
	{
		uint32_t t_0; // 2764
		{
			uint64_t* scratch; // 2776
			uint32_t num_bits_0; // 2777
		}
	}
} /* size: 0, variables: 9, goto labels: 3 */

// <049284CB> ../thirdparty/wuffs/wuffs-v0.4.c:2729
// variable: 1
inline wuffs_base__rect_ie_u32 wuffs_base__make_rect_ie_u32(uint32_t min_incl_x, uint32_t min_incl_y, uint32_t max_excl_x, uint32_t max_excl_y)
{
	wuffs_base__rect_ie_u32 ret; // 2733
} /* size: 0, variables: 1 */

// <049284AD> ../thirdparty/wuffs/wuffs-v0.4.c:2742
inline bool wuffs_base__rect_ie_u32__is_empty(const wuffs_base__rect_ie_u32* r)
{
} /* size: 0 */

// <04928484> ../thirdparty/wuffs/wuffs-v0.4.c:2747
inline bool wuffs_base__rect_ie_u32__equals(const wuffs_base__rect_ie_u32* r, wuffs_base__rect_ie_u32 s)
{
} /* size: 0 */

// <04928450> ../thirdparty/wuffs/wuffs-v0.4.c:2756
// variable: 1
inline wuffs_base__rect_ie_u32 wuffs_base__rect_ie_u32__intersect(const wuffs_base__rect_ie_u32* r, wuffs_base__rect_ie_u32 s)
{
	wuffs_base__rect_ie_u32 t; // 2758
} /* size: 0, variables: 1 */

// <04928427> ../thirdparty/wuffs/wuffs-v0.4.c:2792
inline bool wuffs_base__rect_ie_u32__contains_rect(const wuffs_base__rect_ie_u32* r, wuffs_base__rect_ie_u32 s)
{
} /* size: 0 */

// <04928409> ../thirdparty/wuffs/wuffs-v0.4.c:2799
inline uint32_t wuffs_base__rect_ie_u32__width(const wuffs_base__rect_ie_u32* r)
{
} /* size: 0 */

// <049283E5> ../thirdparty/wuffs/wuffs-v0.4.c:2804
inline uint32_t wuffs_base__rect_ie_u32__height(const wuffs_base__rect_ie_u32* r)
{
} /* size: 0 */

// <048D64CB> ../thirdparty/wuffs/wuffs-v0.4.c:2831
// variables: 7
wuffs_base__status wuffs_png__decoder__decode_srgb(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 2871

suspend: // 2877

exit: // 2881
	wuffs_base__status status; // 2834
	const uint8_t* iop_a_src; // 2836
	const uint8_t* io0_a_src; // 2837
	const uint8_t* io1_a_src; // 2838
	const uint8_t* io2_a_src; // 2839
	uint32_t coro_susp_point; // 2847
	{
		uint64_t t_0; // 2864
	}
} /* size: 0, variables: 6, goto labels: 3 */

// <0483C83C> ../common/../thirdparty/wuffs/wuffs-v0.4.c:2860
// member functions: 9
// member variables: 5
// struct size: 32
struct wuffs_base__more_information__struct {
	uint32_t flavor; /* 0 4 */
	uint32_t w; /* 4 4 */
	uint64_t x; /* 8 8 */
	uint64_t y; /* 16 8 */
	uint64_t z; /* 24 8 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2868 */
	void set(wuffs_base__more_information__struct* , uint32_t, uint32_t, uint64_t, uint64_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2873 */
	uint32_t io_redirect__fourcc(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2874 */
	wuffs_base__range_ie_u64 io_redirect__range(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2875 */
	uint64_t io_seek__position(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2876 */
	uint32_t metadata__fourcc(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2877 */
	wuffs_base__range_ie_u64 metadata_raw_passthrough__range(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2878 */
	int32_t metadata_parsed__chrm(const wuffs_base__more_information__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2879 */
	uint32_t metadata_parsed__gama(const wuffs_base__more_information__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:2880 */
	uint32_t metadata_parsed__srgb(const wuffs_base__more_information__struct* );
};

// <049283C5> ../thirdparty/wuffs/wuffs-v0.4.c:2892
// variable: 1
inline wuffs_base__more_information wuffs_base__empty_more_information(void)
{
	wuffs_base__more_information ret; // 2893
} /* size: 0, variables: 1 */

// <048D6376> ../thirdparty/wuffs/wuffs-v0.4.c:2893
// variables: 16
wuffs_base__status wuffs_png__decoder__decode_trns(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

ok: // 3055

suspend: // 3061

exit: // 3067
	wuffs_base__status status; // 2896
	uint32_t v_i; // 2898
	uint32_t v_n; // 2899
	uint64_t v_u; // 2900
	const uint8_t* iop_a_src; // 2902
	const uint8_t* io0_a_src; // 2903
	const uint8_t* io1_a_src; // 2904
	const uint8_t* io2_a_src; // 2905
	uint32_t coro_susp_point; // 2913
	{
		uint64_t t_0; // 2938
		{
			uint64_t* scratch; // 2950
			uint32_t num_bits_0; // 2951
		}
	}
	{
		uint64_t t_1; // 2993
		{
			uint64_t* scratch; // 3005
			uint32_t num_bits_1; // 3006
		}
	}
	{
		uint8_t t_2; // 3044
	}
} /* size: 0, variables: 9, goto labels: 3 */

// <04928371> ../thirdparty/wuffs/wuffs-v0.4.c:2903
inline void wuffs_base__more_information__set(wuffs_base__more_information* m, uint32_t flavor, uint32_t w, uint64_t x, uint64_t y, uint64_t z)
{
} /* size: 0 */

// <04928353> ../thirdparty/wuffs/wuffs-v0.4.c:2920
inline uint32_t wuffs_base__more_information__io_redirect__fourcc(const wuffs_base__more_information* m)
{
} /* size: 0 */

// <04928328> ../thirdparty/wuffs/wuffs-v0.4.c:2926
// variable: 1
inline wuffs_base__range_ie_u64 wuffs_base__more_information__io_redirect__range(const wuffs_base__more_information* m)
{
	wuffs_base__range_ie_u64 ret; // 2928
} /* size: 0, variables: 1 */

// <049282FD> ../thirdparty/wuffs/wuffs-v0.4.c:2947
// variable: 1
inline wuffs_base__range_ie_u64 wuffs_base__more_information__metadata_raw_passthrough__range(const wuffs_base__more_information* m)
{
	wuffs_base__range_ie_u64 ret; // 2949
} /* size: 0, variables: 1 */

// <049282C3> ../thirdparty/wuffs/wuffs-v0.4.c:3061
inline void wuffs_base__more_information__struct::io_redirect__range()
{
} /* size: 0 */

// <049282A6> ../thirdparty/wuffs/wuffs-v0.4.c:3076
inline void wuffs_base__more_information__struct::metadata_raw_passthrough__range()
{
} /* size: 0 */

// <048D62D5> ../thirdparty/wuffs/wuffs-v0.4.c:3079
// variables: 4
wuffs_base__status wuffs_png__decoder__decode_frame_config(wuffs_png__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 3129

ok: // 3123

exit: // 3134
	wuffs_base__status status; // 3102
	wuffs_base__status v_status; // 3104
	uint32_t coro_susp_point; // 3106
	{
		wuffs_base__status t_0; // 3112
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <0483CA53> ../common/../thirdparty/wuffs/wuffs-v0.4.c:3114
// member functions: 11
// member variables: 2
// struct size: 48
struct wuffs_base__io_buffer__struct {
	wuffs_base__slice_u8 data; /* 0 16 */
	wuffs_base__io_buffer_meta meta; /* 16 32 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3119 */
	bool is_valid(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3120 */
	void compact(wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3121 */
	void compact_retaining(wuffs_base__io_buffer__struct* , uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3122 */
	size_t reader_length(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3123 */
	uint8_t* reader_pointer(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3124 */
	uint64_t reader_position(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3125 */
	wuffs_base__slice_u8 reader_slice(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3126 */
	size_t writer_length(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3127 */
	uint8_t* writer_pointer(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3128 */
	uint64_t writer_position(const wuffs_base__io_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:3129 */
	wuffs_base__slice_u8 writer_slice(const wuffs_base__io_buffer__struct* );
};

// <048D5BAB> ../thirdparty/wuffs/wuffs-v0.4.c:3145
// variables: 19
// function calls: 12
wuffs_base__status wuffs_png__decoder__do_decode_frame_config(wuffs_png__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 3394

suspend: // 3400

exit: // 3404
	wuffs_base__status status; // 3149
	uint32_t v_checksum_have; // 3151
	const uint8_t* iop_a_src; // 3153
	const uint8_t* io0_a_src; // 3154
	const uint8_t* io1_a_src; // 3155
	const uint8_t* io2_a_src; // 3156
	uint32_t coro_susp_point; // 3164
	{
		uint32_t t_0; // 3223
		{
			uint64_t* scratch; // 3235
			uint32_t num_bits_0; // 3236
		}
	}
	{
		uint32_t t_1; // 3252
		{
			uint64_t* scratch; // 3264
			uint32_t num_bits_1; // 3265
		}
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 3254
	}
	{
		uint32_t t_2; // 3286
		{
			uint64_t* scratch; // 3298
			uint32_t num_bits_2; // 3299
		}
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 3288
	}
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 3324

suspend: // 3548

exit: // 3552

ok: // 3542
	wuffs_base__u32__sat_add(uint32_t x,
				uint32_t y);  // 17232
	wuffs_private_impl__u32__sat_add_indirect(uint32_t* x,
							uint32_t y);  // 3539
	{
		uint32_t t_0; // 3476
		{
			uint64_t* scratch; // 3488
			uint32_t num_bits_0; // 3489
		}
	}
	wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p); // 3449
	wuffs_png__decoder__skip_frame(wuffs_png__decoder* self,
					wuffs_base__io_buffer* a_src);  // 3194
	wuffs_base__frame_config__set(wuffs_base__frame_config* c,
					wuffs_base__rect_ie_u32 bounds,
					wuffs_base__flicks duration,
					uint64_t index,
					uint64_t io_position,
					wuffs_base__animation_disposal disposal,
					bool opaque_within_bounds,
					bool overwrite_instead_of_blend,
					wuffs_base__color_u32_argb_premul background_color);  // 3376
	wuffs_base__u32__sat_add(uint32_t x,
				uint32_t y);  // 17232
	wuffs_private_impl__u32__sat_add_indirect(uint32_t* x,
							uint32_t y);  // 3391
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 3185
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 3401
} /* size: 0, variables: 7, goto labels: 6, inline expansions: 10 (0 bytes) */

// <0492825F> ../thirdparty/wuffs/wuffs-v0.4.c:3157
// variable: 1
inline wuffs_base__io_buffer wuffs_base__ptr_u8__reader(uint8_t* ptr, size_t len, bool closed)
{
	wuffs_base__io_buffer ret; // 3158
} /* size: 0, variables: 1 */

// <04928225> ../thirdparty/wuffs/wuffs-v0.4.c:3169
// variable: 1
inline wuffs_base__io_buffer wuffs_base__ptr_u8__writer(uint8_t* ptr, size_t len)
{
	wuffs_base__io_buffer ret; // 3170
} /* size: 0, variables: 1 */

// <04928205> ../thirdparty/wuffs/wuffs-v0.4.c:3205
// variable: 1
inline wuffs_base__io_buffer wuffs_base__empty_io_buffer(void)
{
	wuffs_base__io_buffer ret; // 3206
} /* size: 0, variables: 1 */

// <049281E5> ../thirdparty/wuffs/wuffs-v0.4.c:3217
// variable: 1
inline wuffs_base__io_buffer_meta wuffs_base__empty_io_buffer_meta(void)
{
	wuffs_base__io_buffer_meta ret; // 3218
} /* size: 0, variables: 1 */

// <049281BB> ../thirdparty/wuffs/wuffs-v0.4.c:3241
// variable: 1
inline void wuffs_base__io_buffer__compact(wuffs_base__io_buffer* buf)
{
	size_t new_wi; // 3246
} /* size: 0, variables: 1 */

// <0492819B> ../thirdparty/wuffs/wuffs-v0.4.c:3297
inline size_t wuffs_base__io_buffer__reader_length(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <0492817B> ../thirdparty/wuffs/wuffs-v0.4.c:3302
inline uint8_t* wuffs_base__io_buffer__reader_pointer(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <0492815B> ../thirdparty/wuffs/wuffs-v0.4.c:3307
inline uint64_t wuffs_base__io_buffer__reader_position(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <0492813B> ../thirdparty/wuffs/wuffs-v0.4.c:3312
inline wuffs_base__slice_u8 wuffs_base__io_buffer__reader_slice(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <0492811B> ../thirdparty/wuffs/wuffs-v0.4.c:3320
inline size_t wuffs_base__io_buffer__writer_length(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <049280F5> ../thirdparty/wuffs/wuffs-v0.4.c:3325
inline uint8_t* wuffs_base__io_buffer__writer_pointer(const wuffs_base__io_buffer* buf)
{
} /* size: 0 */

// <049280D8> ../thirdparty/wuffs/wuffs-v0.4.c:3350
inline void wuffs_base__io_buffer__struct::compact()
{
} /* size: 0 */

// <049280BB> ../thirdparty/wuffs/wuffs-v0.4.c:3360
inline void wuffs_base__io_buffer__struct::reader_length()
{
} /* size: 0 */

// <0492809E> ../thirdparty/wuffs/wuffs-v0.4.c:3365
inline void wuffs_base__io_buffer__struct::reader_pointer()
{
} /* size: 0 */

// <04928081> ../thirdparty/wuffs/wuffs-v0.4.c:3370
inline void wuffs_base__io_buffer__struct::reader_position()
{
} /* size: 0 */

// <04928064> ../thirdparty/wuffs/wuffs-v0.4.c:3375
inline void wuffs_base__io_buffer__struct::reader_slice()
{
} /* size: 0 */

// <04928047> ../thirdparty/wuffs/wuffs-v0.4.c:3380
inline void wuffs_base__io_buffer__struct::writer_length()
{
} /* size: 0 */

// <0492802A> ../thirdparty/wuffs/wuffs-v0.4.c:3385
inline void wuffs_base__io_buffer__struct::writer_pointer()
{
} /* size: 0 */

// <04870E2C> ../thirdparty/wuffs/wuffs-v0.4.c:3406
// member functions: 9
// member variable: 1
// struct size: 8
struct wuffs_base__token__struct {
	uint64_t repr; /* 0 8 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3410 */
	int64_t value(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3411 */
	int64_t value_extension(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3412 */
	int64_t value_major(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3413 */
	int64_t value_base_category(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3414 */
	uint64_t value_minor(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3415 */
	uint64_t value_base_detail(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3416 */
	int64_t value_base_detail__sign_extended(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3417 */
	bool continued(const wuffs_base__token__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3418 */
	uint64_t length(const wuffs_base__token__struct* );
};

// <048D5ABE> ../thirdparty/wuffs/wuffs-v0.4.c:3416
// variables: 10
wuffs_base__status wuffs_png__decoder__skip_frame(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src)
{

suspend: // 3548

exit: // 3552

ok: // 3542
	wuffs_base__status status; // 3419
	uint32_t v_seq_num; // 3421
	const uint8_t* iop_a_src; // 3423
	const uint8_t* io0_a_src; // 3424
	const uint8_t* io1_a_src; // 3425
	const uint8_t* io2_a_src; // 3426
	uint32_t coro_susp_point; // 3434
	{
		uint32_t t_0; // 3476
		{
			uint64_t* scratch; // 3488
			uint32_t num_bits_0; // 3489
		}
	}
} /* size: 0, variables: 7, goto labels: 3 */

// <04927FFD> ../thirdparty/wuffs/wuffs-v0.4.c:3424
// variable: 1
inline wuffs_base__token wuffs_base__make_token(uint64_t repr)
{
	wuffs_base__token ret; // 3425
} /* size: 0, variables: 1 */

// <048D4775> ../thirdparty/wuffs/wuffs-v0.4.c:3564
// variables: 33
// function calls: 54
wuffs_base__status wuffs_png__decoder__decode_frame(wuffs_png__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

suspend: // 3622

ok: // 3616

exit: // 3627
	wuffs_base__status status; // 3590
	wuffs_base__status v_status; // 3592
	uint32_t coro_susp_point; // 3594
	{
		wuffs_base__status t_0; // 3600

suspend: // 3865

ok: // 3859

exit: // 3869
		wuffs_base__peek_u64le__no_bounds_check(const uint8_t* p); // 3693
		{
			uint32_t t_0; // 3719
			{
				uint64_t* scratch; // 3731
				uint32_t num_bits_0; // 3732
			}
		}
		memset(void* __dest,
			int __ch,
			size_t __len);  // 38818
		wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
							size_t sizeof_star_self,
							uint64_t wuffs_version,
							uint32_t options);  // 38784
		wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
							size_t sizeof_star_self,
							uint64_t wuffs_version,
							uint32_t options);  // 3701
		wuffs_base__make_slice_u8(uint8_t* ptr,
						size_t len);  // 3703
		wuffs_png__decoder__calculate_bytes_per_row(const wuffs_png__decoder* self,
								uint32_t a_width);  // 3804
		{
			wuffs_base__status t_1; // 3811

ok: // 4201

suspend: // 4207

exit: // 4211
			wuffs_base__empty_io_buffer(void); // 3887
			{
				uint32_t t_3; // 4074
				{
					uint64_t* scratch; // 4086
					uint32_t num_bits_3; // 4087
				}
			}
			{
				uint32_t t_4; // 4103
				wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 4105
				{
					uint64_t* scratch; // 4115
					uint32_t num_bits_4; // 4116
				}
			}
			{
				uint32_t t_5; // 4148
				{
					uint64_t* scratch; // 4160
					uint32_t num_bits_5; // 4161
				}
			}
			memset(void* __dest,
				int __ch,
				size_t __len);  // 38818
			wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
								size_t sizeof_star_self,
								uint64_t wuffs_version,
								uint32_t options);  // 38784
			wuffs_crc32__ieee_hasher__initialize(wuffs_crc32__ieee_hasher* self,
								size_t sizeof_star_self,
								uint64_t wuffs_version,
								uint32_t options);  // 4136
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 4138
			{
				uint32_t t_2; // 4038
				{
					uint64_t* scratch; // 4050
					uint32_t num_bits_2; // 4051
				}
			}
			wuffs_base__empty_slice_u8(void); // 4066
			wuffs_base__status__is_error(const wuffs_base__status* z); // 4028
			wuffs_base__status__is_suspension(const wuffs_base__status* z); // 4030
			{
				uint32_t t_1; // 3985
				{
					uint64_t* scratch; // 3997
					uint32_t num_bits_1; // 3998
				}
			}
			wuffs_base__empty_slice_u8(void); // 4013
			{
				wuffs_base__io_buffer* o_0_v_w; // 3922
				uint8_t* o_0_iop_v_w; // 3923
				uint8_t* o_0_io0_v_w; // 3924
				uint8_t* o_0_io1_v_w; // 3925
				uint8_t* o_0_io2_v_w; // 3926
				wuffs_base__slice_u8__subslice_ij(wuffs_base__slice_u8 s,
									uint64_t i,
									uint64_t j);  // 3927
				wuffs_private_impl__io_writer__set(wuffs_base__io_buffer* b,
									uint8_t** ptr_iop_w,
									uint8_t** ptr_io0_w,
									uint8_t** ptr_io1_w,
									uint8_t** ptr_io2_w,
									wuffs_base__slice_u8 data,
									uint64_t history_position);  // 3927
				{
					const bool  o_1_closed_a_src; // 3938
					const uint8_t* o_1_io2_a_src; // 3939
					wuffs_private_impl__io_reader__limit(const uint8_t ** ptr_io2_r,
										const uint8_t* iop_r,
										uint64_t limit);  // 3940
					{
						size_t n; // 3943
					}
					{
						wuffs_base__status t_0; // 3954
						wuffs_base__empty_slice_u8(void); // 3954
					}
					wuffs_base__make_slice_u8(uint8_t* ptr,
									size_t len);  // 17459
					wuffs_private_impl__io__since(uint64_t mark,
									uint64_t index,
									const uint8_t* ptr);  // 3962
					wuffs_private_impl__io__count_since(uint64_t mark,
										uint64_t index);  // 3964
					wuffs_base__u32__sat_sub(uint32_t x,
								uint32_t y);  // 17237
					wuffs_private_impl__u32__sat_sub_indirect(uint32_t* x,
											uint32_t y);  // 3964
					wuffs_base__u64__sat_add(uint64_t x,
								uint64_t y);  // 17242
					wuffs_private_impl__u64__sat_add_indirect(uint64_t* x,
											uint64_t y);  // 3965
				}
			}
			wuffs_png__decoder__decode_pass(wuffs_png__decoder* self,
							wuffs_base__io_buffer* a_src,
							wuffs_base__slice_u8 a_workbuf);  // 3811
		}
		wuffs_base__status__is_error(const wuffs_base__status* z); // 3819
		wuffs_png__decoder__filter_and_swizzle(wuffs_png__decoder* self,
							wuffs_base__pixel_buffer* a_dst,
							wuffs_base__slice_u8 a_workbuf);  // 3821
		wuffs_base__slice_u8__subslice_j(wuffs_base__slice_u8 s,
						uint64_t j);  // 3821
		wuffs_png__decoder__filter_and_swizzle(wuffs_png__decoder* self,
							wuffs_base__pixel_buffer* a_dst,
							wuffs_base__slice_u8 a_workbuf);  // 3831
		wuffs_base__status__is_error(const wuffs_base__status* z); // 3834
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5497
		{
			wuffs_base__table_u8* tab; // 5498
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5504
		}
		wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb,
								wuffs_base__slice_u8 fallback);  // 3778
		wuffs_base__make_slice_u8(uint8_t* ptr,
						size_t len);  // 3778
		wuffs_base__make_pixel_format(uint32_t repr); // 3778
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 3778
		wuffs_base__status__is_error(const wuffs_base__status* z); // 3786
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 3788
		wuffs_zlib__decoder__initialize(wuffs_zlib__decoder* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 3771
		wuffs_base__make_status(const char* repr); // 63977
		wuffs_zlib__decoder__set_quirk(wuffs_zlib__decoder* self,
						uint32_t a_key,
						uint64_t a_value);  // 63961
		wuffs_zlib__decoder__set_quirk(wuffs_zlib__decoder* self,
						uint32_t a_key,
						uint64_t a_value);  // 3774
		wuffs_base__u32__sat_add(uint32_t x,
					uint32_t y);  // 17232
		wuffs_private_impl__u32__sat_add_indirect(uint32_t* x,
								uint32_t y);  // 3856
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 3866
		wuffs_png__decoder__do_decode_frame(wuffs_png__decoder* self,
							wuffs_base__pixel_buffer* a_dst,
							wuffs_base__io_buffer* a_src,
							wuffs_base__pixel_blend a_blend,
							wuffs_base__slice_u8 a_workbuf,
							wuffs_base__decode_frame_options* a_opts);  // 3600
	}
	wuffs_base__make_status(const char* repr); // 3575
	wuffs_base__status__is_error(const wuffs_base__status* z); // 3628
	wuffs_base__make_status(const char* repr); // 3582
	wuffs_base__make_status(const char* repr); // 3587
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 3624
} /* size: 0, variables: 3, goto labels: 3, inline expansions: 5 (0 bytes) */

// <04927FDF> ../thirdparty/wuffs/wuffs-v0.4.c:3580
inline int64_t wuffs_base__token__value_extension(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927FC1> ../thirdparty/wuffs/wuffs-v0.4.c:3587
inline int64_t wuffs_base__token__value_major(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927FA3> ../thirdparty/wuffs/wuffs-v0.4.c:3594
inline int64_t wuffs_base__token__value_base_category(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927F85> ../thirdparty/wuffs/wuffs-v0.4.c:3599
inline uint64_t wuffs_base__token__value_minor(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927F67> ../thirdparty/wuffs/wuffs-v0.4.c:3604
inline uint64_t wuffs_base__token__value_base_detail(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927F3E> ../thirdparty/wuffs/wuffs-v0.4.c:3609
// variable: 1
inline int64_t wuffs_base__token__value_base_detail__sign_extended(const wuffs_base__token* t)
{
	uint64_t u; // 3613
} /* size: 0, variables: 1 */

// <04927F20> ../thirdparty/wuffs/wuffs-v0.4.c:3618
inline bool wuffs_base__token__continued(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927EFC> ../thirdparty/wuffs/wuffs-v0.4.c:3623
inline uint64_t wuffs_base__token__length(const wuffs_base__token* t)
{
} /* size: 0 */

// <04927EDF> ../thirdparty/wuffs/wuffs-v0.4.c:3635
inline void wuffs_base__token__struct::value_extension()
{
} /* size: 0 */

// <048D460A> ../thirdparty/wuffs/wuffs-v0.4.c:3638
// variables: 14
wuffs_base__status wuffs_png__decoder__do_decode_frame(wuffs_png__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

suspend: // 3865

ok: // 3859

exit: // 3869
	wuffs_base__status status; // 3645
	uint32_t v_seq_num; // 3647
	wuffs_base__status v_status; // 3648
	uint32_t v_pass_width; // 3649
	uint32_t v_pass_height; // 3650
	const uint8_t* iop_a_src; // 3652
	const uint8_t* io0_a_src; // 3653
	const uint8_t* io1_a_src; // 3654
	const uint8_t* io2_a_src; // 3655
	uint32_t coro_susp_point; // 3663
	{
		uint32_t t_0; // 3719
		{
			uint64_t* scratch; // 3731
			uint32_t num_bits_0; // 3732
		}
	}
	{
		wuffs_base__status t_1; // 3811
	}
} /* size: 0, variables: 10, goto labels: 3 */

// <04927EC2> ../thirdparty/wuffs/wuffs-v0.4.c:3640
inline void wuffs_base__token__struct::value_major()
{
} /* size: 0 */

// <04927EA5> ../thirdparty/wuffs/wuffs-v0.4.c:3645
inline void wuffs_base__token__struct::value_base_category()
{
} /* size: 0 */

// <04927E88> ../thirdparty/wuffs/wuffs-v0.4.c:3650
inline void wuffs_base__token__struct::value_minor()
{
} /* size: 0 */

// <04927E6B> ../thirdparty/wuffs/wuffs-v0.4.c:3655
inline void wuffs_base__token__struct::value_base_detail()
{
} /* size: 0 */

// <04927E4E> ../thirdparty/wuffs/wuffs-v0.4.c:3660
inline void wuffs_base__token__struct::value_base_detail__sign_extended()
{
} /* size: 0 */

// <04927E31> ../thirdparty/wuffs/wuffs-v0.4.c:3665
inline void wuffs_base__token__struct::continued()
{
} /* size: 0 */

// <04927E14> ../thirdparty/wuffs/wuffs-v0.4.c:3670
inline void wuffs_base__token__struct::length()
{
} /* size: 0 */

// <04870F9B> ../thirdparty/wuffs/wuffs-v0.4.c:3694
// member variables: 2
// struct size: 16
typedef struct {
	wuffs_base__token * ptr; /* 0 8 */
	size_t len; /* 8 8 */
} wuffs_base__slice_token;

// <04927DDA> ../thirdparty/wuffs/wuffs-v0.4.c:3697
// variable: 1
inline wuffs_base__slice_token wuffs_base__make_slice_token(wuffs_base__token* ptr, size_t len)
{
	wuffs_base__slice_token ret; // 3698
} /* size: 0, variables: 1 */

// <04870FDE> ../thirdparty/wuffs/wuffs-v0.4.c:3716
// member variables: 4
// struct size: 32
struct wuffs_base__token_buffer_meta__struct {
	size_t wi; /* 0 8 */
	size_t ri; /* 8 8 */
	uint64_t pos; /* 16 8 */
	bool closed; /* 24 1 */
};

// <04871038> ../thirdparty/wuffs/wuffs-v0.4.c:3727
// member functions: 11
// member variables: 2
// struct size: 48
struct wuffs_base__token_buffer__struct {
	wuffs_base__slice_token data; /* 0 16 */
	wuffs_base__token_buffer_meta meta; /* 16 32 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3732 */
	bool is_valid(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3733 */
	void compact(wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3734 */
	void compact_retaining(wuffs_base__token_buffer__struct* , uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3735 */
	uint64_t reader_length(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3736 */
	wuffs_base__token* reader_pointer(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3737 */
	wuffs_base__slice_token reader_slice(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3738 */
	uint64_t reader_token_position(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3739 */
	uint64_t writer_length(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3740 */
	uint64_t writer_token_position(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3741 */
	wuffs_base__token* writer_pointer(const wuffs_base__token_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:3742 */
	wuffs_base__slice_token writer_slice(const wuffs_base__token_buffer__struct* );
};

// <04927DAF> ../thirdparty/wuffs/wuffs-v0.4.c:3782
// variable: 1
inline wuffs_base__token_buffer wuffs_base__slice_token__writer(wuffs_base__slice_token s)
{
	wuffs_base__token_buffer ret; // 3783
} /* size: 0, variables: 1 */

// <04927D85> ../thirdparty/wuffs/wuffs-v0.4.c:3830
// variable: 1
inline void wuffs_base__token_buffer__compact(wuffs_base__token_buffer* buf)
{
	size_t new_wi; // 3835
} /* size: 0, variables: 1 */

// <048D4300> ../thirdparty/wuffs/wuffs-v0.4.c:3881
// variables: 42
wuffs_base__status wuffs_png__decoder__decode_pass(wuffs_png__decoder* self, wuffs_base__io_buffer* a_src, wuffs_base__slice_u8 a_workbuf)
{

ok: // 4201

suspend: // 4207

exit: // 4211
	wuffs_base__status status; // 3885
	wuffs_base__io_buffer u_w; // 3887
	wuffs_base__io_buffer* v_w; // 3888
	uint8_t* iop_v_w; // 3889
	uint8_t* io0_v_w; // 3890
	uint8_t* io1_v_w; // 3891
	uint8_t* io2_v_w; // 3892
	uint64_t v_w_mark; // 3893
	uint64_t v_r_mark; // 3894
	wuffs_base__status v_zlib_status; // 3895
	uint32_t v_checksum_have; // 3896
	uint32_t v_checksum_want; // 3897
	uint32_t v_seq_num; // 3898
	const uint8_t* iop_a_src; // 3900
	const uint8_t* io0_a_src; // 3901
	const uint8_t* io1_a_src; // 3902
	const uint8_t* io2_a_src; // 3903
	uint32_t coro_susp_point; // 3911
	{
		wuffs_base__io_buffer* o_0_v_w; // 3922
		uint8_t* o_0_iop_v_w; // 3923
		uint8_t* o_0_io0_v_w; // 3924
		uint8_t* o_0_io1_v_w; // 3925
		uint8_t* o_0_io2_v_w; // 3926
		{
			const bool  o_1_closed_a_src; // 3938
			const uint8_t* o_1_io2_a_src; // 3939
			{
				size_t n; // 3943
			}
			{
				wuffs_base__status t_0; // 3954
			}
		}
	}
	{
		uint32_t t_1; // 3985
		{
			uint64_t* scratch; // 3997
			uint32_t num_bits_1; // 3998
		}
	}
	{
		uint32_t t_2; // 4038
		{
			uint64_t* scratch; // 4050
			uint32_t num_bits_2; // 4051
		}
	}
	{
		uint32_t t_3; // 4074
		{
			uint64_t* scratch; // 4086
			uint32_t num_bits_3; // 4087
		}
	}
	{
		uint32_t t_4; // 4103
		{
			uint64_t* scratch; // 4115
			uint32_t num_bits_4; // 4116
		}
	}
	{
		uint32_t t_5; // 4148
		{
			uint64_t* scratch; // 4160
			uint32_t num_bits_5; // 4161
		}
	}
} /* size: 0, variables: 18, goto labels: 3 */

// <04927D68> ../thirdparty/wuffs/wuffs-v0.4.c:3941
inline void wuffs_base__token_buffer__struct::compact()
{
} /* size: 0 */

// <04927D1E> ../thirdparty/wuffs/wuffs-v0.4.c:4065
// variables: 4
inline bool wuffs_base__color_u32_argb_premul__is_valid(wuffs_base__color_u32_argb_premul c)
{
	uint32_t a; // 4067
	uint32_t r; // 4068
	uint32_t g; // 4069
	uint32_t b; // 4070
} /* size: 0, variables: 4 */

// <04927CDC> ../thirdparty/wuffs/wuffs-v0.4.c:4075
// variables: 3
inline uint16_t wuffs_base__color_u32_argb_premul__as__color_u16_rgb_565(wuffs_base__color_u32_argb_premul c)
{
	uint32_t r5; // 4077
	uint32_t g6; // 4078
	uint32_t b5; // 4079
} /* size: 0, variables: 3 */

// <04927C77> ../thirdparty/wuffs/wuffs-v0.4.c:4084
// variables: 6
inline wuffs_base__color_u32_argb_premul wuffs_base__color_u16_rgb_565__as__color_u32_argb_premul(uint16_t rgb_565)
{
	uint32_t b5; // 4085
	uint32_t b; // 4086
	uint32_t g6; // 4087
	uint32_t g; // 4088
	uint32_t r5; // 4089
	uint32_t r; // 4090
} /* size: 0, variables: 6 */

// <04927C28> ../thirdparty/wuffs/wuffs-v0.4.c:4095
// variables: 4
inline uint8_t wuffs_base__color_u32_argb_premul__as__color_u8_gray(wuffs_base__color_u32_argb_premul c)
{
	uint32_t cr; // 4098
	uint32_t cg; // 4099
	uint32_t cb; // 4100
	uint32_t weighted_average; // 4108
} /* size: 0, variables: 4 */

// <04927BC1> ../thirdparty/wuffs/wuffs-v0.4.c:4113
// variables: 6
inline uint16_t wuffs_base__color_u32_argb_premul__as__color_u16_alpha_gray_nonpremul(wuffs_base__color_u32_argb_premul c)
{
	uint32_t a; // 4115
	uint32_t a16; // 4119
	uint32_t cr; // 4121
	uint32_t cg; // 4123
	uint32_t cb; // 4125
	uint32_t weighted_average; // 4128
} /* size: 0, variables: 6 */

// <04927B72> ../thirdparty/wuffs/wuffs-v0.4.c:4133
// variables: 4
inline uint16_t wuffs_base__color_u32_argb_premul__as__color_u16_gray(wuffs_base__color_u32_argb_premul c)
{
	uint32_t cr; // 4136
	uint32_t cg; // 4137
	uint32_t cb; // 4138
	uint32_t weighted_average; // 4144
} /* size: 0, variables: 4 */

// <04927B19> ../thirdparty/wuffs/wuffs-v0.4.c:4151
// variables: 5
inline wuffs_base__color_u32_argb_premul wuffs_base__color_u32_argb_nonpremul__as__color_u32_argb_premul(uint32_t argb_nonpremul)
{
	uint32_t a; // 4162
	uint32_t a16; // 4163
	uint32_t r; // 4165
	uint32_t g; // 4167
	uint32_t b; // 4169
} /* size: 0, variables: 5 */

// <04927AC2> ../thirdparty/wuffs/wuffs-v0.4.c:4178
// variables: 5
inline uint32_t wuffs_base__color_u32_argb_premul__as__color_u32_argb_nonpremul(wuffs_base__color_u32_argb_premul c)
{
	uint32_t a; // 4180
	uint32_t a16; // 4186
	uint32_t r; // 4188
	uint32_t g; // 4190
	uint32_t b; // 4192
} /* size: 0, variables: 5 */

// <04927A6E> ../thirdparty/wuffs/wuffs-v0.4.c:4201
// variables: 4
inline wuffs_base__color_u32_argb_premul wuffs_base__color_u64_argb_nonpremul__as__color_u32_argb_premul(uint64_t argb_nonpremul)
{
	uint32_t a16; // 4203
	uint32_t r16; // 4205
	uint32_t g16; // 4207
	uint32_t b16; // 4209
} /* size: 0, variables: 4 */

// <049279C7> ../thirdparty/wuffs/wuffs-v0.4.c:4219
// variables: 11
inline uint64_t wuffs_base__color_u32_argb_premul__as__color_u64_argb_nonpremul(wuffs_base__color_u32_argb_premul c)
{
	uint32_t a; // 4221
	uint64_t a16; // 4230
	uint64_t r; // 4232
	uint64_t r16; // 4233
	uint64_t g; // 4234
	uint64_t g16; // 4235
	uint64_t b; // 4236
	uint64_t b16; // 4237
	{
		uint64_t r16; // 4223
		uint64_t g16; // 4224
		uint64_t b16; // 4225
	}
} /* size: 0, variables: 8 */

// <048D42DB> ../thirdparty/wuffs/wuffs-v0.4.c:4223
wuffs_base__rect_ie_u32 wuffs_png__decoder__frame_dirty_rect(const wuffs_png__decoder* self)
{
} /* size: 0 */

// <04927966> ../thirdparty/wuffs/wuffs-v0.4.c:4260
// variables: 5
inline uint8_t wuffs_base__color_u64_argb_nonpremul__as__color_u8_gray(uint64_t argb_nonpremul)
{
	uint32_t a16; // 4262
	uint32_t r16; // 4264
	uint32_t g16; // 4266
	uint32_t b16; // 4268
	uint32_t weighted_average; // 4277
} /* size: 0, variables: 5 */

// <048D4263> ../thirdparty/wuffs/wuffs-v0.4.c:4261
uint64_t wuffs_png__decoder__num_decoded_frame_configs(const wuffs_png__decoder* self)
{
} /* size: 0 */

// <048D4227> ../thirdparty/wuffs/wuffs-v0.4.c:4278
uint64_t wuffs_png__decoder__num_decoded_frames(const wuffs_png__decoder* self)
{
} /* size: 0 */

// <04927914> ../thirdparty/wuffs/wuffs-v0.4.c:4283
// variables: 4
inline uint64_t wuffs_base__color_u32__as__color_u64(uint32_t c)
{
	uint64_t a16; // 4284
	uint64_t r16; // 4285
	uint64_t g16; // 4286
	uint64_t b16; // 4287
} /* size: 0, variables: 4 */

// <049278CA> ../thirdparty/wuffs/wuffs-v0.4.c:4292
// variables: 4
inline uint32_t wuffs_base__color_u64__as__color_u32(uint64_t c)
{
	uint32_t a; // 4293
	uint32_t r; // 4294
	uint32_t g; // 4295
	uint32_t b; // 4296
} /* size: 0, variables: 4 */

// <048D41E4> ../thirdparty/wuffs/wuffs-v0.4.c:4295
wuffs_base__status wuffs_png__decoder__restart_frame(wuffs_png__decoder* self, uint64_t a_index, uint64_t a_io_position)
{
} /* size: 0 */

// <04927845> ../thirdparty/wuffs/wuffs-v0.4.c:4303
// variables: 6
inline wuffs_base__color_u32_argb_premul wuffs_base__color_ycc__as__color_u32(uint8_t yy, uint8_t cb, uint8_t cr)
{
	uint32_t yy32; // 4306
	uint32_t cb32; // 4307
	uint32_t cr32; // 4308
	uint32_t rr32; // 4334
	uint32_t gg32; // 4335
	uint32_t bb32; // 4336
} /* size: 0, variables: 6 */

// <048D41A1> ../thirdparty/wuffs/wuffs-v0.4.c:4328
wuffs_base__empty_wuffs_png__decoder__set_report_metadata(wuffs_png__decoder* self, uint32_t a_fourcc, bool a_report)
{
} /* size: 0 */

// <049277C0> ../thirdparty/wuffs/wuffs-v0.4.c:4356
// variables: 6
inline uint32_t wuffs_base__color_ycc__as__color_u32_abgr(uint8_t yy, uint8_t cb, uint8_t cr)
{
	uint32_t yy32; // 4357
	uint32_t cb32; // 4358
	uint32_t cr32; // 4359
	uint32_t rr32; // 4360
	uint32_t gg32; // 4361
	uint32_t bb32; // 4362
} /* size: 0, variables: 6 */

// <048D40F1> ../thirdparty/wuffs/wuffs-v0.4.c:4359
// variables: 4
wuffs_base__status wuffs_png__decoder__tell_me_more(wuffs_png__decoder* self, wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{

suspend: // 4410

ok: // 4404

exit: // 4415
	wuffs_base__status status; // 4383
	wuffs_base__status v_status; // 4385
	uint32_t coro_susp_point; // 4387
	{
		wuffs_base__status t_0; // 4393
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <048D3DA0> ../thirdparty/wuffs/wuffs-v0.4.c:4426
// variables: 43
wuffs_base__status wuffs_png__decoder__do_tell_me_more(wuffs_png__decoder* self, wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{

label__loop__break: // 4800

label__loop__continue: // 4518

suspend: // 4917

ok: // 4911

label__goto_done__break: // 4888

exit: // 4922
	wuffs_base__status status; // 4431
	uint8_t v_c8; // 4433
	uint16_t v_c16; // 4434
	wuffs_base__io_buffer u_w; // 4435
	wuffs_base__io_buffer* v_w; // 4436
	uint8_t* iop_v_w; // 4437
	uint8_t* io0_v_w; // 4438
	uint8_t* io1_v_w; // 4439
	uint8_t* io2_v_w; // 4440
	uint64_t v_num_written; // 4441
	uint64_t v_w_mark; // 4442
	uint64_t v_r_mark; // 4443
	wuffs_base__status v_zlib_status; // 4444
	uint8_t* iop_a_dst; // 4446
	uint8_t* io0_a_dst; // 4447
	uint8_t* io1_a_dst; // 4448
	uint8_t* io2_a_dst; // 4449
	const uint8_t* iop_a_src; // 4459
	const uint8_t* io0_a_src; // 4460
	const uint8_t* io1_a_src; // 4461
	const uint8_t* io2_a_src; // 4462
	uint32_t coro_susp_point; // 4470
	{
		const bool  o_0_closed_a_src; // 4534
		const uint8_t* o_0_io2_a_src; // 4535
		{
			size_t n; // 4539
		}
		{
			wuffs_base__status t_0; // 4551
		}
	}
	{
		const bool  o_1_closed_a_src; // 4584
		const uint8_t* o_1_io2_a_src; // 4585
		{
			size_t n; // 4589
		}
		{
			wuffs_base__status t_1; // 4601
		}
	}
	{
		wuffs_base__io_buffer* o_2_v_w; // 4635
		uint8_t* o_2_iop_v_w; // 4636
		uint8_t* o_2_io0_v_w; // 4637
		uint8_t* o_2_io1_v_w; // 4638
		uint8_t* o_2_io2_v_w; // 4639
		{
			const bool  o_3_closed_a_src; // 4649
			const uint8_t* o_3_io2_a_src; // 4650
			{
				size_t n; // 4654
			}
			{
				wuffs_base__status t_2; // 4665
			}
		}
	}
	{
		uint8_t t_3; // 4815
	}
	{
		uint8_t t_4; // 4832
	}
	{
		uint8_t t_5; // 4854
	}
	{
		uint8_t t_6; // 4874
	}
} /* size: 0, variables: 22, goto labels: 6 */

// <0483CC36> ../common/../thirdparty/wuffs/wuffs-v0.4.c:4436
// member functions: 9
// member variable: 1
// struct size: 4
struct wuffs_base__pixel_format__struct {
	uint32_t repr; /* 0 4 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4440 */
	bool is_valid(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4441 */
	uint32_t bits_per_pixel(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4442 */
	bool is_direct(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4443 */
	bool is_indexed(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4444 */
	bool is_interleaved(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4445 */
	bool is_planar(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4446 */
	uint32_t coloration(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4447 */
	uint32_t num_planes(const wuffs_base__pixel_format__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4448 */
	wuffs_base__pixel_alpha_transparency transparency(const wuffs_base__pixel_format__struct* );
};

// <04927795> ../thirdparty/wuffs/wuffs-v0.4.c:4454
// variable: 1
inline wuffs_base__pixel_format wuffs_base__make_pixel_format(uint32_t repr)
{
	wuffs_base__pixel_format f; // 4455
} /* size: 0, variables: 1 */

// <04927777> ../thirdparty/wuffs/wuffs-v0.4.c:4519
inline uint32_t wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f)
{
} /* size: 0 */

// <04927759> ../thirdparty/wuffs/wuffs-v0.4.c:4539
inline bool wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f)
{
} /* size: 0 */

// <04927735> ../thirdparty/wuffs/wuffs-v0.4.c:4549
inline bool wuffs_base__pixel_format__is_planar(const wuffs_base__pixel_format* f)
{
} /* size: 0 */

// <0483CDC4> ../common/../thirdparty/wuffs/wuffs-v0.4.c:4627
// member functions: 4
// member variable: 1
// struct size: 4
struct wuffs_base__pixel_subsampling__struct {
	uint32_t repr; /* 0 4 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4631 */
	uint32_t bias_x(const wuffs_base__pixel_subsampling__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4632 */
	uint32_t denominator_x(const wuffs_base__pixel_subsampling__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4633 */
	uint32_t bias_y(const wuffs_base__pixel_subsampling__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4634 */
	uint32_t denominator_y(const wuffs_base__pixel_subsampling__struct* , uint32_t);
};

// <0483CE93> ../common/../thirdparty/wuffs/wuffs-v0.4.c:4711
// member functions: 9
// member variable: 1
// struct size: 16
struct wuffs_base__pixel_config__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4714 */
	struct {
		wuffs_base__pixel_format pixfmt; /* 0 4 */
		wuffs_base__pixel_subsampling pixsub; /* 4 4 */
		uint32_t width; /* 8 4 */
		uint32_t height; /* 12 4 */
	};
	struct {
		wuffs_base__pixel_format pixfmt; /* 0 4 */
		wuffs_base__pixel_subsampling pixsub; /* 4 4 */
		uint32_t width; /* 8 4 */
		uint32_t height; /* 12 4 */
	} private_impl; /* 0 16 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4722 */
	void set(wuffs_base__pixel_config__struct* , uint32_t, uint32_t, uint32_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4726 */
	void invalidate(wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4727 */
	bool is_valid(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4728 */
	wuffs_base__pixel_format pixel_format(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4729 */
	wuffs_base__pixel_subsampling pixel_subsampling(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4730 */
	wuffs_base__rect_ie_u32 bounds(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4731 */
	uint32_t width(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4732 */
	uint32_t height(const wuffs_base__pixel_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4733 */
	uint64_t pixbuf_len(const wuffs_base__pixel_config__struct* );
};

// <0487147D> ../thirdparty/wuffs/wuffs-v0.4.c:4711
// member functions: 9
// member variable: 1
// struct size: 16
struct wuffs_base__pixel_config__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4714 */
	struct {
		wuffs_base__pixel_format pixfmt; /* 0 4 */
		wuffs_base__pixel_subsampling pixsub; /* 4 4 */
		uint32_t width; /* 8 4 */
		uint32_t height; /* 12 4 */
	};
	struct {
		wuffs_base__pixel_format pixfmt; /* 0 4 */
		wuffs_base__pixel_subsampling pixsub; /* 4 4 */
		uint32_t width; /* 8 4 */
		uint32_t height; /* 12 4 */
	} private_impl; /* 0 16 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4722 */
	void set(wuffs_base__pixel_config__struct* , uint32_t, uint32_t, uint32_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4726 */
	void invalidate(wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4727 */
	bool is_valid(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4728 */
	wuffs_base__pixel_format pixel_format(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4729 */
	wuffs_base__pixel_subsampling pixel_subsampling(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4730 */
	wuffs_base__rect_ie_u32 bounds(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4731 */
	uint32_t width(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4732 */
	uint32_t height(const wuffs_base__pixel_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4733 */
	uint64_t pixbuf_len(const wuffs_base__pixel_config__struct* );
};

// <04927715> ../thirdparty/wuffs/wuffs-v0.4.c:4739
// variable: 1
inline wuffs_base__pixel_config wuffs_base__null_pixel_config(void)
{
	wuffs_base__pixel_config ret; // 4740
} /* size: 0, variables: 1 */

// <049276C0> ../thirdparty/wuffs/wuffs-v0.4.c:4750
inline void wuffs_base__pixel_config__set(wuffs_base__pixel_config* c, uint32_t pixfmt_repr, uint32_t pixsub_repr, uint32_t width, uint32_t height)
{
} /* size: 0 */

// <049276A2> ../thirdparty/wuffs/wuffs-v0.4.c:4797
inline wuffs_base__pixel_format wuffs_base__pixel_config__pixel_format(const wuffs_base__pixel_config* c)
{
} /* size: 0 */

// <04927668> ../thirdparty/wuffs/wuffs-v0.4.c:4807
// variables: 2
inline wuffs_base__rect_ie_u32 wuffs_base__pixel_config__bounds(const wuffs_base__pixel_config* c)
{
	wuffs_base__rect_ie_u32 ret; // 4817
	{
		wuffs_base__rect_ie_u32 ret; // 4809
	}
} /* size: 0, variables: 1 */

// <0492764A> ../thirdparty/wuffs/wuffs-v0.4.c:4826
inline uint32_t wuffs_base__pixel_config__width(const wuffs_base__pixel_config* c)
{
} /* size: 0 */

// <0492762C> ../thirdparty/wuffs/wuffs-v0.4.c:4831
inline uint32_t wuffs_base__pixel_config__height(const wuffs_base__pixel_config* c)
{
} /* size: 0 */

// <049275E9> ../thirdparty/wuffs/wuffs-v0.4.c:4839
// variables: 3
inline uint64_t wuffs_base__pixel_config__pixbuf_len(const wuffs_base__pixel_config* c)
{
	uint32_t bits_per_pixel; // 4847
	uint64_t bytes_per_pixel; // 4853
	uint64_t n; // 4855
} /* size: 0, variables: 3 */

// <04927598> ../thirdparty/wuffs/wuffs-v0.4.c:4876
inline void wuffs_base__pixel_config__struct::set(uint32_t pixfmt_repr, uint32_t pixsub_repr, uint32_t width, uint32_t height)
{
} /* size: 0 */

// <0492757B> ../thirdparty/wuffs/wuffs-v0.4.c:4894
inline void wuffs_base__pixel_config__struct::pixel_format()
{
} /* size: 0 */

// <0492755E> ../thirdparty/wuffs/wuffs-v0.4.c:4904
inline void wuffs_base__pixel_config__struct::bounds()
{
} /* size: 0 */

// <04927541> ../thirdparty/wuffs/wuffs-v0.4.c:4909
inline void wuffs_base__pixel_config__struct::width()
{
} /* size: 0 */

// <04927524> ../thirdparty/wuffs/wuffs-v0.4.c:4914
inline void wuffs_base__pixel_config__struct::height()
{
} /* size: 0 */

// <04927507> ../thirdparty/wuffs/wuffs-v0.4.c:4919
inline void wuffs_base__pixel_config__struct::pixbuf_len()
{
} /* size: 0 */

// <0483D064> ../common/../thirdparty/wuffs/wuffs-v0.4.c:4927
// member functions: 5
// member variables: 2
// struct size: 32
struct wuffs_base__image_config__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4932 */
	struct {
		uint64_t first_frame_io_position; /* 0 8 */
		bool first_frame_is_opaque; /* 8 1 */
	};
	wuffs_base__pixel_config pixcfg; /* 0 16 */
	struct {
		uint64_t first_frame_io_position; /* 16 8 */
		bool first_frame_is_opaque; /* 24 1 */
	} private_impl; /* 16 16 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4938 */
	void set(wuffs_base__image_config__struct* , uint32_t, uint32_t, uint32_t, uint32_t, uint64_t, bool);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4944 */
	void invalidate(wuffs_base__image_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4945 */
	bool is_valid(const wuffs_base__image_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4946 */
	uint64_t first_frame_io_position(const wuffs_base__image_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:4947 */
	bool first_frame_is_opaque(const wuffs_base__image_config__struct* );
};

// <0487164F> ../thirdparty/wuffs/wuffs-v0.4.c:4927
// member functions: 5
// member variables: 2
// struct size: 32
struct wuffs_base__image_config__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4932 */
	struct {
		uint64_t first_frame_io_position; /* 0 8 */
		bool first_frame_is_opaque; /* 8 1 */
	};
	wuffs_base__pixel_config pixcfg; /* 0 16 */
	struct {
		uint64_t first_frame_io_position; /* 16 8 */
		bool first_frame_is_opaque; /* 24 1 */
	} private_impl; /* 16 16 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4938 */
	void set(wuffs_base__image_config__struct* , uint32_t, uint32_t, uint32_t, uint32_t, uint64_t, bool);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4944 */
	void invalidate(wuffs_base__image_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4945 */
	bool is_valid(const wuffs_base__image_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4946 */
	uint64_t first_frame_io_position(const wuffs_base__image_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:4947 */
	bool first_frame_is_opaque(const wuffs_base__image_config__struct* );
};

// <048D3D19> ../thirdparty/wuffs/wuffs-v0.4.c:4937
// function call: 1
wuffs_base__range_ii_u64 wuffs_png__decoder__workbuf_len(const wuffs_png__decoder* self)
{
	wuffs_base__make_range_ii_u64(uint64_t min_incl,
					uint64_t max_incl);  // 4947
} /* size: 0, inline expansions: 1 (0 bytes) */

// <049274E7> ../thirdparty/wuffs/wuffs-v0.4.c:4953
// variable: 1
inline wuffs_base__image_config wuffs_base__null_image_config(void)
{
	wuffs_base__image_config ret; // 4954
} /* size: 0, variables: 1 */

// <048D3CD7> ../thirdparty/wuffs/wuffs-v0.4.c:4954
wuffs_base__status wuffs_png__decoder__filter_and_swizzle(wuffs_png__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__slice_u8 a_workbuf)
{
} /* size: 0 */

// <0492747E> ../thirdparty/wuffs/wuffs-v0.4.c:4963
inline void wuffs_base__image_config__set(wuffs_base__image_config* c, uint32_t pixfmt_repr, uint32_t pixsub_repr, uint32_t width, uint32_t height, uint64_t first_frame_io_position, bool first_frame_is_opaque)
{
} /* size: 0 */

// <048D356B> ../thirdparty/wuffs/wuffs-v0.4.c:4963
// variables: 13
// function calls: 22
wuffs_base__status wuffs_png__decoder__filter_and_swizzle__choosy_default(wuffs_png__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__slice_u8 a_workbuf)
{
	wuffs_base__pixel_format v_dst_pixfmt; // 4967
	uint32_t v_dst_bits_per_pixel; // 4968
	uint64_t v_dst_bytes_per_pixel; // 4969
	uint64_t v_dst_bytes_per_row0; // 4970
	uint64_t v_dst_bytes_per_row1; // 4971
	wuffs_base__slice_u8 v_dst_palette; // 4972
	wuffs_base__table_u8 v_tab; // 4973
	uint32_t v_y; // 4974
	wuffs_base__slice_u8 v_dst; // 4975
	uint8_t v_filter; // 4976
	wuffs_base__slice_u8 v_curr_row; // 4977
	wuffs_base__slice_u8 v_prev_row; // 4978
	wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 4980
	wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f); // 4981
	wuffs_base__make_status(const char* repr); // 4983
	wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5497
	{
		wuffs_base__table_u8* tab; // 5498
	}
	wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb,
							wuffs_base__slice_u8 fallback);  // 4988
	wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
					uint32_t p);  // 5520
	wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
					uint32_t p);  // 4989
	wuffs_base__make_table_u8(uint8_t* ptr,
					size_t width,
					size_t height,
					size_t stride);  // 1966
	wuffs_base__table_u8__subtable_ij(wuffs_base__table_u8 t,
						uint64_t ix,
						uint64_t iy,
						uint64_t jx,
						uint64_t jy);  // 4998
	wuffs_base__make_slice_u8(uint8_t* ptr,
					size_t len);  // 17364
	wuffs_private_impl__table_u8__row_u32(wuffs_base__table_u8 t,
						uint32_t y);  // 5012
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5017
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5022
	wuffs_png__decoder__filter_1(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr);  // 5025
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5035
	wuffs_png__decoder__filter_4(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5031
	wuffs_png__decoder__filter_3(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5029
	wuffs_base__u64__min(uint64_t x,
				uint64_t y);  // 65343
	wuffs_png__decoder__filter_2(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5027
	wuffs_base__make_status(const char* repr); // 5033
	wuffs_base__make_status(const char* repr); // 5014
	wuffs_base__make_status(const char* repr); // 5039
} /* size: 0, variables: 12, inline expansions: 22 (0 bytes) */

// <048D292B> ../thirdparty/wuffs/wuffs-v0.4.c:5046
// variables: 21
// function calls: 36
wuffs_base__status wuffs_png__decoder__filter_and_swizzle_tricky(wuffs_png__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__slice_u8 a_workbuf)
{
	wuffs_base__pixel_format v_dst_pixfmt; // 5050
	uint32_t v_dst_bits_per_pixel; // 5051
	uint64_t v_dst_bytes_per_pixel; // 5052
	uint64_t v_dst_bytes_per_row1; // 5053
	wuffs_base__slice_u8 v_dst_palette; // 5054
	wuffs_base__table_u8 v_tab; // 5055
	uint64_t v_src_bytes_per_pixel; // 5056
	uint32_t v_x; // 5057
	uint32_t v_y; // 5058
	uint64_t v_i; // 5059
	wuffs_base__slice_u8 v_dst; // 5060
	uint8_t v_filter; // 5061
	wuffs_base__slice_u8 v_s; // 5062
	wuffs_base__slice_u8 v_curr_row; // 5063
	wuffs_base__slice_u8 v_prev_row; // 5064
	uint8_t v_bits_unpacked; // 5065
	uint8_t v_bits_packed; // 5066
	uint8_t v_packs_remaining; // 5067
	uint8_t v_multiplier; // 5068
	uint8_t v_shift; // 5069
	wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 5071
	wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f); // 5072
	wuffs_base__make_status(const char* repr); // 5074
	wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5497
	{
		wuffs_base__table_u8* tab; // 5498
	}
	wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb,
							wuffs_base__slice_u8 fallback);  // 5078
	wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
					uint32_t p);  // 5520
	wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
					uint32_t p);  // 5079
	wuffs_base__make_slice_u8(uint8_t* ptr,
					size_t len);  // 17364
	wuffs_private_impl__table_u8__row_u32(wuffs_base__table_u8 t,
						uint32_t y);  // 5090
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5098
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5103
	wuffs_png__decoder__filter_1(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr);  // 5106
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5296
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5223
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5296
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5293
	wuffs_png__decoder__filter_4(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5112
	wuffs_png__decoder__filter_3(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5110
	wuffs_base__u64__min(uint64_t x,
				uint64_t y);  // 65343
	wuffs_png__decoder__filter_2(wuffs_png__decoder* self,
					wuffs_base__slice_u8 a_curr,
					wuffs_base__slice_u8 a_prev);  // 5108
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5202
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5202
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5184
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5204
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5252
	wuffs_base__make_status(const char* repr); // 5114
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5281
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5133
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5161
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5161
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5165
	wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
									wuffs_base__slice_u8 dst,
									wuffs_base__slice_u8 dst_palette,
									wuffs_base__slice_u8 src);  // 5165
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5166
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 5151
	wuffs_base__make_status(const char* repr); // 5095
	wuffs_base__make_status(const char* repr); // 5304
} /* size: 0, variables: 20, inline expansions: 36 (0 bytes) */

// <0483D1A5> ../common/../thirdparty/wuffs/wuffs-v0.4.c:5075
// member functions: 11
// member variable: 1
// struct size: 48
struct wuffs_base__frame_config__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5078 */
	struct {
		wuffs_base__rect_ie_u32 bounds; /* 0 16 */
		wuffs_base__flicks duration; /* 16 8 */
		uint64_t index; /* 24 8 */
		uint64_t io_position; /* 32 8 */
		wuffs_base__animation_disposal disposal; /* 40 1 */
		bool opaque_within_bounds; /* 41 1 */
		bool overwrite_instead_of_blend; /* 42 1 */
		wuffs_base__color_u32_argb_premul background_color; /* 44 4 */
	};
	struct {
		wuffs_base__rect_ie_u32 bounds; /* 0 16 */
		wuffs_base__flicks duration; /* 16 8 */
		uint64_t index; /* 24 8 */
		uint64_t io_position; /* 32 8 */
		wuffs_base__animation_disposal disposal; /* 40 1 */
		bool opaque_within_bounds; /* 41 1 */
		bool overwrite_instead_of_blend; /* 42 1 */
		wuffs_base__color_u32_argb_premul background_color; /* 44 4 */
	} private_impl; /* 0 48 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5090 */
	void set(wuffs_base__frame_config__struct* , wuffs_base__rect_ie_u32, wuffs_base__flicks, uint64_t, uint64_t, wuffs_base__animation_disposal, bool, bool, wuffs_base__color_u32_argb_premul);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5098 */
	wuffs_base__rect_ie_u32 bounds(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5099 */
	uint32_t width(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5100 */
	uint32_t height(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5101 */
	wuffs_base__flicks duration(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5102 */
	uint64_t index(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5103 */
	uint64_t io_position(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5104 */
	wuffs_base__animation_disposal disposal(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5105 */
	bool opaque_within_bounds(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5106 */
	bool overwrite_instead_of_blend(const wuffs_base__frame_config__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5107 */
	wuffs_base__color_u32_argb_premul background_color(const wuffs_base__frame_config__struct* );
};

// <04871796> ../thirdparty/wuffs/wuffs-v0.4.c:5075
// member functions: 11
// member variable: 1
// struct size: 48
struct wuffs_base__frame_config__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5078 */
	struct {
		wuffs_base__rect_ie_u32 bounds; /* 0 16 */
		wuffs_base__flicks duration; /* 16 8 */
		uint64_t index; /* 24 8 */
		uint64_t io_position; /* 32 8 */
		wuffs_base__animation_disposal disposal; /* 40 1 */
		bool opaque_within_bounds; /* 41 1 */
		bool overwrite_instead_of_blend; /* 42 1 */
		wuffs_base__color_u32_argb_premul background_color; /* 44 4 */
	};
	struct {
		wuffs_base__rect_ie_u32 bounds; /* 0 16 */
		wuffs_base__flicks duration; /* 16 8 */
		uint64_t index; /* 24 8 */
		uint64_t io_position; /* 32 8 */
		wuffs_base__animation_disposal disposal; /* 40 1 */
		bool opaque_within_bounds; /* 41 1 */
		bool overwrite_instead_of_blend; /* 42 1 */
		wuffs_base__color_u32_argb_premul background_color; /* 44 4 */
	} private_impl; /* 0 48 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5090 */
	void set(wuffs_base__frame_config__struct* , wuffs_base__rect_ie_u32, wuffs_base__flicks, uint64_t, uint64_t, wuffs_base__animation_disposal, bool, bool, wuffs_base__color_u32_argb_premul);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5098 */
	wuffs_base__rect_ie_u32 bounds(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5099 */
	uint32_t width(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5100 */
	uint32_t height(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5101 */
	wuffs_base__flicks duration(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5102 */
	uint64_t index(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5103 */
	uint64_t io_position(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5104 */
	wuffs_base__animation_disposal disposal(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5105 */
	bool opaque_within_bounds(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5106 */
	bool overwrite_instead_of_blend(const wuffs_base__frame_config__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5107 */
	wuffs_base__color_u32_argb_premul background_color(const wuffs_base__frame_config__struct* );
};

// <0492745E> ../thirdparty/wuffs/wuffs-v0.4.c:5113
// variable: 1
inline wuffs_base__frame_config wuffs_base__null_frame_config(void)
{
	wuffs_base__frame_config ret; // 5114
} /* size: 0, variables: 1 */

// <049273DB> ../thirdparty/wuffs/wuffs-v0.4.c:5126
inline void wuffs_base__frame_config__set(wuffs_base__frame_config* c, wuffs_base__rect_ie_u32 bounds, wuffs_base__flicks duration, uint64_t index, uint64_t io_position, wuffs_base__animation_disposal disposal, bool opaque_within_bounds, bool overwrite_instead_of_blend, wuffs_base__color_u32_argb_premul background_color)
{
} /* size: 0 */

// <049273B7> ../thirdparty/wuffs/wuffs-v0.4.c:5228
inline bool wuffs_base__frame_config__overwrite_instead_of_blend(const wuffs_base__frame_config* c)
{
} /* size: 0 */

// <0492739A> ../thirdparty/wuffs/wuffs-v0.4.c:5296
inline void wuffs_base__frame_config__struct::overwrite_instead_of_blend()
{
} /* size: 0 */

// <0483D403> ../common/../thirdparty/wuffs/wuffs-v0.4.c:5309
// member functions: 9
// member variables: 2
// struct size: 144
struct wuffs_base__pixel_buffer__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5314 */
	struct {
		wuffs_base__table_u8 planes[4]; /* 0 128 */
	};
	wuffs_base__pixel_config pixcfg; /* 0 16 */
	struct {
		wuffs_base__table_u8 planes[4]; /* 16 128 */
	} private_impl; /* 16 128 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5320 */
	wuffs_base__status set_interleaved(wuffs_base__pixel_buffer__struct* , const wuffs_base__pixel_config* , wuffs_base__table_u8, wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5324 */
	wuffs_base__status set_from_slice(wuffs_base__pixel_buffer__struct* , const wuffs_base__pixel_config* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5327 */
	wuffs_base__slice_u8 palette(wuffs_base__pixel_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5328 */
	wuffs_base__slice_u8 palette_or_else(wuffs_base__pixel_buffer__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5329 */
	wuffs_base__pixel_format pixel_format(const wuffs_base__pixel_buffer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5330 */
	wuffs_base__table_u8 plane(wuffs_base__pixel_buffer__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5331 */
	wuffs_base__color_u32_argb_premul color_u32_at(const wuffs_base__pixel_buffer__struct* , uint32_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5333 */
	wuffs_base__status set_color_u32_at(wuffs_base__pixel_buffer__struct* , uint32_t, uint32_t, wuffs_base__color_u32_argb_premul);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5337 */
	wuffs_base__status set_color_u32_fill_rect(wuffs_base__pixel_buffer__struct* , wuffs_base__rect_ie_u32, wuffs_base__color_u32_argb_premul);
};

// <048719FF> ../thirdparty/wuffs/wuffs-v0.4.c:5309
// member functions: 9
// member variables: 2
// struct size: 144
struct wuffs_base__pixel_buffer__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5314 */
	struct {
		wuffs_base__table_u8 planes[4]; /* 0 128 */
	};
	wuffs_base__pixel_config pixcfg; /* 0 16 */
	struct {
		wuffs_base__table_u8 planes[4]; /* 16 128 */
	} private_impl; /* 16 128 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5320 */
	wuffs_base__status set_interleaved(wuffs_base__pixel_buffer__struct* , const wuffs_base__pixel_config* , wuffs_base__table_u8, wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5324 */
	wuffs_base__status set_from_slice(wuffs_base__pixel_buffer__struct* , const wuffs_base__pixel_config* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5327 */
	wuffs_base__slice_u8 palette(wuffs_base__pixel_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5328 */
	wuffs_base__slice_u8 palette_or_else(wuffs_base__pixel_buffer__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5329 */
	wuffs_base__pixel_format pixel_format(const wuffs_base__pixel_buffer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5330 */
	wuffs_base__table_u8 plane(wuffs_base__pixel_buffer__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5331 */
	wuffs_base__color_u32_argb_premul color_u32_at(const wuffs_base__pixel_buffer__struct* , uint32_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5333 */
	wuffs_base__status set_color_u32_at(wuffs_base__pixel_buffer__struct* , uint32_t, uint32_t, wuffs_base__color_u32_argb_premul);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5337 */
	wuffs_base__status set_color_u32_fill_rect(wuffs_base__pixel_buffer__struct* , wuffs_base__rect_ie_u32, wuffs_base__color_u32_argb_premul);
};

// <0492737A> ../thirdparty/wuffs/wuffs-v0.4.c:5345
// variable: 1
inline wuffs_base__pixel_buffer wuffs_base__null_pixel_buffer(void)
{
	wuffs_base__pixel_buffer ret; // 5346
} /* size: 0, variables: 1 */

// <048D28D9> ../thirdparty/wuffs/wuffs-v0.4.c:5400
wuffs_base__status wuffs_qoi__decoder__initialize(wuffs_qoi__decoder* self, size_t sizeof_star_self, uint64_t wuffs_version, uint32_t options)
{
} /* size: 0 */

// <049272D8> ../thirdparty/wuffs/wuffs-v0.4.c:5405
// variables: 8
inline wuffs_base__status wuffs_base__pixel_buffer__set_from_slice(wuffs_base__pixel_buffer* pb, const wuffs_base__pixel_config* pixcfg, wuffs_base__slice_u8 pixbuf_memory)
{
	uint32_t bits_per_pixel; // 5419
	uint64_t bytes_per_pixel; // 5425
	uint8_t* ptr; // 5427
	uint64_t len; // 5428
	uint64_t wh; // 5450
	size_t width; // 5452
	wuffs_base__table_u8* tab; // 5465
	{
		wuffs_base__table_u8* tab; // 5439
	}
} /* size: 0, variables: 7 */

// <048D27CE> ../thirdparty/wuffs/wuffs-v0.4.c:5447
// variable: 1
// function calls: 2
wuffs_qoi__decoder* wuffs_qoi__decoder__alloc(void)
{
	wuffs_qoi__decoder* x; // 5448
	wuffs_qoi__decoder__initialize(wuffs_qoi__decoder* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 5400
	wuffs_qoi__decoder__initialize(wuffs_qoi__decoder* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 5453
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <048D27A9> ../thirdparty/wuffs/wuffs-v0.4.c:5462
size_t sizeof__wuffs_qoi__decoder(void)
{
} /* size: 0 */

// <048D2775> ../thirdparty/wuffs/wuffs-v0.4.c:5472
uint64_t wuffs_qoi__decoder__get_quirk(const wuffs_qoi__decoder* self, uint32_t a_key)
{
} /* size: 0 */

// <049272AA> ../thirdparty/wuffs/wuffs-v0.4.c:5477
// variable: 1
inline wuffs_base__slice_u8 wuffs_base__pixel_buffer__palette(wuffs_base__pixel_buffer* pb)
{
	{
		wuffs_base__table_u8* tab; // 5480
	}
} /* size: 0 */

// <048D2732> ../thirdparty/wuffs/wuffs-v0.4.c:5490
wuffs_base__status wuffs_qoi__decoder__set_quirk(wuffs_qoi__decoder* self, uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <04927269> ../thirdparty/wuffs/wuffs-v0.4.c:5494
// variable: 1
inline wuffs_base__slice_u8 wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb, wuffs_base__slice_u8 fallback)
{
	{
		wuffs_base__table_u8* tab; // 5498
	}
} /* size: 0 */

// <048D2691> ../thirdparty/wuffs/wuffs-v0.4.c:5511
// variables: 4
wuffs_base__status wuffs_qoi__decoder__decode_image_config(wuffs_qoi__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 5561

ok: // 5555

exit: // 5566
	wuffs_base__status status; // 5534
	wuffs_base__status v_status; // 5536
	uint32_t coro_susp_point; // 5538
	{
		wuffs_base__status t_0; // 5544
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <0492724A> ../thirdparty/wuffs/wuffs-v0.4.c:5512
inline wuffs_base__pixel_format wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb)
{
} /* size: 0 */

// <04927213> ../thirdparty/wuffs/wuffs-v0.4.c:5520
// variable: 1
inline wuffs_base__table_u8 wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb, uint32_t p)
{
	wuffs_base__table_u8 ret; // 5525
} /* size: 0, variables: 1 */

// <049271DC> ../thirdparty/wuffs/wuffs-v0.4.c:5563
inline void wuffs_base__pixel_buffer__struct::set_from_slice(const wuffs_base__pixel_config* pixcfg_arg, wuffs_base__slice_u8 pixbuf_memory)
{
} /* size: 0 */

// <048D2321> ../thirdparty/wuffs/wuffs-v0.4.c:5577
// variables: 17
// function calls: 3
wuffs_base__status wuffs_qoi__decoder__do_decode_image_config(wuffs_qoi__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 5741

suspend: // 5747

exit: // 5751
	wuffs_base__status status; // 5581
	uint32_t v_a; // 5583
	const uint8_t* iop_a_src; // 5585
	const uint8_t* io0_a_src; // 5586
	const uint8_t* io1_a_src; // 5587
	const uint8_t* io2_a_src; // 5588
	uint32_t coro_susp_point; // 5596
	{
		uint32_t t_0; // 5606
		{
			uint64_t* scratch; // 5618
			uint32_t num_bits_0; // 5619
		}
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 5608
	}
	{
		uint32_t t_1; // 5639
		{
			uint64_t* scratch; // 5651
			uint32_t num_bits_1; // 5652
		}
	}
	{
		uint32_t t_2; // 5673
		{
			uint64_t* scratch; // 5685
			uint32_t num_bits_2; // 5686
		}
	}
	{
		uint32_t t_3; // 5711
	}
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 4963
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 5729
} /* size: 0, variables: 7, goto labels: 3, inline expansions: 2 (0 bytes) */

// <049271A5> ../thirdparty/wuffs/wuffs-v0.4.c:5604
inline void wuffs_base__pixel_buffer__struct::set_color_u32_fill_rect(wuffs_base__rect_ie_u32 rect, wuffs_base__color_u32_argb_premul color)
{
} /* size: 0 */

// <0483D5FA> ../common/../thirdparty/wuffs/wuffs-v0.4.c:5614
// member variable: 1
// struct size: 1
struct wuffs_base__decode_frame_options__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5617 */
	struct {
		uint8_t TODO; /* 0 1 */
	};
	struct {
		uint8_t TODO; /* 0 1 */
	} private_impl; /* 0 1 */
};

// <04871BFB> ../thirdparty/wuffs/wuffs-v0.4.c:5614
// member variable: 1
// struct size: 1
struct wuffs_base__decode_frame_options__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5617 */
	struct {
		uint8_t TODO; /* 0 1 */
	};
	struct {
		uint8_t TODO; /* 0 1 */
	} private_impl; /* 0 1 */
};

// <0483D6BD> ../common/../thirdparty/wuffs/wuffs-v0.4.c:5665
// member functions: 2
// member variable: 1
// struct size: 24
struct wuffs_base__pixel_swizzler__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5668 */
	struct {
		wuffs_base__pixel_swizzler__func func; /* 0 8 */
		wuffs_base__pixel_swizzler__transparent_black_func transparent_black_func; /* 8 8 */
		uint32_t dst_pixfmt_bytes_per_pixel; /* 16 4 */
		uint32_t src_pixfmt_bytes_per_pixel; /* 20 4 */
	};
	struct {
		wuffs_base__pixel_swizzler__func func; /* 0 8 */
		wuffs_base__pixel_swizzler__transparent_black_func transparent_black_func; /* 8 8 */
		uint32_t dst_pixfmt_bytes_per_pixel; /* 16 4 */
		uint32_t src_pixfmt_bytes_per_pixel; /* 20 4 */
	} private_impl; /* 0 24 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5676 */
	wuffs_base__status prepare(wuffs_base__pixel_swizzler__struct* , wuffs_base__pixel_format, wuffs_base__slice_u8, wuffs_base__pixel_format, wuffs_base__slice_u8, wuffs_base__pixel_blend);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:5681 */
	uint64_t swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler__struct* , wuffs_base__slice_u8, wuffs_base__slice_u8, wuffs_base__slice_u8);
};

// <04871CC5> ../thirdparty/wuffs/wuffs-v0.4.c:5665
// member functions: 2
// member variable: 1
// struct size: 24
struct wuffs_base__pixel_swizzler__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5668 */
	struct {
		wuffs_base__pixel_swizzler__func func; /* 0 8 */
		wuffs_base__pixel_swizzler__transparent_black_func transparent_black_func; /* 8 8 */
		uint32_t dst_pixfmt_bytes_per_pixel; /* 16 4 */
		uint32_t src_pixfmt_bytes_per_pixel; /* 20 4 */
	};
	struct {
		wuffs_base__pixel_swizzler__func func; /* 0 8 */
		wuffs_base__pixel_swizzler__transparent_black_func transparent_black_func; /* 8 8 */
		uint32_t dst_pixfmt_bytes_per_pixel; /* 16 4 */
		uint32_t src_pixfmt_bytes_per_pixel; /* 20 4 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5676 */
	wuffs_base__status prepare(wuffs_base__pixel_swizzler__struct* , wuffs_base__pixel_format, wuffs_base__slice_u8, wuffs_base__pixel_format, wuffs_base__slice_u8, wuffs_base__pixel_blend);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:5681 */
	uint64_t swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler__struct* , wuffs_base__slice_u8, wuffs_base__slice_u8, wuffs_base__slice_u8);
};

// <048D2280> ../thirdparty/wuffs/wuffs-v0.4.c:5763
// variables: 4
wuffs_base__status wuffs_qoi__decoder__decode_frame_config(wuffs_qoi__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 5813

ok: // 5807

exit: // 5818
	wuffs_base__status status; // 5786
	wuffs_base__status v_status; // 5788
	uint32_t coro_susp_point; // 5790
	{
		wuffs_base__status t_0; // 5796
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <048D2032> ../thirdparty/wuffs/wuffs-v0.4.c:5829
// variables: 6
// function calls: 3
wuffs_base__status wuffs_qoi__decoder__do_decode_frame_config(wuffs_qoi__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 5894

exit: // 5904

suspend: // 5900
	wuffs_base__status status; // 5833
	const uint8_t* iop_a_src; // 5835
	const uint8_t* io0_a_src; // 5836
	const uint8_t* io1_a_src; // 5837
	const uint8_t* io2_a_src; // 5838
	uint32_t coro_susp_point; // 5846
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 5901
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 5864
	wuffs_base__frame_config__set(wuffs_base__frame_config* c,
					wuffs_base__rect_ie_u32 bounds,
					wuffs_base__flicks duration,
					uint64_t index,
					uint64_t io_position,
					wuffs_base__animation_disposal disposal,
					bool opaque_within_bounds,
					bool overwrite_instead_of_blend,
					wuffs_base__color_u32_argb_premul background_color);  // 5877
} /* size: 0, variables: 6, goto labels: 3, inline expansions: 3 (0 bytes) */

// <04871DBA> ../thirdparty/wuffs/wuffs-v0.4.c:5848
// member variables: 2
// struct size: 4
struct wuffs_base__lossy_value_u16__struct {
	uint16_t value; /* 0 2 */
	bool lossy; /* 2 1 */
};

// <0492717C> ../thirdparty/wuffs/wuffs-v0.4.c:5865
// variable: 1
inline uint64_t wuffs_base__ieee_754_bit_representation__from_f64_to_u64(double f)
{
	uint64_t u; // 5866
} /* size: 0, variables: 1 */

// <0492711D> ../thirdparty/wuffs/wuffs-v0.4.c:5874
// variables: 5
inline double wuffs_base__ieee_754_bit_representation__from_u16_to_f64(uint16_t u)
{
	uint64_t v; // 5875
	double f; // 5894
	{
		uint64_t exp; // 5878
		uint64_t man; // 5879
		{
			uint32_t clz; // 5885
		}
	}
} /* size: 0, variables: 2 */

// <049270F4> ../thirdparty/wuffs/wuffs-v0.4.c:5902
// variable: 1
inline double wuffs_base__ieee_754_bit_representation__from_u32_to_f64(uint32_t u)
{
	float f; // 5903
} /* size: 0, variables: 1 */

// <049270CB> ../thirdparty/wuffs/wuffs-v0.4.c:5911
// variable: 1
inline double wuffs_base__ieee_754_bit_representation__from_u64_to_f64(uint64_t u)
{
	double f; // 5912
} /* size: 0, variables: 1 */

// <048D149F> ../thirdparty/wuffs/wuffs-v0.4.c:5916
// variables: 18
// function calls: 32
wuffs_base__status wuffs_qoi__decoder__decode_frame(wuffs_qoi__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

suspend: // 5974

ok: // 5968

exit: // 5979
	wuffs_base__status status; // 5942
	wuffs_base__status v_status; // 5944
	uint32_t coro_susp_point; // 5946
	{
		wuffs_base__status t_0; // 5952

exit: // 6132

ok: // 6122

suspend: // 6128
		{
			uint64_t t_0; // 6089
			{
				uint64_t* scratch; // 6101
				uint32_t num_bits_0; // 6102
			}
		}
		memset(void* __dest,
			int __ch,
			size_t __len);  // 17344
		wuffs_private_impl__bulk_memset(void* ptr,
						size_t len,
						uint8_t byte_value);  // 6056

exit: // 6341

ok: // 6328

suspend: // 6334
		{
			uint8_t t_0; // 6188
		}
		{
			uint8_t t_8; // 6287
		}
		{
			uint8_t t_7; // 6253
		}
		{
			uint8_t t_6; // 6244
		}
		{
			uint8_t t_5; // 6235
		}
		{
			uint8_t t_4; // 6226
		}
		{
			uint8_t t_3; // 6216
		}
		{
			uint8_t t_1; // 6198
		}
		{
			uint8_t t_2; // 6207
		}
		wuffs_qoi__decoder__from_src_to_buffer(wuffs_qoi__decoder* self,
							wuffs_base__io_buffer* a_src);  // 6063
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5479
		{
			wuffs_base__table_u8* tab; // 5480
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5486
		}
		wuffs_base__pixel_buffer__palette(wuffs_base__pixel_buffer* pb); // 6034
		wuffs_base__empty_slice_u8(void); // 6034
		wuffs_base__make_pixel_format(uint32_t repr); // 6034
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 6034
		wuffs_base__status__is_ok(const wuffs_base__status* z); // 6040
		wuffs_base__status__is_error(const wuffs_base__status* z); // 6042
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 6044
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 6368
		wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f); // 6369
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 5520
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 6375
		wuffs_base__make_slice_u8_ij(uint8_t* ptr,
						size_t i,
						size_t j);  // 6387
		wuffs_private_impl__table_u8__row_u32(wuffs_base__table_u8 t,
							uint32_t y);  // 6393
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5479
		{
			wuffs_base__table_u8* tab; // 5480
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5486
		}
		wuffs_base__pixel_buffer__palette(wuffs_base__pixel_buffer* pb); // 6400
		wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
						uint64_t i);  // 6400
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 6400
		wuffs_qoi__decoder__from_buffer_to_dst(wuffs_qoi__decoder* self,
							wuffs_base__pixel_buffer* a_dst);  // 6075
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 6129
		wuffs_qoi__decoder__do_decode_frame(wuffs_qoi__decoder* self,
							wuffs_base__pixel_buffer* a_dst,
							wuffs_base__io_buffer* a_src,
							wuffs_base__pixel_blend a_blend,
							wuffs_base__slice_u8 a_workbuf,
							wuffs_base__decode_frame_options* a_opts);  // 5952
	}
	wuffs_base__make_status(const char* repr); // 5927
	wuffs_base__status__is_error(const wuffs_base__status* z); // 5980
	wuffs_base__make_status(const char* repr); // 5924
	wuffs_base__make_status(const char* repr); // 5934
	wuffs_base__make_status(const char* repr); // 5939
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 5976
} /* size: 0, variables: 3, goto labels: 3, inline expansions: 6 (0 bytes) */

// <048D1367> ../thirdparty/wuffs/wuffs-v0.4.c:5990
// variables: 11
wuffs_base__status wuffs_qoi__decoder__do_decode_frame(wuffs_qoi__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

exit: // 6132

ok: // 6122

suspend: // 6128
	wuffs_base__status status; // 5997
	wuffs_base__status v_status; // 5999
	uint64_t v_c64; // 6000
	const uint8_t* iop_a_src; // 6002
	const uint8_t* io0_a_src; // 6003
	const uint8_t* io1_a_src; // 6004
	const uint8_t* io2_a_src; // 6005
	uint32_t coro_susp_point; // 6013
	{
		uint64_t t_0; // 6089
		{
			uint64_t* scratch; // 6101
			uint32_t num_bits_0; // 6102
		}
	}
} /* size: 0, variables: 8, goto labels: 3 */

// <048D1198> ../thirdparty/wuffs/wuffs-v0.4.c:6144
// variables: 22
wuffs_base__status wuffs_qoi__decoder__from_src_to_buffer(wuffs_qoi__decoder* self, wuffs_base__io_buffer* a_src)
{

exit: // 6341

ok: // 6328

suspend: // 6334
	wuffs_base__status status; // 6147
	uint8_t v_c8; // 6149
	uint8_t v_dg; // 6150
	uint32_t v_bi; // 6151
	uint32_t v_bj; // 6152
	uint32_t v_bk; // 6153
	uint32_t v_ci; // 6154
	uint32_t v_hash4; // 6155
	const uint8_t* iop_a_src; // 6157
	const uint8_t* io0_a_src; // 6158
	const uint8_t* io1_a_src; // 6159
	const uint8_t* io2_a_src; // 6160
	uint32_t coro_susp_point; // 6168
	{
		uint8_t t_0; // 6188
	}
	{
		uint8_t t_1; // 6198
	}
	{
		uint8_t t_2; // 6207
	}
	{
		uint8_t t_3; // 6216
	}
	{
		uint8_t t_4; // 6226
	}
	{
		uint8_t t_5; // 6235
	}
	{
		uint8_t t_6; // 6244
	}
	{
		uint8_t t_7; // 6253
	}
	{
		uint8_t t_8; // 6287
	}
} /* size: 0, variables: 13, goto labels: 3 */

// <04927091> ../thirdparty/wuffs/wuffs-v0.4.c:6234
// variable: 1
inline wuffs_base__utf_8__next__output wuffs_base__make_utf_8__next__output(uint32_t code_point, uint32_t byte_length)
{
	wuffs_base__utf_8__next__output ret; // 6236
} /* size: 0, variables: 1 */

// <048D10C0> ../thirdparty/wuffs/wuffs-v0.4.c:6353
// variables: 11
wuffs_base__status wuffs_qoi__decoder__from_buffer_to_dst(wuffs_qoi__decoder* self, wuffs_base__pixel_buffer* a_dst)
{
	wuffs_base__pixel_format v_dst_pixfmt; // 6356
	uint32_t v_dst_bits_per_pixel; // 6357
	uint32_t v_dst_bytes_per_pixel; // 6358
	uint64_t v_dst_bytes_per_row; // 6359
	wuffs_base__table_u8 v_tab; // 6360
	uint32_t v_bi; // 6361
	uint32_t v_rem_x; // 6362
	wuffs_base__slice_u8 v_dst; // 6363
	wuffs_base__slice_u8 v_src; // 6364
	uint32_t v_src_length; // 6365
	uint64_t v_i; // 6366
} /* size: 0, variables: 11 */

// <04871EA6> ../thirdparty/wuffs/wuffs-v0.4.c:6363
// member functions: 5
// member variables: 5
// struct size: 40
struct wuffs_base__hasher_u32__func_ptrs__struct {
	uint32_t (*checksum_u32)(const void* ); /* 0 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 8 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 16 8* /
	wuffs_base__empty_struct (*update)(void* , wuffs_base__slice_u8); /* 24 8* /
	uint32_t (*update_u32)(void* , wuffs_base__slice_u8); /* 32 8* /
};

// <048D109B> ../thirdparty/wuffs/wuffs-v0.4.c:6410
wuffs_base__rect_ie_u32 wuffs_qoi__decoder__frame_dirty_rect(const wuffs_qoi__decoder* self)
{
} /* size: 0 */

// <0484EEB3> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6415
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__hasher_u32__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6416 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6428 */
	uint32_t checksum_u32(const wuffs_base__hasher_u32__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6433 */
	uint64_t get_quirk(const wuffs_base__hasher_u32__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6440 */
	wuffs_base__status set_quirk(wuffs_base__hasher_u32__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6448 */
	wuffs_base__empty_struct update(wuffs_base__hasher_u32__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6455 */
	uint32_t update_u32(wuffs_base__hasher_u32__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6424 */
	typedef struct unique_ptr<wuffs_base__hasher_u32__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <04871FB0> ../thirdparty/wuffs/wuffs-v0.4.c:6415
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__hasher_u32__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6416 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6428 */
	uint32_t checksum_u32(const wuffs_base__hasher_u32__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6433 */
	uint64_t get_quirk(const wuffs_base__hasher_u32__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6440 */
	wuffs_base__status set_quirk(wuffs_base__hasher_u32__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6448 */
	wuffs_base__empty_struct update(wuffs_base__hasher_u32__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6455 */
	uint32_t update_u32(wuffs_base__hasher_u32__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6424 */
	typedef struct unique_ptr<wuffs_base__hasher_u32__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <048D1076> ../thirdparty/wuffs/wuffs-v0.4.c:6431
uint32_t wuffs_qoi__decoder__num_animation_loops(const wuffs_qoi__decoder* self)
{
} /* size: 0 */

// <048D103A> ../thirdparty/wuffs/wuffs-v0.4.c:6448
uint64_t wuffs_qoi__decoder__num_decoded_frame_configs(const wuffs_qoi__decoder* self)
{
} /* size: 0 */

// <048D0FFE> ../thirdparty/wuffs/wuffs-v0.4.c:6468
uint64_t wuffs_qoi__decoder__num_decoded_frames(const wuffs_qoi__decoder* self)
{
} /* size: 0 */

// <048720FF> ../thirdparty/wuffs/wuffs-v0.4.c:6470
// member functions: 5
// member variables: 5
// struct size: 40
struct wuffs_base__hasher_u64__func_ptrs__struct {
	uint64_t (*checksum_u64)(const void* ); /* 0 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 8 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 16 8* /
	wuffs_base__empty_struct (*update)(void* , wuffs_base__slice_u8); /* 24 8* /
	uint64_t (*update_u64)(void* , wuffs_base__slice_u8); /* 32 8* /
};

// <048D0FBB> ../thirdparty/wuffs/wuffs-v0.4.c:6488
wuffs_base__status wuffs_qoi__decoder__restart_frame(wuffs_qoi__decoder* self, uint64_t a_index, uint64_t a_io_position)
{
} /* size: 0 */

// <048D0F78> ../thirdparty/wuffs/wuffs-v0.4.c:6516
wuffs_base__empty_wuffs_qoi__decoder__set_report_metadata(wuffs_qoi__decoder* self, uint32_t a_fourcc, bool a_report)
{
} /* size: 0 */

// <048721B3> ../thirdparty/wuffs/wuffs-v0.4.c:6522
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__hasher_u64__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6523 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6535 */
	uint64_t checksum_u64(const wuffs_base__hasher_u64__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6540 */
	uint64_t get_quirk(const wuffs_base__hasher_u64__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6547 */
	wuffs_base__status set_quirk(wuffs_base__hasher_u64__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6555 */
	wuffs_base__empty_struct update(wuffs_base__hasher_u64__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6562 */
	uint64_t update_u64(wuffs_base__hasher_u64__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6531 */
	typedef struct unique_ptr<wuffs_base__hasher_u64__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <048D0EFC> ../thirdparty/wuffs/wuffs-v0.4.c:6527
// variable: 1
wuffs_base__status wuffs_qoi__decoder__tell_me_more(wuffs_qoi__decoder* self, wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{

ok: // 6557

exit: // 6559
	wuffs_base__status status; // 6551
} /* size: 0, variables: 1, goto labels: 2 */

// <048D0ED1> ../thirdparty/wuffs/wuffs-v0.4.c:6570
wuffs_base__range_ii_u64 wuffs_qoi__decoder__workbuf_len(const wuffs_qoi__decoder* self)
{
} /* size: 0 */

// <04872302> ../thirdparty/wuffs/wuffs-v0.4.c:6577
// member functions: 5
// member variables: 5
// struct size: 40
struct wuffs_base__hasher_bitvec256__func_ptrs__struct {
	wuffs_base__bitvec256 (*checksum_bitvec256)(const void* ); /* 0 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 8 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 16 8* /
	wuffs_base__empty_struct (*update)(void* , wuffs_base__slice_u8); /* 24 8* /
	wuffs_base__bitvec256 (*update_bitvec256)(void* , wuffs_base__slice_u8); /* 32 8* /
};

// <048723B6> ../thirdparty/wuffs/wuffs-v0.4.c:6629
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__hasher_bitvec256__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6630 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6642 */
	wuffs_base__bitvec256 checksum_bitvec256(const wuffs_base__hasher_bitvec256__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6647 */
	uint64_t get_quirk(const wuffs_base__hasher_bitvec256__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6654 */
	wuffs_base__status set_quirk(wuffs_base__hasher_bitvec256__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6662 */
	wuffs_base__empty_struct update(wuffs_base__hasher_bitvec256__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6669 */
	wuffs_base__bitvec256 update_bitvec256(wuffs_base__hasher_bitvec256__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6638 */
	typedef struct unique_ptr<wuffs_base__hasher_bitvec256__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <048D0E7F> ../thirdparty/wuffs/wuffs-v0.4.c:6637
wuffs_base__status wuffs_sha256__hasher__initialize(wuffs_sha256__hasher* self, size_t sizeof_star_self, uint64_t wuffs_version, uint32_t options)
{
} /* size: 0 */

// <048D0D75> ../thirdparty/wuffs/wuffs-v0.4.c:6684
// variable: 1
// function calls: 2
wuffs_sha256__hasher* wuffs_sha256__hasher__alloc(void)
{
	wuffs_sha256__hasher* x; // 6685
	wuffs_sha256__hasher__initialize(wuffs_sha256__hasher* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 6637
	wuffs_sha256__hasher__initialize(wuffs_sha256__hasher* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 6690
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <04872505> ../thirdparty/wuffs/wuffs-v0.4.c:6684
// member functions: 13
// member variables: 13
// struct size: 104
struct wuffs_base__image_decoder__func_ptrs__struct {
	wuffs_base__status (*decode_frame)(void* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* ); /* 0 8* /
	wuffs_base__status (*decode_frame_config)(void* , wuffs_base__frame_config* , wuffs_base__io_buffer* ); /* 8 8* /
	wuffs_base__status (*decode_image_config)(void* , wuffs_base__image_config* , wuffs_base__io_buffer* ); /* 16 8* /
	wuffs_base__rect_ie_u32 (*frame_dirty_rect)(const void* ); /* 24 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 32 8* /
	uint32_t (*num_animation_loops)(const void* ); /* 40 8* /
	uint64_t (*num_decoded_frame_configs)(const void* ); /* 48 8* /
	uint64_t (*num_decoded_frames)(const void* ); /* 56 8* /
	wuffs_base__status (*restart_frame)(void* , uint64_t, uint64_t); /* 64 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 72 8* /
	wuffs_base__empty_struct (*set_report_metadata)(void* , uint32_t, bool); /* 80 8* /
	wuffs_base__status (*tell_me_more)(void* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* ); /* 88 8* /
	wuffs_base__range_ii_u64 (*workbuf_len)(const void* ); /* 96 8* /
};

// <048D0D1C> ../thirdparty/wuffs/wuffs-v0.4.c:6709
uint64_t wuffs_sha256__hasher__get_quirk(const wuffs_sha256__hasher* self, uint32_t a_key)
{
} /* size: 0 */

// <048D0CD9> ../thirdparty/wuffs/wuffs-v0.4.c:6727
wuffs_base__status wuffs_sha256__hasher__set_quirk(wuffs_sha256__hasher* self, uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <0483EC7F> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6736
wuffs_base__status wuffs_base__image_decoder__decode_frame(wuffs_base__image_decoder *, wuffs_base__pixel_buffer *, wuffs_base__io_buffer *, wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options *)
{
} /* size: 0 */

// <048D0B9F> ../thirdparty/wuffs/wuffs-v0.4.c:6748
// variable: 1
// function calls: 3
wuffs_base__empty_wuffs_sha256__hasher__update(wuffs_sha256__hasher* self, wuffs_base__slice_u8 a_x)
{
	uint64_t v_new_lmu; // 6758
	wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
					uint64_t i);  // 6780
	wuffs_base__make_slice_u8(uint8_t* ptr,
					size_t len);  // 6783
	wuffs_base__make_empty_struct(void); // 6786
} /* size: 0, variables: 1, inline expansions: 3 (0 bytes) */

// <0483ED25> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6753
wuffs_base__status wuffs_base__image_decoder__decode_image_config(wuffs_base__image_decoder *, wuffs_base__image_config *, wuffs_base__io_buffer *)
{
} /* size: 0 */

// <048D09E4> ../thirdparty/wuffs/wuffs-v0.4.c:6793
// function calls: 2
wuffs_base__bitvec256 wuffs_sha256__hasher__update_bitvec256(wuffs_sha256__hasher* self, wuffs_base__slice_u8 a_x)
{
	wuffs_base__make_bitvec256(uint64_t e00,
					uint64_t e01,
					uint64_t e02,
					uint64_t e03);  // 6797
	wuffs_sha256__hasher__checksum_bitvec256(const wuffs_sha256__hasher* self); // 6804
} /* size: 0, inline expansions: 2 (0 bytes) */

// <048519B2> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6793
wuffs_base__status wuffs_base__image_decoder__set_quirk(wuffs_base__image_decoder *, uint32_t, uint64_t)
{
} /* size: 0 */

// <04930DB5> ../thirdparty/wuffs/wuffs-v0.4.c:6811
// variables: 21
// function calls: 2
wuffs_base__empty_wuffs_sha256__hasher__up(wuffs_sha256__hasher* self, wuffs_base__slice_u8 a_x)
{
	wuffs_base__slice_u8 v_p; // 6814
	uint32_t v_w; // 6815
	uint32_t v_w2; // 6816
	uint32_t v_w15; // 6817
	uint32_t v_s0; // 6818
	uint32_t v_s1; // 6819
	uint32_t v_t1; // 6820
	uint32_t v_t2; // 6821
	uint32_t v_a; // 6822
	uint32_t v_b; // 6823
	uint32_t v_c; // 6824
	uint32_t v_d; // 6825
	uint32_t v_e; // 6826
	uint32_t v_f; // 6827
	uint32_t v_g; // 6828
	uint32_t v_h; // 6829
	uint32_t v_i; // 6830
	uint32_t v_buf_len; // 6831
	{
		wuffs_base__slice_u8 i_slice_p; // 6842
		const uint8_t* i_end0_p; // 6845
		const uint8_t* i_end1_p; // 6958
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 6845
		wuffs_private_impl__ptr_u8_plus_len(const uint8_t* ptr,
							size_t len);  // 6958
	}
} /* size: 0, variables: 18 */

// <048D086D> ../thirdparty/wuffs/wuffs-v0.4.c:6811
// variables: 21
wuffs_base__empty_wuffs_sha256__hasher__up(wuffs_sha256__hasher* self, wuffs_base__slice_u8 a_x)
{
	wuffs_base__slice_u8 v_p; // 6814
	uint32_t v_w; // 6815
	uint32_t v_w2; // 6816
	uint32_t v_w15; // 6817
	uint32_t v_s0; // 6818
	uint32_t v_s1; // 6819
	uint32_t v_t1; // 6820
	uint32_t v_t2; // 6821
	uint32_t v_a; // 6822
	uint32_t v_b; // 6823
	uint32_t v_c; // 6824
	uint32_t v_d; // 6825
	uint32_t v_e; // 6826
	uint32_t v_f; // 6827
	uint32_t v_g; // 6828
	uint32_t v_h; // 6829
	uint32_t v_i; // 6830
	uint32_t v_buf_len; // 6831
	{
		wuffs_base__slice_u8 i_slice_p; // 6842
		const uint8_t* i_end0_p; // 6845
		const uint8_t* i_end1_p; // 6958
	}
} /* size: 0, variables: 18 */

// <0483ECCA> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6815
wuffs_base__range_ii_u64 wuffs_base__image_decoder__workbuf_len(const wuffs_base__image_decoder *)
{
} /* size: 0 */

// <0483D7E3> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6820
// member functions: 13
// member variable: 1
// struct size: 24
struct wuffs_base__image_decoder__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6821 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6833 */
	wuffs_base__status decode_frame(wuffs_base__image_decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6844 */
	wuffs_base__status decode_frame_config(wuffs_base__image_decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6852 */
	wuffs_base__status decode_image_config(wuffs_base__image_decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6860 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_base__image_decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6865 */
	uint64_t get_quirk(const wuffs_base__image_decoder__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6872 */
	uint32_t num_animation_loops(const wuffs_base__image_decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6877 */
	uint64_t num_decoded_frame_configs(const wuffs_base__image_decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6882 */
	uint64_t num_decoded_frames(const wuffs_base__image_decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6887 */
	wuffs_base__status restart_frame(wuffs_base__image_decoder__struct* , uint64_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6895 */
	wuffs_base__status set_quirk(wuffs_base__image_decoder__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6903 */
	wuffs_base__empty_struct set_report_metadata(wuffs_base__image_decoder__struct* , uint32_t, bool);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6911 */
	wuffs_base__status tell_me_more(wuffs_base__image_decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6920 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_base__image_decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6829 */
	typedef struct unique_ptr<wuffs_base__image_decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <0487272C> ../thirdparty/wuffs/wuffs-v0.4.c:6820
// member functions: 13
// member variable: 1
// struct size: 24
struct wuffs_base__image_decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6821 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6833 */
	wuffs_base__status decode_frame(wuffs_base__image_decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6844 */
	wuffs_base__status decode_frame_config(wuffs_base__image_decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6852 */
	wuffs_base__status decode_image_config(wuffs_base__image_decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6860 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_base__image_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6865 */
	uint64_t get_quirk(const wuffs_base__image_decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6872 */
	uint32_t num_animation_loops(const wuffs_base__image_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6877 */
	uint64_t num_decoded_frame_configs(const wuffs_base__image_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6882 */
	uint64_t num_decoded_frames(const wuffs_base__image_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6887 */
	wuffs_base__status restart_frame(wuffs_base__image_decoder__struct* , uint64_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6895 */
	wuffs_base__status set_quirk(wuffs_base__image_decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6903 */
	wuffs_base__empty_struct set_report_metadata(wuffs_base__image_decoder__struct* , uint32_t, bool);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6911 */
	wuffs_base__status tell_me_more(wuffs_base__image_decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6920 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_base__image_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6829 */
	typedef struct unique_ptr<wuffs_base__image_decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <04927037> ../thirdparty/wuffs/wuffs-v0.4.c:6833
inline void wuffs_base__image_decoder__struct::decode_frame(wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{
} /* size: 0 */

// <04927004> ../thirdparty/wuffs/wuffs-v0.4.c:6844
inline void wuffs_base__image_decoder__struct::decode_frame_config(wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{
} /* size: 0 */

// <04926FD1> ../thirdparty/wuffs/wuffs-v0.4.c:6852
inline void wuffs_base__image_decoder__struct::decode_image_config(wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{
} /* size: 0 */

// <04926F9E> ../thirdparty/wuffs/wuffs-v0.4.c:6895
inline void wuffs_base__image_decoder__struct::set_quirk(uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <04926F6B> ../thirdparty/wuffs/wuffs-v0.4.c:6903
inline void wuffs_base__image_decoder__struct::set_report_metadata(uint32_t a_fourcc, bool a_report)
{
} /* size: 0 */

// <04926F2B> ../thirdparty/wuffs/wuffs-v0.4.c:6911
inline void wuffs_base__image_decoder__struct::tell_me_more(wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{
} /* size: 0 */

// <04926F12> ../thirdparty/wuffs/wuffs-v0.4.c:6920
inline void wuffs_base__image_decoder__struct::workbuf_len()
{
} /* size: 0 */

// <048729D6> ../thirdparty/wuffs/wuffs-v0.4.c:6933
// member functions: 5
// member variables: 5
// struct size: 40
struct wuffs_base__io_transformer__func_ptrs__struct {
	wuffs_base__optional_u63 (*dst_history_retain_length)(const void* ); /* 0 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 8 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 16 8* /
	wuffs_base__status (*transform_io)(void* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8); /* 24 8* /
	wuffs_base__range_ii_u64 (*workbuf_len)(const void* ); /* 32 8* /
};

// <048D069E> ../thirdparty/wuffs/wuffs-v0.4.c:6974
// variables: 28
wuffs_base__bitvec256 wuffs_sha256__hasher__checksum_bitvec256(const wuffs_sha256__hasher* self)
{
	uint32_t v_buf_len; // 6984
	uint8_t v_buf_data; // 6985
	uint64_t v_length_in_bits; // 6986
	uint32_t v_w; // 6987
	uint32_t v_w2; // 6988
	uint32_t v_w15; // 6989
	uint32_t v_s0; // 6990
	uint32_t v_s1; // 6991
	uint32_t v_t1; // 6992
	uint32_t v_t2; // 6993
	uint32_t v_h0; // 6994
	uint32_t v_h1; // 6995
	uint32_t v_h2; // 6996
	uint32_t v_h3; // 6997
	uint32_t v_h4; // 6998
	uint32_t v_h5; // 6999
	uint32_t v_h6; // 7000
	uint32_t v_h7; // 7001
	uint32_t v_a; // 7002
	uint32_t v_b; // 7003
	uint32_t v_c; // 7004
	uint32_t v_d; // 7005
	uint32_t v_e; // 7006
	uint32_t v_f; // 7007
	uint32_t v_g; // 7008
	uint32_t v_h; // 7009
	uint32_t v_i; // 7010
	bool v_final_block; // 7011
} /* size: 0, variables: 28 */

// <0484F2D1> ../common/../thirdparty/wuffs/wuffs-v0.4.c:6987
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__io_transformer__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6988 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7000 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_base__io_transformer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7005 */
	uint64_t get_quirk(const wuffs_base__io_transformer__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7012 */
	wuffs_base__status set_quirk(wuffs_base__io_transformer__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7020 */
	wuffs_base__status transform_io(wuffs_base__io_transformer__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7029 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_base__io_transformer__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:6996 */
	typedef struct unique_ptr<wuffs_base__io_transformer__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <04872A94> ../thirdparty/wuffs/wuffs-v0.4.c:6987
// member functions: 5
// member variable: 1
// struct size: 24
struct wuffs_base__io_transformer__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6988 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7000 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_base__io_transformer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7005 */
	uint64_t get_quirk(const wuffs_base__io_transformer__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7012 */
	wuffs_base__status set_quirk(wuffs_base__io_transformer__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7020 */
	wuffs_base__status transform_io(wuffs_base__io_transformer__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7029 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_base__io_transformer__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:6996 */
	typedef struct unique_ptr<wuffs_base__io_transformer__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <04872BE8> ../thirdparty/wuffs/wuffs-v0.4.c:7042
// member functions: 4
// member variables: 4
// struct size: 32
struct wuffs_base__token_decoder__func_ptrs__struct {
	wuffs_base__status (*decode_tokens)(void* , wuffs_base__token_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8); /* 0 8* /
	uint64_t (*get_quirk)(const void* , uint32_t); /* 8 8* /
	wuffs_base__status (*set_quirk)(void* , uint32_t, uint64_t); /* 16 8* /
	wuffs_base__range_ii_u64 (*workbuf_len)(const void* ); /* 24 8* /
};

// <04872C86> ../thirdparty/wuffs/wuffs-v0.4.c:7089
// member functions: 4
// member variable: 1
// struct size: 24
struct wuffs_base__token_decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7090 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable first_vtable; /* 8 16 */
	} private_impl; /* 0 24 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7102 */
	wuffs_base__status decode_tokens(wuffs_base__token_decoder__struct* , wuffs_base__token_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7111 */
	uint64_t get_quirk(const wuffs_base__token_decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7118 */
	wuffs_base__status set_quirk(wuffs_base__token_decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7126 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_base__token_decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7098 */
	typedef struct unique_ptr<wuffs_base__token_decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
};

// <0484F423> ../common/../thirdparty/wuffs/wuffs-v0.4.c:7242
// member functions: 14
// member variables: 2
// struct size: 123,000,056
struct wuffs_adler32__hasher__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7250 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		bool f_started; /* 44 1 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_adler32__hasher* , wuffs_base__slice_u8); /* 48 8* /
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		bool f_started; /* 44 1 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_adler32__hasher* , wuffs_base__slice_u8); /* 48 8* /
	} private_impl; /* 0 56 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7266 */
	typedef struct unique_ptr<wuffs_adler32__hasher__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7271 */
	unique_ptr alloc(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7276 */
	unique_ptr alloc_as__wuffs_base__hasher_u32(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7294 */
	void wuffs_adler32__hasher__struct(wuffs_adler32__hasher__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7295 */
	void wuffs_adler32__hasher__struct(wuffs_adler32__hasher__struct* , const wuffs_adler32__hasher__struct& );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7296 */
	wuffs_adler32__hasher__struct& operator=(wuffs_adler32__hasher__struct* , const wuffs_adler32__hasher__struct& );
	uint8_t dead_weight[123000000]; /* 56 123000000 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7313 */
	wuffs_base__status initialize(wuffs_adler32__hasher__struct* , size_t, uint64_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7322 */
	wuffs_base__hasher_u32* upcast_as__wuffs_base__hasher_u32(wuffs_adler32__hasher__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7327 */
	uint64_t get_quirk(const wuffs_adler32__hasher__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7333 */
	wuffs_base__status set_quirk(wuffs_adler32__hasher__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7340 */
	wuffs_base__empty_struct update(wuffs_adler32__hasher__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7346 */
	uint32_t update_u32(wuffs_adler32__hasher__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:7352 */
	uint32_t checksum_u32(const wuffs_adler32__hasher__struct* );
};

// <04872DBB> ../thirdparty/wuffs/wuffs-v0.4.c:7242
// member functions: 11
// member variable: 1
// struct size: 56
struct wuffs_adler32__hasher__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7250 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		bool f_started; /* 44 1 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_adler32__hasher* , wuffs_base__slice_u8); /* 48 8* /
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		bool f_started; /* 44 1 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_adler32__hasher* , wuffs_base__slice_u8); /* 48 8* /
	} private_impl; /* 0 56 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7266 */
	typedef struct unique_ptr<wuffs_adler32__hasher__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7271 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7276 */
	unique_ptr alloc_as__wuffs_base__hasher_u32(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7313 */
	wuffs_base__status initialize(wuffs_adler32__hasher__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7322 */
	wuffs_base__hasher_u32* upcast_as__wuffs_base__hasher_u32(wuffs_adler32__hasher__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7327 */
	uint64_t get_quirk(const wuffs_adler32__hasher__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7333 */
	wuffs_base__status set_quirk(wuffs_adler32__hasher__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7340 */
	wuffs_base__empty_struct update(wuffs_adler32__hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7346 */
	uint32_t update_u32(wuffs_adler32__hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7352 */
	uint32_t checksum_u32(const wuffs_adler32__hasher__struct* );
};

// <048D064C> ../thirdparty/wuffs/wuffs-v0.4.c:7270
wuffs_base__status wuffs_targa__decoder__initialize(wuffs_targa__decoder* self, size_t sizeof_star_self, uint64_t wuffs_version, uint32_t options)
{
} /* size: 0 */

// <048D0541> ../thirdparty/wuffs/wuffs-v0.4.c:7317
// variable: 1
// function calls: 2
wuffs_targa__decoder* wuffs_targa__decoder__alloc(void)
{
	wuffs_targa__decoder* x; // 7318
	wuffs_targa__decoder__initialize(wuffs_targa__decoder* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 7270
	wuffs_targa__decoder__initialize(wuffs_targa__decoder* self,
					size_t sizeof_star_self,
					uint64_t wuffs_version,
					uint32_t options);  // 7323
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <048D051C> ../thirdparty/wuffs/wuffs-v0.4.c:7332
size_t sizeof__wuffs_targa__decoder(void)
{
} /* size: 0 */

// <048D04E8> ../thirdparty/wuffs/wuffs-v0.4.c:7342
uint64_t wuffs_targa__decoder__get_quirk(const wuffs_targa__decoder* self, uint32_t a_key)
{
} /* size: 0 */

// <048D04A5> ../thirdparty/wuffs/wuffs-v0.4.c:7360
wuffs_base__status wuffs_targa__decoder__set_quirk(wuffs_targa__decoder* self, uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <048D0404> ../thirdparty/wuffs/wuffs-v0.4.c:7381
// variables: 4
wuffs_base__status wuffs_targa__decoder__decode_image_config(wuffs_targa__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 7431

ok: // 7425

exit: // 7436
	wuffs_base__status status; // 7404
	wuffs_base__status v_status; // 7406
	uint32_t coro_susp_point; // 7408
	{
		wuffs_base__status t_0; // 7414
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <04926F03> ../thirdparty/wuffs/wuffs-v0.4.c:7414
inline wuffs_base__image_decoder* wuffs_bmp__decoder__alloc_as__wuffs_base__image_decoder(void)
{
} /* size: 0 */

// <048CFDD3> ../thirdparty/wuffs/wuffs-v0.4.c:7447
// variables: 36
// function calls: 6
wuffs_base__status wuffs_targa__decoder__do_decode_image_config(wuffs_targa__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 7877

suspend: // 7883

exit: // 7888
	wuffs_base__status status; // 7451
	uint32_t v_c32; // 7453
	uint32_t v_c5; // 7454
	uint32_t v_i; // 7455
	const uint8_t* iop_a_src; // 7457
	const uint8_t* io0_a_src; // 7458
	const uint8_t* io1_a_src; // 7459
	const uint8_t* io2_a_src; // 7460
	uint32_t coro_susp_point; // 7468
	{
		uint8_t t_0; // 7485
	}
	{
		uint8_t t_1; // 7494
	}
	{
		uint8_t t_2; // 7507
	}
	{
		uint16_t t_3; // 7522
		{
			uint64_t* scratch; // 7534
			uint32_t num_bits_3; // 7535
		}
	}
	{
		uint16_t t_4; // 7551
		{
			uint64_t* scratch; // 7563
			uint32_t num_bits_4; // 7564
		}
	}
	{
		uint8_t t_5; // 7584
	}
	{
		uint32_t t_6; // 7615
		{
			uint64_t* scratch; // 7627
			uint32_t num_bits_6; // 7628
		}
	}
	{
		uint32_t t_7; // 7644
		{
			uint64_t* scratch; // 7656
			uint32_t num_bits_7; // 7657
		}
	}
	{
		uint8_t t_8; // 7677
	}
	{
		uint8_t t_9; // 7729
	}
	{
		uint32_t t_10; // 7750
		{
			uint64_t* scratch; // 7762
			uint32_t num_bits_10; // 7763
		}
		wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p); // 7752
	}
	{
		uint32_t t_11; // 7784
		{
			uint64_t* scratch; // 7796
			uint32_t num_bits_11; // 7797
		}
		wuffs_base__peek_u32le__no_bounds_check(const uint8_t* p); // 7786
	}
	{
		uint32_t t_12; // 7818
		{
			uint64_t* scratch; // 7830
			uint32_t num_bits_12; // 7831
		}
	}
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 7863
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 4963
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 7865
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 7884
} /* size: 0, variables: 9, goto labels: 3, inline expansions: 4 (0 bytes) */

// <048731EB> ../thirdparty/wuffs/wuffs-v0.4.c:7525
// member functions: 17
// member variables: 2
// struct size: 3,312
struct wuffs_bmp__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7533 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint8_t f_call_sequence; /* 48 1 */
		bool f_top_down; /* 49 1 */
		uint32_t f_pad_per_row; /* 52 4 */
		uint32_t f_src_pixfmt; /* 56 4 */
		uint32_t f_io_redirect_fourcc; /* 60 4 */
		uint64_t f_io_redirect_pos; /* 64 8 */
		uint64_t f_frame_config_io_position; /* 72 8 */
		uint32_t f_bitmap_info_len; /* 80 4 */
		uint32_t f_padding; /* 84 4 */
		uint32_t f_bits_per_pixel; /* 88 4 */
		uint32_t f_compression; /* 92 4 */
		uint32_t f_channel_masks[4]; /* 96 16 */
		uint8_t f_channel_shifts[4]; /* 112 4 */
		uint8_t f_channel_num_bits[4]; /* 116 4 */
		uint32_t f_dst_x; /* 120 4 */
		uint32_t f_dst_y; /* 124 4 */
		uint32_t f_dst_y_inc; /* 128 4 */
		uint32_t f_pending_pad; /* 132 4 */
		uint32_t f_rle_state; /* 136 4 */
		uint32_t f_rle_length; /* 140 4 */
		uint8_t f_rle_delta_x; /* 144 1 */
		bool f_rle_padded; /* 145 1 */
		wuffs_base__pixel_swizzler f_swizzler; /* 152 24 */
		uint32_t p_decode_image_config; /* 176 4 */
		uint32_t p_do_decode_image_config; /* 180 4 */
		uint32_t p_decode_frame_config; /* 184 4 */
		uint32_t p_do_decode_frame_config; /* 188 4 */
		uint32_t p_decode_frame; /* 192 4 */
		uint32_t p_do_decode_frame; /* 196 4 */
		uint32_t p_tell_me_more; /* 200 4 */
		uint32_t p_read_palette; /* 204 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7575 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7579 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7582 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7585 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		uint8_t f_scratch[2048]; /* 0 2048 */
		uint8_t f_src_palette[1024]; /* 2048 1024 */
		struct {
			uint64_t scratch; /* 3072 8 */
		} s_do_decode_image_config; /* 3072 8 */
		struct {
			uint64_t scratch; /* 3080 8 */
		} s_do_decode_frame; /* 3080 8 */
		struct {
			uint32_t v_i; /* 3088 4 */
			uint64_t scratch; /* 3096 8 */
		} s_read_palette; /* 3088 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint8_t f_call_sequence; /* 48 1 */
		bool f_top_down; /* 49 1 */
		uint32_t f_pad_per_row; /* 52 4 */
		uint32_t f_src_pixfmt; /* 56 4 */
		uint32_t f_io_redirect_fourcc; /* 60 4 */
		uint64_t f_io_redirect_pos; /* 64 8 */
		uint64_t f_frame_config_io_position; /* 72 8 */
		uint32_t f_bitmap_info_len; /* 80 4 */
		uint32_t f_padding; /* 84 4 */
		uint32_t f_bits_per_pixel; /* 88 4 */
		uint32_t f_compression; /* 92 4 */
		uint32_t f_channel_masks[4]; /* 96 16 */
		uint8_t f_channel_shifts[4]; /* 112 4 */
		uint8_t f_channel_num_bits[4]; /* 116 4 */
		uint32_t f_dst_x; /* 120 4 */
		uint32_t f_dst_y; /* 124 4 */
		uint32_t f_dst_y_inc; /* 128 4 */
		uint32_t f_pending_pad; /* 132 4 */
		uint32_t f_rle_state; /* 136 4 */
		uint32_t f_rle_length; /* 140 4 */
		uint8_t f_rle_delta_x; /* 144 1 */
		bool f_rle_padded; /* 145 1 */
		wuffs_base__pixel_swizzler f_swizzler; /* 152 24 */
		uint32_t p_decode_image_config; /* 176 4 */
		uint32_t p_do_decode_image_config; /* 180 4 */
		uint32_t p_decode_frame_config; /* 184 4 */
		uint32_t p_do_decode_frame_config; /* 188 4 */
		uint32_t p_decode_frame; /* 192 4 */
		uint32_t p_do_decode_frame; /* 196 4 */
		uint32_t p_tell_me_more; /* 200 4 */
		uint32_t p_read_palette; /* 204 4 */
	} private_impl; /* 0 208 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7579 */
		struct {
			uint64_t scratch; /* 208 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7582 */
		struct {
			uint64_t scratch; /* 208 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7585 */
		struct {
			uint32_t v_i; /* 208 4 */
			uint64_t scratch; /* 216 8 */
		};
		uint8_t f_scratch[2048]; /* 208 2048 */
		uint8_t f_src_palette[1024]; /* 2256 1024 */
		struct {
			uint64_t scratch; /* 3280 8 */
		} s_do_decode_image_config; /* 3280 8 */
		struct {
			uint64_t scratch; /* 3288 8 */
		} s_do_decode_frame; /* 3288 8 */
		struct {
			uint32_t v_i; /* 3296 4 */
			uint64_t scratch; /* 3304 8 */
		} s_read_palette; /* 3296 16 */
	} private_data; /* 208 3104 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7593 */
	typedef struct unique_ptr<wuffs_bmp__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7598 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7603 */
	unique_ptr alloc_as__wuffs_base__image_decoder(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7640 */
	wuffs_base__status initialize(wuffs_bmp__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7649 */
	wuffs_base__image_decoder* upcast_as__wuffs_base__image_decoder(wuffs_bmp__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7654 */
	uint64_t get_quirk(const wuffs_bmp__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7660 */
	wuffs_base__status set_quirk(wuffs_bmp__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7667 */
	wuffs_base__status decode_image_config(wuffs_bmp__decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7674 */
	wuffs_base__status decode_frame_config(wuffs_bmp__decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7681 */
	wuffs_base__status decode_frame(wuffs_bmp__decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7691 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_bmp__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7696 */
	uint32_t num_animation_loops(const wuffs_bmp__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7701 */
	uint64_t num_decoded_frame_configs(const wuffs_bmp__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7706 */
	uint64_t num_decoded_frames(const wuffs_bmp__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7711 */
	wuffs_base__status restart_frame(wuffs_bmp__decoder__struct* , uint64_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7718 */
	wuffs_base__empty_struct set_report_metadata(wuffs_bmp__decoder__struct* , uint32_t, bool);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7725 */
	wuffs_base__status tell_me_more(wuffs_bmp__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7733 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_bmp__decoder__struct* );
};

// <04926EFC> ../thirdparty/wuffs/wuffs-v0.4.c:7603
inline void alloc_as__wuffs_base__image_decoder(void)
{
} /* size: 0 */

// <04873A85> ../thirdparty/wuffs/wuffs-v0.4.c:7860
// member functions: 9
// member variables: 2
// struct size: 4,238,080
struct wuffs_bzip2__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7868 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint32_t f_max_incl_block_size; /* 48 4 */
		uint32_t f_block_size; /* 52 4 */
		bool f_decode_huffman_finished; /* 56 1 */
		uint8_t f_decode_huffman_which; /* 57 1 */
		uint32_t f_decode_huffman_ticks; /* 60 4 */
		uint32_t f_decode_huffman_section; /* 64 4 */
		uint32_t f_decode_huffman_run_shift; /* 68 4 */
		uint32_t f_flush_pointer; /* 72 4 */
		uint32_t f_flush_repeat_count; /* 76 4 */
		uint8_t f_flush_prev; /* 80 1 */
		bool f_ignore_checksum; /* 81 1 */
		uint32_t f_final_checksum_have; /* 84 4 */
		uint32_t f_block_checksum_have; /* 88 4 */
		uint32_t f_block_checksum_want; /* 92 4 */
		uint32_t f_original_pointer; /* 96 4 */
		uint32_t f_num_symbols; /* 100 4 */
		uint32_t f_num_huffman_codes; /* 104 4 */
		uint32_t f_num_sections; /* 108 4 */
		uint32_t f_code_lengths_bitmask; /* 112 4 */
		uint32_t p_transform_io; /* 116 4 */
		uint32_t p_do_transform_io; /* 120 4 */
		uint32_t p_prepare_block; /* 124 4 */
		uint32_t p_read_code_lengths; /* 128 4 */
		uint32_t p_flush_slow; /* 132 4 */
		uint32_t p_decode_huffman_slow; /* 136 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7904 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7914 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t v_tag; /* 8 8 */
			uint32_t v_final_checksum_want; /* 16 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7919 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint32_t v_selector; /* 4 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7923 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint32_t v_code_length; /* 4 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7927 */
		struct {
			uint32_t v_flush_pointer; /* 0 4 */
			uint32_t v_flush_repeat_count; /* 4 4 */
			uint8_t v_flush_prev; /* 8 1 */
			uint32_t v_block_checksum_have; /* 12 4 */
			uint32_t v_block_size; /* 16 4 */
			uint8_t v_curr; /* 20 1 */
			uint64_t scratch; /* 24 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7936 */
		struct {
			uint32_t v_node_index; /* 0 4 */
		};
		uint32_t f_scratch; /* 0 4 */
		uint32_t f_letter_counts[256]; /* 4 1024 */
		uint8_t f_presence[256]; /* 1028 256 */
		uint8_t f_mtft[256]; /* 1284 256 */
		uint8_t f_huffman_selectors[32768]; /* 1540 32768 */
		uint16_t f_huffman_trees[6][257][2]; /* 34308 6168 */
		uint16_t f_huffman_tables[6][256]; /* 40476 3072 */
		uint32_t f_bwt[1048576]; /* 43548 4194304 */
		struct {
			uint32_t v_i; /* 4237856 4 */
			uint64_t v_tag; /* 4237864 8 */
			uint32_t v_final_checksum_want; /* 4237872 4 */
		} s_do_transform_io; /* 4237856 24 */
		struct {
			uint32_t v_i; /* 4237880 4 */
			uint32_t v_selector; /* 4237884 4 */
		} s_prepare_block; /* 4237880 8 */
		struct {
			uint32_t v_i; /* 4237888 4 */
			uint32_t v_code_length; /* 4237892 4 */
		} s_read_code_lengths; /* 4237888 8 */
		struct {
			uint32_t v_flush_pointer; /* 4237896 4 */
			uint32_t v_flush_repeat_count; /* 4237900 4 */
			uint8_t v_flush_prev; /* 4237904 1 */
			uint32_t v_block_checksum_have; /* 4237908 4 */
			uint32_t v_block_size; /* 4237912 4 */
			uint8_t v_curr; /* 4237916 1 */
			uint64_t scratch; /* 4237920 8 */
		} s_flush_slow; /* 4237896 32 */
		struct {
			uint32_t v_node_index; /* 4237928 4 */
		} s_decode_huffman_slow; /* 4237928 4 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint32_t f_max_incl_block_size; /* 48 4 */
		uint32_t f_block_size; /* 52 4 */
		bool f_decode_huffman_finished; /* 56 1 */
		uint8_t f_decode_huffman_which; /* 57 1 */
		uint32_t f_decode_huffman_ticks; /* 60 4 */
		uint32_t f_decode_huffman_section; /* 64 4 */
		uint32_t f_decode_huffman_run_shift; /* 68 4 */
		uint32_t f_flush_pointer; /* 72 4 */
		uint32_t f_flush_repeat_count; /* 76 4 */
		uint8_t f_flush_prev; /* 80 1 */
		bool f_ignore_checksum; /* 81 1 */
		uint32_t f_final_checksum_have; /* 84 4 */
		uint32_t f_block_checksum_have; /* 88 4 */
		uint32_t f_block_checksum_want; /* 92 4 */
		uint32_t f_original_pointer; /* 96 4 */
		uint32_t f_num_symbols; /* 100 4 */
		uint32_t f_num_huffman_codes; /* 104 4 */
		uint32_t f_num_sections; /* 108 4 */
		uint32_t f_code_lengths_bitmask; /* 112 4 */
		uint32_t p_transform_io; /* 116 4 */
		uint32_t p_do_transform_io; /* 120 4 */
		uint32_t p_prepare_block; /* 124 4 */
		uint32_t p_read_code_lengths; /* 128 4 */
		uint32_t p_flush_slow; /* 132 4 */
		uint32_t p_decode_huffman_slow; /* 136 4 */
	} private_impl; /* 0 144 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7914 */
		struct {
			uint32_t v_i; /* 144 4 */
			uint64_t v_tag; /* 152 8 */
			uint32_t v_final_checksum_want; /* 160 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7919 */
		struct {
			uint32_t v_i; /* 144 4 */
			uint32_t v_selector; /* 148 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7923 */
		struct {
			uint32_t v_i; /* 144 4 */
			uint32_t v_code_length; /* 148 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7927 */
		struct {
			uint32_t v_flush_pointer; /* 144 4 */
			uint32_t v_flush_repeat_count; /* 148 4 */
			uint8_t v_flush_prev; /* 152 1 */
			uint32_t v_block_checksum_have; /* 156 4 */
			uint32_t v_block_size; /* 160 4 */
			uint8_t v_curr; /* 164 1 */
			uint64_t scratch; /* 168 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:7936 */
		struct {
			uint32_t v_node_index; /* 144 4 */
		};
		uint32_t f_scratch; /* 144 4 */
		uint32_t f_letter_counts[256]; /* 148 1024 */
		uint8_t f_presence[256]; /* 1172 256 */
		uint8_t f_mtft[256]; /* 1428 256 */
		uint8_t f_huffman_selectors[32768]; /* 1684 32768 */
		uint16_t f_huffman_trees[6][257][2]; /* 34452 6168 */
		uint16_t f_huffman_tables[6][256]; /* 40620 3072 */
		uint32_t f_bwt[1048576]; /* 43692 4194304 */
		struct {
			uint32_t v_i; /* 4238000 4 */
			uint64_t v_tag; /* 4238008 8 */
			uint32_t v_final_checksum_want; /* 4238016 4 */
		} s_do_transform_io; /* 4238000 24 */
		struct {
			uint32_t v_i; /* 4238024 4 */
			uint32_t v_selector; /* 4238028 4 */
		} s_prepare_block; /* 4238024 8 */
		struct {
			uint32_t v_i; /* 4238032 4 */
			uint32_t v_code_length; /* 4238036 4 */
		} s_read_code_lengths; /* 4238032 8 */
		struct {
			uint32_t v_flush_pointer; /* 4238040 4 */
			uint32_t v_flush_repeat_count; /* 4238044 4 */
			uint8_t v_flush_prev; /* 4238048 1 */
			uint32_t v_block_checksum_have; /* 4238052 4 */
			uint32_t v_block_size; /* 4238056 4 */
			uint8_t v_curr; /* 4238060 1 */
			uint64_t scratch; /* 4238064 8 */
		} s_flush_slow; /* 4238040 32 */
		struct {
			uint32_t v_node_index; /* 4238072 4 */
		} s_decode_huffman_slow; /* 4238072 4 */
	} private_data; /* 144 4237936 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7943 */
	typedef struct unique_ptr<wuffs_bzip2__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7948 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7953 */
	unique_ptr alloc_as__wuffs_base__io_transformer(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7990 */
	wuffs_base__status initialize(wuffs_bzip2__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:7999 */
	wuffs_base__io_transformer* upcast_as__wuffs_base__io_transformer(wuffs_bzip2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8004 */
	uint64_t get_quirk(const wuffs_bzip2__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8010 */
	wuffs_base__status set_quirk(wuffs_bzip2__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8017 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_bzip2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8022 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_bzip2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8027 */
	wuffs_base__status transform_io(wuffs_bzip2__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
};

// <048CFD32> ../thirdparty/wuffs/wuffs-v0.4.c:7900
// variables: 4
wuffs_base__status wuffs_targa__decoder__decode_frame_config(wuffs_targa__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 7950

ok: // 7944

exit: // 7955
	wuffs_base__status status; // 7923
	wuffs_base__status v_status; // 7925
	uint32_t coro_susp_point; // 7927
	{
		wuffs_base__status t_0; // 7933
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <048CFAD7> ../thirdparty/wuffs/wuffs-v0.4.c:7966
// variables: 6
// function calls: 3
wuffs_base__status wuffs_targa__decoder__do_decode_frame_config(wuffs_targa__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 8031

exit: // 8041

suspend: // 8037
	wuffs_base__status status; // 7970
	const uint8_t* iop_a_src; // 7972
	const uint8_t* io0_a_src; // 7973
	const uint8_t* io1_a_src; // 7974
	const uint8_t* io2_a_src; // 7975
	uint32_t coro_susp_point; // 7983
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 8038
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 8001
	wuffs_base__frame_config__set(wuffs_base__frame_config* c,
					wuffs_base__rect_ie_u32 bounds,
					wuffs_base__flicks duration,
					uint64_t index,
					uint64_t io_position,
					wuffs_base__animation_disposal disposal,
					bool opaque_within_bounds,
					bool overwrite_instead_of_blend,
					wuffs_base__color_u32_argb_premul background_color);  // 8014
} /* size: 0, variables: 6, goto labels: 3, inline expansions: 3 (0 bytes) */

// <048CED2D> ../thirdparty/wuffs/wuffs-v0.4.c:8053
// variables: 6
// function calls: 46
wuffs_base__status wuffs_targa__decoder__decode_frame(wuffs_targa__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

suspend: // 8111

ok: // 8105

exit: // 8116
	wuffs_base__status status; // 8079
	wuffs_base__status v_status; // 8081
	uint32_t coro_susp_point; // 8083
	{
		wuffs_base__status t_0; // 8089

label__resume__continue: // 8231

exit: // 8440

ok: // 8422

suspend: // 8428
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 5520
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 8233
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5497
		{
			wuffs_base__table_u8* tab; // 5498
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5504
		}
		wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb,
								wuffs_base__slice_u8 fallback);  // 8234
		wuffs_base__make_slice_u8(uint8_t* ptr,
						size_t len);  // 17364
		wuffs_private_impl__table_u8__row_u32(wuffs_base__table_u8 t,
							uint32_t y);  // 8236
		wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
						uint64_t i);  // 8239
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8286
		wuffs_base__u64__min(uint64_t x,
					uint64_t y);  // 8248
		wuffs_private_impl__io__since(uint64_t mark,
						uint64_t index,
						const uint8_t* ptr);  // 8260
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 8260
		wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
						uint64_t i);  // 8262
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 8357
		wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
						uint64_t i);  // 8359
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8326
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8328
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8330
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8332
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 8275
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 8365
		wuffs_base__slice_u8__subslice_i(wuffs_base__slice_u8 s,
						uint64_t i);  // 8367
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8376
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 8429
		wuffs_base__make_slice_u8(uint8_t* ptr,
						size_t len);  // 8200
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5497
		{
			wuffs_base__table_u8* tab; // 5498
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5504
		}
		wuffs_base__pixel_buffer__palette_or_else(wuffs_base__pixel_buffer* pb,
								wuffs_base__slice_u8 fallback);  // 8202
		wuffs_base__make_pixel_format(uint32_t repr); // 8202
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 8202
		wuffs_base__status__is_ok(const wuffs_base__status* z); // 8208
		wuffs_base__status__is_error(const wuffs_base__status* z); // 8210
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 8212
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8302
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8312
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8314
		wuffs_base__peek_u8__no_bounds_check(const uint8_t* p); // 8316
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 8218
		wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f); // 8219
		wuffs_targa__decoder__do_decode_frame(wuffs_targa__decoder* self,
							wuffs_base__pixel_buffer* a_dst,
							wuffs_base__io_buffer* a_src,
							wuffs_base__pixel_blend a_blend,
							wuffs_base__slice_u8 a_workbuf,
							wuffs_base__decode_frame_options* a_opts);  // 8089
	}
	wuffs_base__make_status(const char* repr); // 8064
	wuffs_base__status__is_error(const wuffs_base__status* z); // 8117
	wuffs_base__make_status(const char* repr); // 8061
	wuffs_base__make_status(const char* repr); // 8071
	wuffs_base__make_status(const char* repr); // 8076
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 8113
} /* size: 0, variables: 3, goto labels: 3, inline expansions: 6 (0 bytes) */

// <048CEB0D> ../thirdparty/wuffs/wuffs-v0.4.c:8127
// variables: 26
wuffs_base__status wuffs_targa__decoder__do_decode_frame(wuffs_targa__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

label__resume__continue: // 8231

exit: // 8440

ok: // 8422

suspend: // 8428
	wuffs_base__status status; // 8134
	wuffs_base__status v_status; // 8136
	wuffs_base__pixel_format v_dst_pixfmt; // 8137
	uint32_t v_dst_bits_per_pixel; // 8138
	uint64_t v_dst_bytes_per_pixel; // 8139
	uint32_t v_dst_x; // 8140
	uint32_t v_dst_y; // 8141
	wuffs_base__table_u8 v_tab; // 8142
	wuffs_base__slice_u8 v_dst_palette; // 8143
	wuffs_base__slice_u8 v_dst; // 8144
	uint64_t v_dst_start; // 8145
	wuffs_base__slice_u8 v_src_palette; // 8146
	uint64_t v_mark; // 8147
	uint64_t v_num_pixels64; // 8148
	uint32_t v_num_pixels32; // 8149
	uint32_t v_lit_length; // 8150
	uint32_t v_run_length; // 8151
	uint64_t v_num_dst_bytes; // 8152
	uint32_t v_num_src_bytes; // 8153
	uint32_t v_c32; // 8154
	uint32_t v_c5; // 8155
	const uint8_t* iop_a_src; // 8157
	const uint8_t* io0_a_src; // 8158
	const uint8_t* io1_a_src; // 8159
	const uint8_t* io2_a_src; // 8160
	uint32_t coro_susp_point; // 8168
} /* size: 0, variables: 26, goto labels: 4 */

// <04874265> ../thirdparty/wuffs/wuffs-v0.4.c:8159
// member functions: 8
// member variables: 2
// struct size: 8,512
struct wuffs_cbor__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8167 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__token_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		bool f_end_of_data; /* 40 1 */
		uint32_t p_decode_tokens; /* 44 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8178 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8182 */
		struct {
			uint64_t v_string_length; /* 0 8 */
			uint32_t v_depth; /* 8 4 */
			bool v_tagged; /* 12 1 */
			uint8_t v_indefinite_string_major_type; /* 13 1 */
		};
		uint32_t f_stack[64]; /* 0 256 */
		uint64_t f_container_num_remaining[1024]; /* 256 8192 */
		struct {
			uint64_t v_string_length; /* 8448 8 */
			uint32_t v_depth; /* 8456 4 */
			bool v_tagged; /* 8460 1 */
			uint8_t v_indefinite_string_major_type; /* 8461 1 */
		} s_decode_tokens; /* 8448 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__token_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		bool f_end_of_data; /* 40 1 */
		uint32_t p_decode_tokens; /* 44 4 */
	} private_impl; /* 0 48 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8182 */
		struct {
			uint64_t v_string_length; /* 48 8 */
			uint32_t v_depth; /* 56 4 */
			bool v_tagged; /* 60 1 */
			uint8_t v_indefinite_string_major_type; /* 61 1 */
		};
		uint32_t f_stack[64]; /* 48 256 */
		uint64_t f_container_num_remaining[1024]; /* 304 8192 */
		struct {
			uint64_t v_string_length; /* 8496 8 */
			uint32_t v_depth; /* 8504 4 */
			bool v_tagged; /* 8508 1 */
			uint8_t v_indefinite_string_major_type; /* 8509 1 */
		} s_decode_tokens; /* 8496 16 */
	} private_data; /* 48 8464 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8192 */
	typedef struct unique_ptr<wuffs_cbor__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8197 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8202 */
	unique_ptr alloc_as__wuffs_base__token_decoder(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8239 */
	wuffs_base__status initialize(wuffs_cbor__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8248 */
	wuffs_base__token_decoder* upcast_as__wuffs_base__token_decoder(wuffs_cbor__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8253 */
	uint64_t get_quirk(const wuffs_cbor__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8259 */
	wuffs_base__status set_quirk(wuffs_cbor__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8266 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_cbor__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8271 */
	wuffs_base__status decode_tokens(wuffs_cbor__decoder__struct* , wuffs_base__token_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
};

// <04926EF5> ../thirdparty/wuffs/wuffs-v0.4.c:8197
inline void alloc(void)
{
} /* size: 0 */

// <04926EC2> ../thirdparty/wuffs/wuffs-v0.4.c:8259
inline void wuffs_cbor__decoder__struct::set_quirk(uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <04926E82> ../thirdparty/wuffs/wuffs-v0.4.c:8271
inline void wuffs_cbor__decoder__struct::decode_tokens(wuffs_base__token_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__slice_u8 a_workbuf)
{
} /* size: 0 */

// <0484FA7E> ../common/../thirdparty/wuffs/wuffs-v0.4.c:8386
// member functions: 14
// member variables: 2
// struct size: 123,000,056
struct wuffs_crc32__ieee_hasher__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8394 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc32__ieee_hasher* , wuffs_base__slice_u8); /* 48 8* /
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc32__ieee_hasher* , wuffs_base__slice_u8); /* 48 8* /
	} private_impl; /* 0 56 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8409 */
	typedef struct unique_ptr<wuffs_crc32__ieee_hasher__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8414 */
	unique_ptr alloc(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8419 */
	unique_ptr alloc_as__wuffs_base__hasher_u32(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8437 */
	void wuffs_crc32__ieee_hasher__struct(wuffs_crc32__ieee_hasher__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8438 */
	void wuffs_crc32__ieee_hasher__struct(wuffs_crc32__ieee_hasher__struct* , const wuffs_crc32__ieee_hasher__struct& );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8439 */
	wuffs_crc32__ieee_hasher__struct& operator=(wuffs_crc32__ieee_hasher__struct* , const wuffs_crc32__ieee_hasher__struct& );
	uint8_t dead_weight[123000000]; /* 56 123000000 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8456 */
	wuffs_base__status initialize(wuffs_crc32__ieee_hasher__struct* , size_t, uint64_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8465 */
	wuffs_base__hasher_u32* upcast_as__wuffs_base__hasher_u32(wuffs_crc32__ieee_hasher__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8470 */
	uint64_t get_quirk(const wuffs_crc32__ieee_hasher__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8476 */
	wuffs_base__status set_quirk(wuffs_crc32__ieee_hasher__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8483 */
	wuffs_base__empty_struct update(wuffs_crc32__ieee_hasher__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8489 */
	uint32_t update_u32(wuffs_crc32__ieee_hasher__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8495 */
	uint32_t checksum_u32(const wuffs_crc32__ieee_hasher__struct* );
};

// <048746AB> ../thirdparty/wuffs/wuffs-v0.4.c:8386
// member functions: 11
// member variable: 1
// struct size: 56
struct wuffs_crc32__ieee_hasher__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8394 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc32__ieee_hasher* , wuffs_base__slice_u8); /* 48 8* /
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u32; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_state; /* 40 4 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc32__ieee_hasher* , wuffs_base__slice_u8); /* 48 8* /
	} private_impl; /* 0 56 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8409 */
	typedef struct unique_ptr<wuffs_crc32__ieee_hasher__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8414 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8419 */
	unique_ptr alloc_as__wuffs_base__hasher_u32(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8456 */
	wuffs_base__status initialize(wuffs_crc32__ieee_hasher__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8465 */
	wuffs_base__hasher_u32* upcast_as__wuffs_base__hasher_u32(wuffs_crc32__ieee_hasher__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8470 */
	uint64_t get_quirk(const wuffs_crc32__ieee_hasher__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8476 */
	wuffs_base__status set_quirk(wuffs_crc32__ieee_hasher__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8483 */
	wuffs_base__empty_struct update(wuffs_crc32__ieee_hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8489 */
	uint32_t update_u32(wuffs_crc32__ieee_hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8495 */
	uint32_t checksum_u32(const wuffs_crc32__ieee_hasher__struct* );
};

// <048CEAE8> ../thirdparty/wuffs/wuffs-v0.4.c:8452
wuffs_base__rect_ie_u32 wuffs_targa__decoder__frame_dirty_rect(const wuffs_targa__decoder* self)
{
} /* size: 0 */

// <048CEAC3> ../thirdparty/wuffs/wuffs-v0.4.c:8473
uint32_t wuffs_targa__decoder__num_animation_loops(const wuffs_targa__decoder* self)
{
} /* size: 0 */

// <048CEA9E> ../thirdparty/wuffs/wuffs-v0.4.c:8490
uint64_t wuffs_targa__decoder__num_decoded_frame_configs(const wuffs_targa__decoder* self)
{
} /* size: 0 */

// <048CEA79> ../thirdparty/wuffs/wuffs-v0.4.c:8510
uint64_t wuffs_targa__decoder__num_decoded_frames(const wuffs_targa__decoder* self)
{
} /* size: 0 */

// <048CEA36> ../thirdparty/wuffs/wuffs-v0.4.c:8530
wuffs_base__status wuffs_targa__decoder__restart_frame(wuffs_targa__decoder* self, uint64_t a_index, uint64_t a_io_position)
{
} /* size: 0 */

// <048CE9F3> ../thirdparty/wuffs/wuffs-v0.4.c:8559
wuffs_base__empty_wuffs_targa__decoder__set_report_metadata(wuffs_targa__decoder* self, uint32_t a_fourcc, bool a_report)
{
} /* size: 0 */

// <048CE977> ../thirdparty/wuffs/wuffs-v0.4.c:8570
// variable: 1
wuffs_base__status wuffs_targa__decoder__tell_me_more(wuffs_targa__decoder* self, wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{

ok: // 8600

exit: // 8602
	wuffs_base__status status; // 8594
} /* size: 0, variables: 1, goto labels: 2 */

// <04874983> ../thirdparty/wuffs/wuffs-v0.4.c:8607
// member functions: 11
// member variable: 1
// struct size: 56
struct wuffs_crc64__ecma_hasher__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8615 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u64; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint64_t f_state; /* 40 8 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc64__ecma_hasher* , wuffs_base__slice_u8); /* 48 8* /
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__hasher_u64; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint64_t f_state; /* 40 8 */
		wuffs_base__empty_struct (*choosy_up)(wuffs_crc64__ecma_hasher* , wuffs_base__slice_u8); /* 48 8* /
	} private_impl; /* 0 56 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8630 */
	typedef struct unique_ptr<wuffs_crc64__ecma_hasher__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8635 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8640 */
	unique_ptr alloc_as__wuffs_base__hasher_u64(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8677 */
	wuffs_base__status initialize(wuffs_crc64__ecma_hasher__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8686 */
	wuffs_base__hasher_u64* upcast_as__wuffs_base__hasher_u64(wuffs_crc64__ecma_hasher__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8691 */
	uint64_t get_quirk(const wuffs_crc64__ecma_hasher__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8697 */
	wuffs_base__status set_quirk(wuffs_crc64__ecma_hasher__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8704 */
	wuffs_base__empty_struct update(wuffs_crc64__ecma_hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8710 */
	uint64_t update_u64(wuffs_crc64__ecma_hasher__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8716 */
	uint64_t checksum_u64(const wuffs_crc64__ecma_hasher__struct* );
};

// <048CE94C> ../thirdparty/wuffs/wuffs-v0.4.c:8613
wuffs_base__range_ii_u64 wuffs_targa__decoder__workbuf_len(const wuffs_targa__decoder* self)
{
} /* size: 0 */

// <0484FDD4> ../common/../thirdparty/wuffs/wuffs-v0.4.c:8854
// member functions: 15
// member variables: 3
// struct size: 123,041,760
struct wuffs_deflate__decoder__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8862 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint64_t f_transformed_history_count; /* 48 8 */
		uint32_t f_history_index; /* 56 4 */
		uint32_t f_n_huffs_bits[2]; /* 60 8 */
		bool f_end_of_block; /* 68 1 */
		uint32_t p_transform_io; /* 72 4 */
		uint32_t p_do_transform_io; /* 76 4 */
		uint32_t p_decode_blocks; /* 80 4 */
		uint32_t p_decode_uncompressed; /* 84 4 */
		uint32_t p_init_dynamic_huffman; /* 88 4 */
		wuffs_base__status (*choosy_decode_huffman_fast64)(wuffs_deflate__decoder* , wuffs_base__io_buffer* , wuffs_base__io_buffer* ); /* 96 8* /
		uint32_t p_decode_huffman_slow; /* 104 4 */
	};
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8887 */
	struct {
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8892 */
		struct {
			uint32_t v_final; /* 0 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8895 */
		struct {
			uint32_t v_length; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8899 */
		struct {
			uint32_t v_bits; /* 0 4 */
			uint32_t v_n_bits; /* 4 4 */
			uint32_t v_n_lit; /* 8 4 */
			uint32_t v_n_dist; /* 12 4 */
			uint32_t v_n_clen; /* 16 4 */
			uint32_t v_i; /* 20 4 */
			uint32_t v_mask; /* 24 4 */
			uint32_t v_n_extra_bits; /* 28 4 */
			uint8_t v_rep_symbol; /* 32 1 */
			uint32_t v_rep_count; /* 36 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8911 */
		struct {
			uint32_t v_bits; /* 0 4 */
			uint32_t v_n_bits; /* 4 4 */
			uint32_t v_table_entry_n_bits; /* 8 4 */
			uint32_t v_lmask; /* 12 4 */
			uint32_t v_dmask; /* 16 4 */
			uint32_t v_redir_top; /* 20 4 */
			uint32_t v_redir_mask; /* 24 4 */
			uint32_t v_length; /* 28 4 */
			uint32_t v_dist_minus_1; /* 32 4 */
			uint64_t scratch; /* 40 8 */
		};
		uint32_t f_huffs[2][1024]; /* 0 8192 */
		uint8_t f_history[33025]; /* 8192 33025 */
		uint8_t f_code_lengths[320]; /* 41217 320 */
		struct {
			uint32_t v_final; /* 41540 4 */
		} s_decode_blocks; /* 41540 4 */
		struct {
			uint32_t v_length; /* 41544 4 */
			uint64_t scratch; /* 41552 8 */
		} s_decode_uncompressed; /* 41544 16 */
		struct {
			uint32_t v_bits; /* 41560 4 */
			uint32_t v_n_bits; /* 41564 4 */
			uint32_t v_n_lit; /* 41568 4 */
			uint32_t v_n_dist; /* 41572 4 */
			uint32_t v_n_clen; /* 41576 4 */
			uint32_t v_i; /* 41580 4 */
			uint32_t v_mask; /* 41584 4 */
			uint32_t v_n_extra_bits; /* 41588 4 */
			uint8_t v_rep_symbol; /* 41592 1 */
			uint32_t v_rep_count; /* 41596 4 */
		} s_init_dynamic_huffman; /* 41560 40 */
		struct {
			uint32_t v_bits; /* 41600 4 */
			uint32_t v_n_bits; /* 41604 4 */
			uint32_t v_table_entry_n_bits; /* 41608 4 */
			uint32_t v_lmask; /* 41612 4 */
			uint32_t v_dmask; /* 41616 4 */
			uint32_t v_redir_top; /* 41620 4 */
			uint32_t v_redir_mask; /* 41624 4 */
			uint32_t v_length; /* 41628 4 */
			uint32_t v_dist_minus_1; /* 41632 4 */
			uint64_t scratch; /* 41640 8 */
		} s_decode_huffman_slow; /* 41600 48 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint64_t f_transformed_history_count; /* 48 8 */
		uint32_t f_history_index; /* 56 4 */
		uint32_t f_n_huffs_bits[2]; /* 60 8 */
		bool f_end_of_block; /* 68 1 */
		uint32_t p_transform_io; /* 72 4 */
		uint32_t p_do_transform_io; /* 76 4 */
		uint32_t p_decode_blocks; /* 80 4 */
		uint32_t p_decode_uncompressed; /* 84 4 */
		uint32_t p_init_dynamic_huffman; /* 88 4 */
		wuffs_base__status (*choosy_decode_huffman_fast64)(wuffs_deflate__decoder* , wuffs_base__io_buffer* , wuffs_base__io_buffer* ); /* 96 8* /
		uint32_t p_decode_huffman_slow; /* 104 4 */
	} private_impl; /* 0 112 */
	struct {
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8892 */
		struct {
			uint32_t v_final; /* 112 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8895 */
		struct {
			uint32_t v_length; /* 112 4 */
			uint64_t scratch; /* 120 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8899 */
		struct {
			uint32_t v_bits; /* 112 4 */
			uint32_t v_n_bits; /* 116 4 */
			uint32_t v_n_lit; /* 120 4 */
			uint32_t v_n_dist; /* 124 4 */
			uint32_t v_n_clen; /* 128 4 */
			uint32_t v_i; /* 132 4 */
			uint32_t v_mask; /* 136 4 */
			uint32_t v_n_extra_bits; /* 140 4 */
			uint8_t v_rep_symbol; /* 144 1 */
			uint32_t v_rep_count; /* 148 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8911 */
		struct {
			uint32_t v_bits; /* 112 4 */
			uint32_t v_n_bits; /* 116 4 */
			uint32_t v_table_entry_n_bits; /* 120 4 */
			uint32_t v_lmask; /* 124 4 */
			uint32_t v_dmask; /* 128 4 */
			uint32_t v_redir_top; /* 132 4 */
			uint32_t v_redir_mask; /* 136 4 */
			uint32_t v_length; /* 140 4 */
			uint32_t v_dist_minus_1; /* 144 4 */
			uint64_t scratch; /* 152 8 */
		};
		uint32_t f_huffs[2][1024]; /* 112 8192 */
		uint8_t f_history[33025]; /* 8304 33025 */
		uint8_t f_code_lengths[320]; /* 41329 320 */
		struct {
			uint32_t v_final; /* 41652 4 */
		} s_decode_blocks; /* 41652 4 */
		struct {
			uint32_t v_length; /* 41656 4 */
			uint64_t scratch; /* 41664 8 */
		} s_decode_uncompressed; /* 41656 16 */
		struct {
			uint32_t v_bits; /* 41672 4 */
			uint32_t v_n_bits; /* 41676 4 */
			uint32_t v_n_lit; /* 41680 4 */
			uint32_t v_n_dist; /* 41684 4 */
			uint32_t v_n_clen; /* 41688 4 */
			uint32_t v_i; /* 41692 4 */
			uint32_t v_mask; /* 41696 4 */
			uint32_t v_n_extra_bits; /* 41700 4 */
			uint8_t v_rep_symbol; /* 41704 1 */
			uint32_t v_rep_count; /* 41708 4 */
		} s_init_dynamic_huffman; /* 41672 40 */
		struct {
			uint32_t v_bits; /* 41712 4 */
			uint32_t v_n_bits; /* 41716 4 */
			uint32_t v_table_entry_n_bits; /* 41720 4 */
			uint32_t v_lmask; /* 41724 4 */
			uint32_t v_dmask; /* 41728 4 */
			uint32_t v_redir_top; /* 41732 4 */
			uint32_t v_redir_mask; /* 41736 4 */
			uint32_t v_length; /* 41740 4 */
			uint32_t v_dist_minus_1; /* 41744 4 */
			uint64_t scratch; /* 41752 8 */
		} s_decode_huffman_slow; /* 41712 48 */
	} private_data; /* 112 41648 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8927 */
	typedef struct unique_ptr<wuffs_deflate__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8932 */
	unique_ptr alloc(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8937 */
	unique_ptr alloc_as__wuffs_base__io_transformer(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8955 */
	void wuffs_deflate__decoder__struct(wuffs_deflate__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8956 */
	void wuffs_deflate__decoder__struct(wuffs_deflate__decoder__struct* , const wuffs_deflate__decoder__struct& );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8957 */
	wuffs_deflate__decoder__struct& operator=(wuffs_deflate__decoder__struct* , const wuffs_deflate__decoder__struct& );
	uint8_t dead_weight[123000000]; /* 41760 123000000 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8974 */
	wuffs_base__status initialize(wuffs_deflate__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8983 */
	wuffs_base__io_transformer* upcast_as__wuffs_base__io_transformer(wuffs_deflate__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8988 */
	wuffs_base__empty_struct add_history(wuffs_deflate__decoder__struct* , wuffs_base__slice_u8);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:8994 */
	uint64_t get_quirk(const wuffs_deflate__decoder__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:9000 */
	wuffs_base__status set_quirk(wuffs_deflate__decoder__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:9007 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_deflate__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:9012 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_deflate__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:9017 */
	wuffs_base__status transform_io(wuffs_deflate__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
};

// <04874DF3> ../thirdparty/wuffs/wuffs-v0.4.c:8854
// member functions: 12
// member variables: 2
// struct size: 41,760
struct wuffs_deflate__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8862 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint64_t f_transformed_history_count; /* 48 8 */
		uint32_t f_history_index; /* 56 4 */
		uint32_t f_n_huffs_bits[2]; /* 60 8 */
		bool f_end_of_block; /* 68 1 */
		uint32_t p_transform_io; /* 72 4 */
		uint32_t p_do_transform_io; /* 76 4 */
		uint32_t p_decode_blocks; /* 80 4 */
		uint32_t p_decode_uncompressed; /* 84 4 */
		uint32_t p_init_dynamic_huffman; /* 88 4 */
		wuffs_base__status (*choosy_decode_huffman_fast64)(wuffs_deflate__decoder* , wuffs_base__io_buffer* , wuffs_base__io_buffer* ); /* 96 8* /
		uint32_t p_decode_huffman_slow; /* 104 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8887 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8892 */
		struct {
			uint32_t v_final; /* 0 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8895 */
		struct {
			uint32_t v_length; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8899 */
		struct {
			uint32_t v_bits; /* 0 4 */
			uint32_t v_n_bits; /* 4 4 */
			uint32_t v_n_lit; /* 8 4 */
			uint32_t v_n_dist; /* 12 4 */
			uint32_t v_n_clen; /* 16 4 */
			uint32_t v_i; /* 20 4 */
			uint32_t v_mask; /* 24 4 */
			uint32_t v_n_extra_bits; /* 28 4 */
			uint8_t v_rep_symbol; /* 32 1 */
			uint32_t v_rep_count; /* 36 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8911 */
		struct {
			uint32_t v_bits; /* 0 4 */
			uint32_t v_n_bits; /* 4 4 */
			uint32_t v_table_entry_n_bits; /* 8 4 */
			uint32_t v_lmask; /* 12 4 */
			uint32_t v_dmask; /* 16 4 */
			uint32_t v_redir_top; /* 20 4 */
			uint32_t v_redir_mask; /* 24 4 */
			uint32_t v_length; /* 28 4 */
			uint32_t v_dist_minus_1; /* 32 4 */
			uint64_t scratch; /* 40 8 */
		};
		uint32_t f_huffs[2][1024]; /* 0 8192 */
		uint8_t f_history[33025]; /* 8192 33025 */
		uint8_t f_code_lengths[320]; /* 41217 320 */
		struct {
			uint32_t v_final; /* 41540 4 */
		} s_decode_blocks; /* 41540 4 */
		struct {
			uint32_t v_length; /* 41544 4 */
			uint64_t scratch; /* 41552 8 */
		} s_decode_uncompressed; /* 41544 16 */
		struct {
			uint32_t v_bits; /* 41560 4 */
			uint32_t v_n_bits; /* 41564 4 */
			uint32_t v_n_lit; /* 41568 4 */
			uint32_t v_n_dist; /* 41572 4 */
			uint32_t v_n_clen; /* 41576 4 */
			uint32_t v_i; /* 41580 4 */
			uint32_t v_mask; /* 41584 4 */
			uint32_t v_n_extra_bits; /* 41588 4 */
			uint8_t v_rep_symbol; /* 41592 1 */
			uint32_t v_rep_count; /* 41596 4 */
		} s_init_dynamic_huffman; /* 41560 40 */
		struct {
			uint32_t v_bits; /* 41600 4 */
			uint32_t v_n_bits; /* 41604 4 */
			uint32_t v_table_entry_n_bits; /* 41608 4 */
			uint32_t v_lmask; /* 41612 4 */
			uint32_t v_dmask; /* 41616 4 */
			uint32_t v_redir_top; /* 41620 4 */
			uint32_t v_redir_mask; /* 41624 4 */
			uint32_t v_length; /* 41628 4 */
			uint32_t v_dist_minus_1; /* 41632 4 */
			uint64_t scratch; /* 41640 8 */
		} s_decode_huffman_slow; /* 41600 48 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_bits; /* 40 4 */
		uint32_t f_n_bits; /* 44 4 */
		uint64_t f_transformed_history_count; /* 48 8 */
		uint32_t f_history_index; /* 56 4 */
		uint32_t f_n_huffs_bits[2]; /* 60 8 */
		bool f_end_of_block; /* 68 1 */
		uint32_t p_transform_io; /* 72 4 */
		uint32_t p_do_transform_io; /* 76 4 */
		uint32_t p_decode_blocks; /* 80 4 */
		uint32_t p_decode_uncompressed; /* 84 4 */
		uint32_t p_init_dynamic_huffman; /* 88 4 */
		wuffs_base__status (*choosy_decode_huffman_fast64)(wuffs_deflate__decoder* , wuffs_base__io_buffer* , wuffs_base__io_buffer* ); /* 96 8* /
		uint32_t p_decode_huffman_slow; /* 104 4 */
	} private_impl; /* 0 112 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8892 */
		struct {
			uint32_t v_final; /* 112 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8895 */
		struct {
			uint32_t v_length; /* 112 4 */
			uint64_t scratch; /* 120 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8899 */
		struct {
			uint32_t v_bits; /* 112 4 */
			uint32_t v_n_bits; /* 116 4 */
			uint32_t v_n_lit; /* 120 4 */
			uint32_t v_n_dist; /* 124 4 */
			uint32_t v_n_clen; /* 128 4 */
			uint32_t v_i; /* 132 4 */
			uint32_t v_mask; /* 136 4 */
			uint32_t v_n_extra_bits; /* 140 4 */
			uint8_t v_rep_symbol; /* 144 1 */
			uint32_t v_rep_count; /* 148 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:8911 */
		struct {
			uint32_t v_bits; /* 112 4 */
			uint32_t v_n_bits; /* 116 4 */
			uint32_t v_table_entry_n_bits; /* 120 4 */
			uint32_t v_lmask; /* 124 4 */
			uint32_t v_dmask; /* 128 4 */
			uint32_t v_redir_top; /* 132 4 */
			uint32_t v_redir_mask; /* 136 4 */
			uint32_t v_length; /* 140 4 */
			uint32_t v_dist_minus_1; /* 144 4 */
			uint64_t scratch; /* 152 8 */
		};
		uint32_t f_huffs[2][1024]; /* 112 8192 */
		uint8_t f_history[33025]; /* 8304 33025 */
		uint8_t f_code_lengths[320]; /* 41329 320 */
		struct {
			uint32_t v_final; /* 41652 4 */
		} s_decode_blocks; /* 41652 4 */
		struct {
			uint32_t v_length; /* 41656 4 */
			uint64_t scratch; /* 41664 8 */
		} s_decode_uncompressed; /* 41656 16 */
		struct {
			uint32_t v_bits; /* 41672 4 */
			uint32_t v_n_bits; /* 41676 4 */
			uint32_t v_n_lit; /* 41680 4 */
			uint32_t v_n_dist; /* 41684 4 */
			uint32_t v_n_clen; /* 41688 4 */
			uint32_t v_i; /* 41692 4 */
			uint32_t v_mask; /* 41696 4 */
			uint32_t v_n_extra_bits; /* 41700 4 */
			uint8_t v_rep_symbol; /* 41704 1 */
			uint32_t v_rep_count; /* 41708 4 */
		} s_init_dynamic_huffman; /* 41672 40 */
		struct {
			uint32_t v_bits; /* 41712 4 */
			uint32_t v_n_bits; /* 41716 4 */
			uint32_t v_table_entry_n_bits; /* 41720 4 */
			uint32_t v_lmask; /* 41724 4 */
			uint32_t v_dmask; /* 41728 4 */
			uint32_t v_redir_top; /* 41732 4 */
			uint32_t v_redir_mask; /* 41736 4 */
			uint32_t v_length; /* 41740 4 */
			uint32_t v_dist_minus_1; /* 41744 4 */
			uint64_t scratch; /* 41752 8 */
		} s_decode_huffman_slow; /* 41712 48 */
	} private_data; /* 112 41648 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8927 */
	typedef struct unique_ptr<wuffs_deflate__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8932 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8937 */
	unique_ptr alloc_as__wuffs_base__io_transformer(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8974 */
	wuffs_base__status initialize(wuffs_deflate__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8983 */
	wuffs_base__io_transformer* upcast_as__wuffs_base__io_transformer(wuffs_deflate__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8988 */
	wuffs_base__empty_struct add_history(wuffs_deflate__decoder__struct* , wuffs_base__slice_u8);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:8994 */
	uint64_t get_quirk(const wuffs_deflate__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9000 */
	wuffs_base__status set_quirk(wuffs_deflate__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9007 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_deflate__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9012 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_deflate__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9017 */
	wuffs_base__status transform_io(wuffs_deflate__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
};

// <04926E73> ../thirdparty/wuffs/wuffs-v0.4.c:9081
inline wuffs_base__image_decoder* wuffs_etc2__decoder__alloc_as__wuffs_base__image_decoder(void)
{
} /* size: 0 */

// <048CE8FA> ../thirdparty/wuffs/wuffs-v0.4.c:9098
wuffs_base__status wuffs_thumbhash__decoder__initialize(wuffs_thumbhash__decoder* self, size_t sizeof_star_self, uint64_t wuffs_version, uint32_t options)
{
} /* size: 0 */

// <048CE7EF> ../thirdparty/wuffs/wuffs-v0.4.c:9145
// variable: 1
// function calls: 2
wuffs_thumbhash__decoder* wuffs_thumbhash__decoder__alloc(void)
{
	wuffs_thumbhash__decoder* x; // 9146
	wuffs_thumbhash__decoder__initialize(wuffs_thumbhash__decoder* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 9098
	wuffs_thumbhash__decoder__initialize(wuffs_thumbhash__decoder* self,
						size_t sizeof_star_self,
						uint64_t wuffs_version,
						uint32_t options);  // 9151
} /* size: 0, variables: 1, inline expansions: 2 (0 bytes) */

// <048CE7CA> ../thirdparty/wuffs/wuffs-v0.4.c:9160
size_t sizeof__wuffs_thumbhash__decoder(void)
{
} /* size: 0 */

// <048CE796> ../thirdparty/wuffs/wuffs-v0.4.c:9170
uint64_t wuffs_thumbhash__decoder__get_quirk(const wuffs_thumbhash__decoder* self, uint32_t a_key)
{
} /* size: 0 */

// <048CE753> ../thirdparty/wuffs/wuffs-v0.4.c:9191
wuffs_base__status wuffs_thumbhash__decoder__set_quirk(wuffs_thumbhash__decoder* self, uint32_t a_key, uint64_t a_value)
{
} /* size: 0 */

// <0487545B> ../thirdparty/wuffs/wuffs-v0.4.c:9192
// member functions: 17
// member variables: 2
// struct size: 5,288
struct wuffs_etc2__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9200 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_pixfmt; /* 40 4 */
		uint32_t f_width; /* 44 4 */
		uint32_t f_height; /* 48 4 */
		uint8_t f_call_sequence; /* 52 1 */
		bool f_srgb; /* 53 1 */
		uint32_t f_num_buffered_blocks; /* 56 4 */
		uint32_t f_dst_x; /* 60 4 */
		uint32_t f_dst_y; /* 64 4 */
		wuffs_base__pixel_swizzler f_swizzler; /* 72 24 */
		uint32_t p_decode_image_config; /* 96 4 */
		uint32_t p_do_decode_image_config; /* 100 4 */
		uint32_t p_decode_frame_config; /* 104 4 */
		uint32_t p_do_decode_frame_config; /* 108 4 */
		uint32_t p_decode_frame; /* 112 4 */
		uint32_t p_do_decode_frame; /* 116 4 */
		uint32_t p_from_src_to_colors; /* 120 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9225 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9230 */
		struct {
			uint16_t v_rounded_up_width; /* 0 2 */
			uint16_t v_rounded_up_height; /* 2 2 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9235 */
		struct {
			uint32_t v_remaining; /* 0 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9238 */
		struct {
			uint32_t v_bi; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		uint64_t f_alphas[64]; /* 0 512 */
		uint64_t f_colors[64]; /* 512 512 */
		uint8_t f_buffer[4096]; /* 1024 4096 */
		struct {
			uint16_t v_rounded_up_width; /* 5120 2 */
			uint16_t v_rounded_up_height; /* 5122 2 */
			uint64_t scratch; /* 5128 8 */
		} s_do_decode_image_config; /* 5120 16 */
		struct {
			uint32_t v_remaining; /* 5136 4 */
		} s_do_decode_frame; /* 5136 4 */
		struct {
			uint32_t v_bi; /* 5144 4 */
			uint64_t scratch; /* 5152 8 */
		} s_from_src_to_colors; /* 5144 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_pixfmt; /* 40 4 */
		uint32_t f_width; /* 44 4 */
		uint32_t f_height; /* 48 4 */
		uint8_t f_call_sequence; /* 52 1 */
		bool f_srgb; /* 53 1 */
		uint32_t f_num_buffered_blocks; /* 56 4 */
		uint32_t f_dst_x; /* 60 4 */
		uint32_t f_dst_y; /* 64 4 */
		wuffs_base__pixel_swizzler f_swizzler; /* 72 24 */
		uint32_t p_decode_image_config; /* 96 4 */
		uint32_t p_do_decode_image_config; /* 100 4 */
		uint32_t p_decode_frame_config; /* 104 4 */
		uint32_t p_do_decode_frame_config; /* 108 4 */
		uint32_t p_decode_frame; /* 112 4 */
		uint32_t p_do_decode_frame; /* 116 4 */
		uint32_t p_from_src_to_colors; /* 120 4 */
	} private_impl; /* 0 128 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9230 */
		struct {
			uint16_t v_rounded_up_width; /* 128 2 */
			uint16_t v_rounded_up_height; /* 130 2 */
			uint64_t scratch; /* 136 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9235 */
		struct {
			uint32_t v_remaining; /* 128 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9238 */
		struct {
			uint32_t v_bi; /* 128 4 */
			uint64_t scratch; /* 136 8 */
		};
		uint64_t f_alphas[64]; /* 128 512 */
		uint64_t f_colors[64]; /* 640 512 */
		uint8_t f_buffer[4096]; /* 1152 4096 */
		struct {
			uint16_t v_rounded_up_width; /* 5248 2 */
			uint16_t v_rounded_up_height; /* 5250 2 */
			uint64_t scratch; /* 5256 8 */
		} s_do_decode_image_config; /* 5248 16 */
		struct {
			uint32_t v_remaining; /* 5264 4 */
		} s_do_decode_frame; /* 5264 4 */
		struct {
			uint32_t v_bi; /* 5272 4 */
			uint64_t scratch; /* 5280 8 */
		} s_from_src_to_colors; /* 5272 16 */
	} private_data; /* 128 5160 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9246 */
	typedef struct unique_ptr<wuffs_etc2__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9251 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9256 */
	unique_ptr alloc_as__wuffs_base__image_decoder(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9293 */
	wuffs_base__status initialize(wuffs_etc2__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9302 */
	wuffs_base__image_decoder* upcast_as__wuffs_base__image_decoder(wuffs_etc2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9307 */
	uint64_t get_quirk(const wuffs_etc2__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9313 */
	wuffs_base__status set_quirk(wuffs_etc2__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9320 */
	wuffs_base__status decode_image_config(wuffs_etc2__decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9327 */
	wuffs_base__status decode_frame_config(wuffs_etc2__decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9334 */
	wuffs_base__status decode_frame(wuffs_etc2__decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9344 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_etc2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9349 */
	uint32_t num_animation_loops(const wuffs_etc2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9354 */
	uint64_t num_decoded_frame_configs(const wuffs_etc2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9359 */
	uint64_t num_decoded_frames(const wuffs_etc2__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9364 */
	wuffs_base__status restart_frame(wuffs_etc2__decoder__struct* , uint64_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9371 */
	wuffs_base__empty_struct set_report_metadata(wuffs_etc2__decoder__struct* , uint32_t, bool);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9378 */
	wuffs_base__status tell_me_more(wuffs_etc2__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9386 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_etc2__decoder__struct* );
};

// <048CE6B2> ../thirdparty/wuffs/wuffs-v0.4.c:9216
// variables: 4
wuffs_base__status wuffs_thumbhash__decoder__decode_image_config(wuffs_thumbhash__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 9266

ok: // 9260

exit: // 9271
	wuffs_base__status status; // 9239
	wuffs_base__status v_status; // 9241
	uint32_t coro_susp_point; // 9243
	{
		wuffs_base__status t_0; // 9249
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <048CE354> ../thirdparty/wuffs/wuffs-v0.4.c:9282
// variables: 18
// function calls: 4
wuffs_base__status wuffs_thumbhash__decoder__do_decode_image_config(wuffs_thumbhash__decoder* self, wuffs_base__image_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 9468

suspend: // 9474

exit: // 9478
	wuffs_base__status status; // 9286
	uint32_t v_c32; // 9288
	uint8_t v_swap; // 9289
	const uint8_t* iop_a_src; // 9291
	const uint8_t* io0_a_src; // 9292
	const uint8_t* io1_a_src; // 9293
	const uint8_t* io2_a_src; // 9294
	uint32_t coro_susp_point; // 9302
	{
		uint32_t t_0; // 9313
		{
			uint64_t* scratch; // 9325
			uint32_t num_bits_0; // 9326
		}
		wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p); // 9315
	}
	{
		uint32_t t_1; // 9347
		{
			uint64_t* scratch; // 9359
			uint32_t num_bits_1; // 9360
		}
		wuffs_base__peek_u24le__no_bounds_check(const uint8_t* p); // 9349
	}
	{
		uint32_t t_2; // 9381
		{
			uint64_t* scratch; // 9393
			uint32_t num_bits_2; // 9394
		}
	}
	{
		uint32_t t_3; // 9434
	}
	wuffs_base__u8__max(uint8_t x,
				uint8_t y);  // 9423
	wuffs_base__image_config__set(wuffs_base__image_config* c,
					uint32_t pixfmt_repr,
					uint32_t pixsub_repr,
					uint32_t width,
					uint32_t height,
					uint64_t first_frame_io_position,
					bool first_frame_is_opaque);  // 9456
} /* size: 0, variables: 8, goto labels: 3, inline expansions: 2 (0 bytes) */

// <04926E5D> ../thirdparty/wuffs/wuffs-v0.4.c:9466
inline wuffs_base__image_decoder* wuffs_gif__decoder__alloc_as__wuffs_base__image_decoder(void)
{
} /* size: 0 */

// <048CE2B3> ../thirdparty/wuffs/wuffs-v0.4.c:9490
// variables: 4
wuffs_base__status wuffs_thumbhash__decoder__decode_frame_config(wuffs_thumbhash__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

suspend: // 9540

ok: // 9534

exit: // 9545
	wuffs_base__status status; // 9513
	wuffs_base__status v_status; // 9515
	uint32_t coro_susp_point; // 9517
	{
		wuffs_base__status t_0; // 9523
	}
} /* size: 0, variables: 3, goto labels: 3 */

// <049317B1> ../thirdparty/wuffs/wuffs-v0.4.c:9556
// variables: 6
// function calls: 3
wuffs_base__status wuffs_thumbhash__decoder__do_decode_frame_config(wuffs_thumbhash__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 9621

exit: // 9631

suspend: // 9627
	wuffs_base__status status; // 9560
	const uint8_t* iop_a_src; // 9562
	const uint8_t* io0_a_src; // 9563
	const uint8_t* io1_a_src; // 9564
	const uint8_t* io2_a_src; // 9565
	uint32_t coro_susp_point; // 9573
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 9628
	wuffs_base__u64__sat_add(uint64_t x,
				uint64_t y);  // 9591
	wuffs_base__frame_config__set(wuffs_base__frame_config* c,
					wuffs_base__rect_ie_u32 bounds,
					wuffs_base__flicks duration,
					uint64_t index,
					uint64_t io_position,
					wuffs_base__animation_disposal disposal,
					bool opaque_within_bounds,
					bool overwrite_instead_of_blend,
					wuffs_base__color_u32_argb_premul background_color);  // 9604
} /* size: 0, variables: 6, goto labels: 3, inline expansions: 3 (0 bytes) */

// <048CE1F7> ../thirdparty/wuffs/wuffs-v0.4.c:9556
// variables: 6
wuffs_base__status wuffs_thumbhash__decoder__do_decode_frame_config(wuffs_thumbhash__decoder* self, wuffs_base__frame_config* a_dst, wuffs_base__io_buffer* a_src)
{

ok: // 9621

exit: // 9631

suspend: // 9627
	wuffs_base__status status; // 9560
	const uint8_t* iop_a_src; // 9562
	const uint8_t* io0_a_src; // 9563
	const uint8_t* io1_a_src; // 9564
	const uint8_t* io2_a_src; // 9565
	uint32_t coro_susp_point; // 9573
} /* size: 0, variables: 6, goto labels: 3 */

// <04875AE8> ../thirdparty/wuffs/wuffs-v0.4.c:9577
// member functions: 17
// member variables: 2
// struct size: 64,984
struct wuffs_gif__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9585 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint8_t f_call_sequence; /* 48 1 */
		bool f_report_metadata_iccp; /* 49 1 */
		bool f_report_metadata_xmp; /* 50 1 */
		uint32_t f_metadata_fourcc; /* 52 4 */
		uint64_t f_metadata_io_position; /* 56 8 */
		bool f_quirks[7]; /* 64 7 */
		bool f_delayed_num_decoded_frames; /* 71 1 */
		bool f_seen_header; /* 72 1 */
		bool f_ignored_but_affects_benchmarks; /* 73 1 */
		bool f_has_global_palette; /* 74 1 */
		uint8_t f_interlace; /* 75 1 */
		bool f_seen_num_animation_loops_value; /* 76 1 */
		uint32_t f_num_animation_loops_value; /* 80 4 */
		uint32_t f_background_color_u32_argb_premul; /* 84 4 */
		uint32_t f_black_color_u32_argb_premul; /* 88 4 */
		bool f_gc_has_transparent_index; /* 92 1 */
		uint8_t f_gc_transparent_index; /* 93 1 */
		uint8_t f_gc_disposal; /* 94 1 */
		uint64_t f_gc_duration; /* 96 8 */
		uint64_t f_frame_config_io_position; /* 104 8 */
		uint64_t f_num_decoded_frame_configs_value; /* 112 8 */
		uint64_t f_num_decoded_frames_value; /* 120 8 */
		uint32_t f_frame_rect_x0; /* 128 4 */
		uint32_t f_frame_rect_y0; /* 132 4 */
		uint32_t f_frame_rect_x1; /* 136 4 */
		uint32_t f_frame_rect_y1; /* 140 4 */
		uint32_t f_dst_x; /* 144 4 */
		uint32_t f_dst_y; /* 148 4 */
		uint32_t f_dirty_max_excl_y; /* 152 4 */
		uint64_t f_compressed_ri; /* 160 8 */
		uint64_t f_compressed_wi; /* 168 8 */
		wuffs_base__pixel_swizzler f_swizzler; /* 176 24 */
		uint32_t f_lzw_pending_literal_width_plus_one; /* 200 4 */
		uint32_t f_lzw_literal_width; /* 204 4 */
		uint32_t f_lzw_clear_code; /* 208 4 */
		uint32_t f_lzw_end_code; /* 212 4 */
		uint32_t f_lzw_save_code; /* 216 4 */
		uint32_t f_lzw_prev_code; /* 220 4 */
		uint32_t f_lzw_width; /* 224 4 */
		uint32_t f_lzw_bits; /* 228 4 */
		uint32_t f_lzw_n_bits; /* 232 4 */
		uint32_t f_lzw_output_ri; /* 236 4 */
		uint32_t f_lzw_output_wi; /* 240 4 */
		uint32_t f_lzw_read_from_return_value; /* 244 4 */
		uint16_t f_lzw_prefixes[4096]; /* 248 8192 */
		uint32_t p_decode_image_config; /* 8440 4 */
		uint32_t p_do_decode_image_config; /* 8444 4 */
		uint32_t p_tell_me_more; /* 8448 4 */
		uint32_t p_do_tell_me_more; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_skip_frame; /* 8464 4 */
		uint32_t p_decode_frame; /* 8468 4 */
		uint32_t p_do_decode_frame; /* 8472 4 */
		uint32_t p_decode_up_to_id_part1; /* 8476 4 */
		uint32_t p_decode_header; /* 8480 4 */
		uint32_t p_decode_lsd; /* 8484 4 */
		uint32_t p_decode_extension; /* 8488 4 */
		uint32_t p_skip_blocks; /* 8492 4 */
		uint32_t p_decode_ae; /* 8496 4 */
		uint32_t p_decode_gc; /* 8500 4 */
		uint32_t p_decode_id_part0; /* 8504 4 */
		uint32_t p_decode_id_part1; /* 8508 4 */
		uint32_t p_decode_id_part2; /* 8512 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9660 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9668 */
		struct {
			uint32_t v_background_color; /* 0 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9671 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9674 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9677 */
		struct {
			uint8_t v_flags; /* 0 1 */
			uint8_t v_background_color_index; /* 1 1 */
			uint32_t v_num_palette_entries; /* 4 4 */
			uint32_t v_i; /* 8 4 */
			uint64_t scratch; /* 16 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9684 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9687 */
		struct {
			uint8_t v_block_size; /* 0 1 */
			bool v_is_animexts; /* 1 1 */
			bool v_is_netscape; /* 2 1 */
			bool v_is_iccp; /* 3 1 */
			bool v_is_xmp; /* 4 1 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9695 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9698 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9701 */
		struct {
			uint8_t v_which_palette; /* 0 1 */
			uint32_t v_num_palette_entries; /* 4 4 */
			uint32_t v_i; /* 8 4 */
			uint64_t scratch; /* 16 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9707 */
		struct {
			uint64_t v_block_size; /* 0 8 */
			bool v_need_block_size; /* 8 1 */
			uint64_t scratch; /* 16 8 */
		};
		uint8_t f_compressed[4096]; /* 0 4096 */
		uint8_t f_palettes[2][1024]; /* 4096 2048 */
		uint8_t f_dst_palette[1024]; /* 6144 1024 */
		uint8_t f_lzw_suffixes[4096][8]; /* 7168 32768 */
		uint16_t f_lzw_lm1s[4096]; /* 39936 8192 */
		uint8_t f_lzw_output[8199]; /* 48128 8199 */
		struct {
			uint32_t v_background_color; /* 56328 4 */
		} s_do_decode_frame_config; /* 56328 4 */
		struct {
			uint64_t scratch; /* 56336 8 */
		} s_skip_frame; /* 56336 8 */
		struct {
			uint64_t scratch; /* 56344 8 */
		} s_decode_header; /* 56344 8 */
		struct {
			uint8_t v_flags; /* 56352 1 */
			uint8_t v_background_color_index; /* 56353 1 */
			uint32_t v_num_palette_entries; /* 56356 4 */
			uint32_t v_i; /* 56360 4 */
			uint64_t scratch; /* 56368 8 */
		} s_decode_lsd; /* 56352 24 */
		struct {
			uint64_t scratch; /* 56376 8 */
		} s_skip_blocks; /* 56376 8 */
		struct {
			uint8_t v_block_size; /* 56384 1 */
			bool v_is_animexts; /* 56385 1 */
			bool v_is_netscape; /* 56386 1 */
			bool v_is_iccp; /* 56387 1 */
			bool v_is_xmp; /* 56388 1 */
			uint64_t scratch; /* 56392 8 */
		} s_decode_ae; /* 56384 16 */
		struct {
			uint64_t scratch; /* 56400 8 */
		} s_decode_gc; /* 56400 8 */
		struct {
			uint64_t scratch; /* 56408 8 */
		} s_decode_id_part0; /* 56408 8 */
		struct {
			uint8_t v_which_palette; /* 56416 1 */
			uint32_t v_num_palette_entries; /* 56420 4 */
			uint32_t v_i; /* 56424 4 */
			uint64_t scratch; /* 56432 8 */
		} s_decode_id_part1; /* 56416 24 */
		struct {
			uint64_t v_block_size; /* 56440 8 */
			bool v_need_block_size; /* 56448 1 */
			uint64_t scratch; /* 56456 8 */
		} s_decode_id_part2; /* 56440 24 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint8_t f_call_sequence; /* 48 1 */
		bool f_report_metadata_iccp; /* 49 1 */
		bool f_report_metadata_xmp; /* 50 1 */
		uint32_t f_metadata_fourcc; /* 52 4 */
		uint64_t f_metadata_io_position; /* 56 8 */
		bool f_quirks[7]; /* 64 7 */
		bool f_delayed_num_decoded_frames; /* 71 1 */
		bool f_seen_header; /* 72 1 */
		bool f_ignored_but_affects_benchmarks; /* 73 1 */
		bool f_has_global_palette; /* 74 1 */
		uint8_t f_interlace; /* 75 1 */
		bool f_seen_num_animation_loops_value; /* 76 1 */
		uint32_t f_num_animation_loops_value; /* 80 4 */
		uint32_t f_background_color_u32_argb_premul; /* 84 4 */
		uint32_t f_black_color_u32_argb_premul; /* 88 4 */
		bool f_gc_has_transparent_index; /* 92 1 */
		uint8_t f_gc_transparent_index; /* 93 1 */
		uint8_t f_gc_disposal; /* 94 1 */
		uint64_t f_gc_duration; /* 96 8 */
		uint64_t f_frame_config_io_position; /* 104 8 */
		uint64_t f_num_decoded_frame_configs_value; /* 112 8 */
		uint64_t f_num_decoded_frames_value; /* 120 8 */
		uint32_t f_frame_rect_x0; /* 128 4 */
		uint32_t f_frame_rect_y0; /* 132 4 */
		uint32_t f_frame_rect_x1; /* 136 4 */
		uint32_t f_frame_rect_y1; /* 140 4 */
		uint32_t f_dst_x; /* 144 4 */
		uint32_t f_dst_y; /* 148 4 */
		uint32_t f_dirty_max_excl_y; /* 152 4 */
		uint64_t f_compressed_ri; /* 160 8 */
		uint64_t f_compressed_wi; /* 168 8 */
		wuffs_base__pixel_swizzler f_swizzler; /* 176 24 */
		uint32_t f_lzw_pending_literal_width_plus_one; /* 200 4 */
		uint32_t f_lzw_literal_width; /* 204 4 */
		uint32_t f_lzw_clear_code; /* 208 4 */
		uint32_t f_lzw_end_code; /* 212 4 */
		uint32_t f_lzw_save_code; /* 216 4 */
		uint32_t f_lzw_prev_code; /* 220 4 */
		uint32_t f_lzw_width; /* 224 4 */
		uint32_t f_lzw_bits; /* 228 4 */
		uint32_t f_lzw_n_bits; /* 232 4 */
		uint32_t f_lzw_output_ri; /* 236 4 */
		uint32_t f_lzw_output_wi; /* 240 4 */
		uint32_t f_lzw_read_from_return_value; /* 244 4 */
		uint16_t f_lzw_prefixes[4096]; /* 248 8192 */
		uint32_t p_decode_image_config; /* 8440 4 */
		uint32_t p_do_decode_image_config; /* 8444 4 */
		uint32_t p_tell_me_more; /* 8448 4 */
		uint32_t p_do_tell_me_more; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_skip_frame; /* 8464 4 */
		uint32_t p_decode_frame; /* 8468 4 */
		uint32_t p_do_decode_frame; /* 8472 4 */
		uint32_t p_decode_up_to_id_part1; /* 8476 4 */
		uint32_t p_decode_header; /* 8480 4 */
		uint32_t p_decode_lsd; /* 8484 4 */
		uint32_t p_decode_extension; /* 8488 4 */
		uint32_t p_skip_blocks; /* 8492 4 */
		uint32_t p_decode_ae; /* 8496 4 */
		uint32_t p_decode_gc; /* 8500 4 */
		uint32_t p_decode_id_part0; /* 8504 4 */
		uint32_t p_decode_id_part1; /* 8508 4 */
		uint32_t p_decode_id_part2; /* 8512 4 */
	} private_impl; /* 0 8520 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9668 */
		struct {
			uint32_t v_background_color; /* 8520 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9671 */
		struct {
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9674 */
		struct {
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9677 */
		struct {
			uint8_t v_flags; /* 8520 1 */
			uint8_t v_background_color_index; /* 8521 1 */
			uint32_t v_num_palette_entries; /* 8524 4 */
			uint32_t v_i; /* 8528 4 */
			uint64_t scratch; /* 8536 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9684 */
		struct {
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9687 */
		struct {
			uint8_t v_block_size; /* 8520 1 */
			bool v_is_animexts; /* 8521 1 */
			bool v_is_netscape; /* 8522 1 */
			bool v_is_iccp; /* 8523 1 */
			bool v_is_xmp; /* 8524 1 */
			uint64_t scratch; /* 8528 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9695 */
		struct {
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9698 */
		struct {
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9701 */
		struct {
			uint8_t v_which_palette; /* 8520 1 */
			uint32_t v_num_palette_entries; /* 8524 4 */
			uint32_t v_i; /* 8528 4 */
			uint64_t scratch; /* 8536 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:9707 */
		struct {
			uint64_t v_block_size; /* 8520 8 */
			bool v_need_block_size; /* 8528 1 */
			uint64_t scratch; /* 8536 8 */
		};
		uint8_t f_compressed[4096]; /* 8520 4096 */
		uint8_t f_palettes[2][1024]; /* 12616 2048 */
		uint8_t f_dst_palette[1024]; /* 14664 1024 */
		uint8_t f_lzw_suffixes[4096][8]; /* 15688 32768 */
		uint16_t f_lzw_lm1s[4096]; /* 48456 8192 */
		uint8_t f_lzw_output[8199]; /* 56648 8199 */
		struct {
			uint32_t v_background_color; /* 64848 4 */
		} s_do_decode_frame_config; /* 64848 4 */
		struct {
			uint64_t scratch; /* 64856 8 */
		} s_skip_frame; /* 64856 8 */
		struct {
			uint64_t scratch; /* 64864 8 */
		} s_decode_header; /* 64864 8 */
		struct {
			uint8_t v_flags; /* 64872 1 */
			uint8_t v_background_color_index; /* 64873 1 */
			uint32_t v_num_palette_entries; /* 64876 4 */
			uint32_t v_i; /* 64880 4 */
			uint64_t scratch; /* 64888 8 */
		} s_decode_lsd; /* 64872 24 */
		struct {
			uint64_t scratch; /* 64896 8 */
		} s_skip_blocks; /* 64896 8 */
		struct {
			uint8_t v_block_size; /* 64904 1 */
			bool v_is_animexts; /* 64905 1 */
			bool v_is_netscape; /* 64906 1 */
			bool v_is_iccp; /* 64907 1 */
			bool v_is_xmp; /* 64908 1 */
			uint64_t scratch; /* 64912 8 */
		} s_decode_ae; /* 64904 16 */
		struct {
			uint64_t scratch; /* 64920 8 */
		} s_decode_gc; /* 64920 8 */
		struct {
			uint64_t scratch; /* 64928 8 */
		} s_decode_id_part0; /* 64928 8 */
		struct {
			uint8_t v_which_palette; /* 64936 1 */
			uint32_t v_num_palette_entries; /* 64940 4 */
			uint32_t v_i; /* 64944 4 */
			uint64_t scratch; /* 64952 8 */
		} s_decode_id_part1; /* 64936 24 */
		struct {
			uint64_t v_block_size; /* 64960 8 */
			bool v_need_block_size; /* 64968 1 */
			uint64_t scratch; /* 64976 8 */
		} s_decode_id_part2; /* 64960 24 */
	} private_data; /* 8520 56464 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9716 */
	typedef struct unique_ptr<wuffs_gif__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9721 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9726 */
	unique_ptr alloc_as__wuffs_base__image_decoder(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9763 */
	wuffs_base__status initialize(wuffs_gif__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9772 */
	wuffs_base__image_decoder* upcast_as__wuffs_base__image_decoder(wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9777 */
	uint64_t get_quirk(const wuffs_gif__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9783 */
	wuffs_base__status set_quirk(wuffs_gif__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9790 */
	wuffs_base__status decode_image_config(wuffs_gif__decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9797 */
	wuffs_base__empty_struct set_report_metadata(wuffs_gif__decoder__struct* , uint32_t, bool);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9804 */
	wuffs_base__status tell_me_more(wuffs_gif__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9812 */
	uint32_t num_animation_loops(const wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9817 */
	uint64_t num_decoded_frame_configs(const wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9822 */
	uint64_t num_decoded_frames(const wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9827 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9832 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_gif__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9837 */
	wuffs_base__status restart_frame(wuffs_gif__decoder__struct* , uint64_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9844 */
	wuffs_base__status decode_frame_config(wuffs_gif__decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9851 */
	wuffs_base__status decode_frame(wuffs_gif__decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
};

// <048CD766> ../thirdparty/wuffs/wuffs-v0.4.c:9643
// variables: 10
// function calls: 29
wuffs_base__status wuffs_thumbhash__decoder__decode_frame(wuffs_thumbhash__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

suspend: // 9701

ok: // 9695

exit: // 9706
	wuffs_base__status status; // 9669
	wuffs_base__status v_status; // 9671
	uint32_t coro_susp_point; // 9673
	{
		wuffs_base__status t_0; // 9679

exit: // 9788

ok: // 9778

suspend: // 9784
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 9785

exit: // 9970

ok: // 9956

suspend: // 9962
		{
			uint8_t t_1; // 9885
		}
		{
			uint8_t t_0; // 9854
		}
		{
			uint8_t t_2; // 9914
		}
		{
			uint8_t t_3; // 9947
		}
		wuffs_thumbhash__decoder__from_src_to_coeffs(wuffs_thumbhash__decoder* self,
								wuffs_base__io_buffer* a_src);  // 9760
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5479
		{
			wuffs_base__table_u8* tab; // 5480
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5486
		}
		wuffs_base__pixel_buffer__palette(wuffs_base__pixel_buffer* pb); // 9743
		wuffs_base__empty_slice_u8(void); // 9743
		wuffs_base__make_pixel_format(uint32_t repr); // 9743
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 9743
		wuffs_base__status__is_ok(const wuffs_base__status* z); // 9749
		wuffs_base__status__is_error(const wuffs_base__status* z); // 9751
		wuffs_base__status__is_suspension(const wuffs_base__status* z); // 9753
		wuffs_thumbhash__decoder__from_coeffs_to_pixels(wuffs_thumbhash__decoder* self); // 9764
		wuffs_base__pixel_buffer__pixel_format(const wuffs_base__pixel_buffer* pb); // 10141
		wuffs_base__pixel_format__bits_per_pixel(const wuffs_base__pixel_format* f); // 10142
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 5520
		wuffs_base__pixel_buffer__plane(wuffs_base__pixel_buffer* pb,
						uint32_t p);  // 10148
		wuffs_base__make_slice_u8(uint8_t* ptr,
						size_t len);  // 17364
		wuffs_private_impl__table_u8__row_u32(wuffs_base__table_u8 t,
							uint32_t y);  // 10151
		wuffs_base__pixel_format__is_indexed(const wuffs_base__pixel_format* f); // 5479
		{
			wuffs_base__table_u8* tab; // 5480
			wuffs_base__make_slice_u8(uint8_t* ptr,
							size_t len);  // 5486
		}
		wuffs_base__pixel_buffer__palette(wuffs_base__pixel_buffer* pb); // 10155
		wuffs_base__pixel_swizzler__swizzle_interleaved_from_slice(const wuffs_base__pixel_swizzler* p,
										wuffs_base__slice_u8 dst,
										wuffs_base__slice_u8 dst_palette,
										wuffs_base__slice_u8 src);  // 10155
		wuffs_thumbhash__decoder__from_pixels_to_dst(wuffs_thumbhash__decoder* self,
								wuffs_base__pixel_buffer* a_dst);  // 9765
		wuffs_thumbhash__decoder__do_decode_frame(wuffs_thumbhash__decoder* self,
								wuffs_base__pixel_buffer* a_dst,
								wuffs_base__io_buffer* a_src,
								wuffs_base__pixel_blend a_blend,
								wuffs_base__slice_u8 a_workbuf,
								wuffs_base__decode_frame_options* a_opts);  // 9679
	}
	wuffs_base__make_status(const char* repr); // 9654
	wuffs_base__status__is_error(const wuffs_base__status* z); // 9707
	wuffs_base__make_status(const char* repr); // 9661
	wuffs_base__make_status(const char* repr); // 9666
	wuffs_base__status__is_suspension(const wuffs_base__status* z); // 9703
} /* size: 0, variables: 3, goto labels: 3, inline expansions: 5 (0 bytes) */

// <048CD6AA> ../thirdparty/wuffs/wuffs-v0.4.c:9717
// variables: 3
wuffs_base__status wuffs_thumbhash__decoder__do_decode_frame(wuffs_thumbhash__decoder* self, wuffs_base__pixel_buffer* a_dst, wuffs_base__io_buffer* a_src, wuffs_base__pixel_blend a_blend, wuffs_base__slice_u8 a_workbuf, wuffs_base__decode_frame_options* a_opts)
{

exit: // 9788

ok: // 9778

suspend: // 9784
	wuffs_base__status status; // 9724
	wuffs_base__status v_status; // 9726
	uint32_t coro_susp_point; // 9728
} /* size: 0, variables: 3, goto labels: 3 */

// <048CD562> ../thirdparty/wuffs/wuffs-v0.4.c:9796
// variables: 15
wuffs_base__status wuffs_thumbhash__decoder__from_src_to_coeffs(wuffs_thumbhash__decoder* self, wuffs_base__io_buffer* a_src)
{

exit: // 9970

ok: // 9956

suspend: // 9962
	wuffs_base__status status; // 9799
	uint8_t v_c8; // 9801
	uint32_t v_cy; // 9802
	uint32_t v_cx; // 9803
	uint32_t v_i; // 9804
	bool v_has_bits; // 9805
	const uint8_t* iop_a_src; // 9807
	const uint8_t* io0_a_src; // 9808
	const uint8_t* io1_a_src; // 9809
	const uint8_t* io2_a_src; // 9810
	uint32_t coro_susp_point; // 9818
	{
		uint8_t t_0; // 9854
	}
	{
		uint8_t t_1; // 9885
	}
	{
		uint8_t t_2; // 9914
	}
	{
		uint8_t t_3; // 9947
	}
} /* size: 0, variables: 11, goto labels: 3 */

// <048766F9> ../thirdparty/wuffs/wuffs-v0.4.c:9979
// member functions: 9
// member variables: 2
// struct size: 41,896
struct wuffs_gzip__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9987 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		bool f_ignore_checksum; /* 40 1 */
		uint32_t p_transform_io; /* 44 4 */
		uint32_t p_do_transform_io; /* 48 4 */
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:9999 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10003 */
		struct {
			uint8_t v_flags; /* 0 1 */
			uint32_t v_checksum_have; /* 4 4 */
			uint32_t v_decoded_length_have; /* 8 4 */
			uint32_t v_checksum_want; /* 12 4 */
			uint64_t scratch; /* 16 8 */
		};
		wuffs_crc32__ieee_hasher f_checksum; /* 0 56 */
		wuffs_deflate__decoder f_flate; /* 56 41760 */
		struct {
			uint8_t v_flags; /* 41816 1 */
			uint32_t v_checksum_have; /* 41820 4 */
			uint32_t v_decoded_length_have; /* 41824 4 */
			uint32_t v_checksum_want; /* 41828 4 */
			uint64_t scratch; /* 41832 8 */
		} s_do_transform_io; /* 41816 24 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__io_transformer; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		bool f_ignore_checksum; /* 40 1 */
		uint32_t p_transform_io; /* 44 4 */
		uint32_t p_do_transform_io; /* 48 4 */
	} private_impl; /* 0 56 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10003 */
		struct {
			uint8_t v_flags; /* 56 1 */
			uint32_t v_checksum_have; /* 60 4 */
			uint32_t v_decoded_length_have; /* 64 4 */
			uint32_t v_checksum_want; /* 68 4 */
			uint64_t scratch; /* 72 8 */
		};
		wuffs_crc32__ieee_hasher f_checksum; /* 56 56 */
		wuffs_deflate__decoder f_flate; /* 112 41760 */
		struct {
			uint8_t v_flags; /* 41872 1 */
			uint32_t v_checksum_have; /* 41876 4 */
			uint32_t v_decoded_length_have; /* 41880 4 */
			uint32_t v_checksum_want; /* 41884 4 */
			uint64_t scratch; /* 41888 8 */
		} s_do_transform_io; /* 41872 24 */
	} private_data; /* 56 41840 */
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10014 */
	typedef struct unique_ptr<wuffs_gzip__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10019 */
	unique_ptr alloc(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10024 */
	unique_ptr alloc_as__wuffs_base__io_transformer(void);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10061 */
	wuffs_base__status initialize(wuffs_gzip__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10070 */
	wuffs_base__io_transformer* upcast_as__wuffs_base__io_transformer(wuffs_gzip__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10075 */
	uint64_t get_quirk(const wuffs_gzip__decoder__struct* , uint32_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10081 */
	wuffs_base__status set_quirk(wuffs_gzip__decoder__struct* , uint32_t, uint64_t);
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10088 */
	wuffs_base__optional_u63 dst_history_retain_length(const wuffs_gzip__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10093 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_gzip__decoder__struct* );
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10098 */
	wuffs_base__status transform_io(wuffs_gzip__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__io_buffer* , wuffs_base__slice_u8);
};

// <048CD421> ../thirdparty/wuffs/wuffs-v0.4.c:9982
// variables: 19
wuffs_base__empty_wuffs_thumbhash__decoder__from_coeffs_to_pixels(wuffs_thumbhash__decoder* self)
{
	uint32_t v_h; // 9984
	uint32_t v_w; // 9985
	uint32_t v_fy; // 9986
	uint32_t v_fx; // 9987
	uint32_t v_cosines_base_y; // 9988
	uint32_t v_cosines_base_x; // 9989
	uint32_t v_y; // 9990
	uint32_t v_x; // 9991
	uint32_t v_f; // 9992
	uint64_t v_l; // 9993
	uint64_t v_p; // 9994
	uint64_t v_q; // 9995
	uint64_t v_b; // 9996
	uint64_t v_g; // 9997
	uint64_t v_r; // 9998
	uint64_t v_a; // 9999
	uint32_t v_i; // 10000
	uint32_t v_cy; // 10001
	uint32_t v_cx; // 10002
} /* size: 0, variables: 19 */

// <048CD358> ../thirdparty/wuffs/wuffs-v0.4.c:10125
// variables: 10
wuffs_base__status wuffs_thumbhash__decoder__from_pixels_to_dst(wuffs_thumbhash__decoder* self, wuffs_base__pixel_buffer* a_dst)
{
	uint32_t v_h; // 10128
	uint32_t v_w; // 10129
	wuffs_base__pixel_format v_dst_pixfmt; // 10130
	uint32_t v_dst_bits_per_pixel; // 10131
	uint32_t v_dst_bytes_per_pixel; // 10132
	uint64_t v_dst_bytes_per_row; // 10133
	wuffs_base__table_u8 v_tab; // 10134
	uint32_t v_y; // 10135
	wuffs_base__slice_u8 v_dst; // 10136
	wuffs_base__slice_u8 v_src; // 10137
} /* size: 0, variables: 10 */

// <048CD333> ../thirdparty/wuffs/wuffs-v0.4.c:10165
wuffs_base__rect_ie_u32 wuffs_thumbhash__decoder__frame_dirty_rect(const wuffs_thumbhash__decoder* self)
{
} /* size: 0 */

// <0483ED48> ../common/../thirdparty/wuffs/wuffs-v0.4.c:10182
wuffs_jpeg__decoder* wuffs_jpeg__decoder__alloc(void)
{
} /* size: 0 */

// <04926E47> ../thirdparty/wuffs/wuffs-v0.4.c:10185
inline wuffs_base__image_decoder* wuffs_jpeg__decoder__alloc_as__wuffs_base__image_decoder(void)
{
} /* size: 0 */

// <048CD30E> ../thirdparty/wuffs/wuffs-v0.4.c:10186
uint32_t wuffs_thumbhash__decoder__num_animation_loops(const wuffs_thumbhash__decoder* self)
{
} /* size: 0 */

// <048CD2D2> ../thirdparty/wuffs/wuffs-v0.4.c:10203
uint64_t wuffs_thumbhash__decoder__num_decoded_frame_configs(const wuffs_thumbhash__decoder* self)
{
} /* size: 0 */

// <048CD296> ../thirdparty/wuffs/wuffs-v0.4.c:10223
uint64_t wuffs_thumbhash__decoder__num_decoded_frames(const wuffs_thumbhash__decoder* self)
{
} /* size: 0 */

// <048CD253> ../thirdparty/wuffs/wuffs-v0.4.c:10243
wuffs_base__status wuffs_thumbhash__decoder__restart_frame(wuffs_thumbhash__decoder* self, uint64_t a_index, uint64_t a_io_position)
{
} /* size: 0 */

// <048CD210> ../thirdparty/wuffs/wuffs-v0.4.c:10271
wuffs_base__empty_wuffs_thumbhash__decoder__set_report_metadata(wuffs_thumbhash__decoder* self, uint32_t a_fourcc, bool a_report)
{
} /* size: 0 */

// <048CD194> ../thirdparty/wuffs/wuffs-v0.4.c:10282
// variable: 1
wuffs_base__status wuffs_thumbhash__decoder__tell_me_more(wuffs_thumbhash__decoder* self, wuffs_base__io_buffer* a_dst, wuffs_base__more_information* a_minfo, wuffs_base__io_buffer* a_src)
{

ok: // 10312

exit: // 10314
	wuffs_base__status status; // 10306
} /* size: 0, variables: 1, goto labels: 2 */

// <0483DC25> ../common/../thirdparty/wuffs/wuffs-v0.4.c:10296
// member functions: 26
// member variables: 3
// struct size: 123,016,448
struct wuffs_jpeg__decoder__struct {
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10304 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint32_t f_width_in_mcus; /* 48 4 */
		uint32_t f_height_in_mcus; /* 52 4 */
		uint8_t f_call_sequence; /* 56 1 */
		bool f_test_only_interrupt_decode_mcu; /* 57 1 */
		bool f_is_jfif; /* 58 1 */
		uint8_t f_is_adobe; /* 59 1 */
		bool f_is_rgb_or_cmyk; /* 60 1 */
		uint8_t f_sof_marker; /* 61 1 */
		uint8_t f_next_restart_marker; /* 62 1 */
		uint8_t f_max_incl_components_h; /* 63 1 */
		uint8_t f_max_incl_components_v; /* 64 1 */
		uint32_t f_num_components; /* 68 4 */
		uint8_t f_components_c[4]; /* 72 4 */
		uint8_t f_components_h[4]; /* 76 4 */
		uint8_t f_components_v[4]; /* 80 4 */
		uint8_t f_components_tq[4]; /* 84 4 */
		uint32_t f_components_workbuf_widths[4]; /* 88 16 */
		uint32_t f_components_workbuf_heights[4]; /* 104 16 */
		uint64_t f_components_workbuf_offsets[9]; /* 120 72 */
		uint32_t f_scan_count; /* 192 4 */
		uint32_t f_scan_num_components; /* 196 4 */
		uint8_t f_scan_comps_cselector[4]; /* 200 4 */
		uint8_t f_scan_comps_td[4]; /* 204 4 */
		uint8_t f_scan_comps_ta[4]; /* 208 4 */
		uint8_t f_scan_ss; /* 212 1 */
		uint8_t f_scan_se; /* 213 1 */
		uint8_t f_scan_ah; /* 214 1 */
		uint8_t f_scan_al; /* 215 1 */
		uint32_t f_scan_width_in_mcus; /* 216 4 */
		uint32_t f_scan_height_in_mcus; /* 220 4 */
		uint8_t f_scan_comps_bx_offset[16]; /* 224 16 */
		uint8_t f_scan_comps_by_offset[16]; /* 240 16 */
		uint32_t f_mcu_num_blocks; /* 256 4 */
		uint32_t f_mcu_current_block; /* 260 4 */
		uint32_t f_mcu_zig_index; /* 264 4 */
		uint8_t f_mcu_blocks_sselector[16]; /* 268 16 */
		uint64_t f_mcu_blocks_offset[10]; /* 288 80 */
		uint32_t f_mcu_blocks_mx_mul[10]; /* 368 40 */
		uint32_t f_mcu_blocks_my_mul[10]; /* 408 40 */
		uint8_t f_mcu_blocks_dc_hselector[10]; /* 448 10 */
		uint8_t f_mcu_blocks_ac_hselector[10]; /* 458 10 */
		uint16_t f_mcu_previous_dc_values[4]; /* 468 8 */
		uint8_t f_block_smoothing_lowest_scan_al[4][10]; /* 476 40 */
		uint16_t f_block_smoothing_dc_values[5][5]; /* 516 50 */
		uint32_t f_block_smoothing_mx_max_incl; /* 568 4 */
		uint32_t f_block_smoothing_my_max_incl; /* 572 4 */
		uint16_t f_restart_interval; /* 576 2 */
		uint16_t f_saved_restart_interval; /* 578 2 */
		uint16_t f_restarts_remaining; /* 580 2 */
		uint16_t f_eob_run; /* 582 2 */
		uint64_t f_frame_config_io_position; /* 584 8 */
		uint32_t f_payload_length; /* 592 4 */
		bool f_seen_dqt[4]; /* 596 4 */
		bool f_saved_seen_dqt[4]; /* 600 4 */
		bool f_seen_dht[8]; /* 604 8 */
		uint64_t f_bitstream_bits; /* 616 8 */
		uint32_t f_bitstream_n_bits; /* 624 4 */
		uint32_t f_bitstream_ri; /* 628 4 */
		uint32_t f_bitstream_wi; /* 632 4 */
		bool f_bitstream_is_closed; /* 636 1 */
		bool f_expect_multiple_scans; /* 637 1 */
		bool f_use_lower_quality; /* 638 1 */
		bool f_reject_progressive_jpegs; /* 639 1 */
		bool f_swizzle_immediately; /* 640 1 */
		wuffs_base__status f_swizzle_immediately_status; /* 648 8 */
		uint32_t f_swizzle_immediately_b_offsets[10]; /* 656 40 */
		uint32_t f_swizzle_immediately_c_offsets[5]; /* 696 20 */
		uint32_t f_bitstream_padding; /* 716 4 */
		uint16_t f_quant_tables[4][64]; /* 720 512 */
		uint16_t f_saved_quant_tables[4][64]; /* 1232 512 */
		uint8_t f_huff_tables_symbols[8][256]; /* 1744 2048 */
		uint32_t f_huff_tables_slow[8][16]; /* 3792 512 */
		uint16_t f_huff_tables_fast[8][256]; /* 4304 4096 */
		wuffs_base__pixel_swizzler f_swizzler; /* 8400 24 */
		wuffs_base__empty_struct (*choosy_decode_idct)(wuffs_jpeg__decoder* , wuffs_base__slice_u8, uint64_t, uint32_t); /* 8424 8* /
		uint32_t p_decode_image_config; /* 8432 4 */
		uint32_t p_do_decode_image_config; /* 8436 4 */
		uint32_t p_decode_dqt; /* 8440 4 */
		uint32_t p_decode_dri; /* 8444 4 */
		uint32_t p_decode_appn; /* 8448 4 */
		uint32_t p_decode_sof; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_decode_frame; /* 8464 4 */
		uint32_t p_do_decode_frame; /* 8468 4 */
		uint32_t p_decode_dht; /* 8472 4 */
		uint32_t p_decode_sos; /* 8476 4 */
		uint32_t p_prepare_scan; /* 8480 4 */
		wuffs_base__empty_struct (*choosy_load_mcu_blocks_for_single_component)(wuffs_jpeg__decoder* , uint32_t, uint32_t, wuffs_base__slice_u8, uint32_t); /* 8488 8* /
		uint32_t p_skip_past_the_next_restart_marker; /* 8496 4 */
		uint32_t (*choosy_decode_mcu)(wuffs_jpeg__decoder* , wuffs_base__pixel_buffer* , wuffs_base__slice_u8, uint32_t, uint32_t); /* 8504 8* /
	};
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10420 */
	struct {
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10430 */
		struct {
			uint8_t v_marker; /* 0 1 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10434 */
		struct {
			uint8_t v_q; /* 0 1 */
			uint32_t v_i; /* 4 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10438 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10441 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10444 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10448 */
		struct {
			uint8_t v_marker; /* 0 1 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10452 */
		struct {
			uint8_t v_tc4_th; /* 0 1 */
			uint32_t v_total_count; /* 4 4 */
			uint32_t v_i; /* 8 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10457 */
		struct {
			uint32_t v_my; /* 0 4 */
			uint32_t v_mx; /* 4 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10461 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		uint8_t f_bitstream_buffer[2048]; /* 0 2048 */
		uint16_t f_mcu_blocks[10][64]; /* 2048 1280 */
		uint8_t f_swizzle_immediately_buffer[640]; /* 3328 640 */
		uint8_t f_swizzle_ycck_scratch_buffer_2k[2048]; /* 3968 2048 */
		uint8_t f_dht_temp_counts[16]; /* 6016 16 */
		uint8_t f_dht_temp_bit_lengths[256]; /* 6032 256 */
		uint16_t f_dht_temp_bit_strings[256]; /* 6288 512 */
		uint8_t f_dst_palette[1024]; /* 6800 1024 */
		struct {
			uint8_t v_marker; /* 7824 1 */
			uint64_t scratch; /* 7832 8 */
		} s_do_decode_image_config; /* 7824 16 */
		struct {
			uint8_t v_q; /* 7840 1 */
			uint32_t v_i; /* 7844 4 */
		} s_decode_dqt; /* 7840 8 */
		struct {
			uint64_t scratch; /* 7848 8 */
		} s_decode_dri; /* 7848 8 */
		struct {
			uint64_t scratch; /* 7856 8 */
		} s_decode_appn; /* 7856 8 */
		struct {
			uint32_t v_i; /* 7864 4 */
			uint64_t scratch; /* 7872 8 */
		} s_decode_sof; /* 7864 16 */
		struct {
			uint8_t v_marker; /* 7880 1 */
			uint64_t scratch; /* 7888 8 */
		} s_do_decode_frame; /* 7880 16 */
		struct {
			uint8_t v_tc4_th; /* 7896 1 */
			uint32_t v_total_count; /* 7900 4 */
			uint32_t v_i; /* 7904 4 */
		} s_decode_dht; /* 7896 12 */
		struct {
			uint32_t v_my; /* 7908 4 */
			uint32_t v_mx; /* 7912 4 */
		} s_decode_sos; /* 7908 8 */
		struct {
			uint32_t v_i; /* 7920 4 */
			uint64_t scratch; /* 7928 8 */
		} s_prepare_scan; /* 7920 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint32_t f_width_in_mcus; /* 48 4 */
		uint32_t f_height_in_mcus; /* 52 4 */
		uint8_t f_call_sequence; /* 56 1 */
		bool f_test_only_interrupt_decode_mcu; /* 57 1 */
		bool f_is_jfif; /* 58 1 */
		uint8_t f_is_adobe; /* 59 1 */
		bool f_is_rgb_or_cmyk; /* 60 1 */
		uint8_t f_sof_marker; /* 61 1 */
		uint8_t f_next_restart_marker; /* 62 1 */
		uint8_t f_max_incl_components_h; /* 63 1 */
		uint8_t f_max_incl_components_v; /* 64 1 */
		uint32_t f_num_components; /* 68 4 */
		uint8_t f_components_c[4]; /* 72 4 */
		uint8_t f_components_h[4]; /* 76 4 */
		uint8_t f_components_v[4]; /* 80 4 */
		uint8_t f_components_tq[4]; /* 84 4 */
		uint32_t f_components_workbuf_widths[4]; /* 88 16 */
		uint32_t f_components_workbuf_heights[4]; /* 104 16 */
		uint64_t f_components_workbuf_offsets[9]; /* 120 72 */
		uint32_t f_scan_count; /* 192 4 */
		uint32_t f_scan_num_components; /* 196 4 */
		uint8_t f_scan_comps_cselector[4]; /* 200 4 */
		uint8_t f_scan_comps_td[4]; /* 204 4 */
		uint8_t f_scan_comps_ta[4]; /* 208 4 */
		uint8_t f_scan_ss; /* 212 1 */
		uint8_t f_scan_se; /* 213 1 */
		uint8_t f_scan_ah; /* 214 1 */
		uint8_t f_scan_al; /* 215 1 */
		uint32_t f_scan_width_in_mcus; /* 216 4 */
		uint32_t f_scan_height_in_mcus; /* 220 4 */
		uint8_t f_scan_comps_bx_offset[16]; /* 224 16 */
		uint8_t f_scan_comps_by_offset[16]; /* 240 16 */
		uint32_t f_mcu_num_blocks; /* 256 4 */
		uint32_t f_mcu_current_block; /* 260 4 */
		uint32_t f_mcu_zig_index; /* 264 4 */
		uint8_t f_mcu_blocks_sselector[16]; /* 268 16 */
		uint64_t f_mcu_blocks_offset[10]; /* 288 80 */
		uint32_t f_mcu_blocks_mx_mul[10]; /* 368 40 */
		uint32_t f_mcu_blocks_my_mul[10]; /* 408 40 */
		uint8_t f_mcu_blocks_dc_hselector[10]; /* 448 10 */
		uint8_t f_mcu_blocks_ac_hselector[10]; /* 458 10 */
		uint16_t f_mcu_previous_dc_values[4]; /* 468 8 */
		uint8_t f_block_smoothing_lowest_scan_al[4][10]; /* 476 40 */
		uint16_t f_block_smoothing_dc_values[5][5]; /* 516 50 */
		uint32_t f_block_smoothing_mx_max_incl; /* 568 4 */
		uint32_t f_block_smoothing_my_max_incl; /* 572 4 */
		uint16_t f_restart_interval; /* 576 2 */
		uint16_t f_saved_restart_interval; /* 578 2 */
		uint16_t f_restarts_remaining; /* 580 2 */
		uint16_t f_eob_run; /* 582 2 */
		uint64_t f_frame_config_io_position; /* 584 8 */
		uint32_t f_payload_length; /* 592 4 */
		bool f_seen_dqt[4]; /* 596 4 */
		bool f_saved_seen_dqt[4]; /* 600 4 */
		bool f_seen_dht[8]; /* 604 8 */
		uint64_t f_bitstream_bits; /* 616 8 */
		uint32_t f_bitstream_n_bits; /* 624 4 */
		uint32_t f_bitstream_ri; /* 628 4 */
		uint32_t f_bitstream_wi; /* 632 4 */
		bool f_bitstream_is_closed; /* 636 1 */
		bool f_expect_multiple_scans; /* 637 1 */
		bool f_use_lower_quality; /* 638 1 */
		bool f_reject_progressive_jpegs; /* 639 1 */
		bool f_swizzle_immediately; /* 640 1 */
		wuffs_base__status f_swizzle_immediately_status; /* 648 8 */
		uint32_t f_swizzle_immediately_b_offsets[10]; /* 656 40 */
		uint32_t f_swizzle_immediately_c_offsets[5]; /* 696 20 */
		uint32_t f_bitstream_padding; /* 716 4 */
		uint16_t f_quant_tables[4][64]; /* 720 512 */
		uint16_t f_saved_quant_tables[4][64]; /* 1232 512 */
		uint8_t f_huff_tables_symbols[8][256]; /* 1744 2048 */
		uint32_t f_huff_tables_slow[8][16]; /* 3792 512 */
		uint16_t f_huff_tables_fast[8][256]; /* 4304 4096 */
		wuffs_base__pixel_swizzler f_swizzler; /* 8400 24 */
		wuffs_base__empty_struct (*choosy_decode_idct)(wuffs_jpeg__decoder* , wuffs_base__slice_u8, uint64_t, uint32_t); /* 8424 8* /
		uint32_t p_decode_image_config; /* 8432 4 */
		uint32_t p_do_decode_image_config; /* 8436 4 */
		uint32_t p_decode_dqt; /* 8440 4 */
		uint32_t p_decode_dri; /* 8444 4 */
		uint32_t p_decode_appn; /* 8448 4 */
		uint32_t p_decode_sof; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_decode_frame; /* 8464 4 */
		uint32_t p_do_decode_frame; /* 8468 4 */
		uint32_t p_decode_dht; /* 8472 4 */
		uint32_t p_decode_sos; /* 8476 4 */
		uint32_t p_prepare_scan; /* 8480 4 */
		wuffs_base__empty_struct (*choosy_load_mcu_blocks_for_single_component)(wuffs_jpeg__decoder* , uint32_t, uint32_t, wuffs_base__slice_u8, uint32_t); /* 8488 8* /
		uint32_t p_skip_past_the_next_restart_marker; /* 8496 4 */
		uint32_t (*choosy_decode_mcu)(wuffs_jpeg__decoder* , wuffs_base__pixel_buffer* , wuffs_base__slice_u8, uint32_t, uint32_t); /* 8504 8* /
	} private_impl; /* 0 8512 */
	struct {
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10430 */
		struct {
			uint8_t v_marker; /* 8512 1 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10434 */
		struct {
			uint8_t v_q; /* 8512 1 */
			uint32_t v_i; /* 8516 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10438 */
		struct {
			uint64_t scratch; /* 8512 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10441 */
		struct {
			uint64_t scratch; /* 8512 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10444 */
		struct {
			uint32_t v_i; /* 8512 4 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10448 */
		struct {
			uint8_t v_marker; /* 8512 1 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10452 */
		struct {
			uint8_t v_tc4_th; /* 8512 1 */
			uint32_t v_total_count; /* 8516 4 */
			uint32_t v_i; /* 8520 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10457 */
		struct {
			uint32_t v_my; /* 8512 4 */
			uint32_t v_mx; /* 8516 4 */
		};
		/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10461 */
		struct {
			uint32_t v_i; /* 8512 4 */
			uint64_t scratch; /* 8520 8 */
		};
		uint8_t f_bitstream_buffer[2048]; /* 8512 2048 */
		uint16_t f_mcu_blocks[10][64]; /* 10560 1280 */
		uint8_t f_swizzle_immediately_buffer[640]; /* 11840 640 */
		uint8_t f_swizzle_ycck_scratch_buffer_2k[2048]; /* 12480 2048 */
		uint8_t f_dht_temp_counts[16]; /* 14528 16 */
		uint8_t f_dht_temp_bit_lengths[256]; /* 14544 256 */
		uint16_t f_dht_temp_bit_strings[256]; /* 14800 512 */
		uint8_t f_dst_palette[1024]; /* 15312 1024 */
		struct {
			uint8_t v_marker; /* 16336 1 */
			uint64_t scratch; /* 16344 8 */
		} s_do_decode_image_config; /* 16336 16 */
		struct {
			uint8_t v_q; /* 16352 1 */
			uint32_t v_i; /* 16356 4 */
		} s_decode_dqt; /* 16352 8 */
		struct {
			uint64_t scratch; /* 16360 8 */
		} s_decode_dri; /* 16360 8 */
		struct {
			uint64_t scratch; /* 16368 8 */
		} s_decode_appn; /* 16368 8 */
		struct {
			uint32_t v_i; /* 16376 4 */
			uint64_t scratch; /* 16384 8 */
		} s_decode_sof; /* 16376 16 */
		struct {
			uint8_t v_marker; /* 16392 1 */
			uint64_t scratch; /* 16400 8 */
		} s_do_decode_frame; /* 16392 16 */
		struct {
			uint8_t v_tc4_th; /* 16408 1 */
			uint32_t v_total_count; /* 16412 4 */
			uint32_t v_i; /* 16416 4 */
		} s_decode_dht; /* 16408 12 */
		struct {
			uint32_t v_my; /* 16420 4 */
			uint32_t v_mx; /* 16424 4 */
		} s_decode_sos; /* 16420 8 */
		struct {
			uint32_t v_i; /* 16432 4 */
			uint64_t scratch; /* 16440 8 */
		} s_prepare_scan; /* 16432 16 */
	} private_data; /* 8512 7936 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10469 */
	typedef struct unique_ptr<wuffs_jpeg__decoder__struct, wuffs_unique_ptr_deleter> unique_ptr;
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10474 */
	unique_ptr alloc(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10479 */
	unique_ptr alloc_as__wuffs_base__image_decoder(void);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10497 */
	void wuffs_jpeg__decoder__struct(wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10498 */
	void wuffs_jpeg__decoder__struct(wuffs_jpeg__decoder__struct* , const wuffs_jpeg__decoder__struct& );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10499 */
	wuffs_jpeg__decoder__struct& operator=(wuffs_jpeg__decoder__struct* , const wuffs_jpeg__decoder__struct& );
	uint8_t dead_weight[123000000]; /* 16448 123000000 */
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10516 */
	wuffs_base__status initialize(wuffs_jpeg__decoder__struct* , size_t, uint64_t, uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10525 */
	wuffs_base__image_decoder* upcast_as__wuffs_base__image_decoder(wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10530 */
	uint64_t get_quirk(const wuffs_jpeg__decoder__struct* , uint32_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10536 */
	wuffs_base__status set_quirk(wuffs_jpeg__decoder__struct* , uint32_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10543 */
	wuffs_base__status decode_image_config(wuffs_jpeg__decoder__struct* , wuffs_base__image_config* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10550 */
	wuffs_base__status decode_frame_config(wuffs_jpeg__decoder__struct* , wuffs_base__frame_config* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10557 */
	wuffs_base__status decode_frame(wuffs_jpeg__decoder__struct* , wuffs_base__pixel_buffer* , wuffs_base__io_buffer* , wuffs_base__pixel_blend, wuffs_base__slice_u8, wuffs_base__decode_frame_options* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10567 */
	wuffs_base__rect_ie_u32 frame_dirty_rect(const wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10572 */
	uint32_t num_animation_loops(const wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10577 */
	uint64_t num_decoded_frame_configs(const wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10582 */
	uint64_t num_decoded_frames(const wuffs_jpeg__decoder__struct* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10587 */
	wuffs_base__status restart_frame(wuffs_jpeg__decoder__struct* , uint64_t, uint64_t);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10594 */
	wuffs_base__empty_struct set_report_metadata(wuffs_jpeg__decoder__struct* , uint32_t, bool);
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10601 */
	wuffs_base__status tell_me_more(wuffs_jpeg__decoder__struct* , wuffs_base__io_buffer* , wuffs_base__more_information* , wuffs_base__io_buffer* );
	/* ../common/../thirdparty/wuffs/wuffs-v0.4.c:10609 */
	wuffs_base__range_ii_u64 workbuf_len(const wuffs_jpeg__decoder__struct* );
};

// <04876BD9> ../thirdparty/wuffs/wuffs-v0.4.c:10296
// member functions: 23
// member variables: 2
// struct size: 16,448
struct wuffs_jpeg__decoder__struct {
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10304 */
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint32_t f_width_in_mcus; /* 48 4 */
		uint32_t f_height_in_mcus; /* 52 4 */
		uint8_t f_call_sequence; /* 56 1 */
		bool f_test_only_interrupt_decode_mcu; /* 57 1 */
		bool f_is_jfif; /* 58 1 */
		uint8_t f_is_adobe; /* 59 1 */
		bool f_is_rgb_or_cmyk; /* 60 1 */
		uint8_t f_sof_marker; /* 61 1 */
		uint8_t f_next_restart_marker; /* 62 1 */
		uint8_t f_max_incl_components_h; /* 63 1 */
		uint8_t f_max_incl_components_v; /* 64 1 */
		uint32_t f_num_components; /* 68 4 */
		uint8_t f_components_c[4]; /* 72 4 */
		uint8_t f_components_h[4]; /* 76 4 */
		uint8_t f_components_v[4]; /* 80 4 */
		uint8_t f_components_tq[4]; /* 84 4 */
		uint32_t f_components_workbuf_widths[4]; /* 88 16 */
		uint32_t f_components_workbuf_heights[4]; /* 104 16 */
		uint64_t f_components_workbuf_offsets[9]; /* 120 72 */
		uint32_t f_scan_count; /* 192 4 */
		uint32_t f_scan_num_components; /* 196 4 */
		uint8_t f_scan_comps_cselector[4]; /* 200 4 */
		uint8_t f_scan_comps_td[4]; /* 204 4 */
		uint8_t f_scan_comps_ta[4]; /* 208 4 */
		uint8_t f_scan_ss; /* 212 1 */
		uint8_t f_scan_se; /* 213 1 */
		uint8_t f_scan_ah; /* 214 1 */
		uint8_t f_scan_al; /* 215 1 */
		uint32_t f_scan_width_in_mcus; /* 216 4 */
		uint32_t f_scan_height_in_mcus; /* 220 4 */
		uint8_t f_scan_comps_bx_offset[16]; /* 224 16 */
		uint8_t f_scan_comps_by_offset[16]; /* 240 16 */
		uint32_t f_mcu_num_blocks; /* 256 4 */
		uint32_t f_mcu_current_block; /* 260 4 */
		uint32_t f_mcu_zig_index; /* 264 4 */
		uint8_t f_mcu_blocks_sselector[16]; /* 268 16 */
		uint64_t f_mcu_blocks_offset[10]; /* 288 80 */
		uint32_t f_mcu_blocks_mx_mul[10]; /* 368 40 */
		uint32_t f_mcu_blocks_my_mul[10]; /* 408 40 */
		uint8_t f_mcu_blocks_dc_hselector[10]; /* 448 10 */
		uint8_t f_mcu_blocks_ac_hselector[10]; /* 458 10 */
		uint16_t f_mcu_previous_dc_values[4]; /* 468 8 */
		uint8_t f_block_smoothing_lowest_scan_al[4][10]; /* 476 40 */
		uint16_t f_block_smoothing_dc_values[5][5]; /* 516 50 */
		uint32_t f_block_smoothing_mx_max_incl; /* 568 4 */
		uint32_t f_block_smoothing_my_max_incl; /* 572 4 */
		uint16_t f_restart_interval; /* 576 2 */
		uint16_t f_saved_restart_interval; /* 578 2 */
		uint16_t f_restarts_remaining; /* 580 2 */
		uint16_t f_eob_run; /* 582 2 */
		uint64_t f_frame_config_io_position; /* 584 8 */
		uint32_t f_payload_length; /* 592 4 */
		bool f_seen_dqt[4]; /* 596 4 */
		bool f_saved_seen_dqt[4]; /* 600 4 */
		bool f_seen_dht[8]; /* 604 8 */
		uint64_t f_bitstream_bits; /* 616 8 */
		uint32_t f_bitstream_n_bits; /* 624 4 */
		uint32_t f_bitstream_ri; /* 628 4 */
		uint32_t f_bitstream_wi; /* 632 4 */
		bool f_bitstream_is_closed; /* 636 1 */
		bool f_expect_multiple_scans; /* 637 1 */
		bool f_use_lower_quality; /* 638 1 */
		bool f_reject_progressive_jpegs; /* 639 1 */
		bool f_swizzle_immediately; /* 640 1 */
		wuffs_base__status f_swizzle_immediately_status; /* 648 8 */
		uint32_t f_swizzle_immediately_b_offsets[10]; /* 656 40 */
		uint32_t f_swizzle_immediately_c_offsets[5]; /* 696 20 */
		uint32_t f_bitstream_padding; /* 716 4 */
		uint16_t f_quant_tables[4][64]; /* 720 512 */
		uint16_t f_saved_quant_tables[4][64]; /* 1232 512 */
		uint8_t f_huff_tables_symbols[8][256]; /* 1744 2048 */
		uint32_t f_huff_tables_slow[8][16]; /* 3792 512 */
		uint16_t f_huff_tables_fast[8][256]; /* 4304 4096 */
		wuffs_base__pixel_swizzler f_swizzler; /* 8400 24 */
		wuffs_base__empty_struct (*choosy_decode_idct)(wuffs_jpeg__decoder* , wuffs_base__slice_u8, uint64_t, uint32_t); /* 8424 8* /
		uint32_t p_decode_image_config; /* 8432 4 */
		uint32_t p_do_decode_image_config; /* 8436 4 */
		uint32_t p_decode_dqt; /* 8440 4 */
		uint32_t p_decode_dri; /* 8444 4 */
		uint32_t p_decode_appn; /* 8448 4 */
		uint32_t p_decode_sof; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_decode_frame; /* 8464 4 */
		uint32_t p_do_decode_frame; /* 8468 4 */
		uint32_t p_decode_dht; /* 8472 4 */
		uint32_t p_decode_sos; /* 8476 4 */
		uint32_t p_prepare_scan; /* 8480 4 */
		wuffs_base__empty_struct (*choosy_load_mcu_blocks_for_single_component)(wuffs_jpeg__decoder* , uint32_t, uint32_t, wuffs_base__slice_u8, uint32_t); /* 8488 8* /
		uint32_t p_skip_past_the_next_restart_marker; /* 8496 4 */
		uint32_t (*choosy_decode_mcu)(wuffs_jpeg__decoder* , wuffs_base__pixel_buffer* , wuffs_base__slice_u8, uint32_t, uint32_t); /* 8504 8* /
	};
	/* ../thirdparty/wuffs/wuffs-v0.4.c:10420 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10430 */
		struct {
			uint8_t v_marker; /* 0 1 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10434 */
		struct {
			uint8_t v_q; /* 0 1 */
			uint32_t v_i; /* 4 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10438 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10441 */
		struct {
			uint64_t scratch; /* 0 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10444 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10448 */
		struct {
			uint8_t v_marker; /* 0 1 */
			uint64_t scratch; /* 8 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10452 */
		struct {
			uint8_t v_tc4_th; /* 0 1 */
			uint32_t v_total_count; /* 4 4 */
			uint32_t v_i; /* 8 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10457 */
		struct {
			uint32_t v_my; /* 0 4 */
			uint32_t v_mx; /* 4 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10461 */
		struct {
			uint32_t v_i; /* 0 4 */
			uint64_t scratch; /* 8 8 */
		};
		uint8_t f_bitstream_buffer[2048]; /* 0 2048 */
		uint16_t f_mcu_blocks[10][64]; /* 2048 1280 */
		uint8_t f_swizzle_immediately_buffer[640]; /* 3328 640 */
		uint8_t f_swizzle_ycck_scratch_buffer_2k[2048]; /* 3968 2048 */
		uint8_t f_dht_temp_counts[16]; /* 6016 16 */
		uint8_t f_dht_temp_bit_lengths[256]; /* 6032 256 */
		uint16_t f_dht_temp_bit_strings[256]; /* 6288 512 */
		uint8_t f_dst_palette[1024]; /* 6800 1024 */
		struct {
			uint8_t v_marker; /* 7824 1 */
			uint64_t scratch; /* 7832 8 */
		} s_do_decode_image_config; /* 7824 16 */
		struct {
			uint8_t v_q; /* 7840 1 */
			uint32_t v_i; /* 7844 4 */
		} s_decode_dqt; /* 7840 8 */
		struct {
			uint64_t scratch; /* 7848 8 */
		} s_decode_dri; /* 7848 8 */
		struct {
			uint64_t scratch; /* 7856 8 */
		} s_decode_appn; /* 7856 8 */
		struct {
			uint32_t v_i; /* 7864 4 */
			uint64_t scratch; /* 7872 8 */
		} s_decode_sof; /* 7864 16 */
		struct {
			uint8_t v_marker; /* 7880 1 */
			uint64_t scratch; /* 7888 8 */
		} s_do_decode_frame; /* 7880 16 */
		struct {
			uint8_t v_tc4_th; /* 7896 1 */
			uint32_t v_total_count; /* 7900 4 */
			uint32_t v_i; /* 7904 4 */
		} s_decode_dht; /* 7896 12 */
		struct {
			uint32_t v_my; /* 7908 4 */
			uint32_t v_mx; /* 7912 4 */
		} s_decode_sos; /* 7908 8 */
		struct {
			uint32_t v_i; /* 7920 4 */
			uint64_t scratch; /* 7928 8 */
		} s_prepare_scan; /* 7920 16 */
	};
	struct {
		uint32_t magic; /* 0 4 */
		uint32_t active_coroutine; /* 4 4 */
		wuffs_base__vtable vtable_for__wuffs_base__image_decoder; /* 8 16 */
		wuffs_base__vtable null_vtable; /* 24 16 */
		uint32_t f_width; /* 40 4 */
		uint32_t f_height; /* 44 4 */
		uint32_t f_width_in_mcus; /* 48 4 */
		uint32_t f_height_in_mcus; /* 52 4 */
		uint8_t f_call_sequence; /* 56 1 */
		bool f_test_only_interrupt_decode_mcu; /* 57 1 */
		bool f_is_jfif; /* 58 1 */
		uint8_t f_is_adobe; /* 59 1 */
		bool f_is_rgb_or_cmyk; /* 60 1 */
		uint8_t f_sof_marker; /* 61 1 */
		uint8_t f_next_restart_marker; /* 62 1 */
		uint8_t f_max_incl_components_h; /* 63 1 */
		uint8_t f_max_incl_components_v; /* 64 1 */
		uint32_t f_num_components; /* 68 4 */
		uint8_t f_components_c[4]; /* 72 4 */
		uint8_t f_components_h[4]; /* 76 4 */
		uint8_t f_components_v[4]; /* 80 4 */
		uint8_t f_components_tq[4]; /* 84 4 */
		uint32_t f_components_workbuf_widths[4]; /* 88 16 */
		uint32_t f_components_workbuf_heights[4]; /* 104 16 */
		uint64_t f_components_workbuf_offsets[9]; /* 120 72 */
		uint32_t f_scan_count; /* 192 4 */
		uint32_t f_scan_num_components; /* 196 4 */
		uint8_t f_scan_comps_cselector[4]; /* 200 4 */
		uint8_t f_scan_comps_td[4]; /* 204 4 */
		uint8_t f_scan_comps_ta[4]; /* 208 4 */
		uint8_t f_scan_ss; /* 212 1 */
		uint8_t f_scan_se; /* 213 1 */
		uint8_t f_scan_ah; /* 214 1 */
		uint8_t f_scan_al; /* 215 1 */
		uint32_t f_scan_width_in_mcus; /* 216 4 */
		uint32_t f_scan_height_in_mcus; /* 220 4 */
		uint8_t f_scan_comps_bx_offset[16]; /* 224 16 */
		uint8_t f_scan_comps_by_offset[16]; /* 240 16 */
		uint32_t f_mcu_num_blocks; /* 256 4 */
		uint32_t f_mcu_current_block; /* 260 4 */
		uint32_t f_mcu_zig_index; /* 264 4 */
		uint8_t f_mcu_blocks_sselector[16]; /* 268 16 */
		uint64_t f_mcu_blocks_offset[10]; /* 288 80 */
		uint32_t f_mcu_blocks_mx_mul[10]; /* 368 40 */
		uint32_t f_mcu_blocks_my_mul[10]; /* 408 40 */
		uint8_t f_mcu_blocks_dc_hselector[10]; /* 448 10 */
		uint8_t f_mcu_blocks_ac_hselector[10]; /* 458 10 */
		uint16_t f_mcu_previous_dc_values[4]; /* 468 8 */
		uint8_t f_block_smoothing_lowest_scan_al[4][10]; /* 476 40 */
		uint16_t f_block_smoothing_dc_values[5][5]; /* 516 50 */
		uint32_t f_block_smoothing_mx_max_incl; /* 568 4 */
		uint32_t f_block_smoothing_my_max_incl; /* 572 4 */
		uint16_t f_restart_interval; /* 576 2 */
		uint16_t f_saved_restart_interval; /* 578 2 */
		uint16_t f_restarts_remaining; /* 580 2 */
		uint16_t f_eob_run; /* 582 2 */
		uint64_t f_frame_config_io_position; /* 584 8 */
		uint32_t f_payload_length; /* 592 4 */
		bool f_seen_dqt[4]; /* 596 4 */
		bool f_saved_seen_dqt[4]; /* 600 4 */
		bool f_seen_dht[8]; /* 604 8 */
		uint64_t f_bitstream_bits; /* 616 8 */
		uint32_t f_bitstream_n_bits; /* 624 4 */
		uint32_t f_bitstream_ri; /* 628 4 */
		uint32_t f_bitstream_wi; /* 632 4 */
		bool f_bitstream_is_closed; /* 636 1 */
		bool f_expect_multiple_scans; /* 637 1 */
		bool f_use_lower_quality; /* 638 1 */
		bool f_reject_progressive_jpegs; /* 639 1 */
		bool f_swizzle_immediately; /* 640 1 */
		wuffs_base__status f_swizzle_immediately_status; /* 648 8 */
		uint32_t f_swizzle_immediately_b_offsets[10]; /* 656 40 */
		uint32_t f_swizzle_immediately_c_offsets[5]; /* 696 20 */
		uint32_t f_bitstream_padding; /* 716 4 */
		uint16_t f_quant_tables[4][64]; /* 720 512 */
		uint16_t f_saved_quant_tables[4][64]; /* 1232 512 */
		uint8_t f_huff_tables_symbols[8][256]; /* 1744 2048 */
		uint32_t f_huff_tables_slow[8][16]; /* 3792 512 */
		uint16_t f_huff_tables_fast[8][256]; /* 4304 4096 */
		wuffs_base__pixel_swizzler f_swizzler; /* 8400 24 */
		wuffs_base__empty_struct (*choosy_decode_idct)(wuffs_jpeg__decoder* , wuffs_base__slice_u8, uint64_t, uint32_t); /* 8424 8* /
		uint32_t p_decode_image_config; /* 8432 4 */
		uint32_t p_do_decode_image_config; /* 8436 4 */
		uint32_t p_decode_dqt; /* 8440 4 */
		uint32_t p_decode_dri; /* 8444 4 */
		uint32_t p_decode_appn; /* 8448 4 */
		uint32_t p_decode_sof; /* 8452 4 */
		uint32_t p_decode_frame_config; /* 8456 4 */
		uint32_t p_do_decode_frame_config; /* 8460 4 */
		uint32_t p_decode_frame; /* 8464 4 */
		uint32_t p_do_decode_frame; /* 8468 4 */
		uint32_t p_decode_dht; /* 8472 4 */
		uint32_t p_decode_sos; /* 8476 4 */
		uint32_t p_prepare_scan; /* 8480 4 */
		wuffs_base__empty_struct (*choosy_load_mcu_blocks_for_single_component)(wuffs_jpeg__decoder* , uint32_t, uint32_t, wuffs_base__slice_u8, uint32_t); /* 8488 8* /
		uint32_t p_skip_past_the_next_restart_marker; /* 8496 4 */
		uint32_t (*choosy_decode_mcu)(wuffs_jpeg__decoder* , wuffs_base__pixel_buffer* , wuffs_base__slice_u8, uint32_t, uint32_t); /* 8504 8* /
	} private_impl; /* 0 8512 */
	struct {
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10430 */
		struct {
			uint8_t v_marker; /* 8512 1 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10434 */
		struct {
			uint8_t v_q; /* 8512 1 */
			uint32_t v_i; /* 8516 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10438 */
		struct {
			uint64_t scratch; /* 8512 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10441 */
		struct {
			uint64_t scratch; /* 8512 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10444 */
		struct {
			uint32_t v_i; /* 8512 4 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10448 */
		struct {
			uint8_t v_marker; /* 8512 1 */
			uint64_t scratch; /* 8520 8 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10452 */
		struct {
			uint8_t v_tc4_th; /* 8512 1 */
			uint32_t v_total_count; /* 8516 4 */
			uint32_t v_i; /* 8520 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10457 */
		struct {
			uint32_t v_my; /* 8512 4 */
			uint32_t v_mx; /* 8516 4 */
		};
		/* ../thirdparty/wuffs/wuffs-v0.4.c:10461 */
		struct {
			uint32_t v_i; /* 8512 4 */
			uint64_t scratch; /* 8520 8 */
		};
		uint8_t f_bitstream_buffer[2048]; /* 8512 2048 */
		uint16_t f_mcu_blocks[10][64]; /* 10560 1280 */
		uint8_t f_swizzle_immediately_buffer[640]; /* 11840 640 */
		uint8_t f_swizzle_ycck_scratch_buffer_2k[2048]; /* 12480 2048 */
		uint8_t f_dht_temp_counts[16]; /* 14528 16 */
		uint8_t f_dht_temp_bit_lengths[256]; /* 14544 256 */
		uint16_t f_dht_temp_bit_strings[256]; /* 14800 512 */
		uint8_t f_dst_palette[1024]; /* 15312 1024 */
		struct {
			uint8_t v_marker; /* 16336 1 */
			uint64_t scratch; /* 16344 8 */
		} s_do_decode_image_config; /* 16336 16 */
		struct {
			uint8_t v_q; /* 16352 1 */
