
//
// tier0/global_tables.cpp
//
//	referenced by: libtier0.so
//
//	functions: 3
//	class: 1
//

// <001A416B> tier0/global_tables.cpp:295
inline int TableBitForBitnum(int bitNum)
{
} /* size: 0 */

// <001A3DD5> tier0/global_tables.cpp:300
// member functions: 2
// class size: 1
class CBitWriteMasksInit {
	/* tier0/global_tables.cpp:303 */
	void CBitWriteMasksInit(CBitWriteMasksInit* );
	void CBitWriteMasksInit(class CBitWriteMasksInit *); /* linkage=_ZN18CBitWriteMasksInitC4Ev */
};

// <001A4018> tier0/global_tables.cpp:303
// variables: 8
// function calls: 3
void CBitWriteMasksInit::CBitWriteMasksInit()
{
	{
		unsigned int startbit; // 305
		{
			unsigned int nBitsLeft; // 307
			{
				unsigned int endbit; // 309
			}
		}
	}
	{
		unsigned int maskBit; // 316
	}
	{
		unsigned int startbit; // 305
		{
			unsigned int nBitsLeft; // 307
			{
				unsigned int endbit; // 309
				TableBitForBitnum(int bitNum); // 310
				TableBitForBitnum(int bitNum); // 312
			}
		}
	}
	{
		unsigned int maskBit; // 316
		TableBitForBitnum(int bitNum); // 317
	}
} /* size: 194 */

// <001A3FBF> tier0/global_tables.cpp:303
// variables: 4
inline void CBitWriteMasksInit::CBitWriteMasksInit()
{
	{
		unsigned int startbit; // 305
		{
			unsigned int nBitsLeft; // 307
			{
				unsigned int endbit; // 309
			}
		}
	}
	{
		unsigned int maskBit; // 316
	}
} /* size: 0 */

