
//
// engine2/inputservice.h
//
//	referenced by: libengine2.so
//
//	functions: 62
//	class: 1
//

// <004600D7> engine2/inputservice.h:17
// member functions: 167
// member variables: 19
// static member variable: 1
// vtable entries: 20
// class size: 7,960
class CInputService : public CBaseEngineService<IInputService> {
	/* engine2/inputservice.h:68 */
	struct BindingInfo_t {
		char * m_pBinding; /* 0 8 */
		bool m_bBindingSetByUser:1; /* 8: 0 1 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* engine2/inputservice.h:75 */
	struct KeyContext_t {
		/* engine2/inputservice.h:77 */
		void KeyContext_t(KeyContext_t* );
		BindingInfo_t m_pKeyInfo[369]; /* 0 5904 */
		CUtlVector<ButtonCode_t, CUtlMemory<ButtonCode_t, int> > m_Modifiers; /* 5904 32 */
		void ~KeyContext_t(KeyContext_t* );
	};
	/* engine2/inputservice.h:128 */
	class CCommandMemberInitializer_ListBoundKeys {
		/* engine2/inputservice.h:128 */
		void CCommandMemberInitializer_ListBoundKeys(CCommandMemberInitializer_ListBoundKeys* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_ListBoundKeys(CCommandMemberInitializer_ListBoundKeys* );
	};
	/* engine2/inputservice.h:129 */
	class CCommandMemberInitializer_FindBinding {
		/* engine2/inputservice.h:129 */
		void CCommandMemberInitializer_FindBinding(CCommandMemberInitializer_FindBinding* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_FindBinding(CCommandMemberInitializer_FindBinding* );
	};
	/* engine2/inputservice.h:130 */
	class CCommandMemberInitializer_ExecConfigFile {
		/* engine2/inputservice.h:130 */
		void CCommandMemberInitializer_ExecConfigFile(CCommandMemberInitializer_ExecConfigFile* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_ExecConfigFile(CCommandMemberInitializer_ExecConfigFile* );
	};
	/* engine2/inputservice.h:131 */
	class CCommandMemberInitializer_ExecConfigFileIfExists {
		/* engine2/inputservice.h:131 */
		void CCommandMemberInitializer_ExecConfigFileIfExists(CCommandMemberInitializer_ExecConfigFileIfExists* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_ExecConfigFileIfExists(CCommandMemberInitializer_ExecConfigFileIfExists* );
	};
	/* engine2/inputservice.h:132 */
	class CCommandMemberInitializer_ExecConfigFileAsync {
		/* engine2/inputservice.h:132 */
		void CCommandMemberInitializer_ExecConfigFileAsync(CCommandMemberInitializer_ExecConfigFileAsync* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_ExecConfigFileAsync(CCommandMemberInitializer_ExecConfigFileAsync* );
	};
	/* engine2/inputservice.h:133 */
	class CCommandMemberInitializer_ExecPerfTest {
		/* engine2/inputservice.h:133 */
		void CCommandMemberInitializer_ExecPerfTest(CCommandMemberInitializer_ExecPerfTest* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_ExecPerfTest(CCommandMemberInitializer_ExecPerfTest* );
	};
	/* engine2/inputservice.h:134 */
	class CCommandMemberInitializer_BindKey {
		/* engine2/inputservice.h:134 */
		void CCommandMemberInitializer_BindKey(CCommandMemberInitializer_BindKey* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_BindKey(CCommandMemberInitializer_BindKey* );
	};
	/* engine2/inputservice.h:135 */
	class CCommandMemberInitializer_UnbindAll {
		/* engine2/inputservice.h:135 */
		void CCommandMemberInitializer_UnbindAll(CCommandMemberInitializer_UnbindAll* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_UnbindAll(CCommandMemberInitializer_UnbindAll* );
	};
	/* engine2/inputservice.h:136 */
	class CCommandMemberInitializer_Unbind {
		/* engine2/inputservice.h:136 */
		void CCommandMemberInitializer_Unbind(CCommandMemberInitializer_Unbind* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_Unbind(CCommandMemberInitializer_Unbind* );
	};
	/* engine2/inputservice.h:137 */
	class CCommandMemberInitializer_BindDefaults {
		/* engine2/inputservice.h:137 */
		void CCommandMemberInitializer_BindDefaults(CCommandMemberInitializer_BindDefaults* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_BindDefaults(CCommandMemberInitializer_BindDefaults* );
	};
	/* engine2/inputservice.h:138 */
	class CCommandMemberInitializer_OnWriteKeyBindings {
		/* engine2/inputservice.h:138 */
		void CCommandMemberInitializer_OnWriteKeyBindings(CCommandMemberInitializer_OnWriteKeyBindings* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_OnWriteKeyBindings(CCommandMemberInitializer_OnWriteKeyBindings* );
	};
	/* engine2/inputservice.h:139 */
	class CCommandMemberInitializer_OnWriteConfig {
		/* engine2/inputservice.h:139 */
		void CCommandMemberInitializer_OnWriteConfig(CCommandMemberInitializer_OnWriteConfig* );
	private:
		CConCommandMemberAccessor<CInputService> m_ConCommandAccessor; /* 0 160 */
		void ~CCommandMemberInitializer_OnWriteConfig(CCommandMemberInitializer_OnWriteConfig* );
	};
	/* engine2/inputservice.h:158 */
	struct AsyncConfigFile_t {
		CUtlBuffer m_buf; /* 0 80 */
		uint64 m_nSleepUntilTicks; /* 80 8 */
		int m_nWaitOnIdx; /* 88 4 */
		/* engine2/inputservice.h:164 */
		void AsyncConfigFile_t(AsyncConfigFile_t* );
		/* engine2/inputservice.h:170 */
		void AsyncConfigFile_t(AsyncConfigFile_t* , const AsyncConfigFile_t& );
		/* engine2/inputservice.h:178 */
		AsyncConfigFile_t& operator=(AsyncConfigFile_t* , const AsyncConfigFile_t& );
		void ~AsyncConfigFile_t(AsyncConfigFile_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* engine2/inputservice.h:194 */
	struct AsyncCommand_t {
		const char * m_pName; /* 0 8 */
		FnCommandCallbackAsync_t m_fn; /* 8 8 */
	};
	/* engine2/inputservice.h:192 */
	typedef void ()(CInputService* , int, const CCommand& ) CInputService::* FnCommandCallbackAsync_t;
public:
	/* class CBaseEngineService<IInputService> <ancestor>; */ /* 0 64 */
	void CInputService(CInputService* , const CInputService& );
	/* engine2/inputservice.cpp:1023 */
	virtual InitReturnVal_t Init(CInputService* );
	/* engine2/inputservice.cpp:1111 */
	virtual void Shutdown(CInputService* );
	/* engine2/inputservice.cpp:88 */
	virtual const EngineServiceDependencies_t* GetServiceDependencies(CInputService* );
	/* engine2/inputservice.cpp:1439 */
	virtual bool IsAppActive(const CInputService* );
	/* engine2/inputservice.cpp:1515 */
	virtual void InsertCommand(CInputService* , const char* );
	/* engine2/inputservice.cpp:1240 */
	virtual bool ReadKeyBindings(CInputService* );
	/* engine2/inputservice.cpp:149 */
	virtual void SetBinding(CInputService* , ButtonCode_t, const char* , bool);
	/* engine2/inputservice.cpp:574 */
	virtual const char* GetBinding(CInputService* , ButtonCode_t);
	/* engine2/inputservice.cpp:562 */
	virtual const char* Key_NameForBinding(CInputService* , const char* , int, int);
	/* engine2/inputservice.cpp:1361 */
	virtual void ReadArchivedConvars(CInputService* , const char* , CUtlBuffer& , bool);
	/* engine2/inputservice.cpp:1401 */
	virtual void WriteArchivedConvars(CInputService* , CUtlBuffer& );
	/* engine2/inputservice.cpp:1453 */
	virtual bool HasMouseFocus(const CInputService* );
	/* engine2/inputservice.cpp:102 */
	virtual void EnableKeyBindingSystem(CInputService* , bool);
	/* engine2/inputservice.cpp:1463 */
	virtual void SaveKeyBindings(CInputService* );
	/* engine2/inputservice.cpp:313 */
	virtual void UnbindAllKeys(CInputService* );
	/* engine2/inputservice.cpp:1079 */
	virtual void SaveConvarState(CInputService* );
	/* engine2/inputservice.cpp:1471 */
	virtual void GetCursorPosition(CInputService* , int* , int* );
	/* engine2/inputservice.cpp:1476 */
	virtual void SetCursorPosition(CInputService* , int, int);
	/* engine2/inputservice.cpp:1257 */
	virtual CUtlString GenerateConfigFileName(CInputService* , const char* , bool* , bool);
	/* engine2/inputservice.cpp:1489 */
	virtual void Pump(CInputService* );
	/* engine2/inputservice.cpp:72 */
	void CInputService(CInputService* );
	/* engine2/inputservice.cpp:80 */
	virtual void ~CInputService(CInputService* );
private:
	/* engine2/inputservice.cpp:358 */
	bool ReadKeyBindings(CInputService* , CUtlBuffer& );
	/* engine2/inputservice.cpp:462 */
	void WriteKeyBindings(CInputService* , CUtlBuffer& );
	/* engine2/inputservice.cpp:503 */
	bool FindBindingSubstringMatch(CInputService* , char* , const char* );
	/* engine2/inputservice.cpp:1091 */
	void SaveKeyBindingsToFile(CInputService* );
	/* engine2/inputservice.cpp:1484 */
	int FindInputValue(const CInputService* , const char* );
	/* engine2/inputservice.h:208 */
	BindingInfo_t& GetBindingInfo(CInputService* , ButtonCode_t);
	/* engine2/inputservice.h:215 */
	const BindingInfo_t& GetBindingInfo(const CInputService* , ButtonCode_t);
	/* engine2/inputservice.cpp:1152 */
	bool ReadUserConfigFile(const CInputService* , const char* , CUtlBuffer& );
	/* engine2/inputservice.cpp:1195 */
	bool WriteUserConfigFile(const CInputService* , const char* , const CUtlBuffer& );
	/* engine2/inputservice.cpp:1318 */
	void OnProfileStorageAvailable(CInputService* , const EventProfileStorageAvailable_t& );
	/* engine2/inputservice.cpp:1096 */
	void OnAppShutdown(CInputService* , const EventAppShutdown_t& );
	/* engine2/inputservice.cpp:1283 */
	bool LoadArchivedConvarFile(CInputService* , const char* );
	/* engine2/inputservice.cpp:989 */
	bool LoadDefaultKeysConfig(CInputService* , const char* );
	/* engine2/inputservice.cpp:1303 */
	void LoadFromDefaultsFiles(CInputService* , const char* , const CUtlDelegate<bool(char const*)>& );
	/* engine2/inputservice.cpp:599 */
	void ListBoundKeys(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_ListBoundKeys m_ListBoundKeys_register; /* 64 160 */
	/* engine2/inputservice.cpp:636 */
	void FindBinding(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_FindBinding m_FindBinding_register; /* 224 160 */
	/* engine2/inputservice.cpp:750 */
	void ExecConfigFile(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_ExecConfigFile m_ExecConfigFile_register; /* 384 160 */
	/* engine2/inputservice.cpp:755 */
	void ExecConfigFileIfExists(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_ExecConfigFileIfExists m_ExecConfigFileIfExists_register; /* 544 160 */
	/* engine2/inputservice.cpp:797 */
	void ExecConfigFileAsync(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_ExecConfigFileAsync m_ExecConfigFileAsync_register; /* 704 160 */
	/* engine2/inputservice.cpp:814 */
	void ExecPerfTest(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_ExecPerfTest m_ExecPerfTest_register; /* 864 160 */
	/* engine2/inputservice.cpp:228 */
	void BindKey(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_BindKey m_BindKey_register; /* 1024 160 */
	/* engine2/inputservice.cpp:184 */
	void UnbindAll(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_UnbindAll m_UnbindAll_register; /* 1184 160 */
	/* engine2/inputservice.cpp:159 */
	void Unbind(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_Unbind m_Unbind_register; /* 1344 160 */
	/* engine2/inputservice.cpp:261 */
	void BindDefaults(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_BindDefaults m_BindDefaults_register; /* 1504 160 */
	/* engine2/inputservice.cpp:287 */
	void OnWriteKeyBindings(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_OnWriteKeyBindings m_OnWriteKeyBindings_register; /* 1664 160 */
	/* engine2/inputservice.cpp:292 */
	void OnWriteConfig(CInputService* , const CCommandContext& , const CCommand& );
	CCommandMemberInitializer_OnWriteConfig m_OnWriteConfig_register; /* 1824 160 */
	/* engine2/inputservice.cpp:699 */
	bool ReadConfigFile(CInputService* , const char* , const char* , const char* , bool, CUtlBuffer& );
	/* engine2/inputservice.cpp:763 */
	void ExecConfigFile_Internal(CInputService* , const CCommandContext& , const CCommand& , bool);
	/* engine2/inputservice.cpp:825 */
	void ExecConfigFileAsyncAndWait(CInputService* , int, const CCommand& );
	/* engine2/inputservice.cpp:850 */
	void ExecAsyncSleep(CInputService* , int, const CCommand& );
	/* engine2/inputservice.cpp:877 */
	int AddAsyncConfigFile(CInputService* , const char* , const char* , const char* );
	/* engine2/inputservice.cpp:893 */
	void RemoveAsyncConfigFile(CInputService* , int);
	/* engine2/inputservice.cpp:918 */
	bool FindAsyncCommand(CInputService* , int, const char* );
	/* engine2/inputservice.cpp:951 */
	void ProcessAsyncConfigFiles(CInputService* );
	KeyValues * m_pDefaultKeyBindings; /* 1984 8 */
	KeyValues * m_pKeyBindings; /* 1992 8 */
	KeyContext_t m_KeyContext; /* 2000 5936 */
	bool m_bEnableKeybindings; /* 7936 1 */
	int m_nLockCount; /* 7940 4 */
	CUtlLeanVector<CInputService::AsyncConfigFile_t, short int> m_AsyncConfigFiles; /* 7944 16 */
	static struct AsyncCommand_t s_asyncCommands[2]; /* 0 0 */
	/* engine2/inputservice.cpp:617 */
	void FindBindingForType<ButtonCode_t>(CInputService* , const char* );
	/* engine2/inputservice.cpp:583 */
	void ListBoundKeysForType<ButtonCode_t>(CInputService* );
	/* engine2/inputservice.cpp:529 */
	const char* FindSubstringMatchForType<ButtonCode_t>(CInputService* , const char* , int, int, int& );
	/* engine2/inputservice.cpp:404 */
	void WriteKeyBindingsForType<ButtonCode_t>(CInputService* , CUtlBuffer& , KeyValues* );
	/* engine2/inputservice.cpp:302 */
	void UnbindAllKeysForType<ButtonCode_t>(CInputService* );
	/* engine2/inputservice.cpp:325 */
	void ApplyBindings<ButtonCode_t>(CInputService* , KeyValues* , bool);
	/* engine2/inputservice.cpp:201 */
	bool BindKeyHelper<ButtonCode_t>(CInputService* , const char* , const char* );
	/* engine2/inputservice.cpp:112 */
	void SetBindingForType<ButtonCode_t>(CInputService* , ButtonCode_t, const char* , bool);
	/* engine2/inputservice.cpp:323 */
