
//
// public/rendersystem/renderpass.h
//
//	referenced by: libengine2.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 47
//	class: 1
//	structs: 11
//

// <034602C8> ../public/rendersystem/renderpass.h:41
void RenderPassAttachmentDesc_t::RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t &)
{
} /* size: 0 */

// <034602A7> ../public/rendersystem/renderpass.h:41
inline void RenderPassAttachmentDesc_t::RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t &)
{
} /* size: 0 */

// <00AC6F79> ../public/rendersystem/renderpass.h:41
inline void RenderPassAttachmentDesc_t::operator=(const RenderPassAttachmentDesc_t &)
{
} /* size: 0 */

// <03457312> ../public/rendersystem/renderpass.h:41
// member functions: 5
// member variables: 9
// struct size: 40
struct RenderPassAttachmentDesc_t {
	/* ../public/rendersystem/renderpass.h:43 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:48 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* , HRenderTexture, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderImageLayout_t, RenderImageLayout_t, RenderColorSpace_t, int32);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderPassLoadOp_t m_nLoadOp; /* 8 4 */
	RenderPassStoreOp_t m_nStoreOp; /* 12 4 */
	RenderPassLoadOp_t m_nStencilLoadOp; /* 16 4 */
	RenderPassStoreOp_t m_nStencilStoreOp; /* 20 4 */
	RenderImageLayout_t m_nInitialLayout; /* 24 4 */
	RenderImageLayout_t m_nFinalLayout; /* 28 4 */
	RenderColorSpace_t m_nColorSpace; /* 32 1 */
	int32 m_nTargetIndex; /* 36 4 */
	/* ../public/rendersystem/renderpass.h:89 */
	void Clear(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:103 */
	bool operator<(const RenderPassAttachmentDesc_t* , const RenderPassAttachmentDesc_t& );
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* , RenderPassAttachmentDesc_t& );
};

// <00164837> ../public/rendersystem/renderpass.h:41
// member functions: 4
// member variables: 9
// struct size: 40
struct RenderPassAttachmentDesc_t {
	/* ../public/rendersystem/renderpass.h:43 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:48 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* , HRenderTexture, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderImageLayout_t, RenderImageLayout_t, RenderColorSpace_t, int32);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderPassLoadOp_t m_nLoadOp; /* 8 4 */
	RenderPassStoreOp_t m_nStoreOp; /* 12 4 */
	RenderPassLoadOp_t m_nStencilLoadOp; /* 16 4 */
	RenderPassStoreOp_t m_nStencilStoreOp; /* 20 4 */
	RenderImageLayout_t m_nInitialLayout; /* 24 4 */
	RenderImageLayout_t m_nFinalLayout; /* 28 4 */
	RenderColorSpace_t m_nColorSpace; /* 32 1 */
	int32 m_nTargetIndex; /* 36 4 */
	/* ../public/rendersystem/renderpass.h:89 */
	void Clear(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:103 */
	bool operator<(const RenderPassAttachmentDesc_t* , const RenderPassAttachmentDesc_t& );
};

// <00AA8402> ../public/rendersystem/renderpass.h:41
// member functions: 6
// member variables: 9
// struct size: 40
struct RenderPassAttachmentDesc_t {
	/* ../public/rendersystem/renderpass.h:43 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:48 */
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* , HRenderTexture, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderPassLoadOp_t, RenderPassStoreOp_t, RenderImageLayout_t, RenderImageLayout_t, RenderColorSpace_t, int32);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderPassLoadOp_t m_nLoadOp; /* 8 4 */
	RenderPassStoreOp_t m_nStoreOp; /* 12 4 */
	RenderPassLoadOp_t m_nStencilLoadOp; /* 16 4 */
	RenderPassStoreOp_t m_nStencilStoreOp; /* 20 4 */
	RenderImageLayout_t m_nInitialLayout; /* 24 4 */
	RenderImageLayout_t m_nFinalLayout; /* 28 4 */
	RenderColorSpace_t m_nColorSpace; /* 32 1 */
	int32 m_nTargetIndex; /* 36 4 */
	/* ../public/rendersystem/renderpass.h:89 */
	void Clear(RenderPassAttachmentDesc_t* );
	/* ../public/rendersystem/renderpass.h:103 */
	bool operator<(const RenderPassAttachmentDesc_t* , const RenderPassAttachmentDesc_t& );
	void RenderPassAttachmentDesc_t(RenderPassAttachmentDesc_t* , RenderPassAttachmentDesc_t& );
	RenderPassAttachmentDesc_t& operator=(RenderPassAttachmentDesc_t* , const RenderPassAttachmentDesc_t& );
};

// <034755C1> ../public/rendersystem/renderpass.h:43
void RenderPassAttachmentDesc_t::RenderPassAttachmentDesc_t()
{
} /* size: 0 */

// <034755A8> ../public/rendersystem/renderpass.h:43
inline void RenderPassAttachmentDesc_t::RenderPassAttachmentDesc_t()
{
} /* size: 0 */

// <0347558F> ../public/rendersystem/renderpass.h:89
inline void RenderPassAttachmentDesc_t::Clear()
{
} /* size: 0 */

// <00ADC230> ../public/rendersystem/renderpass.h:103
inline void RenderPassAttachmentDesc_t::operator<(const RenderPassAttachmentDesc_t& rhs)
{
} /* size: 0 */

// <0345748A> ../public/rendersystem/renderpass.h:125
// member functions: 4
// member variables: 3
// struct size: 12
struct RenderPassSubPassDependency_t {
	/* ../public/rendersystem/renderpass.h:127 */
	void RenderPassSubPassDependency_t(RenderPassSubPassDependency_t* );
	/* ../public/rendersystem/renderpass.h:132 */
	void RenderPassSubPassDependency_t(RenderPassSubPassDependency_t* , int32, int32, bool);
	int32_t m_nSrcPassIndex; /* 0 4 */
	int32_t m_nDstPassIndex; /* 4 4 */
	bool m_bByRegionDependency; /* 8 1 */
	/* ../public/rendersystem/renderpass.h:151 */
	void Clear(RenderPassSubPassDependency_t* );
	/* ../public/rendersystem/renderpass.h:159 */
	bool operator<(const RenderPassSubPassDependency_t* , const RenderPassSubPassDependency_t& );
};

// <03475578> ../public/rendersystem/renderpass.h:127
void RenderPassSubPassDependency_t::RenderPassSubPassDependency_t()
{
} /* size: 0 */

// <0347555F> ../public/rendersystem/renderpass.h:127
inline void RenderPassSubPassDependency_t::RenderPassSubPassDependency_t()
{
} /* size: 0 */

// <03475546> ../public/rendersystem/renderpass.h:151
inline void RenderPassSubPassDependency_t::Clear()
{
} /* size: 0 */

// <00ADC1C2> ../public/rendersystem/renderpass.h:159
inline void RenderPassSubPassDependency_t::operator<(const RenderPassSubPassDependency_t& rhs)
{
} /* size: 0 */

// <034601A5> ../public/rendersystem/renderpass.h:176
void RenderSubPassAttachment_t::RenderSubPassAttachment_t(RenderSubPassAttachment_t &)
{
} /* size: 0 */

// <03460184> ../public/rendersystem/renderpass.h:176
inline void RenderSubPassAttachment_t::RenderSubPassAttachment_t(RenderSubPassAttachment_t &)
{
} /* size: 0 */

// <0345E4D4> ../public/rendersystem/renderpass.h:176
inline void RenderSubPassAttachment_t::operator=(RenderSubPassAttachment_t &)
{
} /* size: 0 */

// <00AC6F58> ../public/rendersystem/renderpass.h:176
inline void RenderSubPassAttachment_t::operator=(const RenderSubPassAttachment_t &)
{
} /* size: 0 */

// <03457569> ../public/rendersystem/renderpass.h:176
// member functions: 6
// member variables: 2
// struct size: 16
struct RenderSubPassAttachment_t {
	/* ../public/rendersystem/renderpass.h:178 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:182 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* , HRenderTexture, RenderImageLayout_t);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderImageLayout_t m_nImageLayout; /* 8 4 */
	/* ../public/rendersystem/renderpass.h:194 */
	void Clear(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:201 */
	bool operator<(const RenderSubPassAttachment_t* , const RenderSubPassAttachment_t& );
	RenderSubPassAttachment_t& operator=(RenderSubPassAttachment_t* , RenderSubPassAttachment_t& );
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* , RenderSubPassAttachment_t& );
};

// <00164A63> ../public/rendersystem/renderpass.h:176
// member functions: 4
// member variables: 2
// struct size: 16
struct RenderSubPassAttachment_t {
	/* ../public/rendersystem/renderpass.h:178 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:182 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* , HRenderTexture, RenderImageLayout_t);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderImageLayout_t m_nImageLayout; /* 8 4 */
	/* ../public/rendersystem/renderpass.h:194 */
	void Clear(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:201 */
	bool operator<(const RenderSubPassAttachment_t* , const RenderSubPassAttachment_t& );
};

// <00AA8687> ../public/rendersystem/renderpass.h:176
// member functions: 7
// member variables: 2
// struct size: 16
struct RenderSubPassAttachment_t {
	/* ../public/rendersystem/renderpass.h:178 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:182 */
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* , HRenderTexture, RenderImageLayout_t);
	HRenderTexture m_hTexture; /* 0 8 */
	RenderImageLayout_t m_nImageLayout; /* 8 4 */
	/* ../public/rendersystem/renderpass.h:194 */
	void Clear(RenderSubPassAttachment_t* );
	/* ../public/rendersystem/renderpass.h:201 */
	bool operator<(const RenderSubPassAttachment_t* , const RenderSubPassAttachment_t& );
	RenderSubPassAttachment_t& operator=(RenderSubPassAttachment_t* , RenderSubPassAttachment_t& );
	void RenderSubPassAttachment_t(RenderSubPassAttachment_t* , RenderSubPassAttachment_t& );
	RenderSubPassAttachment_t& operator=(RenderSubPassAttachment_t* , const RenderSubPassAttachment_t& );
};

// <0347552F> ../public/rendersystem/renderpass.h:178
void RenderSubPassAttachment_t::RenderSubPassAttachment_t()
{
} /* size: 0 */

// <03475516> ../public/rendersystem/renderpass.h:178
inline void RenderSubPassAttachment_t::RenderSubPassAttachment_t()
{
} /* size: 0 */

// <034754FD> ../public/rendersystem/renderpass.h:194
inline void RenderSubPassAttachment_t::Clear()
{
} /* size: 0 */

// <00ADC154> ../public/rendersystem/renderpass.h:201
inline void RenderSubPassAttachment_t::operator<(const RenderSubPassAttachment_t& rhs)
{
} /* size: 0 */

// <0346255A> ../public/rendersystem/renderpass.h:216
void RenderPassSubPass_t::~RenderPassSubPass_t()
{
} /* size: 0 */

// <0346253E> ../public/rendersystem/renderpass.h:216
inline void RenderPassSubPass_t::~RenderPassSubPass_t()
{
} /* size: 0 */

// <03460168> ../public/rendersystem/renderpass.h:216
void RenderPassSubPass_t::RenderPassSubPass_t(RenderPassSubPass_t &)
{
} /* size: 0 */

// <03460147> ../public/rendersystem/renderpass.h:216
inline void RenderPassSubPass_t::RenderPassSubPass_t(RenderPassSubPass_t &)
{
} /* size: 0 */

// <00AC6F37> ../public/rendersystem/renderpass.h:216
inline void RenderPassSubPass_t::operator=(const RenderPassSubPass_t &)
{
} /* size: 0 */

// <03459D08> ../public/rendersystem/renderpass.h:216
// member functions: 10
// member variables: 6
// struct size: 256
struct RenderPassSubPass_t {
	/* ../public/rendersystem/renderpass.h:218 */
	void RenderPassSubPass_t(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:223 */
	void RenderPassSubPass_t(RenderPassSubPass_t* , const char* , ...);
	char m_szDebugName[32]; /* 0 32 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_colorAttachments __attribute__((__aligned__(8))); /* 32 72 */
	RenderSubPassAttachment_t m_depthStencilAttachment; /* 104 16 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 2, short int> m_resolveAttachments __attribute__((__aligned__(8))); /* 120 40 */
	CUtlLeanVectorFixedGrowable<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> m_preserveAttachments __attribute__((__aligned__(8))); /* 160 24 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_inputAttachments __attribute__((__aligned__(8))); /* 184 72 */
	/* ../public/rendersystem/renderpass.h:254 */
	void Clear(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:264 */
	const char* GetDebugName(const RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:268 */
	void SetDebugNameV(RenderPassSubPass_t* , const char* , typedef __va_list_tag __va_list_tag* );
	/* ../public/rendersystem/renderpass.h:272 */
	void SetDebugName(RenderPassSubPass_t* , const char* , ...);
	/* ../public/rendersystem/renderpass.h:279 */
	void SetDebugNameString(RenderPassSubPass_t* , const char* );
	/* ../public/rendersystem/renderpass.h:285 */
	bool operator<(const RenderPassSubPass_t* , const RenderPassSubPass_t& );
	void RenderPassSubPass_t(RenderPassSubPass_t* , RenderPassSubPass_t& );
	void ~RenderPassSubPass_t(RenderPassSubPass_t* );
} __attribute__((__aligned__(8)));

// <00167049> ../public/rendersystem/renderpass.h:216
// member functions: 9
// member variables: 6
// struct size: 256
struct RenderPassSubPass_t {
	/* ../public/rendersystem/renderpass.h:218 */
	void RenderPassSubPass_t(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:223 */
	void RenderPassSubPass_t(RenderPassSubPass_t* , const char* , ...);
	char m_szDebugName[32]; /* 0 32 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_colorAttachments __attribute__((__aligned__(8))); /* 32 72 */
	RenderSubPassAttachment_t m_depthStencilAttachment; /* 104 16 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 2, short int> m_resolveAttachments __attribute__((__aligned__(8))); /* 120 40 */
	CUtlLeanVectorFixedGrowable<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> m_preserveAttachments __attribute__((__aligned__(8))); /* 160 24 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_inputAttachments __attribute__((__aligned__(8))); /* 184 72 */
	/* ../public/rendersystem/renderpass.h:254 */
	void Clear(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:264 */
	const char* GetDebugName(const RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:268 */
	void SetDebugNameV(RenderPassSubPass_t* , const char* , typedef __va_list_tag __va_list_tag* );
	/* ../public/rendersystem/renderpass.h:272 */
	void SetDebugName(RenderPassSubPass_t* , const char* , ...);
	/* ../public/rendersystem/renderpass.h:279 */
	void SetDebugNameString(RenderPassSubPass_t* , const char* );
	/* ../public/rendersystem/renderpass.h:285 */
	bool operator<(const RenderPassSubPass_t* , const RenderPassSubPass_t& );
	void ~RenderPassSubPass_t(RenderPassSubPass_t* );
} __attribute__((__aligned__(8)));

// <00990046> ../public/rendersystem/renderpass.h:216
// member functions: 8
// member variables: 6
// struct size: 256
struct RenderPassSubPass_t {
	/* ../public/rendersystem/renderpass.h:218 */
	void RenderPassSubPass_t(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:223 */
	void RenderPassSubPass_t(RenderPassSubPass_t* , const char* , ...);
	char m_szDebugName[32]; /* 0 32 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_colorAttachments __attribute__((__aligned__(8))); /* 32 72 */
	RenderSubPassAttachment_t m_depthStencilAttachment; /* 104 16 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 2, short int> m_resolveAttachments __attribute__((__aligned__(8))); /* 120 40 */
	CUtlLeanVectorFixedGrowable<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> m_preserveAttachments __attribute__((__aligned__(8))); /* 160 24 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_inputAttachments __attribute__((__aligned__(8))); /* 184 72 */
	/* ../public/rendersystem/renderpass.h:254 */
	void Clear(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:264 */
	const char* GetDebugName(const RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:268 */
	void SetDebugNameV(RenderPassSubPass_t* , const char* , typedef __va_list_tag __va_list_tag* );
	/* ../public/rendersystem/renderpass.h:272 */
	void SetDebugName(RenderPassSubPass_t* , const char* , ...);
	/* ../public/rendersystem/renderpass.h:279 */
	void SetDebugNameString(RenderPassSubPass_t* , const char* );
	/* ../public/rendersystem/renderpass.h:285 */
	bool operator<(const RenderPassSubPass_t* , const RenderPassSubPass_t& );
} __attribute__((__aligned__(8)));

// <00AAAE4C> ../public/rendersystem/renderpass.h:216
// member functions: 11
// member variables: 6
// struct size: 256
struct RenderPassSubPass_t {
	/* ../public/rendersystem/renderpass.h:218 */
	void RenderPassSubPass_t(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:223 */
	void RenderPassSubPass_t(RenderPassSubPass_t* , const char* , ...);
	char m_szDebugName[32]; /* 0 32 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_colorAttachments __attribute__((__aligned__(8))); /* 32 72 */
	RenderSubPassAttachment_t m_depthStencilAttachment; /* 104 16 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 2, short int> m_resolveAttachments __attribute__((__aligned__(8))); /* 120 40 */
	CUtlLeanVectorFixedGrowable<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int> m_preserveAttachments __attribute__((__aligned__(8))); /* 160 24 */
	CUtlLeanVectorFixedGrowable<RenderSubPassAttachment_t, 4, short int> m_inputAttachments __attribute__((__aligned__(8))); /* 184 72 */
	/* ../public/rendersystem/renderpass.h:254 */
	void Clear(RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:264 */
	const char* GetDebugName(const RenderPassSubPass_t* );
	/* ../public/rendersystem/renderpass.h:268 */
	void SetDebugNameV(RenderPassSubPass_t* , const char* , typedef __va_list_tag __va_list_tag* );
	/* ../public/rendersystem/renderpass.h:272 */
	void SetDebugName(RenderPassSubPass_t* , const char* , ...);
	/* ../public/rendersystem/renderpass.h:279 */
	void SetDebugNameString(RenderPassSubPass_t* , const char* );
	/* ../public/rendersystem/renderpass.h:285 */
	bool operator<(const RenderPassSubPass_t* , const RenderPassSubPass_t& );
	void RenderPassSubPass_t(RenderPassSubPass_t* , RenderPassSubPass_t& );
	void ~RenderPassSubPass_t(RenderPassSubPass_t* );
	RenderPassSubPass_t& operator=(RenderPassSubPass_t* , const RenderPassSubPass_t& );
} __attribute__((__aligned__(8)));

// <034753AE> ../public/rendersystem/renderpass.h:218
void RenderPassSubPass_t::RenderPassSubPass_t()
{
} /* size: 0 */

// <03475395> ../public/rendersystem/renderpass.h:218
inline void RenderPassSubPass_t::RenderPassSubPass_t()
{
} /* size: 0 */

// <0347536F> ../public/rendersystem/renderpass.h:279
inline void RenderPassSubPass_t::SetDebugNameString(const char* pString)
{
} /* size: 0 */

// <00ADB62A> ../public/rendersystem/renderpass.h:285
// variables: 4
// function calls: 49
void RenderPassSubPass_t::operator<(const RenderPassSubPass_t& rhs)
{
	{
		int32 nAttachment; // 295
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
				int i);  // 297
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
				int i);  // 297
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 203
		RenderSubPassAttachment_t::operator<(
				const RenderSubPassAttachment_t& rhs);  // 297
	}
	{
		int32 nResolveAttachment; // 316
		AlignedByteArrayExplicit_t<2, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this,
				int i);  // 318
		AlignedByteArrayExplicit_t<2, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this,
				int i);  // 318
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 203
		RenderSubPassAttachment_t::operator<(
				const RenderSubPassAttachment_t& rhs);  // 318
	}
	{
		int32 nPreserveAttachment; // 332
		AlignedByteArrayExplicit_t<2, CWeakHandle<InfoForResourceTypeCTextureBase>, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this,
				int i);  // 334
		AlignedByteArrayExplicit_t<2, CWeakHandle<InfoForResourceTypeCTextureBase>, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this,
				int i);  // 334
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 334
	}
	{
		int32 nInputAttachment; // 348
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
				int i);  // 350
		AlignedByteArrayExplicit_t<4, RenderSubPassAttachment_t, 8>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this,
				int i);  // 350
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 203
		RenderSubPassAttachment_t::operator<(
				const RenderSubPassAttachment_t& rhs);  // 350
	}
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this); // 287
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this); // 287
	CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 203
	RenderSubPassAttachment_t::operator<(
			const RenderSubPassAttachment_t& rhs);  // 303
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this); // 308
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 2, short int>, RenderSubPassAtt this); // 308
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this); // 324
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<CWeakHandle<InfoForResourceTypeCTextureBase>, 2, short int this); // 324
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this); // 340
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<RenderSubPassAttachment_t, 4, short int>, RenderSubPassAtt this); // 340
} /* size: 740, inline expansions: 10 (48 bytes) */

// <0345CBCA> ../public/rendersystem/renderpass.h:364
// member functions: 40
// member variables: 4
// class size: 2,448
class CRenderPassDesc {
	int ()(void) * * _vptr.CRenderPassDesc; /* 0 8 */
	/* ../public/rendersystem/renderpass.h:368 */
	void CRenderPassDesc(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:369 */
	virtual void ~CRenderPassDesc(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:372 */
	void CRenderPassDesc(CRenderPassDesc* , const CRenderPassDesc& );
	/* ../public/rendersystem/renderpass.h:383 */
	void AddAttachment(CRenderPassDesc* , const RenderPassAttachmentDesc_t& );
	/* ../public/rendersystem/renderpass.h:387 */
	RenderPassAttachmentDesc_t* AddAttachmentGetPtr(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:394 */
	int32 AddSubPass(CRenderPassDesc* , const RenderPassSubPass_t& );
	/* ../public/rendersystem/renderpass.h:398 */
	RenderPassSubPass_t* AddSubPassGetPtr(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:404 */
	void AddSubPassDependency(CRenderPassDesc* , const RenderPassSubPassDependency_t& );
	/* ../public/rendersystem/renderpass.h:408 */
	RenderPassSubPassDependency_t* AddSubPassDependencyGetPtr(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:420 */
	int32 NumAttachments(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:416 */
	typedef struct CUtlLeanVectorFixedGrowable<RenderPassAttachmentDesc_t, 8, short int> RenderPassAttachmentDescList_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/rendersystem/renderpass.h:421 */
	const RenderPassAttachmentDescList_t& GetAttachments(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:422 */
	RenderPassAttachmentDescList_t& GetAttachmentsNonConst(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:424 */
	int32 NumSubPasses(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:417 */
	typedef struct CUtlLeanVectorFixedGrowable<RenderPassSubPass_t, 8, short int> RenderPassSubPassList_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/rendersystem/renderpass.h:425 */
	const RenderPassSubPassList_t& GetSubPasses(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:426 */
	RenderPassSubPassList_t& GetSubPassesNonConst(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:428 */
	int32 NumSubPassDependencies(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:418 */
	typedef struct CUtlLeanVectorFixedGrowable<RenderPassSubPassDependency_t, 4, short int> RenderPassSubPassDepedencyList_t;
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/rendersystem/renderpass.h:429 */
	const RenderPassSubPassDepedencyList_t& GetSubPassDependencies(const CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:430 */
	RenderPassSubPassDepedencyList_t& GetSubPassDependenciesNonConst(CRenderPassDesc* );
	/* ../public/rendersystem/renderpass.h:433 */
	int32 FindAttachment(const CRenderPassDesc* , HRenderTexture);
	/* ../public/rendersystem/renderpass.h:448 */
	void Clear(CRenderPassDesc* );
private:
	RenderPassAttachmentDescList_t m_attachments __attribute__((__aligned__(8))); /* 8 328 */
	RenderPassSubPassList_t m_subPasses __attribute__((__aligned__(8))); /* 336 2056 */
	RenderPassSubPassDepedencyList_t m_subPassDependencies __attribute__((__aligned__(8))); /* 2392 56 */
	void CRenderPassDesc(class CRenderPassDesc *); /* linkage=_ZN15CRenderPassDescC4Ev */
	virtual void ~CRenderPassDesc(class CRenderPassDesc *); /* linkage=_ZN15CRenderPassDescD4Ev */
	void CRenderPassDesc(class CRenderPassDesc *, const class CRenderPassDesc  &); /* linkage=_ZN15CRenderPassDescC4ERKS_ */
	void AddAttachment(class CRenderPassDesc *, const class RenderPassAttachmentDesc_t  &); /* linkage=_ZN15CRenderPassDesc13AddAttachmentERK26RenderPassAttachmentDesc_t */
	class RenderPassAttachmentDesc_t * AddAttachmentGetPtr(class CRenderPassDesc *); /* linkage=_ZN15CRenderPassDesc19AddAttachmentGetPtrEv */
	int32 AddSubPass(class CRenderPassDesc *, const class RenderPassSubPass_t  &); /* linkage=_ZN15CRenderPassDesc10AddSubPassERK19RenderPassSubPass_t */
	class RenderPassSubPass_t * AddSubPassGetPtr(class CRenderPassDesc *); /* linkage=_ZN15CRenderPassDesc16AddSubPassGetPtrEv */
