
//
// public/rendersystem/sheet.h
//
//	referenced by: libengine2.so
//				   librendersystemempty.so
//				   librendersystemvulkan.so
//
//	functions: 24
//	structs: 16
//

// <00E038E5> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:56
void SequenceFloatParam_t::SequenceFloatParam_t()
{
} /* size: 0 */

// <00E038C9> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:56
inline void SequenceFloatParam_t::SequenceFloatParam_t()
{
} /* size: 0 */

// <0120E4E4> ../public/rendersystem/sheet.h:56
// member functions: 8
// member variables: 2
// static member variable: 1
// struct size: 8
struct SequenceFloatParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:58 */
	SequenceFloatParam_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:58 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:58 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:58 */
	void Schema_CompileTimeVerificationFunction(SequenceFloatParam_t* );
	/* ../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:58 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SequenceFloatParam_t* );
	CResourceString m_name; /* 0 4 */
	float m_value; /* 4 4 */
};

// <00DFFF5E> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:56
// member functions: 9
// member variables: 2
// static member variable: 1
// struct size: 8
struct SequenceFloatParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	SequenceFloatParam_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void Schema_CompileTimeVerificationFunction(SequenceFloatParam_t* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SequenceFloatParam_t* );
	CResourceString m_name; /* 0 4 */
	float m_value; /* 4 4 */
	void SequenceFloatParam_t(SequenceFloatParam_t* );
};

// <004B19EB> ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:56
// member functions: 9
// member variables: 2
// static member variable: 1
// struct size: 8
struct SequenceFloatParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	SequenceFloatParam_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	void Schema_CompileTimeVerificationFunction(SequenceFloatParam_t* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SequenceFloatParam_t* );
	CResourceString m_name; /* 0 4 */
	float m_value; /* 4 4 */
	void SequenceFloatParam_t(SequenceFloatParam_t* );
};

// <00E03A33> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <00E03A2D> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <00E03A14> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:58
inline void SequenceFloatParam_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <00E035B0> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:63
inline void SheetSequence_t::operator=(const SheetSequence_t &)
{
} /* size: 0 */

// <00E03599> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:63
void SheetSequence_t::SheetSequence_t()
{
} /* size: 0 */

// <00E0357D> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:63
inline void SheetSequence_t::SheetSequence_t()
{
} /* size: 0 */

// <0120ED7A> ../public/rendersystem/sheet.h:63
// member functions: 9
// member variables: 9
// static member variable: 1
// struct size: 32
struct SheetSequence_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:65 */
	SheetSequence_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:65 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:65 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:65 */
	void Schema_CompileTimeVerificationFunction(SheetSequence_t* );
	/* ../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:65 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequence_t* );
	uint32 m_nId; /* 0 4 */
	bool m_bClamp; /* 4 1 */
	bool m_bAlphaCrop; /* 5 1 */
	bool m_bNoColor; /* 6 1 */
	bool m_bNoAlpha; /* 7 1 */
	CResourceArray<SheetSequenceFrame_t> m_Frames; /* 8 8 */
	float32 m_flTotalTime; /* 16 4 */
	CResourceString m_name; /* 20 4 */
	CResourceArray<SequenceFloatParam_t> m_floatParams; /* 24 8 */
	/* ../public/rendersystem/sheet.h:78 */
	float FindFloatParam(const SheetSequence_t* , const char* , float);
};

// <00E00D6A> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:63
// member functions: 11
// member variables: 9
// static member variable: 1
// struct size: 32
struct SheetSequence_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	SheetSequence_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void Schema_CompileTimeVerificationFunction(SheetSequence_t* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequence_t* );
	uint32 m_nId; /* 0 4 */
	bool m_bClamp; /* 4 1 */
	bool m_bAlphaCrop; /* 5 1 */
	bool m_bNoColor; /* 6 1 */
	bool m_bNoAlpha; /* 7 1 */
	CResourceArray<SheetSequenceFrame_t> m_Frames; /* 8 8 */
	float32 m_flTotalTime; /* 16 4 */
	CResourceString m_name; /* 20 4 */
	CResourceArray<SequenceFloatParam_t> m_floatParams; /* 24 8 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:78 */
	float FindFloatParam(const SheetSequence_t* , const char* , float);
	void SheetSequence_t(SheetSequence_t* );
	SheetSequence_t& operator=(SheetSequence_t* , const SheetSequence_t& );
};

// <004B27F7> ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:63
// member functions: 11
// member variables: 9
// static member variable: 1
// struct size: 32
struct SheetSequence_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	SheetSequence_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	void Schema_CompileTimeVerificationFunction(SheetSequence_t* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequence_t* );
	uint32 m_nId; /* 0 4 */
	bool m_bClamp; /* 4 1 */
	bool m_bAlphaCrop; /* 5 1 */
	bool m_bNoColor; /* 6 1 */
	bool m_bNoAlpha; /* 7 1 */
	CResourceArray<SheetSequenceFrame_t> m_Frames; /* 8 8 */
	float32 m_flTotalTime; /* 16 4 */
	CResourceString m_name; /* 20 4 */
	CResourceArray<SequenceFloatParam_t> m_floatParams; /* 24 8 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:78 */
	float FindFloatParam(const SheetSequence_t* , const char* , float);
	void SheetSequence_t(SheetSequence_t* );
	SheetSequence_t& operator=(SheetSequence_t* , const SheetSequence_t& );
};

// <00E039EF> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:65
inline void SheetSequence_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <00E02E88> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:93
inline void SheetSequenceFrame_t::operator=(const SheetSequenceFrame_t &)
{
} /* size: 0 */

// <00E02E71> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:93
void SheetSequenceFrame_t::SheetSequenceFrame_t()
{
} /* size: 0 */

// <00E02E55> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:93
inline void SheetSequenceFrame_t::SheetSequenceFrame_t()
{
} /* size: 0 */

// <0120E900> ../public/rendersystem/sheet.h:93
// member functions: 8
// member variables: 2
// static member variable: 1
// struct size: 12
struct SheetSequenceFrame_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:95 */
	SheetSequenceFrame_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:95 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:95 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:95 */
	void Schema_CompileTimeVerificationFunction(SheetSequenceFrame_t* );
	/* ../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:95 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequenceFrame_t* );
	float32 m_flDisplayTime; /* 0 4 */
	CResourceArray<SheetFrameImage_t> m_Images; /* 4 8 */
};

// <00E0039D> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:93
// member functions: 10
// member variables: 2
// static member variable: 1
// struct size: 12
struct SheetSequenceFrame_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	SheetSequenceFrame_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void Schema_CompileTimeVerificationFunction(SheetSequenceFrame_t* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequenceFrame_t* );
	float32 m_flDisplayTime; /* 0 4 */
	CResourceArray<SheetFrameImage_t> m_Images; /* 4 8 */
	void SheetSequenceFrame_t(SheetSequenceFrame_t* );
	SheetSequenceFrame_t& operator=(SheetSequenceFrame_t* , const SheetSequenceFrame_t& );
};

// <004B1E2A> ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:93
// member functions: 10
// member variables: 2
// static member variable: 1
// struct size: 12
struct SheetSequenceFrame_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	SheetSequenceFrame_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	void Schema_CompileTimeVerificationFunction(SheetSequenceFrame_t* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetSequenceFrame_t* );
	float32 m_flDisplayTime; /* 0 4 */
	CResourceArray<SheetFrameImage_t> m_Images; /* 4 8 */
	void SheetSequenceFrame_t(SheetSequenceFrame_t* );
	SheetSequenceFrame_t& operator=(SheetSequenceFrame_t* , const SheetSequenceFrame_t& );
};

// <00E039CA> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:95
inline void SheetSequenceFrame_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <012A3AD9> ../public/rendersystem/sheet.h:100
void SheetFrameImage_t::SheetFrameImage_t(const SheetFrameImage_t &)
{
} /* size: 0 */

// <012A3AB8> ../public/rendersystem/sheet.h:100
inline void SheetFrameImage_t::SheetFrameImage_t(const SheetFrameImage_t &)
{
} /* size: 0 */

// <00E02A25> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:100
inline void SheetFrameImage_t::operator=(const SheetFrameImage_t &)
{
} /* size: 0 */

// <00E02A0E> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:100
void SheetFrameImage_t::SheetFrameImage_t()
{
} /* size: 0 */

// <00E029F2> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:100
inline void SheetFrameImage_t::SheetFrameImage_t()
{
} /* size: 0 */

// <0120F22C> ../public/rendersystem/sheet.h:100
// member functions: 9
// member variables: 2
// static member variable: 1
// struct size: 32
struct SheetFrameImage_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:102 */
	SheetFrameImage_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:102 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:102 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:102 */
	void Schema_CompileTimeVerificationFunction(SheetFrameImage_t* );
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:102 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetFrameImage_t* );
	Vector2D uvCropped[2]; /* 0 16 */
	Vector2D uvUncropped[2]; /* 16 16 */
	void SheetFrameImage_t(SheetFrameImage_t* , const SheetFrameImage_t& );
};

// <0029B988> ../public/rendersystem/sheet.h:100
// member functions: 8
// member variables: 2
// static member variable: 1
// struct size: 32
struct SheetFrameImage_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:102 */
	SheetFrameImage_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:102 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:102 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:102 */
	void Schema_CompileTimeVerificationFunction(SheetFrameImage_t* );
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:102 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetFrameImage_t* );
	Vector2D uvCropped[2]; /* 0 16 */
	Vector2D uvUncropped[2]; /* 16 16 */
};

// <00E01261> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:100
// member functions: 10
// member variables: 2
// static member variable: 1
// struct size: 32
struct SheetFrameImage_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	SheetFrameImage_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void Schema_CompileTimeVerificationFunction(SheetFrameImage_t* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetFrameImage_t* );
	Vector2D uvCropped[2]; /* 0 16 */
	Vector2D uvUncropped[2]; /* 16 16 */
	void SheetFrameImage_t(SheetFrameImage_t* );
	SheetFrameImage_t& operator=(SheetFrameImage_t* , const SheetFrameImage_t& );
};

// <004B2CEE> ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:100
// member functions: 10
// member variables: 2
// static member variable: 1
// struct size: 32
struct SheetFrameImage_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	SheetFrameImage_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	void Schema_CompileTimeVerificationFunction(SheetFrameImage_t* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102 */
	const CSchemaClassInfo* Schema_DynamicBinding(const SheetFrameImage_t* );
	Vector2D uvCropped[2]; /* 0 16 */
	Vector2D uvUncropped[2]; /* 16 16 */
	void SheetFrameImage_t(SheetFrameImage_t* );
	SheetFrameImage_t& operator=(SheetFrameImage_t* , const SheetFrameImage_t& );
};

// <00E039A5> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:102
inline void SheetFrameImage_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <00E027A8> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:107
inline void Sheet_t::operator=(const Sheet_t &)
{
} /* size: 0 */

// <00E02785> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:107
void Sheet_t::Sheet_t()
{
} /* size: 0 */

// <00E02769> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:107
inline void Sheet_t::Sheet_t()
{
} /* size: 0 */

// <0120F6DD> ../public/rendersystem/sheet.h:107
// member functions: 9
// member variable: 1
// static member variable: 1
// struct size: 8
struct Sheet_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/rendersystem/sheet.h:109 */
	Sheet_t* Schema_MarkHelperFn(void);
	/* ../public/rendersystem/sheet.h:109 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/rendersystem/sheet.h:109 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/rendersystem/sheet.h:109 */
	void Schema_CompileTimeVerificationFunction(Sheet_t* );
	/* ../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/rendersystem/sheet.h:109 */
	const char* Schema_StaticClassname(void);
	/* ../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_DynamicBinding(const Sheet_t* );
	CResourceArray<SheetSequence_t> m_Sequences; /* 0 8 */
	/* ../public/rendersystem/sheet.h:112 */
	const SheetSequence_t* FindSequence(const Sheet_t* , const char* );
};

// <00E01C3E> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:107
// member functions: 11
// member variable: 1
// static member variable: 1
// struct size: 8
struct Sheet_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	Sheet_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void Schema_CompileTimeVerificationFunction(Sheet_t* );
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_DynamicBinding(const Sheet_t* );
	CResourceArray<SheetSequence_t> m_Sequences; /* 0 8 */
	/* ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:112 */
	const SheetSequence_t* FindSequence(const Sheet_t* , const char* );
	void Sheet_t(Sheet_t* );
	Sheet_t& operator=(Sheet_t* , const Sheet_t& );
};

// <004B36CB> ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:107
// member functions: 11
// member variable: 1
// static member variable: 1
// struct size: 8
struct Sheet_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	Sheet_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	void Schema_CompileTimeVerificationFunction(Sheet_t* );
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109 */
	const CSchemaClassInfo* Schema_DynamicBinding(const Sheet_t* );
	CResourceArray<SheetSequence_t> m_Sequences; /* 0 8 */
	/* ../_generated_code/rendersystemempty/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:112 */
	const SheetSequence_t* FindSequence(const Sheet_t* , const char* );
	void Sheet_t(Sheet_t* );
	Sheet_t& operator=(Sheet_t* , const Sheet_t& );
};

// <00E03980> ../_generated_code/rendersystemvulkan/linuxsteamrt64/release/../../../../public/rendersystem/sheet.h:109
inline void Sheet_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <002A864C> ../public/rendersystem/sheet.h:126
inline void ComputeSheetShaderData(Vector2D* pUVs, int nTexWidth, int nTexHeight, int nSeqCount, float* pData, int nData)
{
} /* size: 0 */

