
//
// vulkan/renderdevicevulkan.cpp
//
//	referenced by: librendersystemvulkan.so
//
//	functions: 324
//	classes: 2
//	structs: 2
//

// <00A54330> vulkan/renderdevicevulkan.cpp:86
inline void operator()(const class* __closure, IConVar* pVar, const char* pOldValue, float flOldValue)
{
} /* size: 0 */

// <00A54275> vulkan/renderdevicevulkan.cpp:86
// variable: 1
// function calls: 2
void _FUN(IConVar *, const char *, float)
{
	CRenderDeviceVulkan::OnAnisotropyChanged(); // 90
	operator()(const class* __closure,
			IConVar* pVar,
			const char* pOldValue,
			float flOldValue); // 92
} /* size: 24, inline expansions: 2 (26 bytes) */

// <00997BC7> vulkan/renderdevicevulkan.cpp:86
// member functions: 2
// struct size: 1
struct {
	void operator()(const class* , IConVar* , const char* , float);
	void _FUN(IConVar* , const char* , float);
};

// <00A5420F> vulkan/renderdevicevulkan.cpp:102
// variable: 1
uintp RunVKThread(void* pParam)
{
	CRenderThreadBase* pThreadObject; // 104
} /* size: 20, variables: 1 */

// <00A500BB> vulkan/renderdevicevulkan.cpp:120
// function calls: 251
void CRenderDeviceVulkan::CRenderDeviceVulkan()
{
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::ValidateGrowSize(); // 475
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			short unsigned int i);  // 86
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::InvalidIterator(); // 448
	CUtlLinkedList<RenderDescriptorSetHandle_t__::ConstructList(); // 454
	CUtlLinkedList<RenderDescriptorSetHandle_t__::ResetDbgInfo(); // 455
	CUtlLinkedList<RenderDescriptorSetHandle_t__::CUtlLinkedList(
			int growSize,
			int initSize);  // 165
	ITextureResidencyListener::ITextureResidencyListener(); // 165
	IMobileEventListener::IMobileEventListener(); // 165
	CUtlTSHash<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc> >::CUtlTSHash(
			int nAllocationCount);  // 121
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	ConstructList(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this); // 454
	ResetDbgInfo(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this); // 455
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::InvalidIterator(); // 448
	CUtlLinkedList(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<RasterizerStateVulkan_t>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	ConstructList(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this); // 454
	ResetDbgInfo(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this); // 455
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::InvalidIterator(); // 448
	CUtlLinkedList(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<DepthStencilStateVulkan_t>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	ConstructList(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this); // 454
	ResetDbgInfo(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this); // 455
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::InvalidIterator(); // 448
	CUtlLinkedList(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<BlendStateVulkan_t>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	CUtlMemory<RenderDescriptorDesc_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<RenderDescriptorDesc_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::CUtlVector(); // 165
	CUtlMemory<RenderDescriptorBinding_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<RenderDescriptorBinding_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::CUtlVector(); // 165
	_Head_base<1, std::default_delete<CBufferedDescriptorSetVulkan>, true>::_Head_base(); // 561
	_Tuple_impl<1, std::default_delete<CBufferedDescriptorSetVulkan> >::_Tuple_impl(); // 303
	_Head_base<0, CBufferedDescriptorSetVulkan::_Head_base(); // 303
	_Tuple_impl<0, CBufferedDescriptorSetVulkan::_Tuple_impl(); // 966
	tuple<CBufferedDescriptorSetVulkan::tuple(); // 167
	__uniq_ptr_impl<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::__uniq_ptr_impl(); // 232
	__uniq_ptr_data<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan>, true, true>::__uniq_ptr_data(); // 298
	unique_ptr<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::unique_ptr<>(); // 165
	CUtlTSHash<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc> >::CUtlTSHash(
			int nAllocationCount);  // 122
	CColorFormatVulkan::CColorFormatVulkan(); // 165
	CUtlMemory<CUtlString, int>::ValidateGrowSize(); // 475
	CUtlMemory<CUtlString, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::CUtlVector(); // 99
	CAftermathVulkan::CAftermathVulkan(); // 165
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::ValidateGrowSize(); // 475
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 178
	Init(const CUtlHashtable<CUtlString, empty_t, DefaultHashFunctor<CUtlString>, DefaultEqualFunctor<CUtlString>, undefined_t, CU this); // 178
	CUtlHashtable(const CUtlHashtable<CUtlString, empty_t, DefaultHashFunctor<CUtlString>, DefaultEqualFunctor<CUtlString>, undefined_t, CU this,
			int minimumSize);  // 165
	CThreadMutex::CThreadMutex(
			const char* pName);  // 165
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	ConstructList(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 454
	ResetDbgInfo(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 455
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::InvalidIterator(); // 448
	CUtlLinkedList(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<CShaderVulkanBase>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	ConstructList(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 454
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::InvalidIterator(); // 448
	ResetDbgInfo(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 455
	CUtlLinkedList(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<CVertexShaderVulkan>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CInterlockedIntT<int, 4>::CInterlockedIntT(
			int value);  // 123
	CThreadMutex::CThreadMutex(
			const char* pName);  // 165
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this); // 530
	CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
			int growSize,
			int initCapacity);  // 419
	CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRe this,
			int growSize,
			int initCapacity);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlVectorMT(const CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVu this,
			int growSize,
			int initCapacity);  // 165
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 530
	CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRele this); // 165
	CThreadMutex::CThreadMutex(
			const char* pName);  // 165
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	ResetDbgInfo(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 530
	CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
			int growSize,
			int initCapacity);  // 418
	CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferReleas this); // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 101
	CUtlMemory<CRenderResource::ValidateGrowSize(); // 475
	CUtlMemory<CRenderResource::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CRenderResource::ResetDbgInfo(); // 530
	CUtlVectorBase<CRenderResource::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<CRenderResource::CUtlVector(); // 101
	CRenderResourceMgr::CRenderResourceMgr(); // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 419
	CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::CUtlVector(
			int growSize,
			int initCapacity);  // 25
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 25
	CUtlVectorMT(const CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThr this,
			int growSize,
			int initCapacity);  // 165
	ConstructList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 454
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::InvalidIterator(); // 448
	ResetDbgInfo(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 455
	CUtlLinkedList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<VulkanDescriptorSetPool_t>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CInterlockedIntT<unsigned int, 4>::CInterlockedIntT(
			unsigned int value);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::InvalidIterator(); // 448
	ConstructList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 454
	ResetDbgInfo(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 455
	CUtlLinkedList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this,
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<VulkanDescriptorSetPool_t>::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::Grow(
		int num);  // 193
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::Init(
		int nGrowSize,
		int nInitSize);  // 161
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::CUtlFixedMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::InvalidIterator(); // 448
	CUtlLinkedList<CDescriptorSetVulkan::ConstructList(); // 454
	CUtlLinkedList<CDescriptorSetVulkan::ResetDbgInfo(); // 455
	CUtlLinkedList<CDescriptorSetVulkan::CUtlLinkedList(
			int growSize,
			int initSize);  // 404
	CUtlFixedLinkedList<CDescriptorSetVulkan::CUtlFixedLinkedList(
				int growSize,
				int initSize);  // 165
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::ValidateGrowSize(); // 475
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 178
	CUtlHashtable<CUtlStringToken, RenderDescriptorSetHandle_t__::Init(); // 178
	CUtlHashtable<CUtlStringToken, RenderDescriptorSetHandle_t__::CUtlHashtable(
			int minimumSize);  // 165
	CUtlLinkedList<CShaderVulkanBase::ConstructList(); // 454
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::ValidateGrowSize(); // 475
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			int i);  // 86
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::InvalidIterator(); // 448
	CUtlLinkedList<CShaderVulkanBase::ResetDbgInfo(); // 455
	CUtlLinkedList<CShaderVulkanBase::CUtlLinkedList(
			int growSize,
			int initSize);  // 165
	CThreadMutex::CThreadMutex(
			const char* pName);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::ValidateGrowSize(); // 475
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			short unsigned int i);  // 86
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::InvalidIterator(); // 448
	CUtlLinkedList<VulkanSemaphore_t::ConstructList(); // 454
	CUtlLinkedList<VulkanSemaphore_t::ResetDbgInfo(); // 455
	CUtlLinkedList<VulkanSemaphore_t::CUtlLinkedList(
			int growSize,
			int initSize);  // 165
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::ValidateGrowSize(); // 475
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 448
	Iterator_t::Iterator_t(
			short unsigned int i);  // 86
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::InvalidIterator(); // 448
	CUtlLinkedList<VulkanSemaphore_t::ConstructList(); // 454
	CUtlLinkedList<VulkanSemaphore_t::ResetDbgInfo(); // 455
	CUtlLinkedList<VulkanSemaphore_t::CUtlLinkedList(
			int growSize,
			int initSize);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CThreadFastMutex::CThreadFastMutex(
			const char* pLockName);  // 165
	CUtlIntrusiveList<CBaseAccelerationStructureVulkan>::CUtlIntrusiveList(); // 1180
	CUtlIntrusiveDList<CBaseAccelerationStructureVulkan>::CUtlIntrusiveDList(); // 165
	CUtlIntrusiveList<CBaseAccelerationStructureVulkan>::CUtlIntrusiveList(); // 1180
	CUtlIntrusiveDList<CBaseAccelerationStructureVulkan>::CUtlIntrusiveDList(); // 165
	CUtlIntrusiveList<CRayTracePipelineVulkan>::CUtlIntrusiveList(); // 1180
	CUtlIntrusiveDList<CRayTracePipelineVulkan>::CUtlIntrusiveDList(); // 165
	CUtlIntrusiveList<CRayTraceShaderBindingTableVulkan>::CUtlIntrusiveList(); // 1180
	CUtlIntrusiveDList<CRayTraceShaderBindingTableVulkan>::CUtlIntrusiveDList(); // 165
	ValidateGrowSize(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 475
	CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this,
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this); // 489
	ResetDbgInfo(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this); // 491
	CUtlRBTree(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this,
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	CUtlMap(const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHa this,
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 165
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::InvalidIterator(); // 489
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::ResetDbgInfo(); // 491
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	CUtlMap<RenderResourceHandle_t__::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 165
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::InvalidIterator(); // 489
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::ResetDbgInfo(); // 491
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	CUtlMap<RenderDescriptorSetHandle_t__::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 165
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::ValidateGrowSize(); // 475
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::InvalidIterator(); // 489
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::ResetDbgInfo(); // 491
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	CUtlMap<RenderRayTracePipelineHandle_t__::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 165
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 165
	CThreadMutex::CThreadMutex(
			const char* pName);  // 165
	CUtlMemory<char, int>::ValidateGrowSize(); // 475
	CUtlMemory<char, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<char, CUtlMemory<char, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<char, CUtlMemory<char, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<char, CUtlMemory<char, int> >::CUtlVector(); // 165
	CInterlockedIntT<unsigned int, 4>::CInterlockedIntT(); // 165
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 170
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 165
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 171
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 172
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 173
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 175
} /* size: 3436, inline expansions: 251 (4825 bytes) */

// <00A500A2> vulkan/renderdevicevulkan.cpp:120
void CRenderDeviceVulkan::CRenderDeviceVulkan()
{
} /* size: 0 */

// <00A4C1A5> vulkan/renderdevicevulkan.cpp:231
// variables: 24
// function calls: 293
void CRenderDeviceVulkan::~CRenderDeviceVulkan()
{
	CThreadMutex::~CThreadMutex(); // 234
	CUtlVectorBase<char, CUtlMemory<char, int> >::RemoveAll(); // 1798
	CUtlMemory<char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<char, int>::Purge(); // 903
	CUtlMemory<char, int>::Purge(); // 1799
	CUtlVectorBase<char, CUtlMemory<char, int> >::Purge(); // 560
	ValidateAlignment<char>(void); // 508
	CUtlMemory<char, int>::Purge(); // 510
	CUtlMemory<char, int>::~CUtlMemory(); // 562
	CUtlVectorBase<char, CUtlMemory<char, int> >::~CUtlVectorBase(); // 410
	CUtlVector<char, CUtlMemory<char, int> >::~CUtlVector(); // 234
	CThreadMutex::~CThreadMutex(); // 234
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 509
	ValidateAlignment<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__*, VulkanDeviceSpecificRayTracePipeline_t, unsigned int, CDefLess<RenderRayTracePipelineHandle_t__*> >::Node_t, unsigned int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 510
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::~CUtlMemory(); // 510
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::~CUtlRBTree(); // 47
	CUtlMap<RenderRayTracePipelineHandle_t__::~CUtlMap(); // 234
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 509
	ValidateAlignment<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__*, VulkanDeviceSpecificDescriptorSet_t, unsigned int, CDefLess<RenderDescriptorSetHandle_t__*> >::Node_t, unsigned int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 510
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::~CUtlMemory(); // 510
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::~CUtlRBTree(); // 47
	CUtlMap<RenderDescriptorSetHandle_t__::~CUtlMap(); // 234
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Purge(); // 509
	ValidateAlignment<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__*, VulkanDeviceSpecificBuffer_t, unsigned int, CDefLess<RenderResourceHandle_t__*> >::Node_t, unsigned int> >(void); // 508
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::Purge(); // 510
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::~CUtlMemory(); // 510
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::~CUtlRBTree(); // 47
	CUtlMap<RenderResourceHandle_t__::~CUtlMap(); // 234
	IsExternallyAllocated(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this); // 905
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this); // 1288
	Purge(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this); // 509
	ValidateAlignment<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHandle<InfoForResourceTypeCTextureBase> > >::Node_t, unsigned int> >(void); // 508
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 510
	~CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 510
	~CUtlRBTree(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this); // 47
	~CUtlMap(const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHa this); // 234
	ValidateAlignment<UtlLinkedListElem_t<VulkanSemaphore_t*, short unsigned int> >(void); // 508
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::IsExternallyAllocated(); // 905
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::Purge(); // 903
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::Purge(); // 510
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::~CUtlMemory(); // 462
	CUtlLinkedList<VulkanSemaphore_t::~CUtlLinkedList(); // 234
	ValidateAlignment<UtlLinkedListElem_t<VulkanSemaphore_t*, short unsigned int> >(void); // 508
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::IsExternallyAllocated(); // 905
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::Purge(); // 903
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::Purge(); // 510
	CUtlMemory<UtlLinkedListElem_t<VulkanSemaphore_t::~CUtlMemory(); // 462
	CUtlLinkedList<VulkanSemaphore_t::~CUtlLinkedList(); // 234
	ValidateAlignment<UtlLinkedListElem_t<CShaderVulkanBase*, int> >(void); // 508
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::IsExternallyAllocated(); // 905
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::Purge(); // 903
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::Purge(); // 510
	CUtlMemory<UtlLinkedListElem_t<CShaderVulkanBase::~CUtlMemory(); // 462
	CUtlLinkedList<CShaderVulkanBase::~CUtlLinkedList(); // 234
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::Count(); // 897
			CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::IsValid(); // 899
			CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::MarkInvalid(); // 901
			Destruct<CUtlKeyValuePair<CUtlStringToken, RenderDescriptorSetHandle_t__*> >(CUtlKeyValuePair<CUtlStringToken, RenderDescriptorSetHandle_t__*>* pMemory); // 902
		}
	}
	CUtlHashtable<CUtlStringToken, RenderDescriptorSetHandle_t__::RemoveAll(); // 188
	ValidateAlignment<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__*> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<CUtlStringToken, RenderDescriptorSetHandle_t__::~CUtlMemory(); // 188
	CUtlHashtable<CUtlStringToken, RenderDescriptorSetHandle_t__::~CUtlHashtable(); // 234
	CThreadEvent::~CThreadEvent(); // 2177
	CThreadEvent::~CThreadEvent(); // 2177
	CThreadRWLock_FastRead::~CThreadRWLock_FastRead(); // 234
	ValidateAlignment<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__*, short unsigned int> >(void); // 508
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::Purge(); // 903
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::Purge(); // 510
	CUtlMemory<UtlLinkedListElem_t<RenderDescriptorSetHandle_t__::~CUtlMemory(); // 462
	CUtlLinkedList<RenderDescriptorSetHandle_t__::~CUtlLinkedList(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::~CUtlFixedMemory(); // 462
	CUtlLinkedList<CDescriptorSetVulkan::~CUtlLinkedList(); // 400
	CUtlFixedLinkedList<CDescriptorSetVulkan::~CUtlFixedLinkedList(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 400
	CUtlFixedLinkedList<VulkanDescriptorSetPool_t>::~CUtlFixedLinkedList(); // 234
	CThreadEvent::~CThreadEvent(); // 2177
	CThreadEvent::~CThreadEvent(); // 2177
	CThreadRWLock_FastRead::~CThreadRWLock_FastRead(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<VulkanDescriptorSetPool_t, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<VulkanDescriptorSetPool_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<V this); // 400
	CUtlFixedLinkedList<VulkanDescriptorSetPool_t>::~CUtlFixedLinkedList(); // 234
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::RemoveAll(); // 1798
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Purge(); // 1799
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Purge(); // 560
	ValidateAlignment<CRenderDeviceVulkan::QueryPool_t>(void); // 508
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Purge(); // 510
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::~CUtlVector(); // 18
	~CUtlVectorMT(const CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThr this); // 234
	CUtlVectorBase<CRenderResource::RemoveAll(); // 1798
	CUtlMemory<CRenderResource::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderResource::Purge(); // 903
	CUtlMemory<CRenderResource::Purge(); // 1799
	CUtlVectorBase<CRenderResource::Purge(); // 560
	ValidateAlignment<CRenderResource*>(void); // 508
	CUtlMemory<CRenderResource::Purge(); // 510
	CUtlMemory<CRenderResource::~CUtlMemory(); // 562
	CUtlVectorBase<CRenderResource::~CUtlVectorBase(); // 410
	CUtlVector<CRenderResource::~CUtlVector(); // 98
	CRenderResourceMgr::~CRenderResourceMgr(); // 234
	{
		int i; // 1721
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
			int i);  // 1723
		CUtlVectorBase<CIndexBufferVulkan::RemoveAll(); // 1798
		CUtlMemory<CIndexBufferVulkan::IsExternallyAllocated(); // 905
		CUtlMemory<CIndexBufferVulkan::Purge(); // 903
		CUtlMemory<CIndexBufferVulkan::Purge(); // 1799
		CUtlVectorBase<CIndexBufferVulkan::Purge(); // 560
		ValidateAlignment<CIndexBufferVulkan*>(void); // 508
		CUtlMemory<CIndexBufferVulkan::Purge(); // 510
		CUtlMemory<CIndexBufferVulkan::~CUtlMemory(); // 562
		CUtlVectorBase<CIndexBufferVulkan::~CUtlVectorBase(); // 410
		CUtlVector<CIndexBufferVulkan::~CUtlVector(); // 901
		FencedIndexBufferRelease_t::~FencedIndexBufferRelease_t(); // 1526
		Destruct<CRenderDeviceVulkan::FencedIndexBufferRelease_t>(FencedIndexBufferRelease_t* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 1798
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 560
	ValidateAlignment<CRenderDeviceVulkan::FencedIndexBufferRelease_t>(void); // 508
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::Purge(); // 510
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 410
	~CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferReleas this); // 234
	CThreadMutex::~CThreadMutex(); // 234
	{
		int i; // 1721
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
			int i);  // 1723
		CUtlVectorBase<CVertexBufferVulkan::RemoveAll(); // 1798
		CUtlMemory<CVertexBufferVulkan::IsExternallyAllocated(); // 905
		CUtlMemory<CVertexBufferVulkan::Purge(); // 903
		CUtlMemory<CVertexBufferVulkan::Purge(); // 1799
		CUtlVectorBase<CVertexBufferVulkan::Purge(); // 560
		ValidateAlignment<CVertexBufferVulkan*>(void); // 508
		CUtlMemory<CVertexBufferVulkan::Purge(); // 510
		CUtlMemory<CVertexBufferVulkan::~CUtlMemory(); // 562
		CUtlVectorBase<CVertexBufferVulkan::~CUtlVectorBase(); // 410
		CUtlVector<CVertexBufferVulkan::~CUtlVector(); // 892
		FencedVertexBufferRelease_t::~FencedVertexBufferRelease_t(); // 1526
		Destruct<CRenderDeviceVulkan::FencedVertexBufferRelease_t>(FencedVertexBufferRelease_t* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 1798
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 560
	ValidateAlignment<CRenderDeviceVulkan::FencedVertexBufferRelease_t>(void); // 508
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::Purge(); // 510
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 410
	~CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRele this); // 234
	CThreadMutex::~CThreadMutex(); // 234
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::Purge(); // 1799
	Purge(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this); // 560
	ValidateAlignment<CRenderDeviceVulkan::FencedVulkanTextureRelease_t>(void); // 508
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::Purge(); // 510
	CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::~CUtlMemory(); // 562
	~CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this); // 410
	~CUtlVector(const CUtlVector<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRe this); // 18
	~CUtlVectorMT(const CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVu this); // 234
	CThreadMutex::~CThreadMutex(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 400
	CUtlFixedLinkedList<CVertexShaderVulkan>::~CUtlFixedLinkedList(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 400
	CUtlFixedLinkedList<CShaderVulkanBase>::~CUtlFixedLinkedList(); // 234
	{
		entry_t* table; // 896
		CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::Base(); // 896
		{
			int i; // 897
			CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::Count(); // 897
			CUtlHashtableEntry<CUtlString, empty_t>::IsValid(); // 899
			CUtlHashtableEntry<CUtlString, empty_t>::MarkInvalid(); // 901
			CUtlString::~CUtlString(); // 71
			CUtlKeyValuePair<CUtlString, empty_t>::~CUtlKeyValuePair(); // 1526
			Destruct<CUtlKeyValuePair<CUtlString, empty_t> >(CUtlKeyValuePair<CUtlString, empty_t>* pMemory); // 902
		}
	}
	RemoveAll(const CUtlHashtable<CUtlString, empty_t, DefaultHashFunctor<CUtlString>, DefaultEqualFunctor<CUtlString>, undefined_t, CU this); // 188
	ValidateAlignment<CUtlHashtableEntry<CUtlString, empty_t> >(void); // 508
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::Purge(); // 903
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::Purge(); // 510
	CUtlMemory<CUtlHashtableEntry<CUtlString, empty_t>, int>::~CUtlMemory(); // 188
	~CUtlHashtable(const CUtlHashtable<CUtlString, empty_t, DefaultHashFunctor<CUtlString>, DefaultEqualFunctor<CUtlString>, undefined_t, CU this); // 234
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 100
	CAftermathVulkan::~CAftermathVulkan(); // 234
	CUtlMemory<ImageFormat, int>::IsExternallyAllocated(); // 905
	CUtlMemory<ImageFormat, int>::Purge(); // 903
	CUtlMemory<ImageFormat, int>::Purge(); // 1799
	CUtlVectorBase<ImageFormat, CUtlMemory<ImageFormat, int> >::RemoveAll(); // 1798
	CUtlVectorBase<ImageFormat, CUtlMemory<ImageFormat, int> >::Purge(); // 560
	ValidateAlignment<ImageFormat>(void); // 508
	CUtlMemory<ImageFormat, int>::Purge(); // 510
	CUtlMemory<ImageFormat, int>::~CUtlMemory(); // 562
	CUtlVectorBase<ImageFormat, CUtlMemory<ImageFormat, int> >::~CUtlVectorBase(); // 410
	CUtlVector<ImageFormat, CUtlMemory<ImageFormat, int> >::~CUtlVector(); // 22
	CColorFormatBase::~CColorFormatBase(); // 20
	CColorFormatVulkan::~CColorFormatVulkan(); // 234
	CInterlockedIntT<int, 4>::operator int(); // 68
	CUtlMemoryPoolBase::Count(); // 675
	RemoveAll(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 352
	Purge(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 343
	~CUtlMemoryPool(const CUtlMemoryPool<CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerSta this); // 344
	~CUtlTSHashBase(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 803
	CUtlTSHash<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc> >::~CUtlTSHash(); // 234
	CInterlockedIntT<int, 4>::operator int(); // 68
	CUtlMemoryPoolBase::Count(); // 675
	RemoveAll(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 352
	Purge(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 343
	~CUtlMemoryPool(const CUtlMemoryPool<CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerSta this); // 344
	~CUtlTSHashBase(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 803
	CUtlTSHash<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc> >::~CUtlTSHash(); // 234
	{
		CBufferedDescriptorSetVulkan *& __ptr; // 396
		__uniq_ptr_impl<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::_M_ptr(); // 396
		unique_ptr<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::get_deleter(); // 398
		default_delete<CBufferedDescriptorSetVulkan>::operator(
				CBufferedDescriptorSetVulkan* __ptr);  // 398
	}
	unique_ptr<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::~unique_ptr(); // 234
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::RemoveAll(); // 1798
	CUtlMemory<RenderDescriptorBinding_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<RenderDescriptorBinding_t, int>::Purge(); // 903
	CUtlMemory<RenderDescriptorBinding_t, int>::Purge(); // 1799
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::Purge(); // 560
	ValidateAlignment<RenderDescriptorBinding_t>(void); // 508
	CUtlMemory<RenderDescriptorBinding_t, int>::Purge(); // 510
	CUtlMemory<RenderDescriptorBinding_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::~CUtlVector(); // 234
	CUtlVectorBase<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::RemoveAll(); // 1798
	CUtlMemory<RenderDescriptorDesc_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<RenderDescriptorDesc_t, int>::Purge(); // 903
	CUtlMemory<RenderDescriptorDesc_t, int>::Purge(); // 1799
	CUtlVectorBase<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::Purge(); // 560
	ValidateAlignment<RenderDescriptorDesc_t>(void); // 508
	CUtlMemory<RenderDescriptorDesc_t, int>::Purge(); // 510
	CUtlMemory<RenderDescriptorDesc_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<RenderDescriptorDesc_t, CUtlMemory<RenderDescriptorDesc_t, int> >::~CUtlVector(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this); // 400
	CUtlFixedLinkedList<BlendStateVulkan_t>::~CUtlFixedLinkedList(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this); // 400
	CUtlFixedLinkedList<DepthStencilStateVulkan_t>::~CUtlFixedLinkedList(); // 234
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::Purge(); // 167
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::~CUtlFixedMemory(); // 462
	~CUtlLinkedList(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this); // 400
	CUtlFixedLinkedList<RasterizerStateVulkan_t>::~CUtlFixedLinkedList(); // 234
	IMobileEventListener::~IMobileEventListener(); // 234
} /* size: 2252, inline expansions: 246 (6846 bytes) */

// <00A4C13C> vulkan/renderdevicevulkan.cpp:231
void CRenderDeviceVulkan::~CRenderDeviceVulkan()
{
} /* size: 36 */

// <00A67D0C> vulkan/renderdevicevulkan.cpp:239
// variables: 2
// function calls: 3
void CRenderDeviceVulkan::ConfigureDeviceSpecificSettings()
{
	const HardwareCaps_t& caps; // 241
	strstr(const char* __haystack,
		const char* __needle);  // 247
	V_strstr(const char* s1,
		const char* search);  // 246
	{
		ConVar vulkan_amd_timestamp_workaround; // 248
	}
	CRenderDeviceVulkan::ConfigureDeviceSpecificSettings(); // 239
} /* size: 107, variables: 1, inline expansions: 3 (49 bytes) */

// <00A4C0ED> vulkan/renderdevicevulkan.cpp:239
// variables: 2
void CRenderDeviceVulkan::ConfigureDeviceSpecificSettings()
{
	const HardwareCaps_t& caps; // 241
	{
		ConVar vulkan_amd_timestamp_workaround; // 248
	}
} /* size: 0, variables: 1 */

// <00A4A55E> vulkan/renderdevicevulkan.cpp:332
// variables: 23
// function calls: 96
void CRenderDeviceVulkan::InitPipelineCacheManager()
{
	bool bUseSteamShaderCache; // 335
	CUtlString basePath; // 345
	const char* pSteamFossilizeDumpPath; // 346
	const char* pSteamFossilizeReadOnlyEnv; // 357
	const char* pSteamFossilizeDumpPathReadOnly; // 358
	CUtlString separator; // 366
	CUtlStringList fossilizePathList; // 367
	CUtlString additionalFossilizeFile; // 374
	const CUtlString  steamPipelineCache; // 385
	const CUtlString  steamAppPipelineCache; // 386
	bool bUseSteamAppShaderCache; // 389
	bool bUseSteamDownloadedShaderCache; // 393
	CUtlString whitelistPath; // 424
	int32 nWhitelistedDatabaseIndex; // 425
	{
		char fullFilePath; // 377
		CPathBufferString gamePath; // 378
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 712
		CBufferString::CBufferString(); // 591
		CBufferStringN<200>::CBufferStringN(); // 378
		IFileSystem::GetSearchPath(
				const char* pathID,
				CBufferString* pPath,
				int nMaxElements);  // 379
		CUtlString::Get(); // 380
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 781
		CBufferString::operator char const*(); // 380
		V_ComposeFileName<long unsigned int>(const char* path,
							const char* filename,
							char* dest,
							long unsigned int destSize);  // 380
		V_strlen(const char* str); // 46
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 75
		V_memcpy(void* dest,
			const void* src,
			int count);  // 48
		CUtlMemory<char::NumAllocated(); // 1196
		CUtlMemory<char::Base(); // 112
		CUtlVectorBase<char::Base(); // 368
		CUtlVectorBase<char::ResetDbgInfo(); // 824
		CUtlMemory<char::IsGrowable(); // 823
		CUtlMemory<char::IsExternallyAllocated(); // 859
		CUtlMemory<char::IsExternallyAllocated(); // 861
		CUtlMemory<char::Grow(
			int num);  // 806
		CUtlVectorBase<char::GrowMemory(
				int num);  // 1198
		CUtlMemory<char::operator[](
				int i);  // 602
		CUtlVectorBase<char::Element(
			int i);  // 1201
		CopyConstruct<char*>(char** pMemory,
					char* const& src);  // 1201
		CUtlVectorBase<char::AddToTail(
				char* const& src);  // 49
		CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
				const char* pString);  // 381
		CBufferString::~CBufferString(); // 587
		CBufferStringN<200>::~CBufferStringN(); // 383
	}
	{
		int nIndex; // 399
		CUtlVectorBase<char::Count(); // 399
		CUtlString::Get(); // 401
		CUtlVectorBase<char::Remove(
			int elem);  // 403
		CUtlMemory<char::operator[](
				int i);  // 588
		CUtlVectorBase<char::operator[](
				int i);  // 401
		strstr(char* __haystack,
			const char* __needle);  // 255
		V_strstr(char* s1,
			const char* search);  // 401
	}
	{
		int nIndex; // 412
		CUtlString::Get(); // 441
		CUtlString::operator char const*(); // 414
		CUtlVectorBase<char::Remove(
			int elem);  // 416
		CUtlMemory<char::operator[](
				int i);  // 588
		CUtlVectorBase<char::operator[](
				int i);  // 414
		strstr(char* __haystack,
			const char* __needle);  // 255
		V_strstr(char* s1,
			const char* search);  // 414
	}
	{
		CUtlString whitelistFileName; // 428
		char szWhiteListDir; // 429
		char szWhiteListPath; // 432
		{
			int nIndex; // 439
			CUtlVectorBase<char::Count(); // 439
			CUtlString::Get(); // 441
			CUtlString::operator char const*(); // 441
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 441
			strstr(char* __haystack,
				const char* __needle);  // 255
			V_strstr(char* s1,
				const char* search);  // 441
		}
		CUtlString::CUtlString(
				const char* pString);  // 428
		CUtlMemory<char::operator[](
				int i);  // 588
		CUtlVectorBase<char::operator[](
				int i);  // 430
		V_ExtractFilePath<long unsigned int>(const char* path,
							char* dest,
							long unsigned int destSize);  // 430
		CUtlString::Get(); // 433
		V_FixupPathName<long unsigned int>(char* pOut,
							long unsigned int nOutLen,
							const char* pPath,
							bool bLowercaseName);  // 434
		CUtlString::operator=(
				const char* src);  // 438
		CUtlString::~CUtlString(); // 448
	}
	CUtlString::CUtlString(); // 345
	CUtlString::operator=(
			const char* src);  // 350
	CUtlString::CUtlString(
			const char* pString);  // 366
	CUtlMemory<char::ValidateGrowSize(); // 475
	CUtlMemory<char::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<char::ResetDbgInfo(); // 530
	CUtlVectorBase<char::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<char::CUtlVector(); // 11
	CUtlStringList_Base<CUtlVector<char::CUtlStringList_Base(); // 71
	CUtlStringList::CUtlStringList(); // 367
	CUtlString::Get(); // 370
	CUtlString::CUtlString(
			const char* pString);  // 374
	CUtlString::IsEmpty(); // 375
	CUtlString::CUtlString(
			const char* pString);  // 385
	CUtlString::CUtlString(
			const char* pString);  // 386
	CUtlString::CUtlString(); // 424
	CUtlVectorBase<char::Count(); // 450
	CUtlString::~CUtlString(); // 455
	CUtlString::~CUtlString(); // 455
	CUtlString::~CUtlString(); // 455
	{
		int i; // 22
		CUtlVectorBase<char::Count(); // 22
		CUtlMemory<char::operator[](
				int i);  // 602
		CUtlVectorBase<char::Element(
			int i);  // 24
	}
	CUtlVectorBase<char::RemoveAll(); // 26
	CUtlStringList_Base<CUtlVector<char::PurgeAndFreeElements(); // 17
	CUtlMemory<char::IsExternallyAllocated(); // 905
	CUtlMemory<char::Purge(); // 903
	CUtlMemory<char::Purge(); // 1799
	CUtlVectorBase<char::Purge(); // 560
	ValidateAlignment<char*>(void); // 508
	CUtlMemory<char::Purge(); // 510
	CUtlMemory<char::~CUtlMemory(); // 562
	CUtlVectorBase<char::~CUtlVectorBase(); // 410
	CUtlVector<char::~CUtlVector(); // 18
	CUtlStringList_Base<CUtlVector<char::~CUtlStringList_Base(); // 66
	CUtlStringList::~CUtlStringList(); // 455
	CUtlString::~CUtlString(); // 455
	CUtlString::~CUtlString(); // 455
	CUtlString::~CUtlString(); // 455
} /* size: 2363, variables: 14, inline expansions: 36 (998 bytes) */

// <00A3DF92> vulkan/renderdevicevulkan.cpp:460
// variables: 84
// function calls: 520
void CRenderDeviceVulkan::InitDevice(int nAdapter, int nFlags, int nDXLevel)
{
	const bool  bRobustness; // 470
	bool bEXTRobutsness2; // 475
	const VulkanPhysicalDeviceInfo_t* pDevInfo; // 477
	CUtlStringList requiredDeviceExtensions; // 496
	CUtlStringList optionalDeviceExtensions; // 516
	bool bAllowGraphicsPipelineLibrary; // 600
	bool bRequestedGraphicsPipelineLibrary; // 607
	VkPhysicalDeviceFaultFeaturesEXT deviceFaultFeatures; // 645
	VkPhysicalDeviceMemoryPriorityFeaturesEXT deviceMemoryPriorityFeatures; // 660
	const bool  bGpuDiagnostics; // 699
	bool bDescriptorIndexing; // 741
	bool bUseEXTMemoryBudget; // 759
	uint32_t nExtensionCount; // 812
	VkResult nResult; // 813
	const char ** ppDeviceExtensionNames; // 822
	uint32_t nEnabledDeviceExtensionCount; // 823
	VkExtensionProperties* pDeviceExtProperties; // 825
	CUtlVector<char const*, CUtlMemory<char const*, int> > activeLayerNames; // 908
	const char* pStandardValidationName; // 909
	uint32_t nQueueCount; // 935
	VkQueueFamilyProperties* pQueueFamilyProperties; // 937
	bool bDisableAsyncCompute; // 947
	bool bFoundGraphicsQueue; // 948
	bool bFoundComputeQueue; // 949
	uint32_t nGraphicsQueueFamilyIndex; // 950
	uint32_t nComputeQueueFamilyIndex; // 951
	float flQueuePriorities; // 1005
	uint32_t nQueueCreateInfoCount; // 1006
	VkDeviceQueueCreateInfo deviceQueueCreateInfos; // 1007
	VkDeviceCreateInfo deviceCreateInfo; // 1035
	VkBaseInStructure* pDeviceCreateInfo; // 1036
	VkDeviceMemoryOverallocationCreateInfoAMD deviceMemoryOverallocationCreateInfoAMD; // 1060
	VkPhysicalDeviceVulkan12Features physicalDeviceVulkan12Features; // 1069
	VkPhysicalDeviceRayQueryFeaturesKHR rayQueryFeatures; // 1100
	VkPhysicalDeviceAccelerationStructureFeaturesKHR deviceAccelerationFeatures; // 1101
	VkPhysicalDeviceRayTracingPipelineFeaturesKHR deviceRayTracingPipelineFeatures; // 1102
	VkPhysicalDevicePipelineCreationCacheControlFeaturesEXT pipelineCreationCacheControlFeatures; // 1122
	VkPhysicalDeviceSubgroupSizeControlFeaturesEXT subgroupSizeControlFeatures; // 1131
	VkPhysicalDeviceFeatures enabledFeatures; // 1159
	VkPhysicalDeviceExtendedDynamicStateFeaturesEXT extendedDynamicStateFeatures; // 1171
	VkPhysicalDeviceExtendedDynamicState2FeaturesEXT extendedDynamicState2Features; // 1180
	const char   __FUNCTION__; // 28624
	VkPhysicalDeviceExtendedDynamicState3FeaturesEXT extendedDynamicState3Features; // 1200
	VkPhysicalDeviceGraphicsPipelineLibraryFeaturesEXT graphicsPipelineLibraryFeatures; // 1220
	VkPhysicalDeviceDynamicRenderingFeaturesKHR dynamicRenderingFeatures; // 1238
	VkPhysicalDevicePageableDeviceLocalMemoryFeaturesEXT pageableDeviceLocalMemoryFeatures; // 1247
	VkPhysicalDeviceShaderClockFeaturesKHR shaderClockFeatures; // 1256
	VkPhysicalDeviceRobustness2FeaturesEXT robustness2Features; // 1276
	VkPhysicalDevicePipelineRobustnessFeaturesEXT pipelineRobustnessFeatures; // 1289
	VkDeviceDiagnosticsConfigCreateInfoNV deviceDiagnosticsConfigCreateInfo; // 1307
	bool bEnableValidation; // 1419
	const bool  bReflex; // 1420
	RenderAdapterInfo_t gpu; // 1434
	const RenderAdapterInfo_t& info; // 1479
	ImageFormat preferredDepthStencilFormat; // 1519
	{
		CUtlStringList vrDeviceExtensions; // 501
		{
			int i; // 504
			CUtlVectorBase<char::Count(); // 504
			CUtlMemory<char::operator[](
					int i);  // 588
			CUtlVectorBase<char::operator[](
					int i);  // 507
			V_strcmp(const char* s1,
				const char* s2);  // 507
			V_strlen(const char* str); // 46
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 75
			V_memcpy(void* dest,
				const void* src,
				int count);  // 48
			CUtlMemory<char::operator[](
					int i);  // 602
			CUtlVectorBase<char::Element(
				int i);  // 1201
			CopyConstruct<char*>(char** pMemory,
						char* const& src);  // 1201
			CUtlMemory<char::Grow(
				int num);  // 806
			CUtlVectorBase<char::GrowMemory(
					int num);  // 1198
			CUtlVectorBase<char::AddToTail(
					char* const& src);  // 49
			CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
					const char* pString);  // 510
		}
		CUtlMemory<char::ValidateGrowSize(); // 475
		CUtlMemory<char::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<char::ResetDbgInfo(); // 530
		CUtlVectorBase<char::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<char::CUtlVector(); // 11
		CUtlStringList_Base<CUtlVector<char::CUtlStringList_Base(); // 71
		CUtlStringList::CUtlStringList(); // 501
		CUtlMemory<char::Purge(); // 903
		CUtlMemory<char::IsExternallyAllocated(); // 905
		CUtlMemory<char::Purge(); // 1799
		CUtlVectorBase<char::Purge(); // 560
		ValidateAlignment<char*>(void); // 508
		CUtlMemory<char::Purge(); // 510
		CUtlMemory<char::~CUtlMemory(); // 562
		CUtlVectorBase<char::~CUtlVectorBase(); // 410
		CUtlVector<char::~CUtlVector(); // 18
		{
			int i; // 22
			CUtlVectorBase<char::Count(); // 22
			CUtlMemory<char::operator[](
					int i);  // 602
			CUtlVectorBase<char::Element(
				int i);  // 24
		}
		CUtlVectorBase<char::RemoveAll(); // 26
		CUtlStringList_Base<CUtlVector<char::PurgeAndFreeElements(); // 17
		CUtlStringList_Base<CUtlVector<char::~CUtlStringList_Base(); // 66
		CUtlStringList::~CUtlStringList(); // 512
	}
	{
		VkPhysicalDeviceFeatures2KHR physicalDeviceFeatures2; // 649
	}
	{
		VkPhysicalDeviceFeatures2KHR physicalDeviceFeatures2; // 664
	}
	{
		int nIndex; // 839
		{
			const char* pExtName; // 841
		}
	}
	{
		int nIndex; // 855
		{
			const char* pExtName; // 857
		}
	}
	{
		uint32_t nValidationExtensionCount; // 912
		VkExtensionProperties* pValidationExtensionProperties; // 915
		CUtlMemory<char const::Grow(
			int num);  // 806
		CUtlVectorBase<char const::GrowMemory(
				int num);  // 1198
		CopyConstruct<char const*>(const char ** pMemory,
						const char* const& src);  // 1201
		CUtlVectorBase<char const::AddToTail(
				const char* const& src);  // 922
	}
	{
		uint32_t nQueueFamilyIndex; // 952
	}
	{
		uint32_t nExt; // 1049
	}
	{
		VkPhysicalDeviceFeatures2KHR physicalDeviceFeatures2; // 1136
	}
	{
		VkPhysicalDeviceFeatures2KHR physicalDeviceFeatures2; // 1186
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1184
		}
		CRenderDeviceMgrVulkan::KHRGetPhysicalDeviceProperties2Enabled(); // 1184
	}
	{
		VkPhysicalDeviceFeatures2KHR physicalDeviceFeatures2; // 1206
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1204
		}
		CRenderDeviceMgrVulkan::KHRGetPhysicalDeviceProperties2Enabled(); // 1204
	}
	{
		VkPhysicalDeviceFeatures2 physicalDeviceFeatures2; // 1260
	}
	{
		VkPhysicalDeviceFeatures2 physicalDeviceFeatures2; // 1280
	}
	{
		VkPhysicalDeviceFeatures2 physicalDeviceFeatures2; // 1293
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1329
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1352
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1365
	}
	{
		int nMajor; // 1463
		int nMinor; // 1464
		int nPatch; // 1465
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 771
		CBufferString::Get(); // 80
		CFmtStrN<256>::Get(); // 1470
		CBufferString::~CBufferString(); // 587
		CBufferStringN<256>::~CBufferStringN(); // 41
		CFmtStrN<256>::~CFmtStrN(); // 1470
	}
	CUtlMemory<VulkanPhysicalDeviceInfo_t, int>::operator[](
			int i);  // 595
	CUtlVectorBase<VulkanPhysicalDeviceInfo_t, CUtlMemory<VulkanPhysicalDeviceInfo_t, int> >::operator[](
			int i);  // 80
	CRenderDeviceMgrVulkan::GetVulkanPhysicalDeviceInfo(
					int nAdapter);  // 477
	CUtlMemory<char::ValidateGrowSize(); // 475
	CUtlMemory<char::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<char::ResetDbgInfo(); // 530
	CUtlVectorBase<char::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<char::CUtlVector(); // 11
	CUtlStringList_Base<CUtlVector<char::CUtlStringList_Base(); // 71
	CUtlStringList::CUtlStringList(); // 496
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::NumAllocated(); // 1196
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 514
	CUtlVectorBase<char::ResetDbgInfo(); // 530
	CUtlMemory<char::ValidateGrowSize(); // 475
	CUtlMemory<char::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<char::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<char::CUtlVector(); // 11
	CUtlStringList_Base<CUtlVector<char::CUtlStringList_Base(); // 71
	CUtlStringList::CUtlStringList(); // 516
	CRenderDeviceMgrVulkan::KHRGetPhysicalDeviceProperties2Enabled(); // 647
	CRenderDeviceMgrVulkan::KHRGetPhysicalDeviceProperties2Enabled(); // 662
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 682
	CRenderDeviceMgrVulkan::KHRGetPhysicalDeviceProperties2Enabled(); // 759
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 780
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 789
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 826
	{
		int i; // 22
	}
	CUtlStringList_Base<CUtlVector<char::PurgeAndFreeElements(); // 17
	CUtlMemory<char::Purge(); // 903
	CUtlMemory<char::Purge(); // 1799
	CUtlVectorBase<char::Purge(); // 560
	ValidateAlignment<char*>(void); // 508
	CUtlMemory<char::Purge(); // 510
	CUtlMemory<char::~CUtlMemory(); // 562
	CUtlVectorBase<char::~CUtlVectorBase(); // 410
	CUtlVector<char::~CUtlVector(); // 18
	CUtlStringList_Base<CUtlVector<char::~CUtlStringList_Base(); // 66
	CUtlStringList::~CUtlStringList(); // 1536
	{
		int i; // 22
	}
	CUtlStringList_Base<CUtlVector<char::PurgeAndFreeElements(); // 17
	CUtlMemory<char::Purge(); // 903
	CUtlMemory<char::Purge(); // 1799
	CUtlVectorBase<char::Purge(); // 560
	ValidateAlignment<char*>(void); // 508
	CUtlMemory<char::Purge(); // 510
	CUtlMemory<char::~CUtlMemory(); // 562
	CUtlVectorBase<char::~CUtlVectorBase(); // 410
	CUtlVector<char::~CUtlVector(); // 18
	CUtlStringList_Base<CUtlVector<char::~CUtlStringList_Base(); // 66
	CUtlStringList::~CUtlStringList(); // 1536
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 809
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 745
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 746
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 747
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 748
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 749
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 750
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 751
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 752
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 735
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 784
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 777
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 730
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 725
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 719
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 588
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 641
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 625
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 626
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 627
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 637
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 633
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 756
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 611
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 612
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 613
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 614
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 615
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 616
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 617
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 618
	CUtlMemory<char::operator[](
			int i);  // 602
	CUtlVectorBase<char::Element(
		int i);  // 1201
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlMemory<char::IsGrowable(); // 823
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 694
	CUtlMemory<char::Grow(
		int num);  // 806
	CUtlVectorBase<char::ResetDbgInfo(); // 824
	CUtlVectorBase<char::GrowMemory(
			int num);  // 1198
	CopyConstruct<char*>(char** pMemory,
				char* const& src);  // 1201
	CUtlVectorBase<char::AddToTail(
			char* const& src);  // 49
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 48
	CUtlStringList_Base<CUtlVector<char::CopyAndAddToTail(
			const char* pString);  // 551
	CUtlMemory<char const::ValidateGrowSize(); // 475
	CUtlMemory<char const::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<char const::ResetDbgInfo(); // 530
	CUtlVectorBase<char const::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<char const::CUtlVector(); // 908
	CRenderDeviceMgrVulkan::DebugUtilsEnabled(); // 910
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1037
	CUtlMemory<char const::Purge(); // 903
	CUtlMemory<char const::Purge(); // 1799
	CUtlVectorBase<char const::Purge(); // 560
	ValidateAlignment<char const*>(void); // 508
	CUtlMemory<char const::Purge(); // 510
	CUtlMemory<char const::~CUtlMemory(); // 562
	CUtlVectorBase<char const::~CUtlVectorBase(); // 410
	CUtlVector<char const::~CUtlVector(); // 1536
	CRenderDeviceMgrVulkan::GetEnabledLayerCount(); // 1153
	CRenderDeviceMgrVulkan::GetEnabledLayerNames(); // 1154
	CRenderDeviceVulkan::KHRMaintenance2Enabled(); // 1399
	CRenderDeviceVulkan::GOOGLEDisplayTimingEnabled(); // 1429
	CRenderDeviceVulkan::ColorFormat(); // 1519
	CRenderDeviceVulkan::GetInitializedTextureManager(); // 1527
	CRenderDeviceVulkan::SetInitializedTextureManager(
					bool bInitialized);  // 1531
} /* size: 0, variables: 55, inline expansions: 470 (73706 bytes) */

// <00A3DF44> vulkan/renderdevicevulkan.cpp:1539
void CRenderDeviceVulkan::PreShutdown()
{
} /* size: 16 */

// <00A3B2A1> vulkan/renderdevicevulkan.cpp:1546
// variables: 19
// function calls: 176
void CRenderDeviceVulkan::ShutdownDevice()
{
	{
		int i; // 1596
		Count(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertex this); // 1596
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 1598
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 1601
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 1603
		CUtlMemory<CVertexBufferVulkan::Base(); // 112
		CUtlVectorBase<CVertexBufferVulkan::Base(); // 1603
		CUtlVectorBase<CVertexBufferVulkan::Count(); // 1603
		CUtlMemory<CVertexBufferVulkan::NumAllocated(); // 782
		CUtlMemory<CVertexBufferVulkan::Base(); // 112
		CUtlVectorBase<CVertexBufferVulkan::Base(); // 368
		CUtlVectorBase<CVertexBufferVulkan::ResetDbgInfo(); // 824
		CUtlVectorBase<CVertexBufferVulkan::GrowMemory(
				int num);  // 784
		CUtlVectorBase<CVertexBufferVulkan::GrowVector(
				int num);  // 1484
		{
			int i; // 1500
			CUtlMemory<CVertexBufferVulkan::operator[](
					int i);  // 602
			CUtlVectorBase<CVertexBufferVulkan::Element(
				int i);  // 1502
			CopyConstruct<CVertexBufferVulkan*>(CVertexBufferVulkan** pMemory,
								CVertexBufferVulkan* const& src);  // 1502
		}
		CUtlVectorBase<CVertexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CVertexBufferVulkan* const* pToInsert);  // 1476
		CUtlVectorBase<CVertexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CVertexBufferVulkan* const* pToInsert);  // 1303
		CUtlVectorBase<CVertexBufferVulkan::AddMultipleToTail(
					int num,
					CVertexBufferVulkan* const* pToCopy);  // 1603
	}
	{
		int i; // 1611
		Count(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBu this); // 1611
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
				int i);  // 1613
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
				int i);  // 1616
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
				int i);  // 1618
		CUtlMemory<CIndexBufferVulkan::Base(); // 112
		CUtlVectorBase<CIndexBufferVulkan::Base(); // 1618
		CUtlVectorBase<CIndexBufferVulkan::Count(); // 1618
		CUtlMemory<CIndexBufferVulkan::NumAllocated(); // 782
		CUtlMemory<CIndexBufferVulkan::Base(); // 112
		CUtlVectorBase<CIndexBufferVulkan::Base(); // 368
		CUtlVectorBase<CIndexBufferVulkan::ResetDbgInfo(); // 824
		CUtlVectorBase<CIndexBufferVulkan::GrowMemory(
				int num);  // 784
		CUtlVectorBase<CIndexBufferVulkan::GrowVector(
				int num);  // 1484
		{
			int i; // 1500
			CUtlMemory<CIndexBufferVulkan::operator[](
					int i);  // 602
			CUtlVectorBase<CIndexBufferVulkan::Element(
				int i);  // 1502
			CopyConstruct<CIndexBufferVulkan*>(CIndexBufferVulkan** pMemory,
								CIndexBufferVulkan* const& src);  // 1502
		}
		CUtlVectorBase<CIndexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CIndexBufferVulkan* const* pToInsert);  // 1476
		CUtlVectorBase<CIndexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CIndexBufferVulkan* const* pToInsert);  // 1303
		CUtlVectorBase<CIndexBufferVulkan::AddMultipleToTail(
					int num,
					CIndexBufferVulkan* const* pToCopy);  // 1618
	}
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 890
	CInterlockedIntT<int, 4>::operator==(
			int rhs);  // 895
	{
	}
	{
	}
	{
	}
	CTSQueue<DynamicVertexBufferHandle_t__::Purge(); // 1559
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	ThreadPause(void); // 208
	CTSListBase::Pop(); // 890
	CInterlockedIntT<int, 4>::operator==(
			int rhs);  // 895
	{
	}
	{
	}
	{
	}
	CTSQueue<DynamicIndexBufferHandle_t__::Purge(); // 1560
	CInterlockedIntT<int, 4>::operator int(); // 594
	CRenderDeviceBase::IsAsyncPresentEnabled(); // 161
	{
	}
	CUtlVectorBase<CRenderResource::Count(); // 166
	{
		int i; // 167
		{
			CRenderResource* pRenderResource; // 169
			CUtlMemory<CRenderResource::operator[](
					int i);  // 588
			CUtlVectorBase<CRenderResource::operator[](
					int i);  // 169
			CRenderResource::IsInUse(
				uint nCompletedFrameNumber);  // 170
			CUtlMemory<CRenderResource::operator[](
					int i);  // 602
			CUtlVectorBase<CRenderResource::Element(
				int i);  // 1575
			{
				const bool  bNotLast; // 1578
				CUtlMemory<CRenderResource::operator[](
						int i);  // 602
				CUtlVectorBase<CRenderResource::Element(
					int i);  // 1584
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1584
			}
			Destruct<CRenderResource*>(CRenderResource** pMemory); // 1575
			CUtlVectorBase<CRenderResource::FastRemove(
					int elem);  // 174
		}
	}
	CRenderResourceMgr::PerformQueuedDeletions(
				uint nFinishedFrameNumber);  // 1579
	CInterlockedIntT<int, 4>::operator int(); // 68
	CUtlMemoryPoolBase::Count(); // 675
	RemoveAll(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 352
	Purge(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 1591
	CInterlockedIntT<int, 4>::operator int(); // 68
	CUtlMemoryPoolBase::Count(); // 675
	RemoveAll(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 352
	Purge(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 1593
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 1595
	{
		int i; // 1721
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
			int i);  // 1723
		CUtlVectorBase<CVertexBufferVulkan::RemoveAll(); // 1798
		CUtlMemory<CVertexBufferVulkan::IsExternallyAllocated(); // 905
		CUtlMemory<CVertexBufferVulkan::Purge(); // 903
		CUtlMemory<CVertexBufferVulkan::Purge(); // 1799
		CUtlVectorBase<CVertexBufferVulkan::Purge(); // 560
		ValidateAlignment<CVertexBufferVulkan*>(void); // 508
		CUtlMemory<CVertexBufferVulkan::Purge(); // 510
		CUtlMemory<CVertexBufferVulkan::~CUtlMemory(); // 562
		CUtlVectorBase<CVertexBufferVulkan::~CUtlVectorBase(); // 410
		CUtlVector<CVertexBufferVulkan::~CUtlVector(); // 892
		FencedVertexBufferRelease_t::~FencedVertexBufferRelease_t(); // 1526
		Destruct<CRenderDeviceVulkan::FencedVertexBufferRelease_t>(FencedVertexBufferRelease_t* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 1798
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::Purge(); // 1799
	ResetDbgInfo(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 1800
	Purge(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this); // 1607
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 1608
	CThreadMutex::Lock(
		const char* pFileName,
		int nLineNumber);  // 1610
	{
		int i; // 1721
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
			int i);  // 1723
		CUtlVectorBase<CIndexBufferVulkan::RemoveAll(); // 1798
		CUtlMemory<CIndexBufferVulkan::IsExternallyAllocated(); // 905
		CUtlMemory<CIndexBufferVulkan::Purge(); // 903
		CUtlMemory<CIndexBufferVulkan::Purge(); // 1799
		CUtlVectorBase<CIndexBufferVulkan::Purge(); // 560
		ValidateAlignment<CIndexBufferVulkan*>(void); // 508
		CUtlMemory<CIndexBufferVulkan::Purge(); // 510
		CUtlMemory<CIndexBufferVulkan::~CUtlMemory(); // 562
		CUtlVectorBase<CIndexBufferVulkan::~CUtlVectorBase(); // 410
		CUtlVector<CIndexBufferVulkan::~CUtlVector(); // 901
		FencedIndexBufferRelease_t::~FencedIndexBufferRelease_t(); // 1526
		Destruct<CRenderDeviceVulkan::FencedIndexBufferRelease_t>(FencedIndexBufferRelease_t* pMemory); // 1723
	}
	RemoveAll(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 1798
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::Purge(); // 1799
	ResetDbgInfo(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 1800
	Purge(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this); // 1620
	CThreadMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 1621
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::Purge(); // 643
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::InvalidIterator(); // 648
	ResetDbgInfo(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 650
	Purge(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 1630
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::Purge(); // 643
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::InvalidIterator(); // 648
	ResetDbgInfo(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 650
	Purge(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 1631
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::Purge(); // 643
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<RasterizerStateVulkan_t, long long int> >::InvalidIterator(); // 648
	ResetDbgInfo(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this); // 650
	Purge(const CUtlLinkedList<RasterizerStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<Ras this); // 1647
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::Purge(); // 643
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<DepthStencilStateVulkan_t, long long int> >::InvalidIterator(); // 648
	ResetDbgInfo(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this); // 650
	Purge(const CUtlLinkedList<DepthStencilStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<D this); // 1648
	{
		BlockHeader_t* pbh; // 338
		{
			BlockHeader_t* pFree; // 340
		}
	}
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::Purge(); // 643
	Iterator_t::Iterator_t(
			BlockHeader_t* p,
			intp i);  // 96
	CUtlFixedMemory<UtlLinkedListElem_t<BlendStateVulkan_t, long long int> >::InvalidIterator(); // 648
	ResetDbgInfo(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this); // 650
	Purge(const CUtlLinkedList<BlendStateVulkan_t, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<BlendSta this); // 1649
	IsExternallyAllocated(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this); // 905
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this); // 1288
	Purge(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this); // 347
	Purge(const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHa this); // 1651
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Purge(); // 347
	CUtlMap<RenderResourceHandle_t__::Purge(); // 1652
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 347
	CUtlMap<RenderDescriptorSetHandle_t__::Purge(); // 1653
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 903
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 1287
	Iterator_t::Iterator_t(
			unsigned int i);  // 86
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::InvalidIterator(); // 1288
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 347
	CUtlMap<RenderRayTracePipelineHandle_t__::Purge(); // 1654
} /* size: 0, inline expansions: 93 (4681 bytes) */

// <00A3AD39> vulkan/renderdevicevulkan.cpp:1684
// variables: 3
// function calls: 16
void CRenderDeviceVulkan::OnBeginningOfClientShutdown()
{
	const char   __FUNCTION__; // 29073
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1686
	}
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_1694; // 1694
		CRenderDeviceVulkan::RenderThread(); // 1694
		CRenderThreadVulkan::GetQueueMutex(); // 1694
		ThreadInterlockedAssignIf64(volatile int64* pDest,
						int64 value,
						int64 comparand);  // 800
		CThreadFastMutex::TryLockInline(
				const char* pFileName,
				int nLineNumber,
				const ThreadId_t  threadId);  // 837
		ThreadPause(void); // 839
		CThreadFastMutex::Lock(
			const char* pFileName,
			int nLineNumber,
			unsigned int nSpinSleepTime);  // 943
		Lock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
				const CThreadFastMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 1694
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 1695
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 874
		CThreadFastMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 1696
	}
} /* size: 0, variables: 1 */

// <00A5E39F> vulkan/renderdevicevulkan.cpp:1705
void CRenderDeviceVulkan::GetRenderDeviceAPI()
{
} /* size: 10 */

// <00A3A892> vulkan/renderdevicevulkan.cpp:1713
// variables: 2
// function calls: 15
void CRenderDeviceVulkan::CreateDefaultSamplerStates()
{
	CSamplerStateDescBase::CSamplerStateDescBase(); // 927
	{
		float32 flZeros; // 936
		float32 flOnes; // 937
		CSamplerStateDescBase::SetFilterMode(
				RsFilter_t filter);  // 928
		CSamplerStateDescBase::SetTextureAddressModeU(
					RsTextureAddressMode_t addressMode);  // 929
		CSamplerStateDescBase::SetTextureAddressModeV(
					RsTextureAddressMode_t addressMode);  // 930
		CSamplerStateDescBase::SetTextureAddressModeW(
					RsTextureAddressMode_t addressMode);  // 931
		Min<unsigned int>(const unsigned int& val1,
					const unsigned int& val2);  // 800
		CSamplerStateDescBase::SetMaxAnisotropy(
				uint32 nMaxAniso);  // 933
		CSamplerStateDescBase::SetMipLodBias(
				float32 flBias);  // 932
		CSamplerStateDescBase::SetBorderColor(
				const float32* pBorderColor);  // 938
		CSamplerStateDescBase::SetComparisonFunc(
					RsComparison_t compFunc);  // 934
		CSamplerStateDescBase::SetMinMaxLod(
				uint32 nMinLod,
				uint32 nMaxLod);  // 935
		CSamplerStateDescBase::SetGlobalMipBiasOverrideAllowed(
						bool bAllow);  // 939
	}
	CSamplerStateDesc::CSamplerStateDesc(
				RsFilter_t filter,
				RsTextureAddressMode_t addressU,
				RsTextureAddressMode_t addressV,
				RsTextureAddressMode_t addressW,
				float32 flMipLodBias,
				uint32 nMaxAniso,
				RsComparison_t comparisonFunc,
				uint32 nMinLod,
				uint32 nMaxLod,
				bool bWhiteBorder,
				bool bAllowGlobalMipBiasOverride);  // 970
	DefaultSamplerStateDesc(void); // 959
	DefaultSamplerStateDesc(void); // 1741
} /* size: 190, inline expansions: 4 (312 bytes) */

// <00A67E3A> vulkan/renderdevicevulkan.cpp:1744
void CRenderDeviceVulkan::OnAnisotropyChanged()
{
} /* size: 0 */

// <00A394D9> vulkan/renderdevicevulkan.cpp:1751
// variables: 14
// function calls: 70
void CRenderDeviceVulkan::RebuildUserConfigurableSamplers()
{
	{
		CUtlVector<long long int, CUtlMemory<long long int, int> > handles; // 1772
		{
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_1765; // 1765
			CRenderDeviceVulkan::RenderThread(); // 1765
			CRenderThreadVulkan::GetQueueMutex(); // 1765
			ThreadInterlockedAssignIf64(volatile int64* pDest,
							int64 value,
							int64 comparand);  // 800
			CThreadFastMutex::TryLockInline(
					const char* pFileName,
					int nLineNumber,
					const ThreadId_t  threadId);  // 837
			ThreadPause(void); // 839
			CThreadFastMutex::Lock(
				const char* pFileName,
				int nLineNumber,
				unsigned int nSpinSleepTime);  // 943
			Lock(CThreadFastMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
					const CThreadFastMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 1765
			VulkanQueue(void); // 1766
			CUtlString::CUtlString(); // 149
			CUtlString::Get(); // 151
			CUtlString::~CUtlString(); // 153
			_DOVK(VkResult result,
				const char* pCommand);  // 1766
			ThreadInterlockedExchange64(volatile int64* p,
							int64 value);  // 874
			CThreadFastMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadFastMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 1767
		}
		{
			UtlTSHashHandle_t hSampler; // 1776
			CUtlVector<long long int, CUtlMemory<long long int, int> >& __for_range; // 9998
			iterator __for_begin; // 7853
			iterator __for_end; // 7853
			{
				CSamplerStateBinding& sampler; // 1778
				const CSamplerStateDesc* pDesc; // 1779
				const bool  bImmutable; // 1780
				Element(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this,
					UtlTSHashHandle_t hHash);  // 1778
				GetPointerToKey(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>,  this,
						UtlTSHashHandle_t hHash);  // 1779
				{
				}
				CVulkanObject<VkSampler_T::DestroyObject()>* this); // 117
				CVulkanSamplerObject::ReplaceSampler(
						VkSampler pNewSampler);  // 1782
			}
			CUtlMemory<long long int, int>::Base(); // 112
			CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::Base(); // 102
			CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::begin(); // 1776
			CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::Count(); // 104
			CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::end(); // 1776
		}
		{
			long long int nIndex; // 1791
			{
				CDescriptorSetVulkan* pDescriptorSet; // 1793
				CUtlFixedMemory<UtlLinkedListElem_t<CDescriptorSetVulkan::operator[](
						intp i);  // 494
				CUtlLinkedList<CDescriptorSetVulkan::operator[](
						long long int i);  // 1793
				CDescriptorSetVulkan::IsFullyRewrittenEachFrame(); // 1794
			}
			CUtlLinkedList<CDescriptorSetVulkan::Head(); // 1791
			CUtlLinkedList<CDescriptorSetVulkan::Next(
				long long int i);  // 1791
		}
		CTextureManagerBase::GetTextureManagerRWLock(); // 1756
		CTextureManagerBase::GetTextureManagerRWLock(); // 1763
		CInterlockedIntT<int, 4>::GetRaw(); // 3180
		ThreadInterlockedExchangeAdd(volatile int32* p,
						int32 value);  // 660
		CInterlockedIntT<unsigned int, 4>::AtomicAdd(
				unsigned int add);  // 3189
		CThreadRWLock_FastRead::LockForWrite(
				const char* pFileName,
				int nLineNumber);  // 1763
		CUtlMemory<long long int, int>::ValidateGrowSize(); // 475
		CUtlMemory<long long int, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::ResetDbgInfo(); // 530
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<long long int, CUtlMemory<long long int, int> >::CUtlVector(); // 1772
		CInterlockedIntT<int, 4>::operator int(); // 68
		CUtlMemoryPoolBase::Count(); // 365
		Count(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, this); // 1773
		CUtlMemory<long long int, int>::Base(); // 112
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::Base(); // 368
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::ResetDbgInfo(); // 824
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::GrowMemory(
				int num);  // 784
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::GrowVector(
				int num);  // 1445
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::InsertMultipleBefore(
					int elem,
					int num);  // 1437
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::InsertMultipleBefore(
					int elem,
					int num);  // 1294
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::AddMultipleToTail(
					int num);  // 1319
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::RemoveMultipleFromTail(
					int num);  // 1323
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::SetCount(
			int count);  // 1773
		CTextureManagerVulkan::MarkAllSamplersDirty(); // 1787
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::RemoveAll(); // 1798
		CUtlMemory<long long int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<long long int, int>::Purge(); // 903
		CUtlMemory<long long int, int>::Purge(); // 1799
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::Purge(); // 560
		ValidateAlignment<long long int>(void); // 508
		CUtlMemory<long long int, int>::Purge(); // 510
		CUtlMemory<long long int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<long long int, CUtlMemory<long long int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<long long int, CUtlMemory<long long int, int> >::~CUtlVector(); // 1799
		{
			int i; // 379
			{
				const HashBucket_t& bucket; // 381
				CThreadSpinRWLock::LockForRead(
						const char* pFileName,
						int nLineNumber);  // 382
				{
					HashFixedData_t* pElement; // 383
					CThreadSpinRWLock::UnlockRead(
							const char* pFileName,
							int nLineNumber);  // 391
				}
				CThreadSpinRWLock::UnlockRead(
						const char* pFileName,
						int nLineNumber);  // 395
			}
		}
		GetElements(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>,  this,
				int nFirstElement,
				int nCount,
				UtlTSHashHandle_t* pHandles);  // 1774
	}
} /* size: 0 */

// <00A38F8A> vulkan/renderdevicevulkan.cpp:1918
// variable: 1
// function calls: 6
void CRenderDeviceVulkan::CreateDefaultShaders()
{
	const char   __FUNCTION__; // 28894
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1925
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1933
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1941
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1949
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1957
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 1965
} /* size: 979, variables: 1, inline expansions: 6 (174 bytes) */

// <00A38F2B> vulkan/renderdevicevulkan.cpp:1970
// variable: 1
void CRenderDeviceVulkan::DestroyDefaultShaders()
{
	{
		int i; // 1972
	}
} /* size: 77 */

// <00A38D78> vulkan/renderdevicevulkan.cpp:1997
// function calls: 2
void CRenderDeviceVulkan::CreateDefaultInputLayouts()
{
	CRenderDeviceVulkan::CreateInputLayout(
				const char* pLayoutName,
				int nFieldCount,
				const RenderInputLayoutField_t* pFieldDescs);  // 1999
	CRenderDeviceVulkan::CreateInputLayout(
				const char* pLayoutName,
				int nFieldCount,
				const RenderInputLayoutField_t* pFieldDescs);  // 2000
} /* size: 196, inline expansions: 2 (62 bytes) */

// <00A38C87> vulkan/renderdevicevulkan.cpp:2003
// variable: 1
// function calls: 2
void CRenderDeviceVulkan::DestroyDefaultInputLayouts()
{
	{
		int i; // 2005
		CInputLayoutDict<CInputLayoutVulkan>::DestroyInputLayout(
					RenderInputLayout_t hInputLayout);  // 4975
		CRenderDeviceVulkan::DestroyInputLayout(
					RenderInputLayout_t hInputLayout);  // 2007
	}
} /* size: 106 */

// <00A387FE> vulkan/renderdevicevulkan.cpp:2015
// variable: 1
// function calls: 12
void CRenderDeviceVulkan::CreateDefaultDepthStencilStates()
{
	RsDepthStencilStateDesc_t desc; // 2017
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 251
	RsStencilStateDesc_t::RsStencilStateDesc_t(); // 433
	RsStencilStateDesc_t::RsStencilStateDesc_t(
				bool bStencilEnable,
				uint8 nStencilReadMask,
				uint8 nStencilWriteMask,
				RsStencilOp_t frontStencilFailOp,
				RsStencilOp_t frontStencilDepthFailOp,
				RsStencilOp_t frontStencilPassOp,
				RsComparison_t frontStencilFunc,
				RsStencilOp_t backStencilFailOp,
				RsStencilOp_t backStencilDepthFailOp,
				RsStencilOp_t backStencilPassOp,
				RsComparison_t backStencilFunc);  // 356
	RsDepthStencilStateDesc_t::RsDepthStencilStateDesc_t(
					bool bDepthTestEnable,
					bool bDepthWriteEnable,
					RsComparison_t depthFunc,
					bool bStencilEnable,
					uint8 nStencilReadMask,
					uint8 nStencilWriteMask,
					RsStencilOp_t frontStencilFailOp,
					RsStencilOp_t frontStencilDepthFailOp,
					RsStencilOp_t frontStencilPassOp,
					RsComparison_t frontStencilFunc,
					RsStencilOp_t backStencilFailOp,
					RsStencilOp_t backStencilDepthFailOp,
					RsStencilOp_t backStencilPassOp,
					RsComparison_t backStencilFunc);  // 429
	DefaultDepthStencilStateDesc(void); // 424
	DefaultDepthStencilStateDesc(void); // 435
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 435
	RsDepthStencilStateDesc_t::RsDepthStencilStateDesc_t(); // 2017
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2018
	RsStencilStateDesc_t::SetStencilEnabled(
				bool bEnable);  // 2024
} /* size: 259, variables: 1, inline expansions: 12 (277 bytes) */

// <00A387E5> vulkan/renderdevicevulkan.cpp:2040
void CRenderDeviceVulkan::DestroyDefaultDepthStencilStates()
{
} /* size: 0 */

// <00A38371> vulkan/renderdevicevulkan.cpp:2048
// variables: 8
// function calls: 7
void CRenderDeviceVulkan::CreateDefaultBuffers()
{
	BufferDesc_t desc; // 2051
	const char   __FUNCTION__; // 28894
	CRenderContextVulkanPtr pRenderContextVulkan; // 2059
	LockDesc_t lockDesc; // 2061
	uint32_t nDefaultCBSize; // 2075
	uint8* pZeroData; // 2076
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2057
	}
	{
		Vector4D* pData; // 2064
	}
	CRenderContextVulkanPtr::operator->(); // 2062
	memset(void* __dest,
		int __ch,
		size_t __len);  // 55
	V_memset(void* dest,
		int fill,
		uint count);  // 2077
	CRenderDeviceVulkan::CreateDescriptorSet(
				int32 nNumDescriptors,
				const RenderDescriptorDesc_t* pDescriptorDescs,
				int32 nNumBindings,
				const RenderDescriptorBinding_t* pDescriptorBindings,
				bool bFullyRewriteEachFrame);  // 2081
	CRenderContextPtr::Release(); // 845
	CRenderContextPtr::~CRenderContextPtr(); // 481
	CRenderContextVulkanPtr::~CRenderContextVulkanPtr(); // 2082
} /* size: 0, variables: 6, inline expansions: 7 (155 bytes) */

// <00A38304> vulkan/renderdevicevulkan.cpp:2084
void CRenderDeviceVulkan::DestroyDefaultBuffers()
{
} /* size: 124 */

// <00A37EE5> vulkan/renderdevicevulkan.cpp:2106
// variables: 7
// function calls: 8
void CRenderDeviceVulkan::GetCmdPool(PerThreadDataVulkan_t* pPerThread, VulkanCommandBufferType_t nCommandBufferType)
{
	uint32_t nCommandPool; // 2108
	uint32_t nNumCommandPools; // 2114
	const char   __FUNCTION__; // 28624
	VkCommandPool cmdPool; // 2126
	VkCommandPoolCreateInfo cmdPoolCreateInfo; // 2127
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2117
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2122
	}
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2132
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2139
} /* size: 0, variables: 5, inline expansions: 8 (362 bytes) */

// <00A37BB0> vulkan/renderdevicevulkan.cpp:2147
// variables: 3
// function calls: 8
void CRenderDeviceVulkan::CreateCmdBuffer(PerThreadDataVulkan_t* pPerThread, VulkanCommandBufferType_t nCommandBufferType)
{
	VkCommandBuffer pCmdBuffer; // 2149
	VkCommandBufferAllocateInfo cmdBufferCreateinfo; // 2151
	{
		int curLive; // 2163
		ThreadInterlockedIncrement(volatile int32* p); // 576
		CInterlockedIntT<int, 4>::operator++(); // 2163
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2152
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2158
} /* size: 323, variables: 2, inline expansions: 6 (239 bytes) */

// <00A37A3D> vulkan/renderdevicevulkan.cpp:2172
// variables: 3
// function calls: 2
void CRenderDeviceVulkan::DestroyCmdBuffer(VkCommandBuffer* pBuf, PerThreadDataVulkan_t* pPerThread, VulkanCommandBufferType_t nCommandBufferType)
{
	const char   __FUNCTION__; // 28786
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2174
	}
	{
		int curLive; // 2177
		ThreadInterlockedDecrement(volatile int32* p); // 586
		CInterlockedIntT<int, 4>::operator--(); // 2177
	}
} /* size: 0, variables: 1 */

// <00A375BF> vulkan/renderdevicevulkan.cpp:2189
// variables: 5
// function calls: 12
void CRenderDeviceVulkan::TrimCommandPool(PerThreadDataVulkan_t* pPerThread)
{
	const char   __FUNCTION__; // 28759
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_2195; // 2195
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2197
		}
		{
			uint32_t nNumCommandPools; // 2200
			{
				uint32_t nCommandBufferType; // 2201
			}
		}
		CRenderDeviceVulkan::RenderThread(); // 2195
		CRenderThreadVulkan::GetQueueMutex(); // 2195
		ThreadInterlockedAssignIf64(volatile int64* pDest,
						int64 value,
						int64 comparand);  // 800
		CThreadFastMutex::TryLockInline(
				const char* pFileName,
				int nLineNumber,
				const ThreadId_t  threadId);  // 837
		ThreadPause(void); // 839
		CThreadFastMutex::Lock(
			const char* pFileName,
			int nLineNumber,
			unsigned int nSpinSleepTime);  // 943
		Lock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
				const CThreadFastMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 2195
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 874
		CThreadFastMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 2206
	}
} /* size: 0, variables: 1 */

// <00A36DDC> vulkan/renderdevicevulkan.cpp:2213
// variables: 9
// function calls: 22
void CRenderDeviceVulkan::TrimAllCommandPools()
{
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_2217; // 2217
	const char   __FUNCTION__; // 28867
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_2220; // 2220
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2219
	}
	{
		int _idx_pPerThread; // 2221
		{
			PerThreadDataVulkan_t* pPerThread; // 2221
			{
				uint32_t nNumCommandPools; // 2223
				{
					uint32_t nCommandBufferType; // 2224
					{
						VkCommandPool commandPool; // 2226
					}
				}
			}
		}
	}
	CRenderDeviceVulkan::RenderThread(); // 2217
	CRenderThreadVulkan::GetQueueMutex(); // 2217
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 2217
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 2220
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 2233
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 2233
} /* size: 0, variables: 3, inline expansions: 22 (858 bytes) */

// <00A368DD> vulkan/renderdevicevulkan.cpp:2238
// function calls: 22
void CSwapChainVulkan::CSwapChainVulkan()
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 239
	V_memset(void* dest,
		int fill,
		size_t count);  // 213
	RenderDisplayMode_t::RenderDisplayMode_t(); // 239
	RenderDeviceInfo_t::RenderDeviceInfo_t(); // 327
	CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 327
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 331
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 327
	CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 327
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 327
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 327
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 332
	CSwapChainBase::CSwapChainBase(); // 2254
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 239
	V_memset(void* dest,
		int fill,
		size_t count);  // 213
	RenderDisplayMode_t::RenderDisplayMode_t(); // 239
	RenderDeviceInfo_t::RenderDeviceInfo_t(); // 2254
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2257
} /* size: 321, inline expansions: 22 (361 bytes) */

// <00A368C4> vulkan/renderdevicevulkan.cpp:2238
void CSwapChainVulkan::CSwapChainVulkan()
{
} /* size: 0 */

// <00A3661A> vulkan/renderdevicevulkan.cpp:2260
// function calls: 8
void CSwapChainVulkan::~CSwapChainVulkan()
{
	CRenderDeviceVulkan::IsShuttingDown(); // 2266
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2270
	CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 337
	CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 337
	CSwapChainBase::~CSwapChainBase(); // 2278
} /* size: 306, inline expansions: 8 (256 bytes) */

// <00A365B3> vulkan/renderdevicevulkan.cpp:2260
void CSwapChainVulkan::~CSwapChainVulkan()
{
} /* size: 36 */

// <00A3640A> vulkan/renderdevicevulkan.cpp:2284
// variable: 1
// function call: 1
void CSwapChainVulkan::Init(PlatWindow_t hPlatWnd, OsSpecificWindowHandle_t hOsWnd, const RenderDeviceInfo_t& mode, const char* pDebugName, VkDevice pDeviceVulkan, VkPhysicalDevice pPhysicalDeviceVulkan, VkQueue pQueueVulkan)
{
	float flContentsScale; // 2291
	V_strcpy_safe<256>(char& pDest,
				const char* pSrc);  // 2300
} /* size: 319, variables: 1, inline expansions: 1 (13 bytes) */

// <00A32C58> vulkan/renderdevicevulkan.cpp:2308
// variables: 51
// function calls: 184
void CSwapChainVulkan::CreateSwapChain(VkDevice pDeviceVulkan, VkPhysicalDevice pPhysicalDeviceVulkan)
{
	VkBool32 bSupportsPresent; // 2311
	VkResult nResult; // 2312
	PlatWindow_t hPlatWnd; // 2316
	PlatWindow_t hTemporaryWrappedSDLWindow; // 2317
	bool bCreatedTemporaryWrappedSDLWindow; // 2318
	const CScopeGuardLambdaImpl<CSwapChainVulkan::CreateSwapChain(VkDevice, VkPhysicalDevice)::<lambda()> >& generated_id_2321; // 2321
	bool bNoWindow; // 2328
	bool bFakeSwapChain; // 2329
	const char   __FUNCTION__; // 28759
	uint32_t nNumSupportedSwapChainFormats; // 2361
	VkSurfaceFormatKHR* pSupportedSurfaceFormats; // 2362
	VkFormat selectedSwapChainFormat; // 2414
	VkColorSpaceKHR imageColorSpace; // 2415
	VkFormat nRequestedFormat; // 2416
	VkSurfaceCapabilitiesKHR surfaceCaps; // 2472
	uint32_t nPresentModeCount; // 2473
	VkPresentModeKHR* pPresentModes; // 2474
	VkImageUsageFlags nImageUsageFlags; // 2530
	VkSemaphore pAcquireNextImageSemaphore; // 2809
	CommandSetSwapChainSemaphore_t cmd; // 2815
	CRenderContextVulkanPtr pRenderContextVulkan; // 2817
	{
		bool bCreateSurfaceResult; // 2345
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2337
		}
		CRenderDeviceMgrVulkan::GetInstance(); // 2347
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2351
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2340
	}
	{
		uint32_t nQueueFamilyIndex; // 2365
		VulkanQueueFamilyIndex(void); // 2365
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2397
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2368
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2390
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 2374
	}
	{
		bool bFoundMatch; // 2427
		{
			uint32 nFormat; // 2428
		}
		{
			bool bRequestedSRGB; // 2442
			{
				uint32 nFormat; // 2443
			}
			LeafCodeInfo_t::LeafCodeInfo_t(
					const char* szFile,
					int nLine,
					const char* szFunction);  // 2465
		}
	}
	{
		VkPresentModeKHR swapChainPresentMode; // 2535
		bool bRotated; // 2579
		bool bForceIntermediateSwapchainImage; // 2580
		VkSurfaceTransformFlagsKHR preTransform; // 2583
		bool bDisableSwapChainSampling; // 2615
		VkSwapchainCreateInfoKHR swapChainCreateInfo; // 2626
		VkBaseInStructure* pSwapChainCreateInfo; // 2627
		VkImageFormatListCreateInfoKHR imageFormatListCreateInfo; // 2658
		VkFormat viewFormats; // 2659
		bool bMSAA; // 2714
		bool bScalingCoopFullscreen; // 2715
		VkImage* pSwapChainImages; // 2734
		{
			uint32_t i; // 2536
			CRenderDeviceVulkan::GOOGLEDisplayTimingEnabled(); // 2544
		}
		{
			int32_t nNumImagesLessThanDesired; // 2570
			Max<int>(const int& val1,
				const int& val2);  // 2572
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2586
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2595
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2654
		}
		{
			CUtlString errString; // 2690
			CUtlString::CUtlString(); // 2690
			CUtlString::Get(); // 99
			CUtlString::String(); // 2692
			CUtlString::~CUtlString(); // 2694
		}
		{
			uint32 nImageIndex; // 2703
		}
		{
			uint32_t nImage; // 2737
		}
		CRenderDeviceVulkan::KHRSwapchainMutableFormatEnabled(); // 2660
		CUtlString::CUtlString(); // 171
		CUtlString::Get(); // 173
		CUtlString::~CUtlString(); // 176
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 167
		_DOVK_RESULT(VkResult result,
				const char* pCommand);  // 158
		_DOVK_RESULT(VkResult result,
				const char* pCommand);  // 2687
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 2697
		CStrongHandle<InfoForResourceTypeCTextureBase>::CStrongHandle(); // 2700
		CVulkanImage::SetIsResident(
				bool bResident);  // 2710
		RenderDeviceInfo_t::IsCooperativeFullscreen(); // 2718
		CVulkanImage::SetIsResident(
				bool bResident);  // 2723
		CVulkanImage::SetIsResident(
				bool bResident);  // 2729
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 2735
	}
	{
		uint32 nSem; // 2786
		{
			VkSemaphoreCreateInfo acquireNextImageSemaphoreCreateInfo; // 2788
			CUtlString::CUtlString(); // 149
			CUtlString::Get(); // 151
			CUtlString::~CUtlString(); // 153
			_DOVK(VkResult result,
				const char* pCommand);  // 2792
		}
	}
	CScopeGuardLambdaImpl<CSwapChainVulkan::CreateSwapChain(VkDevice, VkPhysicalDevice)::<lambda()> >::CScopeGuardLambdaImpl(
				class& lambda); // 39
	MakeScopeGuardLambda<CSwapChainVulkan::CreateSwapChain(VkDevice, VkPhysicalDevice)::<lambda()> >(class& lambda); // 2321
	operator()(const class* __closure); // 31
	CScopeGuardLambdaImpl<CSwapChainVulkan::CreateSwapChain(VkDevice, VkPhysicalDevice)::<lambda()> >::~CScopeGuardLambdaImpl()::<lambda()> >* this); // 2821
	CVulkanImage::SetIsResident(
			bool bResident);  // 2772
	CVulkanImage::SetIsResident(
			bool bResident);  // 2776
	CRenderDeviceVulkan::IsHibernating(); // 3034
	CSwapChainVulkan::SwapBuffers(
			VkSemaphore* ppAcquireNextImageSemaphoreOut);  // 2810
	CommandBase_t::CommandBase_t(
			int nOpCode,
			bool bSkipOnLostDevice,
			int nCmdSizeInBytes);  // 117
	CommandHelper_t<CommandSetSwapChainSemaphore_t, 19, true>::CommandHelper_t(); // 152
	CommandSetSwapChainSemaphore_t::CommandSetSwapChainSemaphore_t(); // 2815
	CCommandStreamBuilder::AvailableCommandBufferSpace(); // 677
	CUtlMemoryPool<CCommandBufferChunk>::Alloc(); // 81
	operator new(size_t size); // 133
	Alloc(void); // 328
	AllocateChunk(void); // 690
	ThreadPause(void); // 208
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	CTSListBase::Pop(); // 376
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 341
	simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
	CTSPool<CCommandStream>::GetObject(); // 390
	CTSPool<CCommandStream>::Get(); // 645
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 1479
	Construct<CCommandStream>(CCommandStream* pMemory); // 646
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 649
	CCommandStreamBuilder::EnsureStream(); // 641
	CCommandStreamBuilder::EnsureStream(); // 695
	{
		CommandJump_t cmd; // 705
		CommandBase_t::CommandBase_t(
				int nOpCode,
				bool bSkipOnLostDevice,
				int nCmdSizeInBytes);  // 117
		CommandHelper_t<CommandJump_t, 1, false>::CommandHelper_t(); // 143
		CommandJump_t::CommandJump_t(); // 705
		CCommandStreamBuilder::Store<CommandJump_t>(
					CommandJump_t obj);  // 707
	}
	CCommandStreamBuilder::GrowForCapacity(
			int nNumBytes);  // 681
	CCommandStreamBuilder::EnsureCapacity(
			int nNumBytes);  // 530
	CCommandStreamBuilder::WriteCmd<CommandSetSwapChainSemaphore_t>(
						const CommandSetSwapChainSemaphore_t& obj);  // 2818
	CRenderContextPtr::Release(); // 845
	CRenderContextPtr::~CRenderContextPtr(); // 481
	CRenderContextVulkanPtr::~CRenderContextVulkanPtr(); // 2821
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2487
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2489
	Min<int>(const int& val1,
		const int& val2);  // 2512
	Min<int>(const int& val1,
		const int& val2);  // 2513
} /* size: 0, variables: 21, inline expansions: 140 (9947 bytes) */

// <00A30F7E> vulkan/renderdevicevulkan.cpp:2824
// variables: 11
// function calls: 113
void CSwapChainVulkan::SetupViews(VkDevice pDeviceVulkan, VkFormat nOverrideSwapChainFormat, VkImageUsageFlags nImageUsageFlags)
{
	VkImageCreateInfo imageCreateDepthStencilInfo; // 2827
	const bool  bSwapchainSampleableDepth; // 2842
	const bool  bSwapchainSampleableStencil; // 2843
	const bool  bDedicatedAllocation; // 2855
	VkResult nResult; // 2856
	CTextureCreationDesc header; // 2873
	const char   __FUNCTION__; // 28624
	{
		VkImageCreateInfo imageCreateInfo; // 2895
		CTextureCreationDesc coopFullscreenImageHeader; // 2929
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2909
		}
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 2896
		ComputeAASettings(RenderMultisampleType_t nType,
					VkSampleCountFlagBits* pSampleCount);  // 2905
		CRenderDeviceVulkan::MemoryManager(); // 2918
		CMemoryManagerVulkan::GetVmaAllocator(); // 1491
		GetVmaAllocator(void); // 2926
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 2926
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 142
		CTextureDesc::CTextureDesc(); // 228
		CTextureDesc::operator=(
				const CTextureDesc& rhs);  // 238
		Vector4D::operator=(
				const Vector4D& vOther);  // 239
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Count(); // 244
		CUtlMemory<TextureCreationExtraData_t, int>::Base(); // 113
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Base(); // 244
		CTextureCreationDesc::operator=(
				const CTextureCreationDesc& rhs);  // 229
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::ResetDbgInfo(); // 530
		CUtlMemory<TextureCreationExtraData_t, int>::ValidateGrowSize(); // 475
		CUtlMemory<TextureCreationExtraData_t, int>::CUtlMemory(
				int nGrowSize,
				int nInitAllocationCount);  // 527
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 418
		CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVector(); // 228
		Vector4D::Vector4D(); // 228
		CTextureCreationDesc::CTextureCreationDesc(
					const CTextureCreationDesc& rhs);  // 2929
		operator|(RuntimeTextureSpecificationFlags_t a,
				RuntimeTextureSpecificationFlags_t b);  // 35
		operator|=(RuntimeTextureSpecificationFlags_t& a,
				RuntimeTextureSpecificationFlags_t b);  // 2930
		CWeakHandle<InfoForResourceTypeCTextureBase>::InitUntypedUnchecked(
					ResourceHandle_t hUntypedResource);  // 227
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
		FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
		CStrongHandle<InfoForResourceTypeCTextureBase>::operator CWeakHandle<InfoForResourceTypeCTextureBase>(); // 2931
		CWeakHandle<InfoForResourceTypeCTextureBase>::GetBinding(); // 673
		CStrongHandle<InfoForResourceTypeCTextureBase>::operator=(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2931
		CRenderDeviceVulkan::MemoryManager(); // 2944
		CMemoryManagerVulkan::GetVmaAllocator(); // 1491
		GetVmaAllocator(void); // 2952
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 2952
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::RemoveAll(); // 1798
		CUtlMemory<TextureCreationExtraData_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 903
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 1799
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Purge(); // 560
		ValidateAlignment<TextureCreationExtraData_t>(void); // 508
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 510
		CUtlMemory<TextureCreationExtraData_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVector(); // 234
		CTextureCreationDesc::~CTextureCreationDesc(); // 2954
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::RemoveAll(); // 1798
		CUtlMemory<TextureCreationExtraData_t, int>::IsExternallyAllocated(); // 905
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 903
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 1799
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Purge(); // 560
		ValidateAlignment<TextureCreationExtraData_t>(void); // 508
		CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 510
		CUtlMemory<TextureCreationExtraData_t, int>::~CUtlMemory(); // 562
		CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVectorBase(); // 410
		CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVector(); // 234
		CTextureCreationDesc::~CTextureCreationDesc(); // 2954
	}
	{
		uint32 nImageIndex; // 2957
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
		CWeakHandle<InfoForResourceTypeCTextureBase>::InitUntypedUnchecked(
					ResourceHandle_t hUntypedResource);  // 227
		FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
		CStrongHandle<InfoForResourceTypeCTextureBase>::operator CWeakHandle<InfoForResourceTypeCTextureBase>(); // 2959
		CWeakHandle<InfoForResourceTypeCTextureBase>::GetBinding(); // 673
		CStrongHandle<InfoForResourceTypeCTextureBase>::operator=(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2959
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2828
	CRenderDeviceVulkan::ColorFormat(); // 2833
	ComputeAASettings(RenderMultisampleType_t nType,
				VkSampleCountFlagBits* pSampleCount);  // 2837
	CRenderDeviceVulkan::MemoryManager(); // 2864
	CMemoryManagerVulkan::GetVmaAllocator(); // 1491
	GetVmaAllocator(void); // 2871
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 2871
	V_memset(void* dest,
		int fill,
		size_t count);  // 142
	CTextureDesc::CTextureDesc(); // 221
	Vector4D::Vector4D(); // 221
	CUtlMemory<TextureCreationExtraData_t, int>::ValidateGrowSize(); // 475
	CUtlMemory<TextureCreationExtraData_t, int>::CUtlMemory(
			int nGrowSize,
			int nInitAllocationCount);  // 527
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::ResetDbgInfo(); // 530
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 418
	CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::CUtlVector(); // 221
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 222
	CTextureCreationDesc::CTextureCreationDesc(); // 2873
	Vector4D::Init(
		vec_t ix,
		vec_t iy,
		vec_t iz,
		vec_t iw);  // 2889
	operator|=(RuntimeTextureSpecificationFlags_t& a,
			RuntimeTextureSpecificationFlags_t b);  // 2886
	CWeakHandle<InfoForResourceTypeCTextureBase>::InitUntypedUnchecked(
				ResourceHandle_t hUntypedResource);  // 227
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 754
	CStrongHandle<InfoForResourceTypeCTextureBase>::operator CWeakHandle<InfoForResourceTypeCTextureBase>(); // 2974
	operator&=(RuntimeTextureSpecificationFlags_t& a,
			RuntimeTextureSpecificationFlags_t b);  // 2965
	operator|(RuntimeTextureSpecificationFlags_t a,
			RuntimeTextureSpecificationFlags_t b);  // 35
	operator|=(RuntimeTextureSpecificationFlags_t& a,
			RuntimeTextureSpecificationFlags_t b);  // 2968
	CWeakHandle<InfoForResourceTypeCTextureBase>::GetBinding(); // 673
	CStrongHandle<InfoForResourceTypeCTextureBase>::operator=(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 2974
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::RemoveAll(); // 1798
	CUtlMemory<TextureCreationExtraData_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 903
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 1799
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::Purge(); // 560
	ValidateAlignment<TextureCreationExtraData_t>(void); // 508
	CUtlMemory<TextureCreationExtraData_t, int>::Purge(); // 510
	CUtlMemory<TextureCreationExtraData_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<TextureCreationExtraData_t, CUtlMemory<TextureCreationExtraData_t, int> >::~CUtlVector(); // 234
	CTextureCreationDesc::~CTextureCreationDesc(); // 2976
} /* size: 0, variables: 7, inline expansions: 44 (872 bytes) */

// <00A30F2F> vulkan/renderdevicevulkan.cpp:2978
void CRenderDeviceVulkan::WaitIfTooFarAheadOfGPU()
{
} /* size: 14 */

// <00A30798> vulkan/renderdevicevulkan.cpp:2987
// variables: 5
// function calls: 24
void CRenderDeviceVulkan::WaitIfAheadOfTheGPUByMoreThanNFrames(int32 nNumFramesAheadOfGPU)
{
	int32 nOutstandingFrames; // 2989
	{
		float64 flLastWaitTime; // 2994
		float64 flBeginWaitTime; // 2995
		{
			float64 flCurWaitTime; // 3009
			{
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3004; // 3004
				ThreadInterlockedAssignIf64(volatile int64* pDest,
								int64 value,
								int64 comparand);  // 800
				CThreadFastMutex::TryLockInline(
						const char* pFileName,
						int nLineNumber,
						const ThreadId_t  threadId);  // 837
				ThreadPause(void); // 839
				CThreadFastMutex::Lock(
					const char* pFileName,
					int nLineNumber,
					unsigned int nSpinSleepTime);  // 943
				Lock(CThreadFastMutex& lock,
					const char* pFileName,
					int nLineNumber);  // 978
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
						const CThreadFastMutex& lock,
						const char* pFilename,
						int nLineNumber);  // 3004
				VulkanQueue(void); // 3005
				CUtlString::CUtlString(); // 149
				CUtlString::Get(); // 151
				CUtlString::~CUtlString(); // 153
				_DOVK(VkResult result,
					const char* pCommand);  // 3005
				ThreadInterlockedExchange64(volatile int64* p,
								int64 value);  // 874
				CThreadFastMutex::Unlock(
					const char* pFileName,
					int nLineNumber);  // 944
				Unlock(CThreadFastMutex& lock,
					const char* pFileName,
					int nLineNumber);  // 983
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 3006
				CRenderDeviceVulkan::RenderThread(); // 3004
				CRenderThreadVulkan::GetQueueMutex(); // 3004
			}
			CInterlockedIntT<unsigned int, 4>::GetRaw(); // 3007
			CInterlockedIntT<unsigned int, 4>::GetRaw(); // 484
			CMemoryManagerVulkan::GetHighestFrameCompletedOnGPU(); // 3007
			CRenderDeviceVulkan::MemoryManager(); // 3000
		}
	}
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 2989
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 484
	CMemoryManagerVulkan::GetHighestFrameCompletedOnGPU(); // 2989
} /* size: 668, variables: 1, inline expansions: 3 (31 bytes) */

// <00A6F016> vulkan/renderdevicevulkan.cpp:3022
// variables: 4
// function call: 1
void CSwapChainVulkan::SwapBuffers(VkSemaphore* ppAcquireNextImageSemaphoreOut)
{
	bool bAttemptedToRecreateSwapchain; // 3049
	VkSemaphore pAcquireNextImageSemaphore; // 3052
	VkSemaphoreCreateInfo acquireNextImageSemaphoreCreateInfo; // 3053
	VkResult nResult; // 3078
	{
	}
	CRenderDeviceVulkan::IsHibernating(); // 3034
} /* size: 0, variables: 4, inline expansions: 1 (7 bytes) */

// <00A6E04C> vulkan/renderdevicevulkan.cpp:3022
// variables: 11
// function calls: 50
void CSwapChainVulkan::SwapBuffers(VkSemaphore* ppAcquireNextImageSemaphoreOut)
{
	bool bAttemptedToRecreateSwapchain; // 3049
	VkSemaphore pAcquireNextImageSemaphore; // 3052
	VkSemaphoreCreateInfo acquireNextImageSemaphoreCreateInfo; // 3053
	VkResult nResult; // 3078
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 3057
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3081; // 3081
		uint64_t nTimeout; // 3085
		CRenderDeviceVulkan::RenderThread(); // 3081
		CRenderThreadVulkan::GetQueueMutex(); // 3081
		ThreadInterlockedAssignIf64(volatile int64* pDest,
						int64 value,
						int64 comparand);  // 800
		CThreadFastMutex::TryLockInline(
				const char* pFileName,
				int nLineNumber,
				const ThreadId_t  threadId);  // 837
		ThreadPause(void); // 839
		CThreadFastMutex::Lock(
			const char* pFileName,
			int nLineNumber,
			unsigned int nSpinSleepTime);  // 943
		Lock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
				const CThreadFastMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3081
		{
			CUtlString errString; // 3091
			CUtlString::CUtlString(); // 3091
			CUtlString::Get(); // 99
			CUtlString::String(); // 3093
			CUtlString::~CUtlString(); // 3094
		}
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 874
		CThreadFastMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 3095
	}
	{
		CUtlString errString; // 3116
		CUtlString::Get(); // 3118
		CUtlString::CUtlString(); // 3116
		CUtlString::~CUtlString(); // 3141
	}
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3100; // 3100
		uint64_t nTimeout; // 3105
		CUtlString msgString; // 3108
		ThreadInterlockedAssignIf64(volatile int64* pDest,
						int64 value,
						int64 comparand);  // 800
		CThreadFastMutex::TryLockInline(
				const char* pFileName,
				int nLineNumber,
				const ThreadId_t  threadId);  // 837
		ThreadPause(void); // 839
		CThreadFastMutex::Lock(
			const char* pFileName,
			int nLineNumber,
			unsigned int nSpinSleepTime);  // 943
		Lock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
				const CThreadFastMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3100
		VulkanQueue(void); // 3103
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		LeafCodeInfo_t::LeafCodeInfo_t(
				const char* szFile,
				int nLine,
				const char* szFunction);  // 145
		_DOVK(VkResult result,
			const char* pCommand);  // 136
		_DOVK(VkResult result,
			const char* pCommand);  // 3103
		CUtlString::CUtlString(); // 3108
		CUtlString::Get(); // 99
		CUtlString::String(); // 3110
		CUtlString::~CUtlString(); // 3111
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 874
		CThreadFastMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 3111
		CRenderDeviceVulkan::RenderThread(); // 3100
		CRenderThreadVulkan::GetQueueMutex(); // 3100
	}
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<int, 4>::operator++(); // 604
	CStrongHandle<InfoForResourceTypeCTextureBase>::Init(
		const CStrongHandle<InfoForResourceTypeCTextureBase>& src);  // 666
	CStrongHandle<InfoForResourceTypeCTextureBase>::operator=(
			const CStrongHandle<InfoForResourceTypeCTextureBase>& src);  // 3153
} /* size: 1635, variables: 4, inline expansions: 8 (357 bytes) */

// <00A30690> vulkan/renderdevicevulkan.cpp:3022
// variables: 13
void CSwapChainVulkan::SwapBuffers(VkSemaphore* ppAcquireNextImageSemaphoreOut)
{
	const char   __FUNCTION__; // 28651
	bool bAttemptedToRecreateSwapchain; // 3049
	VkSemaphore pAcquireNextImageSemaphore; // 3052
	VkSemaphoreCreateInfo acquireNextImageSemaphoreCreateInfo; // 3053
	VkResult nResult; // 3078
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3024
	}
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3081; // 3081
		uint64_t nTimeout; // 3085
		{
			CUtlString errString; // 3091
		}
	}
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3100; // 3100
		uint64_t nTimeout; // 3105
		CUtlString msgString; // 3108
	}
	{
		CUtlString errString; // 3116
	}
} /* size: 0, variables: 5 */

// <00A30199> vulkan/renderdevicevulkan.cpp:3162
// variable: 1
// function calls: 21
void CSwapChainVulkan::CleanupViews()
{
	{
		uint32 nImageIndex; // 3165
		ThreadInterlockedDecrement(volatile int32* p); // 159
		Decrement(int* p); // 204
		CRefCountServiceBase<true, CRefMT>::DoRelease(); // 202
		CRefCountServiceBase<true, CRefMT>::DoRelease(); // 330
		CRefCounted<CRefCountServiceBase<true, CRefMT> >::Release(); // 3174
	}
	ThreadInterlockedDecrement(volatile int32* p); // 159
	Decrement(int* p); // 204
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 202
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 330
	CRefCounted<CRefCountServiceBase<true, CRefMT> >::Release(); // 3181
	ThreadInterlockedDecrement(volatile int32* p); // 159
	Decrement(int* p); // 204
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 202
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 330
	CRefCounted<CRefCountServiceBase<true, CRefMT> >::Release(); // 3186
	ThreadInterlockedDecrement(volatile int32* p); // 159
	Decrement(int* p); // 204
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 202
	CRefCountServiceBase<true, CRefMT>::DoRelease(); // 330
	CRefCounted<CRefCountServiceBase<true, CRefMT> >::Release(); // 3191
	CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 3197
} /* size: 588, inline expansions: 16 (461 bytes) */

// <00A2FFA5> vulkan/renderdevicevulkan.cpp:3205
// variables: 2
// function calls: 2
void CSwapChainVulkan::CleanupVulkanSwapchain()
{
	bool bShouldLeak; // 3215
	{
		xcb_get_input_focus_reply_t* pXcbGetInputFocusReply; // 3242
	}
	CRenderDeviceVulkan::GOOGLEDisplayTimingEnabled(); // 3215
	CRenderDeviceMgrVulkan::GetInstance(); // 3265
} /* size: 578, variables: 1, inline expansions: 2 (17 bytes) */

// <00A2FC31> vulkan/renderdevicevulkan.cpp:3278
// variable: 1
// function calls: 9
void CSwapChainVulkan::Update(const RenderDeviceInfo_t& mode)
{
	float flContentsScale; // 3283
	CSwapChainBase::GetPlatWindowHandle(); // 3283
	CInterlockedIntT<int, 4>::operator int(); // 594
	CRenderDeviceBase::IsAsyncPresentEnabled(); // 3296
	VulkanQueue(void); // 3306
	CUtlString::CUtlString(); // 149
	CUtlString::Get(); // 151
	CUtlString::~CUtlString(); // 153
	_DOVK(VkResult result,
		const char* pCommand);  // 3306
	CRenderDeviceVulkan::RenderThread(); // 3308
} /* size: 656, variables: 1, inline expansions: 9 (204 bytes) */

// <00A2FAA7> vulkan/renderdevicevulkan.cpp:3338
// variables: 8
// function call: 1
void CSwapChainVulkan::FrameUpdate()
{
	int nWidth; // 3340
	int nHeight; // 3340
	const char   __FUNCTION__; // 28651
	bool bRequiresUpdate; // 3360
	float flContentsScale; // 3380
	bool bHighDPI; // 3381
	bool bIsMinimized; // 3403
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3356
	}
	RenderDeviceInfo_t::IsHighDPI(); // 3389
} /* size: 0, variables: 7, inline expansions: 1 (12 bytes) */

// <00A2F92C> vulkan/renderdevicevulkan.cpp:3418
// variables: 2
// function call: 1
void CRenderDeviceVulkan::CreateSwapChain(PlatWindow_t hPlatWnd, OsSpecificWindowHandle_t hOsWnd, const RenderDeviceInfo_t& info, const char* pDebugName)
{
	CSwapChainVulkan* pSwapChain; // 3420
	SwapChainHandle_t hSwapChain; // 3427
	CSwapChainVulkan::~CSwapChainVulkan(); // 3423
} /* size: 188, variables: 2, inline expansions: 1 (21 bytes) */

// <00A2F89A> vulkan/renderdevicevulkan.cpp:3431
// variable: 1
// function call: 1
void CRenderDeviceVulkan::CanRenderToSwapChain(SwapChainHandle_t hSwapChain)
{
	const CSwapChainVulkan* pSwapChain; // 3433
	CRenderDeviceBase::GetSwapChain<CSwapChainVulkan>(
					SwapChainHandle_t hSwapChain);  // 3433
} /* size: 27, variables: 1, inline expansions: 1 (5 bytes) */

// <00A63464> vulkan/renderdevicevulkan.cpp:3448
// variable: 1
// function calls: 8
void CRenderDeviceVulkan::GetSwapChainInfo(SwapChainHandle_t hSwapChain)
{
	const CSwapChainVulkan* pSwapChain; // 3450
	CRenderDeviceBase::GetSwapChain<CSwapChainVulkan>(
					SwapChainHandle_t hSwapChain);  // 3450
	CSwapChainVulkan::GetRenderDeviceInfoScaled(); // 3453
	V_memset(void* dest,
		int fill,
		size_t count);  // 213
	RenderDisplayMode_t::RenderDisplayMode_t(); // 239
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 239
	RenderDeviceInfo_t::RenderDeviceInfo_t(); // 3456
	CRenderDeviceVulkan::GetSwapChainInfo(
			SwapChainHandle_t hSwapChain);  // 3448
} /* size: 171, variables: 1, inline expansions: 8 (303 bytes) */

// <00A2F850> vulkan/renderdevicevulkan.cpp:3448
// variables: 2
void CRenderDeviceVulkan::GetSwapChainInfo(SwapChainHandle_t hSwapChain)
{
	const CSwapChainVulkan* pSwapChain; // 3450
	RenderDeviceInfo_t errorInfo; // 3456
} /* size: 0, variables: 2 */

// <00A2F785> vulkan/renderdevicevulkan.cpp:3464
// variable: 1
// function call: 1
void CRenderDeviceVulkan::UpdateSwapChain(SwapChainHandle_t hSwapChain, const RenderDeviceInfo_t& info)
{
	CSwapChainVulkan* pSwapChain; // 3466
	CRenderDeviceBase::GetSwapChain<CSwapChainVulkan>(
					SwapChainHandle_t hSwapChain);  // 3466
} /* size: 46, variables: 1, inline expansions: 1 (8 bytes) */

// <00A2F6A4> vulkan/renderdevicevulkan.cpp:3479
// function call: 1
void CRenderDeviceVulkan::GetNearestSupportedColorFormat(ImageFormat fmt, bool bIsRenderTarget, bool bIsVertexTexture, bool bIsFilterableRequired)
{
	CColorFormatBase::FindNearestSupportedFormat(
					ImageFormat format,
					bool bIsVertexTexture,
					bool bIsRenderTarget,
					bool bFilterableRequired,
					int nAlternateFormatIter);  // 3481
} /* size: 40, inline expansions: 1 (33 bytes) */

// <00A2E986> vulkan/renderdevicevulkan.cpp:3485
// variables: 13
// function calls: 42
void* CRenderDeviceVulkan::GetDeviceSpecificTexture(HRenderTexture hTexture, RenderTextureDimension_t renderDimension)
{
	IndexType_t nIndex; // 3487
	const char   __FUNCTION__; // 28997
	VulkanDeviceSpecificTexture_t* pDeviceSpecificTexture; // 3499
	CVulkanImage* pVulkanImage; // 3501
	const VkFormat* pVulkanFormat; // 3504
	const TextureSpecification_t* pSpec; // 3507
	{
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_3489; // 3489
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 943
		Lock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
				const CThreadMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3489
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_ this,
				unsigned int i);  // 545
		Element(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
			unsigned int i);  // 1912
		LeftChild(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
				unsigned int i);  // 1913
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 49
		CDefLess<CWeakHandle<InfoForResourceTypeCTextureBase> >::operator(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& lhs,
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 426
		CKeyLess::operator(
				const KeyType_t& left,
				const Node_t& right);  // 1912
		RightChild(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
				unsigned int i);  // 1915
		FindAltKeyType<CWeakHandle<InfoForResourceTypeCTextureBase>, CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHandle<InfoForResourceTypeCTextureBase> > >::CKeyLess>(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
																const CWeakHandle<InfoForResourceTypeCTextureBase>& search,
																const CKeyLess& altLess);  // 298
		FindAltKeyType<CWeakHandle<InfoForResourceTypeCTextureBase> >(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
										const CWeakHandle<InfoForResourceTypeCTextureBase>& search);  // 243
		Find(const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<C this,
			const KeyType_t& key);  // 3491
		CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
		CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 405
		Node_t::Node_t(
			const KeyType_t& k);  // 213
		LeftChild(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
				unsigned int i);  // 1667
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this,
				unsigned int i);  // 539
		Element(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this,
			unsigned int i);  // 1665
		CWeakHandle<InfoForResourceTypeCTextureBase>::operator<(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 49
		CDefLess<CWeakHandle<InfoForResourceTypeCTextureBase> >::operator(
				const CWeakHandle<InfoForResourceTypeCTextureBase>& lhs,
				const CWeakHandle<InfoForResourceTypeCTextureBase>& rhs);  // 418
		CKeyLess::operator(
				const Node_t& left,
				const Node_t& right);  // 1665
		RightChild(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, this,
				unsigned int i);  // 1677
		FindInsertionPosition(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this,
					const Node_t& insert,
					bool bCheckForDuplicates,
					unsigned int& parent,
					bool& leftchild,
					bool& isDuplicate);  // 1693
		{
			unsigned int newNode; // 1696
		}
		{
			unsigned int newNode; // 1709
			{
			}
		}
		Insert(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this,
			const Node_t& insert,
			ERBTreeInsertBehavior eInsertBehavior);  // 213
		Insert(const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHa this,
			const KeyType_t& key,
			ERBTreeInsertBehavior eInsertBehavior);  // 3494
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 3496
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3498
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3502
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3505
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3508
	}
	operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, uns this,
			unsigned int i);  // 539
	Element(const CUtlRBTree<CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefL this,
		unsigned int i);  // 92
	operator[](const CUtlMap<CWeakHandle<InfoForResourceTypeCTextureBase>, VulkanDeviceSpecificTexture_t, unsigned int, CDefLess<CWeakHa this,
			IndexType_t i);  // 3499
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3501
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3504
	CInterlockedIntT<int, 4>::operator int(); // 288
	ResourceHandleToNonConstData<InfoForResourceTypeCTextureBase>(const CWeakHandle<InfoForResourceTypeCTextureBase>& hResource); // 421
	CTextureManagerVulkan::GetVulkanFormat(
			HRenderTexture hTexture);  // 3504
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3507
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 3512
} /* size: 0, variables: 6, inline expansions: 13 (196 bytes) */

// <00A2E84F> vulkan/renderdevicevulkan.cpp:3523
// variable: 1
// function calls: 2
void* CRenderDeviceVulkan::GetDeviceSpecificImageView(HRenderTexture hTexture, RenderTextureDimension_t nDim, RenderColorSpace_t colorSpace)
{
	VkImageView vkImageView; // 3525
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3525
} /* size: 82, variables: 1, inline expansions: 2 (14 bytes) */

// <00A2E7E7> vulkan/renderdevicevulkan.cpp:3530
void* CRenderDeviceVulkan::GetDeviceSpecificBuffer(RenderBufferHandle_t hGPUBuffer)
{
} /* size: 13 */

// <00A2E1F2> vulkan/renderdevicevulkan.cpp:3537
// variables: 6
// function calls: 23
void* CRenderDeviceVulkan::GetDeviceSpecificBuffer(VertexBufferHandle_t hVertexBuffer)
{
	CVertexBufferVulkan* pVertexBuffer; // 3540
	IndexType_t nIndex; // 3542
	const char   __FUNCTION__; // 28970
	VulkanDeviceSpecificBuffer_t* pDeviceSpecificBuffer; // 3554
	{
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_3544; // 3544
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 943
		Lock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
				const CThreadMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3544
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::operator[](
				unsigned int i);  // 545
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Element(
			unsigned int i);  // 1912
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::LeftChild(
				unsigned int i);  // 1913
		CDefLess<RenderResourceHandle_t__::operator(
				RenderResourceHandle_t__* const& lhs,
				RenderResourceHandle_t__* const& rhs);  // 426
		CKeyLess::operator(
				const KeyType_t& left,
				const Node_t& right);  // 1912
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::RightChild(
				unsigned int i);  // 1915
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::FindAltKeyType<RenderResourceHandle_t__*, CUtlMap<RenderResourceHandle_t__*, VulkanDeviceSpecificBuffer_t, unsigned int, CDefLess<RenderResourceHandle_t__*> >::CKeyLess>(
																RenderResourceHandle_t__* const& search,
																const CKeyLess& altLess);  // 298
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::FindAltKeyType<RenderResourceHandle_t__*>(
								RenderResourceHandle_t__* const& search);  // 243
		CUtlMap<RenderResourceHandle_t__::Find(
			const KeyType_t& key);  // 3546
		Node_t::Node_t(
			const KeyType_t& k);  // 213
		CUtlMap<RenderResourceHandle_t__::Insert(
			const KeyType_t& key,
			ERBTreeInsertBehavior eInsertBehavior);  // 3549
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 3551
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3552
	}
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::operator[](
			unsigned int i);  // 539
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Element(
		unsigned int i);  // 92
	CUtlMap<RenderResourceHandle_t__::operator[](
			IndexType_t i);  // 3554
	CVertexBufferVulkan::GetVKBuffer(); // 3555
	CVertexBufferVulkan::GetMemoryOffset(); // 3556
	CVertexBufferBase::GetBufferSizeInBytes(); // 3557
} /* size: 374, variables: 4, inline expansions: 6 (56 bytes) */

// <00A2DBF7> vulkan/renderdevicevulkan.cpp:3562
// variables: 6
// function calls: 23
void* CRenderDeviceVulkan::GetDeviceSpecificBuffer(IndexBufferHandle_t hBuffer)
{
	CIndexBufferVulkan* pIndexBuffer; // 3564
	IndexType_t nIndex; // 3566
	const char   __FUNCTION__; // 28970
	VulkanDeviceSpecificBuffer_t* pDeviceSpecificBuffer; // 3578
	{
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_3568; // 3568
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 943
		Lock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
				const CThreadMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3568
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::operator[](
				unsigned int i);  // 545
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Element(
			unsigned int i);  // 1912
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::LeftChild(
				unsigned int i);  // 1913
		CDefLess<RenderResourceHandle_t__::operator(
				RenderResourceHandle_t__* const& lhs,
				RenderResourceHandle_t__* const& rhs);  // 426
		CKeyLess::operator(
				const KeyType_t& left,
				const Node_t& right);  // 1912
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::RightChild(
				unsigned int i);  // 1915
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::FindAltKeyType<RenderResourceHandle_t__*, CUtlMap<RenderResourceHandle_t__*, VulkanDeviceSpecificBuffer_t, unsigned int, CDefLess<RenderResourceHandle_t__*> >::CKeyLess>(
																RenderResourceHandle_t__* const& search,
																const CKeyLess& altLess);  // 298
		CUtlRBTree<CUtlMap<RenderResourceHandle_t__::FindAltKeyType<RenderResourceHandle_t__*>(
								RenderResourceHandle_t__* const& search);  // 243
		CUtlMap<RenderResourceHandle_t__::Find(
			const KeyType_t& key);  // 3570
		Node_t::Node_t(
			const KeyType_t& k);  // 213
		CUtlMap<RenderResourceHandle_t__::Insert(
			const KeyType_t& key,
			ERBTreeInsertBehavior eInsertBehavior);  // 3573
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 3575
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3576
	}
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderResourceHandle_t__::operator[](
			unsigned int i);  // 539
	CUtlRBTree<CUtlMap<RenderResourceHandle_t__::Element(
		unsigned int i);  // 92
	CUtlMap<RenderResourceHandle_t__::operator[](
			IndexType_t i);  // 3578
	CIndexBufferVulkan::GetVkBuffer(); // 3579
	CIndexBufferVulkan::GetBindOffset(); // 3580
	CIndexBufferBase::GetBufferSizeInBytes(); // 3581
} /* size: 374, variables: 4, inline expansions: 6 (49 bytes) */

// <00A2D047> vulkan/renderdevicevulkan.cpp:3586
// variables: 11
// function calls: 40
void* CRenderDeviceVulkan::GetDeviceSpecificDescriptorSet(RenderDescriptorSetHandle_t hDescriptorSet)
{
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForReadTrait<CThreadRWLock_FastRead> > generated_id_3591; // 3591
	const char   __FUNCTION__; // 29154
	StaticDescriptorSetIndex_t nIdx; // 3594
	CDescriptorSetVulkan* pStaticDescriptorSet; // 3595
	IndexType_t nIndex; // 3597
	VulkanDeviceSpecificDescriptorSet_t* pDeviceSpecificDescriptorSet; // 3609
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3593
	}
	{
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_3599; // 3599
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 943
		Lock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
				const CThreadMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3599
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::operator[](
				unsigned int i);  // 545
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Element(
			unsigned int i);  // 1912
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::LeftChild(
				unsigned int i);  // 1913
		CDefLess<RenderDescriptorSetHandle_t__::operator(
				RenderDescriptorSetHandle_t__* const& lhs,
				RenderDescriptorSetHandle_t__* const& rhs);  // 426
		CKeyLess::operator(
				const KeyType_t& left,
				const Node_t& right);  // 1912
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::RightChild(
				unsigned int i);  // 1915
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::FindAltKeyType<RenderDescriptorSetHandle_t__*, CUtlMap<RenderDescriptorSetHandle_t__*, VulkanDeviceSpecificDescriptorSet_t, unsigned int, CDefLess<RenderDescriptorSetHandle_t__*> >::CKeyLess>(
																RenderDescriptorSetHandle_t__* const& search,
																const CKeyLess& altLess);  // 298
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::FindAltKeyType<RenderDescriptorSetHandle_t__*>(
								RenderDescriptorSetHandle_t__* const& search);  // 243
		CUtlMap<RenderDescriptorSetHandle_t__::Find(
			const KeyType_t& key);  // 3601
		Node_t::Node_t(
			const KeyType_t& k);  // 213
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::LeftChild(
				unsigned int i);  // 1667
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::operator[](
				unsigned int i);  // 539
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Element(
			unsigned int i);  // 1665
		CDefLess<RenderDescriptorSetHandle_t__::operator(
				RenderDescriptorSetHandle_t__* const& lhs,
				RenderDescriptorSetHandle_t__* const& rhs);  // 418
		CKeyLess::operator(
				const Node_t& left,
				const Node_t& right);  // 1665
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::RightChild(
				unsigned int i);  // 1677
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::FindInsertionPosition(
					const Node_t& insert,
					bool bCheckForDuplicates,
					unsigned int& parent,
					bool& leftchild,
					bool& isDuplicate);  // 1693
		{
			unsigned int newNode; // 1696
		}
		{
			unsigned int newNode; // 1709
			{
			}
		}
		CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Insert(
			const Node_t& insert,
			ERBTreeInsertBehavior eInsertBehavior);  // 213
		CUtlMap<RenderDescriptorSetHandle_t__::Insert(
			const KeyType_t& key,
			ERBTreeInsertBehavior eInsertBehavior);  // 3604
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 3606
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3607
	}
	ThreadInterlockedIncrement(volatile int32* p); // 576
	CInterlockedIntT<unsigned int, 4>::operator++(); // 3093
	CThreadRWLock_FastRead::LockForRead(
			const char* pFileName,
			int nLineNumber);  // 951
	Lock(CThreadRWLock_FastRead& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForReadTrait<CThreadRWLock_FastRead> >::CAutoLockT(
			const CThreadRWLock_FastRead& lock,
			const char* pFilename,
			int nLineNumber);  // 3591
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderDescriptorSetHandle_t__::operator[](
			unsigned int i);  // 539
	CUtlRBTree<CUtlMap<RenderDescriptorSetHandle_t__::Element(
		unsigned int i);  // 92
	CUtlMap<RenderDescriptorSetHandle_t__::operator[](
			IndexType_t i);  // 3609
	ThreadInterlockedDecrement(volatile int32* p); // 586
	CInterlockedIntT<unsigned int, 4>::operator--(); // 3106
	CThreadRWLock_FastRead::UnlockRead(
			const char* pFileName,
			int nLineNumber);  // 952
	Unlock(CThreadRWLock_FastRead& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForReadTrait<CThreadRWLock_FastRead> >::~CAutoLockT(); // 3613
	CDescriptorSetVulkan::GetDescriptorSet(); // 3610
	CDescriptorSetVulkan::GetDescriptorSetLayout(); // 3611
} /* size: 0, variables: 6, inline expansions: 15 (456 bytes) */

// <00A2C794> vulkan/renderdevicevulkan.cpp:3616
// variables: 8
// function calls: 30
void* CRenderDeviceVulkan::GetDeviceSpecificRayTracePipeline(RenderRayTracePipelineHandle_t hRayTracePipeline)
{
	CRayTracePipelineVulkan* pRaytracePipeline; // 3618
	IndexType_t nIndex; // 3620
	const char   __FUNCTION__; // 29230
	VulkanDeviceSpecificRayTracePipeline_t* pDeviceSpecificRayTracePipeline; // 3632
	{
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_3622; // 3622
		CThreadMutex::Lock(
			const char* pFileName,
			int nLineNumber);  // 943
		Lock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
				const CThreadMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3622
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::operator[](
				unsigned int i);  // 545
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Element(
			unsigned int i);  // 1912
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::LeftChild(
				unsigned int i);  // 1913
		CDefLess<RenderRayTracePipelineHandle_t__::operator(
				RenderRayTracePipelineHandle_t__* const& lhs,
				RenderRayTracePipelineHandle_t__* const& rhs);  // 426
		CKeyLess::operator(
				const KeyType_t& left,
				const Node_t& right);  // 1912
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::RightChild(
				unsigned int i);  // 1915
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::FindAltKeyType<RenderRayTracePipelineHandle_t__*, CUtlMap<RenderRayTracePipelineHandle_t__*, VulkanDeviceSpecificRayTracePipeline_t, unsigned int, CDefLess<RenderRayTracePipelineHandle_t__*> >::CKeyLess>(
																RenderRayTracePipelineHandle_t__* const& search,
																const CKeyLess& altLess);  // 298
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::FindAltKeyType<RenderRayTracePipelineHandle_t__*>(
									RenderRayTracePipelineHandle_t__* const& search);  // 243
		CUtlMap<RenderRayTracePipelineHandle_t__::Find(
			const KeyType_t& key);  // 3624
		Node_t::Node_t(
			const KeyType_t& k);  // 213
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::LeftChild(
				unsigned int i);  // 1667
		CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::operator[](
				unsigned int i);  // 539
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Element(
			unsigned int i);  // 1665
		CDefLess<RenderRayTracePipelineHandle_t__::operator(
				RenderRayTracePipelineHandle_t__* const& lhs,
				RenderRayTracePipelineHandle_t__* const& rhs);  // 418
		CKeyLess::operator(
				const Node_t& left,
				const Node_t& right);  // 1665
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::RightChild(
				unsigned int i);  // 1677
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::FindInsertionPosition(
					const Node_t& insert,
					bool bCheckForDuplicates,
					unsigned int& parent,
					bool& leftchild,
					bool& isDuplicate);  // 1693
		{
			unsigned int newNode; // 1696
		}
		{
			unsigned int newNode; // 1709
			{
			}
		}
		CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Insert(
			const Node_t& insert,
			ERBTreeInsertBehavior eInsertBehavior);  // 213
		CUtlMap<RenderRayTracePipelineHandle_t__::Insert(
			const KeyType_t& key,
			ERBTreeInsertBehavior eInsertBehavior);  // 3627
		CThreadMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 3629
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3630
	}
	CUtlMemory<UtlRBTreeNode_t<CUtlMap<RenderRayTracePipelineHandle_t__::operator[](
			unsigned int i);  // 539
	CUtlRBTree<CUtlMap<RenderRayTracePipelineHandle_t__::Element(
		unsigned int i);  // 92
	CUtlMap<RenderRayTracePipelineHandle_t__::operator[](
			IndexType_t i);  // 3632
	CRayTracePipelineVulkan::Pipeline(); // 3633
	CRayTracePipelineVulkan::PipelineLayout(); // 3634
} /* size: 0, variables: 4, inline expansions: 5 (49 bytes) */

// <00A2C5DA> vulkan/renderdevicevulkan.cpp:3641
// variables: 5
// function call: 1
void CRenderDeviceVulkan::SupportsMSAAMode(ImageFormat fmt, bool bWindowed, RenderMultisampleType_t nMSAAMode)
{
	VkFormat nVulkanFormat; // 3643
	bool bIsDepthStencil; // 3644
	VkImageFormatProperties imageFormatProperties; // 3645
	VkResult nResult; // 3646
	VkSampleCountFlagBits nSampleCount; // 3656
	ComputeAASettings(RenderMultisampleType_t nType,
				VkSampleCountFlagBits* pSampleCount);  // 3657
} /* size: 0, variables: 5, inline expansions: 1 (102 bytes) */

// <00A2C56B> vulkan/renderdevicevulkan.cpp:3682
void CRenderDeviceVulkan::SupportsCSAAMode(ImageFormat fmt, bool bWindowed, RenderMultisampleType_t nMSAAMode, int nQualityLevel)
{
} /* size: 7 */

// <00A70C14> vulkan/renderdevicevulkan.cpp:3688
// variables: 11
// function calls: 16
void CRenderDeviceVulkan::PrintGPUMemoryStats()
{
	{
		uint64 nBLASUncompacted; // 3694
		uint64 nBLASUncompactedBytes; // 3695
		uint64 nBLASCompacted; // 3696
		uint64 nBLASCompactedBytes; // 3697
		uint64 nBLASCompactedBytesIfUncompacted; // 3698
		const float  flTotalMem; // 3717
		const float  flUncompactedMem; // 3718
		const float  flCompactedMem; // 3719
		const float  flCompactedMemIfUncompacted; // 3720
		{
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3700; // 3700
			ThreadInterlockedAssignIf64(volatile int64* pDest,
							int64 value,
							int64 comparand);  // 800
			CThreadFastMutex::TryLockInline(
					const char* pFileName,
					int nLineNumber,
					const ThreadId_t  threadId);  // 837
			ThreadPause(void); // 839
			CThreadFastMutex::Lock(
				const char* pFileName,
				int nLineNumber,
				unsigned int nSpinSleepTime);  // 943
			Lock(CThreadFastMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
					const CThreadFastMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 3700
			CUtlIntrusiveList<CBaseAccelerationStructureVulkan>::Head(); // 1125
			CBaseAccelerationStructureVulkan::OriginalUncompactedSizeInBytes(); // 3707
			CBaseAccelerationStructureVulkan::IsCompacted(); // 3703
			operator()(const class* __closure,
					CBaseAccelerationStructureVulkan* pAccelStruct); // 1128
			CUtlIntrusiveList<CBaseAccelerationStructureVulkan>::ForEach<CRenderDeviceVulkan::PrintGPUMemoryStats(
																 f);  // 3701
			ThreadInterlockedExchange64(volatile int64* p,
							int64 value);  // 874
			CThreadFastMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadFastMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 3715
		}
	}
	CRenderDeviceVulkan::PrintGPUMemoryStats(); // 3688
} /* size: 1033, inline expansions: 1 (862 bytes) */

// <00A2C3F4> vulkan/renderdevicevulkan.cpp:3688
// variables: 10
void CRenderDeviceVulkan::PrintGPUMemoryStats()
{
	{
		uint64 nBLASUncompacted; // 3694
		uint64 nBLASUncompactedBytes; // 3695
		uint64 nBLASCompacted; // 3696
		uint64 nBLASCompactedBytes; // 3697
		uint64 nBLASCompactedBytesIfUncompacted; // 3698
		const float  flTotalMem; // 3717
		const float  flUncompactedMem; // 3718
		const float  flCompactedMem; // 3719
		const float  flCompactedMemIfUncompacted; // 3720
		{
			CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3700; // 3700
		}
	}
} /* size: 0 */

// <00A29FA7> vulkan/renderdevicevulkan.cpp:3733
// variables: 14
// function calls: 160
void CRenderDeviceVulkan::ReadTexturePixels(HRenderTexture hTexture, Rect_t* pSrcRect, int nSrcSlice, int nSrcMip, Rect_t* pDstRect, void* pData, ImageFormat dstFormat, int nDstStride)
{
	CRenderContextVulkanPtr pRenderContextVK; // 3736
	const char   __FUNCTION__; // 28813
	CommandReadTexturePixelsVulkan_t cmd; // 3744
	CVulkanImage* pVulkanImage; // 3753
	const VkFormat* pVKFormat; // 3756
	const TextureSpecification_t* pSpec; // 3764
	const bool  validX; // 3787
	const bool  validY; // 3788
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3740
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3757
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3789
	}
	CWeakHandle<InfoForResourceTypeCTextureBase>::operator==(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& hResource);  // 3738
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
	StaticInvalidHandle(void); // 3738
	CommandBase_t::CommandBase_t(
			int nOpCode,
			bool bSkipOnLostDevice,
			int nCmdSizeInBytes);  // 117
	CommandHelper_t<CommandReadTexturePixelsVulkan_t, 15, true>::CommandHelper_t(); // 126
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 126
	CommandReadTexturePixelsVulkan_t::CommandReadTexturePixelsVulkan_t(); // 3744
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3753
	CInterlockedIntT<int, 4>::operator int(); // 282
	ResourceHandleToData<InfoForResourceTypeCTextureBase>(const CWeakHandle<InfoForResourceTypeCTextureBase>& hResource); // 339
	{
		RenderTextureDimension_t nTextureDim; // 342
		bool bDimsOkay; // 343
		CTextureInfoId::GetDiskSpec(); // 388
		CTextureBase::GetDiskSpec(); // 483
		CTextureBase::ComputeTextureDimension(); // 342
		CTextureInfoId::GetTextureObject(); // 83
		CTextureVulkan::GetTextureResource(); // 348
	}
	{
	}
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(); // 226
	FromUntypedHandleUnchecked(ResourceHandle_t hResource); // 172
	StaticInvalidHandle(void); // 360
	CTextureInfoId::GetTextureObject(); // 83
	CTextureVulkan::GetTextureResource(); // 365
	CTextureManagerVulkan::GetTextureResource(
				HRenderTexture hTexture,
				RenderTextureDimension_t nDim,
				const char* szParamName);  // 3753
	CInterlockedIntT<int, 4>::operator int(); // 288
	ResourceHandleToNonConstData<InfoForResourceTypeCTextureBase>(const CWeakHandle<InfoForResourceTypeCTextureBase>& hResource); // 421
	CTextureManagerVulkan::GetVulkanFormat(
			HRenderTexture hTexture);  // 3756
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3756
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 273
	CWeakHandle<InfoForResourceTypeCTextureBase>::CWeakHandle(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3764
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 331
	CWeakHandle<InfoForResourceTypeCTextureBase>::operator=(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 3766
	CCommandStreamBuilder::AvailableCommandBufferSpace(); // 677
	CUtlMemoryPool<CCommandBufferChunk>::Alloc(); // 81
	operator new(size_t size); // 133
	Alloc(void); // 328
	AllocateChunk(void); // 690
	ThreadPause(void); // 208
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	CTSListBase::Pop(); // 376
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 341
	simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
	CTSPool<CCommandStream>::GetObject(); // 390
	CTSPool<CCommandStream>::Get(); // 645
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 1479
	Construct<CCommandStream>(CCommandStream* pMemory); // 646
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 649
	CCommandStreamBuilder::EnsureStream(); // 641
	CCommandStreamBuilder::EnsureStream(); // 695
	{
		CommandJump_t cmd; // 705
		CommandBase_t::CommandBase_t(
				int nOpCode,
				bool bSkipOnLostDevice,
				int nCmdSizeInBytes);  // 117
		CommandHelper_t<CommandJump_t, 1, false>::CommandHelper_t(); // 143
		CommandJump_t::CommandJump_t(); // 705
		CCommandStreamBuilder::Store<CommandJump_t>(
					CommandJump_t obj);  // 707
	}
	CCommandStreamBuilder::GrowForCapacity(
			int nNumBytes);  // 681
	CCommandStreamBuilder::EnsureCapacity(
			int nNumBytes);  // 530
	CWeakHandle<InfoForResourceTypeCTextureBase>::Init(
		const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 331
	CWeakHandle<InfoForResourceTypeCTextureBase>::operator=(
			const CWeakHandle<InfoForResourceTypeCTextureBase>& src);  // 126
	CommandReadTexturePixelsVulkan_t::operator=(
			const CommandReadTexturePixelsVulkan_t  &);  // 532
	CCommandStreamBuilder::WriteCmd<CommandReadTexturePixelsVulkan_t>(
							const CommandReadTexturePixelsVulkan_t& obj);  // 3795
	CRenderContextPtr::Release(); // 845
	CRenderContextPtr::~CRenderContextPtr(); // 481
	CRenderContextVulkanPtr::~CRenderContextVulkanPtr(); // 3802
	Max<int>(const int& val1,
		const int& val2);  // 3771
	Max<int>(const int& val1,
		const int& val2);  // 3772
} /* size: 0, variables: 8, inline expansions: 151 (10851 bytes) */

// <00A29F78> vulkan/renderdevicevulkan.cpp:3808
void CRenderDeviceVulkan::IsUsingGraphics()
{
} /* size: 7 */

// <00A29F49> vulkan/renderdevicevulkan.cpp:3817
void CRenderDeviceVulkan::GetCurrentAdapter()
{
} /* size: 7 */

// <00A29EF9> vulkan/renderdevicevulkan.cpp:3826
void CRenderDeviceVulkan::SpewDriverInfo()
{
} /* size: 18 */

// <00A29E0D> vulkan/renderdevicevulkan.cpp:3832
// variable: 1
// function calls: 2
void CRenderDeviceVulkan::GetSwapChainDepthStencilFormat(SwapChainHandle_t hSwapChain)
{
	const CSwapChainVulkan* pSwapChain; // 3834
	CRenderDeviceBase::GetSwapChain<CSwapChainVulkan>(
					SwapChainHandle_t hSwapChain);  // 3834
	CRenderDeviceVulkan::ColorFormat(); // 3836
} /* size: 62, variables: 1, inline expansions: 2 (19 bytes) */

// <00A5E9DE> vulkan/renderdevicevulkan.cpp:3851
// variables: 2
// function call: 1
void CRenderDeviceVulkan::GetShaderVersionString(RenderShaderType_t nType)
{
	const char* pVsString; // 3853
	const char* pPsString; // 3854
	{
	}
	CRenderDeviceVulkan::GetShaderVersionString(
				RenderShaderType_t nType);  // 3851
} /* size: 0, variables: 2, inline expansions: 1 (26 bytes) */

// <00A29DA9> vulkan/renderdevicevulkan.cpp:3851
// variables: 4
void CRenderDeviceVulkan::GetShaderVersionString(RenderShaderType_t nType)
{
	const char* pVsString; // 3853
	const char* pPsString; // 3854
	const char   __FUNCTION__; // 28943
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 3871
	}
} /* size: 0, variables: 3 */

// <00A2940C> vulkan/renderdevicevulkan.cpp:3877
// variables: 4
// function calls: 26
void CRenderDeviceVulkan::UpdatePipelineStats(SwapChainHandle_t hSwapChain)
{
	bool bPipelineStatsActive; // 3880
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForWriteTrait<CThreadRWLock_FastRead> > generated_id_3890; // 3890
	{
		CRenderPipelineStatsVulkan* pPipelineStats; // 3899
	}
	{
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_3919; // 3919
		CRenderDeviceVulkan::RenderThread(); // 3919
		CRenderThreadVulkan::GetQueueMutex(); // 3919
		ThreadInterlockedAssignIf64(volatile int64* pDest,
						int64 value,
						int64 comparand);  // 800
		CThreadFastMutex::TryLockInline(
				const char* pFileName,
				int nLineNumber,
				const ThreadId_t  threadId);  // 837
		ThreadPause(void); // 839
		CThreadFastMutex::Lock(
			const char* pFileName,
			int nLineNumber,
			unsigned int nSpinSleepTime);  // 943
		Lock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 978
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
				const CThreadFastMutex& lock,
				const char* pFilename,
				int nLineNumber);  // 3919
		VulkanQueue(void); // 3920
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 3920
		ThreadInterlockedExchange64(volatile int64* p,
						int64 value);  // 874
		CThreadFastMutex::Unlock(
			const char* pFileName,
			int nLineNumber);  // 944
		Unlock(CThreadFastMutex& lock,
			const char* pFileName,
			int nLineNumber);  // 983
		CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 3921
	}
	CTextureManagerBase::GetTextureManagerRWLock(); // 3890
	CInterlockedIntT<int, 4>::GetRaw(); // 3180
	ThreadInterlockedExchangeAdd(volatile int32* p,
					int32 value);  // 660
	CInterlockedIntT<unsigned int, 4>::AtomicAdd(
			unsigned int add);  // 3189
	CThreadRWLock_FastRead::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 959
	Lock(CThreadRWLock_FastRead& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForWriteTrait<CThreadRWLock_FastRead> >::CAutoLockT(
			const CThreadRWLock_FastRead& lock,
			const char* pFilename,
			int nLineNumber);  // 3890
	Unlock(CThreadRWLock_FastRead& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadRWLock_FastRead, CAutoLockRWLockLockForWriteTrait<CThreadRWLock_FastRead> >::~CAutoLockT(); // 3929
} /* size: 1068, variables: 2, inline expansions: 9 (694 bytes) */

// <00A293C2> vulkan/renderdevicevulkan.cpp:3931
void CRenderDeviceVulkan::BeginRendering()
{
} /* size: 9 */

// <00A6F0B6> vulkan/renderdevicevulkan.cpp:3937
// variables: 3
// function calls: 135
void CRenderDeviceVulkan::BeginSubmittingDisplayLists(SwapChainHandle_t hSwapChain)
{
	__uniq_ptr_impl<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::_M_ptr(); // 472
	unique_ptr<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::get(); // 489
	unique_ptr<CBufferedDescriptorSetVulkan, std::default_delete<CBufferedDescriptorSetVulkan> >::operator bool(); // 8747
	CUtlMemory<RenderDescriptorBinding_t, int>::Base(); // 112
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::Base(); // 8749
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::Count(); // 8749
	CUtlVectorBase<RenderDescriptorBinding_t, CUtlMemory<RenderDescriptorBinding_t, int> >::RemoveAll(); // 8751
	CRenderDeviceVulkan::UpdateGlobalPerFrameDescriptorSet(); // 3940
	{
		CommandBeginSubmittingViews_t cmd; // 3944
		CRenderContextVulkanPtr pRenderContextVulkan; // 3947
		CommandBase_t::CommandBase_t(
				int nOpCode,
				bool bSkipOnLostDevice,
				int nCmdSizeInBytes);  // 117
		CommandHelper_t<CommandBeginSubmittingViews_t, 20, true>::CommandHelper_t(); // 162
		CommandBeginSubmittingViews_t::CommandBeginSubmittingViews_t(); // 3944
		CCommandStreamBuilder::AvailableCommandBufferSpace(); // 677
		CUtlMemoryPool<CCommandBufferChunk>::Alloc(); // 81
		operator new(size_t size); // 133
		Alloc(void); // 328
		AllocateChunk(void); // 690
		ThreadPause(void); // 208
		ThreadInterlockedAssignIf128(volatile int128* pDest,
						const int128& value,
						const int128& comparand);  // 478
		ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
							const InterlockedPointerX2SizedInt_t& value,
							const InterlockedPointerX2SizedInt_t& comperand);  // 203
		CTSListBase::Pop(); // 376
		{
		}
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
		CUtlMemory<CDependencyDescriptor::CUtlMemory(
				CDependencyDescriptor** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CDependencyDescriptor::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
						CDependencyDescriptor** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
		CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
		CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
					int growSize);  // 296
		{
		}
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
		CUtlMemory<CDependencyDescriptor::CUtlMemory(
				CDependencyDescriptor** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CDependencyDescriptor::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
						CDependencyDescriptor** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
		CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
		CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
					int growSize);  // 296
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 712
		CBufferString::CBufferString(); // 591
		CBufferStringN<64>::CBufferStringN(); // 296
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CRenderPipelineStats::CRenderPipelineStats(); // 296
		CCommandStream::CCommandStream(); // 341
		simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
		CTSPool<CCommandStream>::GetObject(); // 390
		CTSPool<CCommandStream>::Get(); // 645
		{
		}
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
		CUtlMemory<CDependencyDescriptor::CUtlMemory(
				CDependencyDescriptor** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CDependencyDescriptor::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
						CDependencyDescriptor** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
		CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
		CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
					int growSize);  // 296
		{
		}
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
		AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
		CUtlMemory<CDependencyDescriptor::CUtlMemory(
				CDependencyDescriptor** pMemory,
				int numElements,
				bool bGrowable,
				uint32 nGrowable_GrowSize);  // 197
		CUtlMemory<CDependencyDescriptor::EnsureCapacity(
				int num);  // 199
		CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
						CDependencyDescriptor** pFixedMemory,
						int nFixedElements,
						int nGrowSize,
						int nInitAllocationCount);  // 228
		AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
		CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
					int nGrowSize,
					int nInitSize);  // 527
		CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
		CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
				int growSize,
				int initCapacity);  // 484
		CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
					int growSize);  // 296
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 712
		CBufferString::CBufferString(); // 591
		CBufferStringN<64>::CBufferStringN(); // 296
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
		CRenderPipelineStats::CRenderPipelineStats(); // 296
		CCommandStream::CCommandStream(); // 1479
		Construct<CCommandStream>(CCommandStream* pMemory); // 646
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 649
		CCommandStreamBuilder::EnsureStream(); // 641
		CCommandStreamBuilder::EnsureStream(); // 695
		{
			CommandJump_t cmd; // 705
			CommandBase_t::CommandBase_t(
					int nOpCode,
					bool bSkipOnLostDevice,
					int nCmdSizeInBytes);  // 117
			CommandHelper_t<CommandJump_t, 1, false>::CommandHelper_t(); // 143
			CommandJump_t::CommandJump_t(); // 705
			CCommandStreamBuilder::Store<CommandJump_t>(
						CommandJump_t obj);  // 707
		}
		CCommandStreamBuilder::GrowForCapacity(
				int nNumBytes);  // 681
		CCommandStreamBuilder::EnsureCapacity(
				int nNumBytes);  // 530
		CCommandStreamBuilder::WriteCmd<CommandBeginSubmittingViews_t>(
							const CommandBeginSubmittingViews_t& obj);  // 3948
		CRenderContextPtr::Release(); // 845
		CRenderContextPtr::~CRenderContextPtr(); // 481
		CRenderContextVulkanPtr::~CRenderContextVulkanPtr(); // 3950
	}
	CRenderDeviceVulkan::BeginSubmittingDisplayLists(
					SwapChainHandle_t hSwapChain);  // 3937
} /* size: 1241, inline expansions: 9 (1143 bytes) */

// <00A2934C> vulkan/renderdevicevulkan.cpp:3937
// variables: 2
void CRenderDeviceVulkan::BeginSubmittingDisplayLists(SwapChainHandle_t hSwapChain)
{
	{
		CommandBeginSubmittingViews_t cmd; // 3944
		CRenderContextVulkanPtr pRenderContextVulkan; // 3947
	}
} /* size: 0 */

// <00A292B1> vulkan/renderdevicevulkan.cpp:3953
// variable: 1
void CRenderDeviceVulkan::Present(SwapChainHandle_t hSwapChain)
{
	bool bPreviousPresentCameBack; // 3955
} /* size: 47, variables: 1 */

// <00A291BD> vulkan/renderdevicevulkan.cpp:3963
// function calls: 2
void CRenderDeviceVulkan::GetPipelineFrameStats(CRenderPipelineFrameStats& frameStats)
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 3966
} /* size: 87, inline expansions: 2 (26 bytes) */

// <00A5E723> vulkan/renderdevicevulkan.cpp:3979
// function call: 1
void CRenderDeviceVulkan::ReleasePipelineFrameStats(CRenderPipelineFrameStats& frameStats)
{
	CRenderDeviceVulkan::ReleasePipelineFrameStats(
					CRenderPipelineFrameStats& frameStats);  // 3979
} /* size: 77, inline expansions: 1 (26 bytes) */

// <00A29197> vulkan/renderdevicevulkan.cpp:3979
void CRenderDeviceVulkan::ReleasePipelineFrameStats(CRenderPipelineFrameStats& frameStats)
{
} /* size: 0 */

// <00A28D85> vulkan/renderdevicevulkan.cpp:3992
// variables: 2
// function calls: 15
void CRenderDeviceVulkan::DestroyQueryPools()
{
	{
		int nIndex; // 3995
		{
			QueryPool_t* pQueryPool; // 3997
			CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::operator[](
					int i);  // 3997
		}
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Count(); // 3995
	}
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 3994
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::RemoveAll(); // 1798
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Purge(); // 903
	CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Purge(); // 1799
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Purge(); // 4001
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 4002
} /* size: 386, inline expansions: 12 (409 bytes) */

// <00A281D8> vulkan/renderdevicevulkan.cpp:4005
// variables: 9
// function calls: 40
void CRenderDeviceVulkan::AssignQueryObjectToPool(RenderQueryHandle_t hQueryObject)
{
	QueryObjectInternalVulkan_t* pQueryObjectInternal; // 4007
	CAutoLockT<CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThreadFastMutex>, CAutoLockMutexTrait<CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThreadFastMutex> > > generated_id_4009; // 4009
	QueryPool_t* pQueryPool; // 4010
	const char   __FUNCTION__; // 28970
	uint32 nSlot; // 4079
	{
		int nIndex; // 4011
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Count(); // 4011
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::operator[](
				int i);  // 4013
		CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
		CRenderDeviceBase::GetContextFrameCount(); // 4024
		CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
		CRenderDeviceBase::GetContextFrameCount(); // 4020
	}
	{
		QueryPool_t newQueryPool; // 4035
		VkQueryPoolCreateInfo queryPoolCreateInfo; // 4036
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 4062
		}
		CUtlString::CUtlString(); // 149
		CUtlString::Get(); // 151
		CUtlString::~CUtlString(); // 153
		_DOVK(VkResult result,
			const char* pCommand);  // 4066
		CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
		CRenderDeviceBase::GetContextFrameCount(); // 4068
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 4074
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::NumAllocated(); // 1196
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Base(); // 112
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Base(); // 368
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::ResetDbgInfo(); // 824
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::IsGrowable(); // 823
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::IsExternallyAllocated(); // 859
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::IsExternallyAllocated(); // 861
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::Grow(
			int num);  // 806
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::GrowMemory(
				int num);  // 1198
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Element(
			int i);  // 1201
		CopyConstruct<CRenderDeviceVulkan::QueryPool_t>(QueryPool_t* pMemory,
								const QueryPool_t& src);  // 1201
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::AddToTail(
				const QueryPool_t& src);  // 4075
		CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int>::operator[](
				int i);  // 630
		CUtlVectorBase<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >::Tail(); // 4076
	}
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThreadFas lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT(const CAutoLockT<CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, i this,
			const CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThr lock,
			const char* pFilename,
			int nLineNumber);  // 4009
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, int> >, CThreadFas lock,
		const char* pFileName,
		int nLineNumber);  // 983
	~CAutoLockT(const CAutoLockT<CUtlVectorMT<CUtlVector<CRenderDeviceVulkan::QueryPool_t, CUtlMemory<CRenderDeviceVulkan::QueryPool_t, i this); // 4093
} /* size: 0, variables: 5, inline expansions: 10 (455 bytes) */

// <00A2802F> vulkan/renderdevicevulkan.cpp:4095
// variables: 3
// function calls: 4
void CRenderDeviceVulkan::CreateQueryObject(RenderQueryType_t queryType)
{
	const char   __FUNCTION__; // 28813
	QueryObjectInternalVulkan_t* pQueryObjectInternal; // 4100
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 4097
	}
	CInterlockedIntT<int, 4>::CInterlockedIntT(); // 27
	QueryObjectInternalVulkan_t::QueryObjectInternalVulkan_t(); // 4100
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 4105
} /* size: 0, variables: 2, inline expansions: 4 (29 bytes) */

// <00A66181> vulkan/renderdevicevulkan.cpp:4113
// variables: 3
// function calls: 127
void CRenderDeviceVulkan::DeleteQueryObject(RenderQueryHandle_t hQueryObject)
{
	CRenderContextVulkanPtr pRenderContextVulkan; // 4119
	CommandDestroyQueryVulkan_t cmd; // 4120
	CommandBase_t::CommandBase_t(
			int nOpCode,
			bool bSkipOnLostDevice,
			int nCmdSizeInBytes);  // 117
	CommandHelper_t<CommandDestroyQueryVulkan_t, 13, true>::CommandHelper_t(); // 121
	CommandDestroyQueryVulkan_t::CommandDestroyQueryVulkan_t(); // 4120
	CCommandStreamBuilder::AvailableCommandBufferSpace(); // 677
	CUtlMemoryPool<CCommandBufferChunk>::Alloc(); // 81
	operator new(size_t size); // 133
	Alloc(void); // 328
	AllocateChunk(void); // 690
	ThreadPause(void); // 208
	ThreadInterlockedAssignIf128(volatile int128* pDest,
					const int128& value,
					const int128& comparand);  // 478
	ThreadInterlockedAssignIfPointerX2(volatile InterlockedPointerX2SizedInt_t* pDest,
						const InterlockedPointerX2SizedInt_t& value,
						const InterlockedPointerX2SizedInt_t& comperand);  // 203
	CTSListBase::Pop(); // 376
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 341
	simpleTSPoolStruct_t::simpleTSPoolStruct_t(); // 382
	CTSPool<CCommandStream>::GetObject(); // 390
	CTSPool<CCommandStream>::Get(); // 645
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	{
	}
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::AlignedByteArrayExplicit_t(); // 1597
	AlignedByteArray_t<16, CDependencyDescriptor::AlignedByteArray_t(); // 228
	CUtlMemory<CDependencyDescriptor::CUtlMemory(
			CDependencyDescriptor** pMemory,
			int numElements,
			bool bGrowable,
			uint32 nGrowable_GrowSize);  // 197
	CUtlMemory<CDependencyDescriptor::EnsureCapacity(
			int num);  // 199
	CUtlMemoryFixedGrowable_Base<CDependencyDescriptor::CUtlMemoryFixedGrowable_Base(
					CDependencyDescriptor** pFixedMemory,
					int nFixedElements,
					int nGrowSize,
					int nInitAllocationCount);  // 228
	AlignedByteArrayExplicit_t<16, CDependencyDescriptor::Base(); // 231
	CUtlMemoryFixedGrowable<CDependencyDescriptor::CUtlMemoryFixedGrowable(
				int nGrowSize,
				int nInitSize);  // 527
	CUtlVectorBase<CDependencyDescriptor::ResetDbgInfo(); // 530
	CUtlVectorBase<CDependencyDescriptor::CUtlVectorBase(
			int growSize,
			int initCapacity);  // 484
	CUtlVectorFixedGrowable<CDependencyDescriptor::CUtlVectorFixedGrowable(
				int growSize);  // 296
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 712
	CBufferString::CBufferString(); // 591
	CBufferStringN<64>::CBufferStringN(); // 296
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<short unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CBigEndianValue<unsigned int>::CBigEndianValue(); // 20
	CRenderPipelineStats::CRenderPipelineStats(); // 296
	CCommandStream::CCommandStream(); // 1479
	Construct<CCommandStream>(CCommandStream* pMemory); // 646
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 649
	CCommandStreamBuilder::EnsureStream(); // 641
	CCommandStreamBuilder::EnsureStream(); // 695
	{
		CommandJump_t cmd; // 705
		CommandBase_t::CommandBase_t(
				int nOpCode,
				bool bSkipOnLostDevice,
				int nCmdSizeInBytes);  // 117
		CommandHelper_t<CommandJump_t, 1, false>::CommandHelper_t(); // 143
		CommandJump_t::CommandJump_t(); // 705
		CCommandStreamBuilder::Store<CommandJump_t>(
					CommandJump_t obj);  // 707
	}
	CCommandStreamBuilder::GrowForCapacity(
			int nNumBytes);  // 681
	CCommandStreamBuilder::EnsureCapacity(
			int nNumBytes);  // 530
	CCommandStreamBuilder::WriteCmd<CommandDestroyQueryVulkan_t>(
						const CommandDestroyQueryVulkan_t& obj);  // 4122
	CRenderContextPtr::Release(); // 845
	CRenderContextPtr::~CRenderContextPtr(); // 481
	CRenderContextVulkanPtr::~CRenderContextVulkanPtr(); // 4123
	CRenderDeviceVulkan::DeleteQueryObject(
				RenderQueryHandle_t hQueryObject);  // 4113
} /* size: 1106, variables: 2, inline expansions: 123 (8775 bytes) */

// <00A27FBB> vulkan/renderdevicevulkan.cpp:4113
// variables: 2
void CRenderDeviceVulkan::DeleteQueryObject(RenderQueryHandle_t hQueryObject)
{
	CRenderContextVulkanPtr pRenderContextVulkan; // 4119
	CommandDestroyQueryVulkan_t cmd; // 4120
} /* size: 0, variables: 2 */

// <00A27DF2> vulkan/renderdevicevulkan.cpp:4129
// variables: 2
// function calls: 5
void CRenderDeviceVulkan::GetQueryData(RenderQueryHandle_t hQueryObject, uint64* pQueryData)
{
	QueryObjectInternalVulkan_t* pQueryObjectInternal; // 4136
	RenderQueryState_t state; // 4137
	CInterlockedIntT<int, 4>::operator()(const CInterlockedIntT<int, 4>* this); // 4137
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 4142
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 4153
} /* size: 179, variables: 2, inline expansions: 5 (172 bytes) */

// <00A27DC3> vulkan/renderdevicevulkan.cpp:4167
void CRenderDeviceVulkan::ForceDeviceLost()
{
} /* size: 5 */

// <00A27208> vulkan/renderdevicevulkan.cpp:4174
// variables: 12
// function calls: 33
void CRenderDeviceVulkan::PerFrameCleanup(SwapChainHandle_t hSwapchain)
{
	uint nHighestFrameCompletedGPU; // 4190
	const bool  bDefragEachFrame; // 4232
	bool bDefragThisFrame; // 4233
	int curLive; // 4247
	{
		RenderDefragFlags_t nDefragAlgorithm; // 4242
		ConVar::GetInt(); // 4242
		Clamp<RenderDefragFlags_t>(const RenderDefragFlags_t& val,
						const RenderDefragFlags_t& minVal,
						const RenderDefragFlags_t& maxVal);  // 4242
	}
	CTextureManagerBase::GetTextureManagerRWLock(); // 4176
	CInterlockedIntT<int, 4>::GetRaw(); // 3180
	ThreadInterlockedExchangeAdd(volatile int32* p,
					int32 value);  // 660
	CInterlockedIntT<unsigned int, 4>::AtomicAdd(
			unsigned int add);  // 3189
	CThreadRWLock_FastRead::LockForWrite(
			const char* pFileName,
			int nLineNumber);  // 4176
	{
		int i; // 591
		{
			HashBucket_t& bucket; // 593
		}
	}
	Commit(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 579
	Commit(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 4187
	{
		int i; // 591
		{
			HashBucket_t& bucket; // 593
		}
	}
	Commit(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 579
	Commit(const CUtlTSHashBase<CSamplerStateBinding, 1024, CSamplerStateDesc, CUtlTSHashUseKeyHashMethod<CSamplerStateDesc>, CThrea this); // 4188
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 484
	CMemoryManagerVulkan::GetHighestFrameCompletedOnGPU(); // 4190
	CInterlockedIntT<int, 4>::operator int(); // 594
	CRenderDeviceBase::IsAsyncPresentEnabled(); // 161
	{
	}
	CUtlVectorBase<CRenderResource::Count(); // 166
	{
		int i; // 167
		{
			CRenderResource* pRenderResource; // 169
			CUtlMemory<CRenderResource::operator[](
					int i);  // 588
			CUtlVectorBase<CRenderResource::operator[](
					int i);  // 169
			CRenderResource::IsInUse(
				uint nCompletedFrameNumber);  // 170
			CUtlMemory<CRenderResource::operator[](
					int i);  // 602
			CUtlVectorBase<CRenderResource::Element(
				int i);  // 1575
			{
				const bool  bNotLast; // 1578
				CUtlMemory<CRenderResource::operator[](
						int i);  // 602
				CUtlVectorBase<CRenderResource::Element(
					int i);  // 1584
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1584
			}
			Destruct<CRenderResource*>(CRenderResource** pMemory); // 1575
			CUtlVectorBase<CRenderResource::FastRemove(
					int elem);  // 174
		}
	}
	CRenderResourceMgr::PerformQueuedDeletions(
				uint nFinishedFrameNumber);  // 4192
	CRenderDeviceVulkan::CommitInputLayoutChanges(); // 4201
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
	CRenderDeviceBase::GetContextFrameCount(); // 4219
	CInterlockedIntT<int, 4>::operator int(); // 4247
	CTextureManagerBase::GetTextureManagerRWLock(); // 4249
} /* size: 0, variables: 4, inline expansions: 20 (851 bytes) */

// <00A27187> vulkan/renderdevicevulkan.cpp:4273
void CRenderDeviceVulkan::UpdateStats()
{
} /* size: 50 */

// <00A25966> vulkan/renderdevicevulkan.cpp:4285
// variables: 8
// function calls: 112
void CRenderDeviceVulkan::PerformQueuedTextureDeletions(bool bForce)
{
	uint nHighestFrameCompletedGPU; // 4287
	{
		int i; // 4290
		{
			uint nFrameNumber; // 4292
			{
				int j; // 4295
				{
					VulkanTextureReleaseResources_t* pTextureResources; // 4297
					CVulkanTextureObjectToDelete* pVulkanObjectToDelete; // 4302
					CUtlMemory<float, int>::Base(); // 112
					CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 368
					CUtlVectorBase<float, CUtlMemory<float, int> >::ResetDbgInfo(); // 824
					CUtlVectorBase<float, CUtlMemory<float, int> >::GrowMemory(
							int num);  // 784
					CUtlVectorBase<float, CUtlMemory<float, int> >::GrowVector(
							int num);  // 1445
					CUtlVectorBase<float, CUtlMemory<float, int> >::InsertMultipleBefore(
								int elem,
								int num);  // 1437
					CUtlVectorBase<float, CUtlMemory<float, int> >::InsertMultipleBefore(
								int elem,
								int num);  // 1294
					CUtlVectorBase<float, CUtlMemory<float, int> >::AddMultipleToTail(
								int num);  // 1319
					CUtlVectorBase<float, CUtlMemory<float, int> >::SetCount(
						int count);  // 573
					CUtlMemory<float, int>::Base(); // 113
					CUtlVectorBase<float, CUtlMemory<float, int> >::Base(); // 105
					CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 105
					CUtlVectorBase<float, CUtlMemory<float, int> >::end(); // 574
					memcpy(void* __dest,
						const void* __src,
						size_t __len);  // 85
					V_memcpy(void* dest,
						const void* src,
						ptrdiff_t count);  // 180
					UtlTraitsCopyRange<TextureCreationExtraData_t>(const TextureCreationExtraData_t* pFrom,
											const TextureCreationExtraData_t* pFromEnd,
											TextureCreationExtraData_t* pTo);  // 173
					UtlTraitsCopyRange<float>(const float* pFrom,
									const float* pFromEnd,
									float* pTo);  // 574
					CUtlVectorBase<float, CUtlMemory<float, int> >::Count(); // 573
					CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
							const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 565
					CUtlVectorBase<float, CUtlMemory<float, int> >::operator=(
							const CUtlVectorBase<float, CUtlMemory<float, int> >& other);  // 452
					CUtlVector<float, CUtlMemory<float, int> >::operator=(
							const CUtlVector<float, CUtlMemory<float, int> >& src);  // 434
					CUtlMemory<float, int>::ValidateGrowSize(); // 475
					CUtlMemory<float, int>::CUtlMemory(
							int nGrowSize,
							int nInitAllocationCount);  // 527
					CUtlVectorBase<float, CUtlMemory<float, int> >::ResetDbgInfo(); // 530
					CUtlVectorBase<float, CUtlMemory<float, int> >::CUtlVectorBase(
							int growSize,
							int initCapacity);  // 434
					CUtlVector<float, CUtlMemory<float, int> >::CUtlVector(
							const CUtlVector<float, CUtlMemory<float, int> >& src);  // 38
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 573
					CUtlMemory<unsigned int, int>::Base(); // 112
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 102
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::begin(); // 574
					CUtlMemory<unsigned int, int>::Base(); // 113
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 105
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 105
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::end(); // 574
					memcpy(void* __dest,
						const void* __src,
						size_t __len);  // 85
					V_memcpy(void* dest,
						const void* src,
						ptrdiff_t count);  // 180
					UtlTraitsCopyRange<TextureCreationExtraData_t>(const TextureCreationExtraData_t* pFrom,
											const TextureCreationExtraData_t* pFromEnd,
											TextureCreationExtraData_t* pTo);  // 173
					UtlTraitsCopyRange<unsigned int>(const unsigned int* pFrom,
									const unsigned int* pFromEnd,
									unsigned int* pTo);  // 574
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
							const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 565
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
							const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 452
					CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
							const CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& src);  // 434
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 530
					CUtlMemory<unsigned int, int>::ValidateGrowSize(); // 475
					CUtlMemory<unsigned int, int>::CUtlMemory(
							int nGrowSize,
							int nInitAllocationCount);  // 527
					CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVectorBase(
							int growSize,
							int initCapacity);  // 434
					CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::CUtlVector(
							const CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& src);  // 38
					CTextureDesc::operator=(
							const CTextureDesc& rhs);  // 147
					CTextureDesc::CTextureDesc(
							const CTextureDesc& rhs);  // 38
					TextureSpecification_t::TextureSpecification_t(
								const TextureSpecification_t  &);  // 508
					CRefCountServiceBase<true, CRefMT>::CRefCountServiceBase(); // 325
					CRefCounted<CRefCountServiceBase<true, CRefMT> >::CRefCounted(); // 508
					CVulkanTextureObjectToDelete::CVulkanTextureObjectToDelete(
									CVulkanImage* pVulkanImage,
									VulkanImageViews_t* pImageViews,
									const TextureSpecification_t* pSpec);  // 4302
					CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::operator[](
							int i);  // 588
					operator[](const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureR this,
							int i);  // 4297
				}
				CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::operator[](
						int i);  // 588
				operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
						int i);  // 4295
				Count(const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTe this); // 4295
			}
			{
				int i; // 1721
				CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureR this,
					int i);  // 1723
				CUtlVectorBase<float, CUtlMemory<float, int> >::RemoveAll(); // 1798
				CUtlMemory<float, int>::IsExternallyAllocated(); // 905
				CUtlMemory<float, int>::Purge(); // 903
				CUtlMemory<float, int>::Purge(); // 1799
				CUtlVectorBase<float, CUtlMemory<float, int> >::Purge(); // 560
				ValidateAlignment<float>(void); // 508
				CUtlMemory<float, int>::Purge(); // 510
				CUtlMemory<float, int>::~CUtlMemory(); // 562
				CUtlVectorBase<float, CUtlMemory<float, int> >::~CUtlVectorBase(); // 410
				CUtlVector<float, CUtlMemory<float, int> >::~CUtlVector(); // 52
				CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
				CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
				CUtlMemory<unsigned int, int>::Purge(); // 903
				CUtlMemory<unsigned int, int>::Purge(); // 1799
				CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
				ValidateAlignment<unsigned int>(void); // 508
				CUtlMemory<unsigned int, int>::Purge(); // 510
				CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
				CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
				CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 52
				TextureSpecification_t::~TextureSpecification_t(); // 873
				VulkanTextureReleaseResources_t::~VulkanTextureReleaseResources_t(); // 1526
				Destruct<CRenderDeviceVulkan::VulkanTextureReleaseResources_t>(VulkanTextureReleaseResources_t* pMemory); // 1723
			}
			RemoveAll(const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureR this); // 1798
			CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::IsExternallyAllocated(); // 905
			CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::Purge(); // 903
			CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::Purge(); // 1799
			Purge(const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureR this); // 560
			ValidateAlignment<CRenderDeviceVulkan::VulkanTextureReleaseResources_t>(void); // 508
			CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::Purge(); // 510
			CUtlMemory<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, int>::~CUtlMemory(); // 562
			~CUtlVectorBase(const CUtlVectorBase<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureR this); // 410
			~CUtlVector(const CUtlVector<CRenderDeviceVulkan::VulkanTextureReleaseResources_t, CUtlMemory<CRenderDeviceVulkan::VulkanTextureRelea this); // 884
			FencedVulkanTextureRelease_t::~FencedVulkanTextureRelease_t(); // 1526
			Destruct<CRenderDeviceVulkan::FencedVulkanTextureRelease_t>(FencedVulkanTextureRelease_t* pMemory); // 1575
			{
				const bool  bNotLast; // 1578
				CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
					int i);  // 1584
				CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::operator[](
						int i);  // 602
				Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
					int i);  // 1584
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 91
				V_memcpy(void* dest,
					const void* src,
					size_t count);  // 1584
			}
			FastRemove(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
					int elem);  // 4306
			CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, int>::operator[](
					int i);  // 588
			operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulkanTextu this,
					int i);  // 4292
		}
		Count(const CUtlVectorBase<CRenderDeviceVulkan::FencedVulkanTextureRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVulka this); // 4290
	}
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 484
	CMemoryManagerVulkan::GetHighestFrameCompletedOnGPU(); // 4287
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 4289
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 4309
} /* size: 1404, variables: 1, inline expansions: 8 (217 bytes) */

// <00A2581F> vulkan/renderdevicevulkan.cpp:4314
// function calls: 5
void CRenderDeviceVulkan::MarkResourceUsed(RenderResourceHandle_t hResource)
{
	CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
	CRenderDeviceBase::GetContextFrameCount(); // 4316
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 80
	CRenderResource::MarkUsed(
		uint nFrameNumber);  // 155
	CRenderResourceMgr::MarkUsed(
		RenderResourceHandle_t hResource,
		int nFrameCount);  // 4316
} /* size: 34, inline expansions: 5 (64 bytes) */

// <00A5F471> vulkan/renderdevicevulkan.cpp:4320
// variable: 1
// function calls: 2
void CRenderDeviceVulkan::SetHardwareGammaRamp(SwapChainHandle_t hSwapChain, float fGamma, float fGammaTVRangeMin, float fGammaTVRangeMax, float fGammaTVExponent, bool bTVEnabled)
{
	const CSwapChainVulkan* pSwapChain; // 4322
	CRenderDeviceBase::GetSwapChain<CSwapChainVulkan>(
					SwapChainHandle_t hSwapChain);  // 4322
	CRenderDeviceVulkan::SetHardwareGammaRamp(
				SwapChainHandle_t hSwapChain,
				float fGamma,
				float fGammaTVRangeMin,
				float fGammaTVRangeMax,
				float fGammaTVExponent,
				bool bTVEnabled);  // 4320
} /* size: 77, variables: 1, inline expansions: 2 (56 bytes) */

// <00A257AB> vulkan/renderdevicevulkan.cpp:4320
// variable: 1
void CRenderDeviceVulkan::SetHardwareGammaRamp(SwapChainHandle_t hSwapChain, float fGamma, float fGammaTVRangeMin, float fGammaTVRangeMax, float fGammaTVExponent, bool bTVEnabled)
{
	const CSwapChainVulkan* pSwapChain; // 4322
} /* size: 0, variables: 1 */

// <009A198A> vulkan/renderdevicevulkan.cpp:4334
// member functions: 12
// member variables: 3
// vtable entries: 2
// class size: 112
class CVfxShaderFileRenderShaderBuffer : public IRenderShaderByteCode {
public:
	/* class IRenderShaderByteCode <ancestor>; */ /* 0 8 */
private:
	/* vulkan/renderdevicevulkan.cpp:4336 */
	void CVfxShaderFileRenderShaderBuffer(CVfxShaderFileRenderShaderBuffer* , const CVfxShaderFileRenderShaderBuffer& );
	/* vulkan/renderdevicevulkan.cpp:4337 */
	CVfxShaderFileRenderShaderBuffer& operator=(CVfxShaderFileRenderShaderBuffer* , const CVfxShaderFileRenderShaderBuffer& );
	/* vulkan/renderdevicevulkan.cpp:4340 */
	void CVfxShaderFileRenderShaderBuffer(CVfxShaderFileRenderShaderBuffer* , const char* , uint32);
	/* vulkan/renderdevicevulkan.cpp:4346 */
	virtual void ~CVfxShaderFileRenderShaderBuffer(CVfxShaderFileRenderShaderBuffer* );
	/* vulkan/renderdevicevulkan.cpp:4348 */
	virtual uint32 GetSize(const CVfxShaderFileRenderShaderBuffer* );
	/* vulkan/renderdevicevulkan.cpp:4350 */
	virtual const void* GetBits(const CVfxShaderFileRenderShaderBuffer* );
	CVfxShaderFile m_ShaderFile; /* 8 0 */
	CUtlBuffer m_SerializedBuffer; /* 32 80 */
	void CVfxShaderFileRenderShaderBuffer(class CVfxShaderFileRenderShaderBuffer *, const class CVfxShaderFileRenderShaderBuffer  &); /* linkage=_ZN32CVfxShaderFileRenderShaderBufferC4ERKS_ */
	class CVfxShaderFileRenderShaderBuffer & operator=(class CVfxShaderFileRenderShaderBuffer *, const class CVfxShaderFileRenderShaderBuffer  &); /* linkage=_ZN32CVfxShaderFileRenderShaderBufferaSERKS_ */
	void CVfxShaderFileRenderShaderBuffer(class CVfxShaderFileRenderShaderBuffer *, const char  *, uint32); /* linkage=_ZN32CVfxShaderFileRenderShaderBufferC4EPKcj */
	virtual void ~CVfxShaderFileRenderShaderBuffer(class CVfxShaderFileRenderShaderBuffer *); /* linkage=_ZN32CVfxShaderFileRenderShaderBufferD4Ev */
	virtual uint32 GetSize(const class CVfxShaderFileRenderShaderBuffer  *); /* linkage=_ZNK32CVfxShaderFileRenderShaderBuffer7GetSizeEv */
	virtual const void  * GetBits(const class CVfxShaderFileRenderShaderBuffer  *); /* linkage=_ZNK32CVfxShaderFileRenderShaderBuffer7GetBitsEv */
};

// <00A25722> vulkan/renderdevicevulkan.cpp:4340
void CVfxShaderFileRenderShaderBuffer::CVfxShaderFileRenderShaderBuffer(const char* pShaderSource, uint32 nSizeInBytes)
{
} /* size: 0 */

// <00A256EF> vulkan/renderdevicevulkan.cpp:4340
inline void CVfxShaderFileRenderShaderBuffer::CVfxShaderFileRenderShaderBuffer(const char* pShaderSource, uint32 nSizeInBytes)
{
} /* size: 0 */

// <00A25585> vulkan/renderdevicevulkan.cpp:4346
// function calls: 6
void CVfxShaderFileRenderShaderBuffer::~CVfxShaderFileRenderShaderBuffer()
{
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 4346
} /* size: 81, inline expansions: 6 (99 bytes) */

// <00A253B6> vulkan/renderdevicevulkan.cpp:4346
// function calls: 8
void CVfxShaderFileRenderShaderBuffer::~CVfxShaderFileRenderShaderBuffer()
{
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 4346
	IRenderShaderByteCode::~IRenderShaderByteCode(); // 4346
	CVfxShaderFileRenderShaderBuffer::~CVfxShaderFileRenderShaderBuffer(); // 4346
} /* size: 76, inline expansions: 8 (125 bytes) */

// <00A2539D> vulkan/renderdevicevulkan.cpp:4346
inline void CVfxShaderFileRenderShaderBuffer::~CVfxShaderFileRenderShaderBuffer()
{
} /* size: 0 */

// <00A2533D> vulkan/renderdevicevulkan.cpp:4348
// function call: 1
void CVfxShaderFileRenderShaderBuffer::GetSize()
{
	CUtlBuffer::TellPut(); // 4348
} /* size: 8, inline expansions: 1 (0 bytes) */

// <00A252A7> vulkan/renderdevicevulkan.cpp:4350
// function calls: 2
const void* CVfxShaderFileRenderShaderBuffer::GetBits()
{
	CUtlMemory<unsigned char, int>::Base(); // 1479
	CUtlBuffer::Base(); // 4350
} /* size: 9, inline expansions: 2 (0 bytes) */

// <00A71285> vulkan/renderdevicevulkan.cpp:4356
// function calls: 11
void CRenderDeviceVulkan::CompileShader(const char* pProgram, uint32 nBufLen, const char* pShaderVersion)
{
	IRenderShaderByteCode::IRenderShaderByteCode(); // 4341
	CVfxShaderFileRenderShaderBuffer::CVfxShaderFileRenderShaderBuffer(
					const char* pShaderSource,
					uint32 nSizeInBytes);  // 4359
	_Head_base<1, std::default_delete<IRenderShaderByteCode>, true>::_Head_base(); // 561
	_Tuple_impl<1, std::default_delete<IRenderShaderByteCode> >::_Tuple_impl(); // 303
	_Head_base<0, IRenderShaderByteCode::_Head_base(); // 303
	_Tuple_impl<0, IRenderShaderByteCode::_Tuple_impl(); // 966
	tuple<IRenderShaderByteCode::tuple(); // 169
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 169
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::__uniq_ptr_impl(
			pointer __p);  // 234
	__uniq_ptr_data<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode>, true, true>::__uniq_ptr_data(
			pointer);  // 311
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::unique_ptr<>(
			pointer __p);  // 4359
} /* size: 129, inline expansions: 11 (75 bytes) */

// <00A25267> vulkan/renderdevicevulkan.cpp:4356
void CRenderDeviceVulkan::CompileShader(const char* pProgram, uint32 nBufLen, const char* pShaderVersion)
{
} /* size: 0 */

// <00A24AA5> vulkan/renderdevicevulkan.cpp:4366
// variables: 5
// function calls: 22
void CRenderDeviceVulkan::CreateGenericShader(VkShaderStageFlagBits shaderStage, IRenderShaderByteCode* pShaderBuffer, const char* pDebugName)
{
	bool bIsSPIRV; // 4368
	UtlHashHandle_t hShaderFile; // 4369
	{
		BaseShaderIndex_t nIndex; // 4372
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4375; // 4375
			CThreadMutex::Lock(
				const char* pFileName,
				int nLineNumber);  // 943
			Lock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
					const CThreadMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 4375
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 81
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::HeaderToBlock(
					const BlockHeader_t* pHeader);  // 131
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsInBlock(
					intp i,
					BlockHeader_t* pBlockHeader);  // 85
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 82
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::GetIndex(
				const Iterator_t& it);  // 86
			{
				BlockHeader_t* pbh; // 88
				CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::HeaderToBlock(
						const BlockHeader_t* pHeader);  // 131
				CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsInBlock(
						intp i,
						BlockHeader_t* pBlockHeader);  // 90
			}
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsIdxAfter(
					intp i,
					const Iterator_t& it);  // 591
			IsValidIndex(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CSh this,
					long long int i);  // 977
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::operator[](
					intp i);  // 367
			InternalElement(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
					long long int i);  // 1011
			{
			}
			LinkBefore(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
					long long int before,
					long long int elem);  // 771
			Element(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
				long long int i);  // 774
			Construct<CShaderVulkanBase>(CShaderVulkanBase* pMemory); // 774
			InsertBefore(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
					long long int before);  // 805
			AddToTail(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this); // 4376
			CThreadMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 4377
		}
	}
} /* size: 0, variables: 2 */

// <00A6A3B3> vulkan/renderdevicevulkan.cpp:4398
// variables: 2
// function calls: 3
void CRenderDeviceVulkan::DestroyGenericShader(RenderShaderHandle_t hShader)
{
	BaseShaderIndex_t i; // 4403
	bool bDeferDeletion; // 4404
	CRenderDeviceVulkan::EXTGraphicsPipelineLibraryEnabled(); // 4406
	operator[](const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
			long long int i);  // 4408
	CRenderDeviceVulkan::DestroyGenericShader(
				RenderShaderHandle_t hShader);  // 4398
} /* size: 0, variables: 2, inline expansions: 3 (0 bytes) */

// <00A24A67> vulkan/renderdevicevulkan.cpp:4398
// variables: 2
void CRenderDeviceVulkan::DestroyGenericShader(RenderShaderHandle_t hShader)
{
	BaseShaderIndex_t i; // 4403
	bool bDeferDeletion; // 4404
} /* size: 0, variables: 2 */

// <00A69C1B> vulkan/renderdevicevulkan.cpp:4418
// variables: 3
// function calls: 23
void CRenderDeviceVulkan::DeleteGenericShader(RenderShaderHandle_t hShader, bool bForceDeleteNow)
{
	CRenderDeviceVulkan::EXTGraphicsPipelineLibraryEnabled(); // 4420
	CAsyncCompileHelperVulkan::BEnabled(); // 4420
	{
		BaseShaderIndex_t i; // 4422
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4424; // 4424
			CThreadMutex::Lock(
				const char* pFileName,
				int nLineNumber);  // 943
			Lock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
					const CThreadMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 4424
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 81
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 82
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::HeaderToBlock(
					const BlockHeader_t* pHeader);  // 131
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsInBlock(
					intp i,
					BlockHeader_t* pBlockHeader);  // 85
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::GetIndex(
				const Iterator_t& it);  // 86
			{
				BlockHeader_t* pbh; // 88
				CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::HeaderToBlock(
						const BlockHeader_t* pHeader);  // 131
				CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsInBlock(
						intp i,
						BlockHeader_t* pBlockHeader);  // 90
			}
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::IsIdxAfter(
					intp i,
					const Iterator_t& it);  // 591
			IsValidIndex(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CSh this,
					long long int i);  // 749
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CShaderVulkanBase, long long int> >::operator[](
					intp i);  // 367
			InternalElement(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
					long long int i);  // 752
			Destruct<CShaderVulkanBase>(CShaderVulkanBase* pMemory); // 753
			{
			}
			Free(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
				long long int elem);  // 907
			Remove(const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
				long long int elem);  // 4425
			CThreadMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 4426
		}
	}
	CRenderDeviceVulkan::DeleteGenericShader(
				RenderShaderHandle_t hShader,
				bool bForceDeleteNow);  // 4418
} /* size: 0, inline expansions: 3 (16 bytes) */

// <00A24A18> vulkan/renderdevicevulkan.cpp:4418
// variables: 2
void CRenderDeviceVulkan::DeleteGenericShader(RenderShaderHandle_t hShader, bool bForceDeleteNow)
{
	{
		BaseShaderIndex_t i; // 4422
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4424; // 4424
		}
	}
} /* size: 0 */

// <00A243F4> vulkan/renderdevicevulkan.cpp:4435
// variables: 4
// function calls: 16
void CRenderDeviceVulkan::CreateMemoryPooledGPUBuffer(IBufferMovedListener* pMoveListener, const BufferDesc_t& desc, VulkanMemoryPoolType_t nMemoryPool, CRenderContextVulkan* pContext, void* pInitialData)
{
	CVertexBufferVulkan* pBuffer; // 4437
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_4446; // 4446
	VertexBufferHandle_t hBuffer; // 4448
	LockDesc_t lockDesc; // 4450
	ThreadInterlockedAssignIf64(volatile int64* pDest,
					int64 value,
					int64 comparand);  // 800
	CThreadFastMutex::TryLockInline(
			const char* pFileName,
			int nLineNumber,
			const ThreadId_t  threadId);  // 837
	ThreadPause(void); // 839
	CThreadFastMutex::Lock(
		const char* pFileName,
		int nLineNumber,
		unsigned int nSpinSleepTime);  // 943
	Lock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 978
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
			const CThreadFastMutex& lock,
			const char* pFilename,
			int nLineNumber);  // 4446
	AddToDHead<CVertexBufferBase>(CVertexBufferBase *& head,
					CVertexBufferBase* which);  // 1186
	CUtlIntrusiveDList<CVertexBufferBase>::AddToHead(
			CVertexBufferBase* node);  // 4447
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 75
	V_memcpy(void* dest,
		const void* src,
		int count);  // 4455
	ThreadInterlockedExchange64(volatile int64* p,
					int64 value);  // 874
	CThreadFastMutex::Unlock(
		const char* pFileName,
		int nLineNumber);  // 944
	Unlock(CThreadFastMutex& lock,
		const char* pFileName,
		int nLineNumber);  // 983
	CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 4465
	memset(void* __dest,
		int __ch,
		size_t __len);  // 51
	V_memset(void* dest,
		int fill,
		int count);  // 4459
} /* size: 414, variables: 4, inline expansions: 16 (538 bytes) */

// <00A24399> vulkan/renderdevicevulkan.cpp:4468
void CRenderDeviceVulkan::ReserveAccelStructBuildScratchSize(int nSize)
{
} /* size: 81 */

// <00A23D1A> vulkan/renderdevicevulkan.cpp:4479
// variables: 4
// function calls: 18
void CRenderDeviceVulkan::AccelStructBuildScratchBuffer()
{
	{
		_DebuggerBreakInlineExpressionWrapper(void); // 4481
	}
	{
		BufferDesc_t desc; // 4489
		CVertexBufferVulkan* pScratchBuf; // 4495
		{
			{
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> > generated_id_4504; // 4504
				ThreadInterlockedAssignIf64(volatile int64* pDest,
								int64 value,
								int64 comparand);  // 800
				CThreadFastMutex::TryLockInline(
						const char* pFileName,
						int nLineNumber,
						const ThreadId_t  threadId);  // 837
				ThreadPause(void); // 839
				CThreadFastMutex::Lock(
					const char* pFileName,
					int nLineNumber,
					unsigned int nSpinSleepTime);  // 943
				Lock(CThreadFastMutex& lock,
					const char* pFileName,
					int nLineNumber);  // 978
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::CAutoLockT(
						const CThreadFastMutex& lock,
						const char* pFilename,
						int nLineNumber);  // 4504
				AddToDHead<CVertexBufferBase>(CVertexBufferBase *& head,
								CVertexBufferBase* which);  // 1186
				CUtlIntrusiveDList<CVertexBufferBase>::AddToHead(
						CVertexBufferBase* node);  // 4505
				ThreadInterlockedExchange64(volatile int64* p,
								int64 value);  // 874
				CThreadFastMutex::Unlock(
					const char* pFileName,
					int nLineNumber);  // 944
				Unlock(CThreadFastMutex& lock,
					const char* pFileName,
					int nLineNumber);  // 983
				CAutoLockT<CThreadFastMutex, CAutoLockMutexTrait<CThreadFastMutex> >::~CAutoLockT(); // 4507
			}
			_DebuggerBreakInlineExpressionWrapper(void); // 4501
		}
	}
	{
		CVertexBufferVulkan* pVertexBuffer; // 4516
		CInterlockedIntT<unsigned int, 4>::GetRaw(); // 1069
		CRenderDeviceBase::GetContextFrameCount(); // 4521
		Max<unsigned int>(const unsigned int& val1,
					const unsigned int& val2);  // 80
		CRenderResource::MarkUsed(
			uint nFrameNumber);  // 4521
	}
} /* size: 0 */

// <00A2342A> vulkan/renderdevicevulkan.cpp:4531
// variables: 5
// function calls: 29
void CRenderDeviceVulkan::CreateVertexShader(unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> > pShaderBuffer, const char* pDebugName)
{
	bool bIsSPIRV; // 4533
	UtlHashHandle_t hShaderFile; // 4534
	{
		VertexShaderIndex_t nIndex; // 4537
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4539; // 4539
			CThreadMutex::Lock(
				const char* pFileName,
				int nLineNumber);  // 943
			Lock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
					const CThreadMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 4539
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 81
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::HeaderToBlock(
					const BlockHeader_t* pHeader);  // 131
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsInBlock(
					intp i,
					BlockHeader_t* pBlockHeader);  // 85
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 82
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::GetIndex(
				const Iterator_t& it);  // 86
			{
				BlockHeader_t* pbh; // 88
				CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::HeaderToBlock(
						const BlockHeader_t* pHeader);  // 131
				CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsInBlock(
						intp i,
						BlockHeader_t* pBlockHeader);  // 90
			}
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsIdxAfter(
					intp i,
					const Iterator_t& it);  // 591
			IsValidIndex(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<C this,
					long long int i);  // 977
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::operator[](
					intp i);  // 367
			InternalElement(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
					long long int i);  // 1011
			{
			}
			LinkBefore(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
					long long int before,
					long long int elem);  // 771
			CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 530
			CUtlMemory<int, int>::ValidateGrowSize(); // 475
			CUtlMemory<int, int>::CUtlMemory(
					int nGrowSize,
					int nInitAllocationCount);  // 527
			CUtlVectorBase<int, CUtlMemory<int, int> >::CUtlVectorBase(
					int growSize,
					int initCapacity);  // 418
			CUtlVector<int, CUtlMemory<int, int> >::CUtlVector(); // 8081
			CVertexShaderVulkan::CVertexShaderVulkan(); // 1479
			Construct<CVertexShaderVulkan>(CVertexShaderVulkan* pMemory); // 774
			InsertBefore(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
					long long int before);  // 805
			AddToTail(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this); // 4540
			CThreadMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 4541
		}
	}
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 472
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::get(); // 4534
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <00A6ACCA> vulkan/renderdevicevulkan.cpp:4557
// variables: 2
// function calls: 3
void CRenderDeviceVulkan::DestroyVertexShader(RenderShaderHandle_t hShader)
{
	VertexShaderIndex_t i; // 4562
	bool bDeferDeletion; // 4563
	CRenderDeviceVulkan::EXTGraphicsPipelineLibraryEnabled(); // 4565
	operator[](const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
			long long int i);  // 4567
	CRenderDeviceVulkan::DestroyVertexShader(
				RenderShaderHandle_t hShader);  // 4557
} /* size: 97, variables: 2, inline expansions: 3 (24 bytes) */

// <00A233EC> vulkan/renderdevicevulkan.cpp:4557
// variables: 2
void CRenderDeviceVulkan::DestroyVertexShader(RenderShaderHandle_t hShader)
{
	VertexShaderIndex_t i; // 4562
	bool bDeferDeletion; // 4563
} /* size: 0, variables: 2 */

// <00A6A532> vulkan/renderdevicevulkan.cpp:4577
// variables: 3
// function calls: 23
void CRenderDeviceVulkan::DeleteVertexShader(RenderShaderHandle_t hShader, bool bForceDeleteNow)
{
	CRenderDeviceVulkan::EXTGraphicsPipelineLibraryEnabled(); // 4579
	CAsyncCompileHelperVulkan::BEnabled(); // 4579
	{
		BaseShaderIndex_t i; // 4581
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4583; // 4583
			CThreadMutex::Lock(
				const char* pFileName,
				int nLineNumber);  // 943
			Lock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 978
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::CAutoLockT(
					const CThreadMutex& lock,
					const char* pFilename,
					int nLineNumber);  // 4583
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 81
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsValidIterator(
					const Iterator_t& it);  // 82
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::HeaderToBlock(
					const BlockHeader_t* pHeader);  // 131
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsInBlock(
					intp i,
					BlockHeader_t* pBlockHeader);  // 85
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::GetIndex(
				const Iterator_t& it);  // 86
			{
				BlockHeader_t* pbh; // 88
				CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::HeaderToBlock(
						const BlockHeader_t* pHeader);  // 131
				CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsInBlock(
						intp i,
						BlockHeader_t* pBlockHeader);  // 90
			}
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::IsIdxAfter(
					intp i,
					const Iterator_t& it);  // 591
			IsValidIndex(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<C this,
					long long int i);  // 749
			{
			}
			CUtlFixedMemory<UtlLinkedListElem_t<CVertexShaderVulkan, long long int> >::operator[](
					intp i);  // 367
			InternalElement(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
					long long int i);  // 752
			Destruct<CVertexShaderVulkan>(CVertexShaderVulkan* pMemory); // 753
			{
			}
			Free(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
				long long int elem);  // 907
			Remove(const CUtlLinkedList<CVertexShaderVulkan, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CVertex this,
				long long int elem);  // 4584
			CThreadMutex::Unlock(
				const char* pFileName,
				int nLineNumber);  // 944
			Unlock(CThreadMutex& lock,
				const char* pFileName,
				int nLineNumber);  // 983
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> >::~CAutoLockT(); // 4585
		}
	}
	CRenderDeviceVulkan::DeleteVertexShader(
				RenderShaderHandle_t hShader,
				bool bForceDeleteNow);  // 4577
} /* size: 0, inline expansions: 3 (24 bytes) */

// <00A2339D> vulkan/renderdevicevulkan.cpp:4577
// variables: 2
void CRenderDeviceVulkan::DeleteVertexShader(RenderShaderHandle_t hShader, bool bForceDeleteNow)
{
	{
		BaseShaderIndex_t i; // 4581
		{
			CAutoLockT<CThreadMutex, CAutoLockMutexTrait<CThreadMutex> > generated_id_4583; // 4583
		}
	}
} /* size: 0 */

// <00A232B7> vulkan/renderdevicevulkan.cpp:4594
// function calls: 2
void CRenderDeviceVulkan::CreateGeometryShader(unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> > pShaderBuffer, const char* pDebugName)
{
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 472
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::get(); // 4596
} /* size: 20, inline expansions: 2 (0 bytes) */

// <00A230FA> vulkan/renderdevicevulkan.cpp:4599
// function calls: 4
void CRenderDeviceVulkan::DestroyGeometryShader(RenderShaderHandle_t hShader)
{
	CRenderDeviceVulkan::EXTGraphicsPipelineLibraryEnabled(); // 4406
	operator[](const CUtlLinkedList<CShaderVulkanBase, long long int, true, long long int, CUtlFixedMemory<UtlLinkedListElem_t<CShaderVu this,
			long long int i);  // 4408
	CRenderDeviceVulkan::DestroyGenericShader(
				RenderShaderHandle_t hShader);  // 4398
	CRenderDeviceVulkan::DestroyGenericShader(
				RenderShaderHandle_t hShader);  // 4601
} /* size: 97, inline expansions: 4 (100 bytes) */

// <00A23013> vulkan/renderdevicevulkan.cpp:4604
// function calls: 2
void CRenderDeviceVulkan::CreateComputeShader(unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> > pShaderBuffer, const char* pDebugName)
{
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 472
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::get(); // 4606
} /* size: 20, inline expansions: 2 (0 bytes) */

// <00A22FED> vulkan/renderdevicevulkan.cpp:4609
void CRenderDeviceVulkan::DestroyComputeShader(RenderShaderHandle_t hShader)
{
} /* size: 0 */

// <00A22F07> vulkan/renderdevicevulkan.cpp:4614
// function calls: 2
void CRenderDeviceVulkan::CreatePixelShader(unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> > pShaderBuffer, const char* pDebugName)
{
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 472
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::get(); // 4616
} /* size: 20, inline expansions: 2 (0 bytes) */

// <00A22EE1> vulkan/renderdevicevulkan.cpp:4619
void CRenderDeviceVulkan::DestroyPixelShader(RenderShaderHandle_t hShader)
{
} /* size: 0 */

// <00A22DF9> vulkan/renderdevicevulkan.cpp:4624
// function calls: 2
void CRenderDeviceVulkan::CreateRayTraceShader(unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> > pShaderBuffer, const char* pDebugName)
{
	__uniq_ptr_impl<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::_M_ptr(); // 472
	unique_ptr<IRenderShaderByteCode, std::default_delete<IRenderShaderByteCode> >::get(); // 4626
} /* size: 20, inline expansions: 2 (0 bytes) */

// <00A22DD3> vulkan/renderdevicevulkan.cpp:4632
void CRenderDeviceVulkan::DestroyRayTraceShader(RenderShaderHandle_t hShader)
{
} /* size: 0 */

// <00A21D72> vulkan/renderdevicevulkan.cpp:4637
// variables: 6
// function calls: 82
void CRenderDeviceVulkan::RecycleDynamicBufferPools()
{
	{
		int i; // 4640
		Count(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertex this); // 4640
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 4642
		CUtlMemory<CVertexBufferVulkan::Base(); // 112
		CUtlVectorBase<CVertexBufferVulkan::Base(); // 4644
		CUtlVectorBase<CVertexBufferVulkan::Count(); // 4644
		CUtlMemory<CVertexBufferVulkan::NumAllocated(); // 782
		CUtlMemory<CVertexBufferVulkan::Base(); // 112
		CUtlVectorBase<CVertexBufferVulkan::Base(); // 368
		CUtlVectorBase<CVertexBufferVulkan::ResetDbgInfo(); // 824
		CUtlVectorBase<CVertexBufferVulkan::GrowMemory(
				int num);  // 784
		CUtlVectorBase<CVertexBufferVulkan::GrowVector(
				int num);  // 1484
		{
			int i; // 1500
			CUtlMemory<CVertexBufferVulkan::operator[](
					int i);  // 602
			CUtlVectorBase<CVertexBufferVulkan::Element(
				int i);  // 1502
			CopyConstruct<CVertexBufferVulkan*>(CVertexBufferVulkan** pMemory,
								CVertexBufferVulkan* const& src);  // 1502
		}
		CUtlVectorBase<CVertexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CVertexBufferVulkan* const* pToInsert);  // 1476
		CUtlVectorBase<CVertexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CVertexBufferVulkan* const* pToInsert);  // 1303
		CUtlVectorBase<CVertexBufferVulkan::AddMultipleToTail(
					int num,
					CVertexBufferVulkan* const* pToCopy);  // 4644
		CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
				int i);  // 602
		Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
			int i);  // 1575
		CUtlMemory<CVertexBufferVulkan::Purge(); // 903
		CUtlMemory<CVertexBufferVulkan::IsExternallyAllocated(); // 905
		CUtlMemory<CVertexBufferVulkan::Purge(); // 1799
		CUtlVectorBase<CVertexBufferVulkan::RemoveAll(); // 1798
		CUtlVectorBase<CVertexBufferVulkan::Purge(); // 560
		ValidateAlignment<CVertexBufferVulkan*>(void); // 508
		CUtlMemory<CVertexBufferVulkan::Purge(); // 510
		CUtlMemory<CVertexBufferVulkan::~CUtlMemory(); // 562
		CUtlVectorBase<CVertexBufferVulkan::~CUtlVectorBase(); // 410
		CUtlVector<CVertexBufferVulkan::~CUtlVector(); // 892
		FencedVertexBufferRelease_t::~FencedVertexBufferRelease_t(); // 1526
		Destruct<CRenderDeviceVulkan::FencedVertexBufferRelease_t>(FencedVertexBufferRelease_t* pMemory); // 1575
		{
			const bool  bNotLast; // 1578
			CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
					int i);  // 602
			Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 1584
			CUtlMemory<CRenderDeviceVulkan::FencedVertexBufferRelease_t, int>::operator[](
					int i);  // 602
			Element(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int i);  // 1584
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 1584
		}
		FastRemove(const CUtlVectorBase<CRenderDeviceVulkan::FencedVertexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedVertexBuffer this,
				int elem);  // 4645
	}
	{
		int i; // 4651
		Count(const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBu this); // 4651
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
				int i);  // 588
		operator[](const CUtlVectorBase<CRenderDeviceVulkan::FencedIndexBufferRelease_t, CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRe this,
				int i);  // 4653
		CUtlMemory<CIndexBufferVulkan::Base(); // 112
		CUtlVectorBase<CIndexBufferVulkan::Base(); // 4655
		CUtlVectorBase<CIndexBufferVulkan::Count(); // 4655
		CUtlMemory<CIndexBufferVulkan::NumAllocated(); // 782
		CUtlMemory<CIndexBufferVulkan::Base(); // 112
		CUtlVectorBase<CIndexBufferVulkan::Base(); // 368
		CUtlVectorBase<CIndexBufferVulkan::ResetDbgInfo(); // 824
		CUtlVectorBase<CIndexBufferVulkan::GrowMemory(
				int num);  // 784
		CUtlVectorBase<CIndexBufferVulkan::GrowVector(
				int num);  // 1484
		{
			int i; // 1500
			CUtlMemory<CIndexBufferVulkan::operator[](
					int i);  // 602
			CUtlVectorBase<CIndexBufferVulkan::Element(
				int i);  // 1502
			CopyConstruct<CIndexBufferVulkan*>(CIndexBufferVulkan** pMemory,
								CIndexBufferVulkan* const& src);  // 1502
		}
		CUtlVectorBase<CIndexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CIndexBufferVulkan* const* pToInsert);  // 1476
		CUtlVectorBase<CIndexBufferVulkan::InsertMultipleBefore(
					int elem,
					int num,
					CIndexBufferVulkan* const* pToInsert);  // 1303
		CUtlVectorBase<CIndexBufferVulkan::AddMultipleToTail(
					int num,
					CIndexBufferVulkan* const* pToCopy);  // 4655
		CUtlMemory<CRenderDeviceVulkan::FencedIndexBufferRelease_t, int>::operator[](
