
//
// public/modellib/modelbuilder.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 48
//	classes: 17
//	structs: 7
//

// <04BAB99E> ../public/modellib/modelbuilder.h:24
void CBuilderMaterialGroup::CBuilderMaterialGroup()
{
} /* size: 0 */

// <04BAB982> ../public/modellib/modelbuilder.h:24
inline void CBuilderMaterialGroup::CBuilderMaterialGroup()
{
} /* size: 0 */

// <01855728> ../public/modellib/modelbuilder.h:24
void CBuilderMaterialGroup::~CBuilderMaterialGroup()
{
} /* size: 0 */

// <0185570C> ../public/modellib/modelbuilder.h:24
inline void CBuilderMaterialGroup::~CBuilderMaterialGroup()
{
} /* size: 0 */

// <010D0223> ../public/modellib/modelbuilder.h:24
// member functions: 7
// member variables: 2
// class size: 40
class CBuilderMaterialGroup {
	/* ../public/modellib/modelbuilder.h:27 */
	void SetName(CBuilderMaterialGroup* , const char* );
	/* ../public/modellib/modelbuilder.h:28 */
	void AddMaterial(CBuilderMaterialGroup* , HMaterial);
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void ~CBuilderMaterialGroup(CBuilderMaterialGroup* );
	/* <4bdf7f3> modellib/modelbuilder.cpp:22 */
	void SetName(class CBuilderMaterialGroup *, const char  *); /* linkage=_ZN21CBuilderMaterialGroup7SetNameEPKc */
	void AddMaterial(class CBuilderMaterialGroup *, HMaterial); /* linkage=_ZN21CBuilderMaterialGroup11AddMaterialE11CWeakHandleI29InfoForResourceTypeIMaterial2E */
	void CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupC4Ev */
	void ~CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupD4Ev */
};

// <011EDA9A> ../public/modellib/modelbuilder.h:24
// member functions: 8
// member variables: 2
// class size: 40
class CBuilderMaterialGroup {
	/* ../public/modellib/modelbuilder.h:27 */
	void SetName(CBuilderMaterialGroup* , const char* );
	/* ../public/modellib/modelbuilder.h:28 */
	void AddMaterial(CBuilderMaterialGroup* , HMaterial);
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void CBuilderMaterialGroup(CBuilderMaterialGroup* );
	void ~CBuilderMaterialGroup(CBuilderMaterialGroup* );
	/* <4bdf7f3> modellib/modelbuilder.cpp:22 */
	void SetName(class CBuilderMaterialGroup *, const char  *); /* linkage=_ZN21CBuilderMaterialGroup7SetNameEPKc */
	void AddMaterial(class CBuilderMaterialGroup *, HMaterial); /* linkage=_ZN21CBuilderMaterialGroup11AddMaterialE11CWeakHandleI29InfoForResourceTypeIMaterial2E */
	void CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupC4Ev */
	void ~CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupD4Ev */
};

// <04B5DA58> ../public/modellib/modelbuilder.h:24
// member functions: 7
// member variables: 2
// class size: 40
class CBuilderMaterialGroup {
	/* ../public/modellib/modelbuilder.h:27 */
	void SetName(CBuilderMaterialGroup* , const char* );
	/* ../public/modellib/modelbuilder.h:28 */
	void AddMaterial(CBuilderMaterialGroup* , HMaterial);
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	void CBuilderMaterialGroup(CBuilderMaterialGroup* );
	/* <4bdf7f3> modellib/modelbuilder.cpp:22 */
	void SetName(class CBuilderMaterialGroup *, const char  *); /* linkage=_ZN21CBuilderMaterialGroup7SetNameEPKc */
	void AddMaterial(class CBuilderMaterialGroup *, HMaterial); /* linkage=_ZN21CBuilderMaterialGroup11AddMaterialE11CWeakHandleI29InfoForResourceTypeIMaterial2E */
	void CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupC4Ev */
	void ~CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupD4Ev */
};

// <001461CD> ../public/modellib/modelbuilder.h:24
// member functions: 6
// member variables: 2
// class size: 40
class CBuilderMaterialGroup {
	/* ../public/modellib/modelbuilder.h:27 */
	void SetName(CBuilderMaterialGroup* , const char* );
	/* ../public/modellib/modelbuilder.h:28 */
	void AddMaterial(CBuilderMaterialGroup* , HMaterial);
	CUtlString m_name; /* 0 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeIMaterial2>, CUtlMemory<CStrongHandle<InfoForResourceTypeIMaterial2>, int> > m_materials; /* 8 32 */
	/* <4bdf7f3> modellib/modelbuilder.cpp:22 */
	void SetName(class CBuilderMaterialGroup *, const char  *); /* linkage=_ZN21CBuilderMaterialGroup7SetNameEPKc */
	void AddMaterial(class CBuilderMaterialGroup *, HMaterial); /* linkage=_ZN21CBuilderMaterialGroup11AddMaterialE11CWeakHandleI29InfoForResourceTypeIMaterial2E */
	void CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupC4Ev */
	void ~CBuilderMaterialGroup(class CBuilderMaterialGroup *); /* linkage=_ZN21CBuilderMaterialGroupD4Ev */
};

// <0131CAF2> ../public/modellib/modelbuilder.h:36
void CBuilderMaterialGroupArray::~CBuilderMaterialGroupArray()
{
} /* size: 0 */

// <0131CAD6> ../public/modellib/modelbuilder.h:36
inline void CBuilderMaterialGroupArray::~CBuilderMaterialGroupArray()
{
} /* size: 0 */

// <011ED8C1> ../public/modellib/modelbuilder.h:36
// member functions: 6
// member variable: 1
// class size: 32
class CBuilderMaterialGroupArray {
	/* ../public/modellib/modelbuilder.h:40 */
	void CBuilderMaterialGroupArray(CBuilderMaterialGroupArray* , int);
	/* ../public/modellib/modelbuilder.h:45 */
	CBuilderMaterialGroup* Get(CBuilderMaterialGroupArray* , int);
	CUtlVector<CBuilderMaterialGroup, CUtlMemory<CBuilderMaterialGroup, int> > groups; /* 0 32 */
	void ~CBuilderMaterialGroupArray(CBuilderMaterialGroupArray* );
	void CBuilderMaterialGroupArray(class CBuilderMaterialGroupArray *, int); /* linkage=_ZN26CBuilderMaterialGroupArrayC4Ei */
	class CBuilderMaterialGroup * Get(class CBuilderMaterialGroupArray *, int); /* linkage=_ZN26CBuilderMaterialGroupArray3GetEi */
	void ~CBuilderMaterialGroupArray(class CBuilderMaterialGroupArray *); /* linkage=_ZN26CBuilderMaterialGroupArrayD4Ev */
};

// <017F7E32> ../public/modellib/modelbuilder.h:36
// member functions: 5
// member variable: 1
// class size: 32
class CBuilderMaterialGroupArray {
	/* ../public/modellib/modelbuilder.h:40 */
	void CBuilderMaterialGroupArray(CBuilderMaterialGroupArray* , int);
	/* ../public/modellib/modelbuilder.h:45 */
	CBuilderMaterialGroup* Get(CBuilderMaterialGroupArray* , int);
	CUtlVector<CBuilderMaterialGroup, CUtlMemory<CBuilderMaterialGroup, int> > groups; /* 0 32 */
	void CBuilderMaterialGroupArray(class CBuilderMaterialGroupArray *, int); /* linkage=_ZN26CBuilderMaterialGroupArrayC4Ei */
	class CBuilderMaterialGroup * Get(class CBuilderMaterialGroupArray *, int); /* linkage=_ZN26CBuilderMaterialGroupArray3GetEi */
	void ~CBuilderMaterialGroupArray(class CBuilderMaterialGroupArray *); /* linkage=_ZN26CBuilderMaterialGroupArrayD4Ev */
};

// <01339A87> ../public/modellib/modelbuilder.h:40
void CBuilderMaterialGroupArray::CBuilderMaterialGroupArray(int count)
{
} /* size: 0 */

// <01339A62> ../public/modellib/modelbuilder.h:40
inline void CBuilderMaterialGroupArray::CBuilderMaterialGroupArray(int count)
{
} /* size: 0 */

// <01339A3D> ../public/modellib/modelbuilder.h:45
inline void CBuilderMaterialGroupArray::Get(int index)
{
} /* size: 0 */

// <04BC82FB> ../public/modellib/modelbuilder.h:54
void CBuilderModelInfo::~CBuilderModelInfo()
{
} /* size: 0 */

// <04BC82DF> ../public/modellib/modelbuilder.h:54
inline void CBuilderModelInfo::~CBuilderModelInfo()
{
} /* size: 0 */

// <04BC6D98> ../public/modellib/modelbuilder.h:54
inline void CBuilderModelInfo::operator=(const CBuilderModelInfo &)
{
} /* size: 0 */

// <010D19D2> ../public/modellib/modelbuilder.h:54
// member functions: 9
// member variables: 11
// class size: 96
class CBuilderModelInfo {
	/* ../public/modellib/modelbuilder.h:57 */
	void CBuilderModelInfo(CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:58 */
	CBuilderModelInfo& operator=(CBuilderModelInfo* , const PermModelInfo_t& );
	/* ../public/modellib/modelbuilder.h:59 */
	void FillInPermData(CBuilderModelInfo* , PermModelInfo_t* );
	ModelFlags_t m_nInherentFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
	const class KeyValues3 * m_pModelKeyValues; /* 88 8 */
	void ~CBuilderModelInfo(CBuilderModelInfo* );
	void CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoC4Ev */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class PermModelInfo_t  &); /* linkage=_ZN17CBuilderModelInfoaSERK15PermModelInfo_t */
	void FillInPermData(class CBuilderModelInfo *, class PermModelInfo_t *); /* linkage=_ZN17CBuilderModelInfo14FillInPermDataEP15PermModelInfo_t */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class CBuilderModelInfo  &); /* linkage=_ZN17CBuilderModelInfoaSERKS_ */
	void ~CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoD4Ev */
};

// <04B5F1F1> ../public/modellib/modelbuilder.h:54
// member functions: 10
// member variables: 11
// class size: 96
class CBuilderModelInfo {
	/* ../public/modellib/modelbuilder.h:57 */
	void CBuilderModelInfo(CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:58 */
	CBuilderModelInfo& operator=(CBuilderModelInfo* , const PermModelInfo_t& );
	/* ../public/modellib/modelbuilder.h:59 */
	void FillInPermData(CBuilderModelInfo* , PermModelInfo_t* );
	ModelFlags_t m_nInherentFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
	const class KeyValues3 * m_pModelKeyValues; /* 88 8 */
	CBuilderModelInfo& operator=(CBuilderModelInfo* , const CBuilderModelInfo& );
	void ~CBuilderModelInfo(CBuilderModelInfo* );
	void CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoC4Ev */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class PermModelInfo_t  &); /* linkage=_ZN17CBuilderModelInfoaSERK15PermModelInfo_t */
	void FillInPermData(class CBuilderModelInfo *, class PermModelInfo_t *); /* linkage=_ZN17CBuilderModelInfo14FillInPermDataEP15PermModelInfo_t */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class CBuilderModelInfo  &); /* linkage=_ZN17CBuilderModelInfoaSERKS_ */
	void ~CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoD4Ev */
};

// <001478F4> ../public/modellib/modelbuilder.h:54
// member functions: 8
// member variables: 11
// class size: 96
class CBuilderModelInfo {
	/* ../public/modellib/modelbuilder.h:57 */
	void CBuilderModelInfo(CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:58 */
	CBuilderModelInfo& operator=(CBuilderModelInfo* , const PermModelInfo_t& );
	/* ../public/modellib/modelbuilder.h:59 */
	void FillInPermData(CBuilderModelInfo* , PermModelInfo_t* );
	ModelFlags_t m_nInherentFlags; /* 0 4 */
	Vector m_vHullMin; /* 4 12 */
	Vector m_vHullMax; /* 16 12 */
	Vector m_vViewMin; /* 28 12 */
	Vector m_vViewMax; /* 40 12 */
	float m_flMass; /* 52 4 */
	Vector m_vEyePosition; /* 56 12 */
	float m_flMaxEyeDeflection; /* 68 4 */
	CUtlString m_sSurfaceProperty; /* 72 8 */
	CUtlString m_keyValueText; /* 80 8 */
	const class KeyValues3 * m_pModelKeyValues; /* 88 8 */
	void CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoC4Ev */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class PermModelInfo_t  &); /* linkage=_ZN17CBuilderModelInfoaSERK15PermModelInfo_t */
	void FillInPermData(class CBuilderModelInfo *, class PermModelInfo_t *); /* linkage=_ZN17CBuilderModelInfo14FillInPermDataEP15PermModelInfo_t */
	class CBuilderModelInfo & operator=(class CBuilderModelInfo *, const class CBuilderModelInfo  &); /* linkage=_ZN17CBuilderModelInfoaSERKS_ */
	void ~CBuilderModelInfo(class CBuilderModelInfo *); /* linkage=_ZN17CBuilderModelInfoD4Ev */
};

// <01872B57> ../public/modellib/modelbuilder.h:79
void CModelSkeletonBuilder::~CModelSkeletonBuilder()
{
} /* size: 0 */

// <01872B3B> ../public/modellib/modelbuilder.h:79
inline void CModelSkeletonBuilder::~CModelSkeletonBuilder()
{
} /* size: 0 */

// <010D3235> ../public/modellib/modelbuilder.h:79
// member functions: 78
// member variables: 9
// class size: 288
class CModelSkeletonBuilder {
	/* ../public/modellib/modelbuilder.h:82 */
	void CModelSkeletonBuilder(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:83 */
	void Clear(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:84 */
	int NumBones(const CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:85 */
	int GetNumParentIndices(const CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:86 */
	int GetParent(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:87 */
	BoneFlags_t GetFlags(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:88 */
	const char* GetBoneNameByIndex(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:89 */
	const Vector& GetBonePos(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:90 */
	const Quaternion& GetBoneRotation(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:91 */
	void SetParent(CModelSkeletonBuilder* , int, uint32);
	/* ../public/modellib/modelbuilder.h:92 */
	void SetParent(CModelSkeletonBuilder* , int, const char* );
	/* ../public/modellib/modelbuilder.h:93 */
	void AddFlags(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:94 */
	void AddBoneSphere(CModelSkeletonBuilder* , int, float);
	/* ../public/modellib/modelbuilder.h:95 */
	void ClearFlags(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:96 */
	void SetPosParent(CModelSkeletonBuilder* , int, const Vector& );
	/* ../public/modellib/modelbuilder.h:97 */
	void SetRotParent(CModelSkeletonBuilder* , int, const Quaternion& );
	/* ../public/modellib/modelbuilder.h:98 */
	int FindOrAddBone(CModelSkeletonBuilder* , uint32, uint32, float, BoneFlags_t, const Vector& , const Quaternion& , const char* );
	/* ../public/modellib/modelbuilder.h:99 */
	int FindOrAddBone(CModelSkeletonBuilder* , const char* , const char* , float, BoneFlags_t, const Vector& , const Quaternion& );
	/* ../public/modellib/modelbuilder.h:100 */
	int FindBoneIndex(const CModelSkeletonBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:101 */
	int FindBoneIndexByHash(const CModelSkeletonBuilder* , uint32);
	/* ../public/modellib/modelbuilder.h:102 */
	void AddFlagToAllParentsOfBone(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:103 */
	void AppendRenderMeshSkeleton(CModelSkeletonBuilder* , const CRenderSkeleton* , LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:104 */
	void MarkBonesWithHitboxsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:105 */
	void MarkBonesWithAttachmentsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:106 */
	void MarkBonesWithConstraintsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:107 */
	void AppendSkeleton(CModelSkeletonBuilder* , const CAnimationGroup* );
	/* ../public/modellib/modelbuilder.h:108 */
	void AppendSkeleton(CModelSkeletonBuilder* , const CPhysAggregateData* );
	/* ../public/modellib/modelbuilder.h:109 */
	void AppendRetargetDst(CModelSkeletonBuilder* , const CAnimRetargetData* );
	/* ../public/modellib/modelbuilder.h:110 */
	bool AppendRetargetSrc(CModelSkeletonBuilder* , const CAnimationGroup* , const CAnimRetargetData* , ResourceId_t);
	/* ../public/modellib/modelbuilder.h:111 */
	void Finalize(CModelSkeletonBuilder* , bool);
	/* ../public/modellib/modelbuilder.h:112 */
	void FillInPermData(CModelSkeletonBuilder* , ModelSkeletonData_t* );
	/* ../public/modellib/modelbuilder.h:113 */
	void FillInRuntimeData(CModelSkeletonBuilder* , CModelSkeleton* );
	/* ../public/modellib/modelbuilder.h:114 */
	ModelSkeletonData_t* CompileToPermDataPointer(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:115 */
	void DestroyPermDataPointer(CModelSkeletonBuilder* , const ModelSkeletonData_t* );
private:
	/* ../public/modellib/modelbuilder.h:118 */
	void FixupFlagsAndParents(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:119 */
	void SortBoneList(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:120 */
	void MarkSimBone(CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:121 */
	void GetBoneToWorld(const CModelSkeletonBuilder* , matrix3x4a_t& , int);
	BoneDict_t m_boneDict; /* 0 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 32 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nParentHash; /* 64 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParentIndices; /* 96 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 128 32 */
	CUtlVector<CModelSkeleton::BoneFlags_t, CUtlMemory<CModelSkeleton::BoneFlags_t, int> > m_nFlag; /* 160 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 192 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 224 32 */
	CUtlVector<bool, CUtlMemory<bool, int> > m_simBones; /* 256 32 */
	void ~CModelSkeletonBuilder(CModelSkeletonBuilder* );
	void CModelSkeletonBuilder(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilderC4Ev */
	void Clear(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder5ClearEv */
	/* <4bdf889> modellib/modelbuilder.cpp:101 */
	int NumBones(const class CModelSkeletonBuilder  *); /* linkage=_ZNK21CModelSkeletonBuilder8NumBonesEv */
	/* <4bdf8e2> modellib/modelbuilder.cpp:106 */
	int GetNumParentIndices(const class CModelSkeletonBuilder  *); /* linkage=_ZNK21CModelSkeletonBuilder19GetNumParentIndicesEv */
	/* <4bdf93b> modellib/modelbuilder.cpp:111 */
	int GetParent(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder9GetParentEi */
	/* <4bdfa4a> modellib/modelbuilder.cpp:117 */
	enum BoneFlags_t GetFlags(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder8GetFlagsEi */
	/* <4bdfadd> modellib/modelbuilder.cpp:122 */
	const char  * GetBoneNameByIndex(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder18GetBoneNameByIndexEi */
	/* <4bdfb98> modellib/modelbuilder.cpp:127 */
	const class Vector  & GetBonePos(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder10GetBonePosEi */
	/* <4bdfc43> modellib/modelbuilder.cpp:132 */
	const class Quaternion  & GetBoneRotation(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder15GetBoneRotationEi */
	/* <4bdfcee> modellib/modelbuilder.cpp:137 */
	void SetParent(class CModelSkeletonBuilder *, int, uint32); /* linkage=_ZN21CModelSkeletonBuilder9SetParentEij */
	void SetParent(class CModelSkeletonBuilder *, int, const char  *); /* linkage=_ZN21CModelSkeletonBuilder9SetParentEiPKc */
	/* <4bdfd88> modellib/modelbuilder.cpp:151 */
	void AddFlags(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder8AddFlagsEiN14CModelSkeleton11BoneFlags_tE */
	/* <4bdfeb8> modellib/modelbuilder.cpp:156 */
	void AddBoneSphere(class CModelSkeletonBuilder *, int, float); /* linkage=_ZN21CModelSkeletonBuilder13AddBoneSphereEif */
	void ClearFlags(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder10ClearFlagsEiN14CModelSkeleton11BoneFlags_tE */
	/* <4bdff70> modellib/modelbuilder.cpp:166 */
	void SetPosParent(class CModelSkeletonBuilder *, int, const class Vector  &); /* linkage=_ZN21CModelSkeletonBuilder12SetPosParentEiRK6Vector */
	/* <4be0037> modellib/modelbuilder.cpp:171 */
	void SetRotParent(class CModelSkeletonBuilder *, int, const class Quaternion  &); /* linkage=_ZN21CModelSkeletonBuilder12SetRotParentEiRK10Quaternion */
	int FindOrAddBone(class CModelSkeletonBuilder *, uint32, uint32, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &, const char  *); /* linkage=_ZN21CModelSkeletonBuilder13FindOrAddBoneEjjfN14CModelSkeleton11BoneFlags_tERK6VectorRK10QuaternionPKc */
	/* <4be1ea2> modellib/modelbuilder.cpp:207 */
	int FindOrAddBone(class CModelSkeletonBuilder *, const char  *, const char  *, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &); /* linkage=_ZN21CModelSkeletonBuilder13FindOrAddBoneEPKcS1_fN14CModelSkeleton11BoneFlags_tERK6VectorRK10Quaternion */
	/* <4be0ac3> modellib/modelbuilder.cpp:218 */
	int FindBoneIndex(const class CModelSkeletonBuilder  *, const char  *); /* linkage=_ZNK21CModelSkeletonBuilder13FindBoneIndexEPKc */
	/* <4be094e> modellib/modelbuilder.cpp:224 */
	int FindBoneIndexByHash(const class CModelSkeletonBuilder  *, uint32); /* linkage=_ZNK21CModelSkeletonBuilder19FindBoneIndexByHashEj */
	void AddFlagToAllParentsOfBone(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder25AddFlagToAllParentsOfBoneEiN14CModelSkeleton11BoneFlags_tE */
	/* <4be4de5> modellib/modelbuilder.cpp:244 */
	void AppendRenderMeshSkeleton(class CModelSkeletonBuilder *, const class CRenderSkeleton  *, LODGroupMask_t); /* linkage=_ZN21CModelSkeletonBuilder24AppendRenderMeshSkeletonEPK15CRenderSkeletonh */
	void MarkBonesWithHitboxsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder30MarkBonesWithHitboxsAsSimBonesEPK11CRenderMesh */
	/* <4be177d> modellib/modelbuilder.cpp:388 */
	void MarkBonesWithAttachmentsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder34MarkBonesWithAttachmentsAsSimBonesEPK11CRenderMesh */
	void MarkBonesWithConstraintsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder34MarkBonesWithConstraintsAsSimBonesEPK11CRenderMesh */
	/* <4be5dcd> modellib/modelbuilder.cpp:413 */
	void AppendSkeleton(class CModelSkeletonBuilder *, const class CAnimationGroup  *); /* linkage=_ZN21CModelSkeletonBuilder14AppendSkeletonEPK15CAnimationGroup */
	/* <4be5629> modellib/modelbuilder.cpp:651 */
	void AppendSkeleton(class CModelSkeletonBuilder *, const class CPhysAggregateData  *); /* linkage=_ZN21CModelSkeletonBuilder14AppendSkeletonEPK18CPhysAggregateData */
	void AppendRetargetDst(class CModelSkeletonBuilder *, const class CAnimRetargetData  *); /* linkage=_ZN21CModelSkeletonBuilder17AppendRetargetDstEPK17CAnimRetargetData */
	bool AppendRetargetSrc(class CModelSkeletonBuilder *, const class CAnimationGroup  *, const class CAnimRetargetData  *, class ResourceId_t); /* linkage=_ZN21CModelSkeletonBuilder17AppendRetargetSrcEPK15CAnimationGroupPK17CAnimRetargetData12ResourceId_t */
	/* <4be5e2b> modellib/modelbuilder.cpp:696 */
	void Finalize(class CModelSkeletonBuilder *, bool); /* linkage=_ZN21CModelSkeletonBuilder8FinalizeEb */
	void FillInPermData(class CModelSkeletonBuilder *, class ModelSkeletonData_t *); /* linkage=_ZN21CModelSkeletonBuilder14FillInPermDataEP19ModelSkeletonData_t */
	void FillInRuntimeData(class CModelSkeletonBuilder *, class CModelSkeleton *); /* linkage=_ZN21CModelSkeletonBuilder17FillInRuntimeDataEP14CModelSkeleton */
	class ModelSkeletonData_t * CompileToPermDataPointer(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder24CompileToPermDataPointerEv */
	void DestroyPermDataPointer(class CModelSkeletonBuilder *, const class ModelSkeletonData_t  *); /* linkage=_ZN21CModelSkeletonBuilder22DestroyPermDataPointerEPK19ModelSkeletonData_t */
	void FixupFlagsAndParents(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder20FixupFlagsAndParentsEv */
	void SortBoneList(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder12SortBoneListEv */
	/* <4be00ef> modellib/modelbuilder.cpp:449 */
	void MarkSimBone(class CModelSkeletonBuilder *, int); /* linkage=_ZN21CModelSkeletonBuilder11MarkSimBoneEi */
	void GetBoneToWorld(const class CModelSkeletonBuilder  *, class matrix3x4a_t &, int); /* linkage=_ZNK21CModelSkeletonBuilder14GetBoneToWorldER12matrix3x4a_ti */
	void ~CModelSkeletonBuilder(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilderD4Ev */
};

// <04B60D30> ../public/modellib/modelbuilder.h:79
// member functions: 77
// member variables: 9
// class size: 288
class CModelSkeletonBuilder {
	/* ../public/modellib/modelbuilder.h:82 */
	void CModelSkeletonBuilder(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:83 */
	void Clear(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:84 */
	int NumBones(const CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:85 */
	int GetNumParentIndices(const CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:86 */
	int GetParent(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:87 */
	BoneFlags_t GetFlags(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:88 */
	const char* GetBoneNameByIndex(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:89 */
	const Vector& GetBonePos(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:90 */
	const Quaternion& GetBoneRotation(const CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:91 */
	void SetParent(CModelSkeletonBuilder* , int, uint32);
	/* ../public/modellib/modelbuilder.h:92 */
	void SetParent(CModelSkeletonBuilder* , int, const char* );
	/* ../public/modellib/modelbuilder.h:93 */
	void AddFlags(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:94 */
	void AddBoneSphere(CModelSkeletonBuilder* , int, float);
	/* ../public/modellib/modelbuilder.h:95 */
	void ClearFlags(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:96 */
	void SetPosParent(CModelSkeletonBuilder* , int, const Vector& );
	/* ../public/modellib/modelbuilder.h:97 */
	void SetRotParent(CModelSkeletonBuilder* , int, const Quaternion& );
	/* ../public/modellib/modelbuilder.h:98 */
	int FindOrAddBone(CModelSkeletonBuilder* , uint32, uint32, float, BoneFlags_t, const Vector& , const Quaternion& , const char* );
	/* ../public/modellib/modelbuilder.h:99 */
	int FindOrAddBone(CModelSkeletonBuilder* , const char* , const char* , float, BoneFlags_t, const Vector& , const Quaternion& );
	/* ../public/modellib/modelbuilder.h:100 */
	int FindBoneIndex(const CModelSkeletonBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:101 */
	int FindBoneIndexByHash(const CModelSkeletonBuilder* , uint32);
	/* ../public/modellib/modelbuilder.h:102 */
	void AddFlagToAllParentsOfBone(CModelSkeletonBuilder* , int, BoneFlags_t);
	/* ../public/modellib/modelbuilder.h:103 */
	void AppendRenderMeshSkeleton(CModelSkeletonBuilder* , const CRenderSkeleton* , LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:104 */
	void MarkBonesWithHitboxsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:105 */
	void MarkBonesWithAttachmentsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:106 */
	void MarkBonesWithConstraintsAsSimBones(CModelSkeletonBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:107 */
	void AppendSkeleton(CModelSkeletonBuilder* , const CAnimationGroup* );
	/* ../public/modellib/modelbuilder.h:108 */
	void AppendSkeleton(CModelSkeletonBuilder* , const CPhysAggregateData* );
	/* ../public/modellib/modelbuilder.h:109 */
	void AppendRetargetDst(CModelSkeletonBuilder* , const CAnimRetargetData* );
	/* ../public/modellib/modelbuilder.h:110 */
	bool AppendRetargetSrc(CModelSkeletonBuilder* , const CAnimationGroup* , const CAnimRetargetData* , ResourceId_t);
	/* ../public/modellib/modelbuilder.h:111 */
	void Finalize(CModelSkeletonBuilder* , bool);
	/* ../public/modellib/modelbuilder.h:112 */
	void FillInPermData(CModelSkeletonBuilder* , ModelSkeletonData_t* );
	/* ../public/modellib/modelbuilder.h:113 */
	void FillInRuntimeData(CModelSkeletonBuilder* , CModelSkeleton* );
	/* ../public/modellib/modelbuilder.h:114 */
	ModelSkeletonData_t* CompileToPermDataPointer(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:115 */
	void DestroyPermDataPointer(CModelSkeletonBuilder* , const ModelSkeletonData_t* );
private:
	/* ../public/modellib/modelbuilder.h:118 */
	void FixupFlagsAndParents(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:119 */
	void SortBoneList(CModelSkeletonBuilder* );
	/* ../public/modellib/modelbuilder.h:120 */
	void MarkSimBone(CModelSkeletonBuilder* , int);
	/* ../public/modellib/modelbuilder.h:121 */
	void GetBoneToWorld(const CModelSkeletonBuilder* , matrix3x4a_t& , int);
	BoneDict_t m_boneDict; /* 0 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_boneName; /* 32 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nParentHash; /* 64 32 */
	CUtlVector<short int, CUtlMemory<short int, int> > m_nParentIndices; /* 96 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_boneSphere; /* 128 32 */
	CUtlVector<CModelSkeleton::BoneFlags_t, CUtlMemory<CModelSkeleton::BoneFlags_t, int> > m_nFlag; /* 160 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_bonePosParent; /* 192 32 */
	CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > m_boneRotParent; /* 224 32 */
	CUtlVector<bool, CUtlMemory<bool, int> > m_simBones; /* 256 32 */
	void CModelSkeletonBuilder(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilderC4Ev */
	void Clear(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder5ClearEv */
	/* <4bdf889> modellib/modelbuilder.cpp:101 */
	int NumBones(const class CModelSkeletonBuilder  *); /* linkage=_ZNK21CModelSkeletonBuilder8NumBonesEv */
	/* <4bdf8e2> modellib/modelbuilder.cpp:106 */
	int GetNumParentIndices(const class CModelSkeletonBuilder  *); /* linkage=_ZNK21CModelSkeletonBuilder19GetNumParentIndicesEv */
	/* <4bdf93b> modellib/modelbuilder.cpp:111 */
	int GetParent(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder9GetParentEi */
	/* <4bdfa4a> modellib/modelbuilder.cpp:117 */
	enum BoneFlags_t GetFlags(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder8GetFlagsEi */
	/* <4bdfadd> modellib/modelbuilder.cpp:122 */
	const char  * GetBoneNameByIndex(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder18GetBoneNameByIndexEi */
	/* <4bdfb98> modellib/modelbuilder.cpp:127 */
	const class Vector  & GetBonePos(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder10GetBonePosEi */
	/* <4bdfc43> modellib/modelbuilder.cpp:132 */
	const class Quaternion  & GetBoneRotation(const class CModelSkeletonBuilder  *, int); /* linkage=_ZNK21CModelSkeletonBuilder15GetBoneRotationEi */
	/* <4bdfcee> modellib/modelbuilder.cpp:137 */
	void SetParent(class CModelSkeletonBuilder *, int, uint32); /* linkage=_ZN21CModelSkeletonBuilder9SetParentEij */
	void SetParent(class CModelSkeletonBuilder *, int, const char  *); /* linkage=_ZN21CModelSkeletonBuilder9SetParentEiPKc */
	/* <4bdfd88> modellib/modelbuilder.cpp:151 */
	void AddFlags(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder8AddFlagsEiN14CModelSkeleton11BoneFlags_tE */
	/* <4bdfeb8> modellib/modelbuilder.cpp:156 */
	void AddBoneSphere(class CModelSkeletonBuilder *, int, float); /* linkage=_ZN21CModelSkeletonBuilder13AddBoneSphereEif */
	void ClearFlags(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder10ClearFlagsEiN14CModelSkeleton11BoneFlags_tE */
	/* <4bdff70> modellib/modelbuilder.cpp:166 */
	void SetPosParent(class CModelSkeletonBuilder *, int, const class Vector  &); /* linkage=_ZN21CModelSkeletonBuilder12SetPosParentEiRK6Vector */
	/* <4be0037> modellib/modelbuilder.cpp:171 */
	void SetRotParent(class CModelSkeletonBuilder *, int, const class Quaternion  &); /* linkage=_ZN21CModelSkeletonBuilder12SetRotParentEiRK10Quaternion */
	int FindOrAddBone(class CModelSkeletonBuilder *, uint32, uint32, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &, const char  *); /* linkage=_ZN21CModelSkeletonBuilder13FindOrAddBoneEjjfN14CModelSkeleton11BoneFlags_tERK6VectorRK10QuaternionPKc */
	/* <4be1ea2> modellib/modelbuilder.cpp:207 */
	int FindOrAddBone(class CModelSkeletonBuilder *, const char  *, const char  *, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &); /* linkage=_ZN21CModelSkeletonBuilder13FindOrAddBoneEPKcS1_fN14CModelSkeleton11BoneFlags_tERK6VectorRK10Quaternion */
	/* <4be0ac3> modellib/modelbuilder.cpp:218 */
	int FindBoneIndex(const class CModelSkeletonBuilder  *, const char  *); /* linkage=_ZNK21CModelSkeletonBuilder13FindBoneIndexEPKc */
	/* <4be094e> modellib/modelbuilder.cpp:224 */
	int FindBoneIndexByHash(const class CModelSkeletonBuilder  *, uint32); /* linkage=_ZNK21CModelSkeletonBuilder19FindBoneIndexByHashEj */
	void AddFlagToAllParentsOfBone(class CModelSkeletonBuilder *, int, enum BoneFlags_t); /* linkage=_ZN21CModelSkeletonBuilder25AddFlagToAllParentsOfBoneEiN14CModelSkeleton11BoneFlags_tE */
	/* <4be4de5> modellib/modelbuilder.cpp:244 */
	void AppendRenderMeshSkeleton(class CModelSkeletonBuilder *, const class CRenderSkeleton  *, LODGroupMask_t); /* linkage=_ZN21CModelSkeletonBuilder24AppendRenderMeshSkeletonEPK15CRenderSkeletonh */
	void MarkBonesWithHitboxsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder30MarkBonesWithHitboxsAsSimBonesEPK11CRenderMesh */
	/* <4be177d> modellib/modelbuilder.cpp:388 */
	void MarkBonesWithAttachmentsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder34MarkBonesWithAttachmentsAsSimBonesEPK11CRenderMesh */
	void MarkBonesWithConstraintsAsSimBones(class CModelSkeletonBuilder *, const class CRenderMesh  *); /* linkage=_ZN21CModelSkeletonBuilder34MarkBonesWithConstraintsAsSimBonesEPK11CRenderMesh */
	/* <4be5dcd> modellib/modelbuilder.cpp:413 */
	void AppendSkeleton(class CModelSkeletonBuilder *, const class CAnimationGroup  *); /* linkage=_ZN21CModelSkeletonBuilder14AppendSkeletonEPK15CAnimationGroup */
	/* <4be5629> modellib/modelbuilder.cpp:651 */
	void AppendSkeleton(class CModelSkeletonBuilder *, const class CPhysAggregateData  *); /* linkage=_ZN21CModelSkeletonBuilder14AppendSkeletonEPK18CPhysAggregateData */
	void AppendRetargetDst(class CModelSkeletonBuilder *, const class CAnimRetargetData  *); /* linkage=_ZN21CModelSkeletonBuilder17AppendRetargetDstEPK17CAnimRetargetData */
	bool AppendRetargetSrc(class CModelSkeletonBuilder *, const class CAnimationGroup  *, const class CAnimRetargetData  *, class ResourceId_t); /* linkage=_ZN21CModelSkeletonBuilder17AppendRetargetSrcEPK15CAnimationGroupPK17CAnimRetargetData12ResourceId_t */
	/* <4be5e2b> modellib/modelbuilder.cpp:696 */
	void Finalize(class CModelSkeletonBuilder *, bool); /* linkage=_ZN21CModelSkeletonBuilder8FinalizeEb */
	void FillInPermData(class CModelSkeletonBuilder *, class ModelSkeletonData_t *); /* linkage=_ZN21CModelSkeletonBuilder14FillInPermDataEP19ModelSkeletonData_t */
	void FillInRuntimeData(class CModelSkeletonBuilder *, class CModelSkeleton *); /* linkage=_ZN21CModelSkeletonBuilder17FillInRuntimeDataEP14CModelSkeleton */
	class ModelSkeletonData_t * CompileToPermDataPointer(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder24CompileToPermDataPointerEv */
	void DestroyPermDataPointer(class CModelSkeletonBuilder *, const class ModelSkeletonData_t  *); /* linkage=_ZN21CModelSkeletonBuilder22DestroyPermDataPointerEPK19ModelSkeletonData_t */
	void FixupFlagsAndParents(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder20FixupFlagsAndParentsEv */
	void SortBoneList(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilder12SortBoneListEv */
	/* <4be00ef> modellib/modelbuilder.cpp:449 */
	void MarkSimBone(class CModelSkeletonBuilder *, int); /* linkage=_ZN21CModelSkeletonBuilder11MarkSimBoneEi */
	void GetBoneToWorld(const class CModelSkeletonBuilder  *, class matrix3x4a_t &, int); /* linkage=_ZNK21CModelSkeletonBuilder14GetBoneToWorldER12matrix3x4a_ti */
	void ~CModelSkeletonBuilder(class CModelSkeletonBuilder *); /* linkage=_ZN21CModelSkeletonBuilderD4Ev */
};

// <0131FE9A> ../public/modellib/modelbuilder.h:137
void CAnimationGroupBuilder::~CAnimationGroupBuilder()
{
} /* size: 0 */

// <0131FE7E> ../public/modellib/modelbuilder.h:137
inline void CAnimationGroupBuilder::~CAnimationGroupBuilder()
{
} /* size: 0 */

// <0131FE4F> ../public/modellib/modelbuilder.h:137
void CAnimationGroupBuilder::CAnimationGroupBuilder()
{
} /* size: 0 */

// <0131FE33> ../public/modellib/modelbuilder.h:137
inline void CAnimationGroupBuilder::CAnimationGroupBuilder()
{
} /* size: 0 */

// <011ED5EA> ../public/modellib/modelbuilder.h:137
// member functions: 20
// member variable: 1
// class size: 32
class CAnimationGroupBuilder {
	/* ../public/modellib/modelbuilder.h:141 */
	struct Animation_t {
		CUtlString m_name; /* 0 8 */
		float m_fps; /* 8 4 */
		bool m_looping; /* 12 1 */
		bool m_delta; /* 13 1 */
		bool m_disableInterpolation; /* 14 1 */
		CUtlVector<CUtlVector<CTransform, CUtlMemory<CTransform, int> >, CUtlMemory<CUtlVector<CTransform, CUtlMemory<CTransform, int> >, int> > m_frames; /* 16 32 */
		void ~Animation_t(Animation_t* );
		void Animation_t(Animation_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/modellib/modelbuilder.h:151 */
	int AddAnimation(CAnimationGroupBuilder* );
	/* ../public/modellib/modelbuilder.h:156 */
	void AddFrame(CAnimationGroupBuilder* , int, CTransformUnaligned* , int);
	/* ../public/modellib/modelbuilder.h:169 */
	void SetName(CAnimationGroupBuilder* , int, const char* );
	/* ../public/modellib/modelbuilder.h:176 */
	void SetFrameRate(CAnimationGroupBuilder* , int, float);
	/* ../public/modellib/modelbuilder.h:183 */
	void SetLooping(CAnimationGroupBuilder* , int, bool);
	/* ../public/modellib/modelbuilder.h:190 */
	void SetDelta(CAnimationGroupBuilder* , int, bool);
	/* ../public/modellib/modelbuilder.h:197 */
	void SetDisableInterpolation(CAnimationGroupBuilder* , int, bool);
	CUtlVector<CAnimationGroupBuilder::Animation_t, CUtlMemory<CAnimationGroupBuilder::Animation_t, int> > m_anims; /* 0 32 */
	void CAnimationGroupBuilder(CAnimationGroupBuilder* );
	void ~CAnimationGroupBuilder(CAnimationGroupBuilder* );
	int AddAnimation(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilder12AddAnimationEv */
	void AddFrame(class CAnimationGroupBuilder *, int, class CTransformUnaligned *, int); /* linkage=_ZN22CAnimationGroupBuilder8AddFrameEiP19CTransformUnalignedi */
	void SetName(class CAnimationGroupBuilder *, int, const char  *); /* linkage=_ZN22CAnimationGroupBuilder7SetNameEiPKc */
	void SetFrameRate(class CAnimationGroupBuilder *, int, float); /* linkage=_ZN22CAnimationGroupBuilder12SetFrameRateEif */
	void SetLooping(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder10SetLoopingEib */
	void SetDelta(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder8SetDeltaEib */
	void SetDisableInterpolation(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder23SetDisableInterpolationEib */
	void CAnimationGroupBuilder(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilderC4Ev */
	void ~CAnimationGroupBuilder(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilderD4Ev */
};

// <017F7BED> ../public/modellib/modelbuilder.h:137
// member functions: 16
// member variable: 1
// class size: 32
class CAnimationGroupBuilder {
	/* ../public/modellib/modelbuilder.h:141 */
	struct Animation_t {
		CUtlString m_name; /* 0 8 */
		float m_fps; /* 8 4 */
		bool m_looping; /* 12 1 */
		bool m_delta; /* 13 1 */
		bool m_disableInterpolation; /* 14 1 */
		CUtlVector<CUtlVector<CTransform, CUtlMemory<CTransform, int> >, CUtlMemory<CUtlVector<CTransform, CUtlMemory<CTransform, int> >, int> > m_frames; /* 16 32 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/modellib/modelbuilder.h:151 */
	int AddAnimation(CAnimationGroupBuilder* );
	/* ../public/modellib/modelbuilder.h:156 */
	void AddFrame(CAnimationGroupBuilder* , int, CTransformUnaligned* , int);
	/* ../public/modellib/modelbuilder.h:169 */
	void SetName(CAnimationGroupBuilder* , int, const char* );
	/* ../public/modellib/modelbuilder.h:176 */
	void SetFrameRate(CAnimationGroupBuilder* , int, float);
	/* ../public/modellib/modelbuilder.h:183 */
	void SetLooping(CAnimationGroupBuilder* , int, bool);
	/* ../public/modellib/modelbuilder.h:190 */
	void SetDelta(CAnimationGroupBuilder* , int, bool);
	/* ../public/modellib/modelbuilder.h:197 */
	void SetDisableInterpolation(CAnimationGroupBuilder* , int, bool);
	CUtlVector<CAnimationGroupBuilder::Animation_t, CUtlMemory<CAnimationGroupBuilder::Animation_t, int> > m_anims; /* 0 32 */
	int AddAnimation(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilder12AddAnimationEv */
	void AddFrame(class CAnimationGroupBuilder *, int, class CTransformUnaligned *, int); /* linkage=_ZN22CAnimationGroupBuilder8AddFrameEiP19CTransformUnalignedi */
	void SetName(class CAnimationGroupBuilder *, int, const char  *); /* linkage=_ZN22CAnimationGroupBuilder7SetNameEiPKc */
	void SetFrameRate(class CAnimationGroupBuilder *, int, float); /* linkage=_ZN22CAnimationGroupBuilder12SetFrameRateEif */
	void SetLooping(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder10SetLoopingEib */
	void SetDelta(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder8SetDeltaEib */
	void SetDisableInterpolation(class CAnimationGroupBuilder *, int, bool); /* linkage=_ZN22CAnimationGroupBuilder23SetDisableInterpolationEib */
	void CAnimationGroupBuilder(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilderC4Ev */
	void ~CAnimationGroupBuilder(class CAnimationGroupBuilder *); /* linkage=_ZN22CAnimationGroupBuilderD4Ev */
};

// <0126E176> ../public/modellib/modelbuilder.h:141
void Animation_t::Animation_t()
{
} /* size: 0 */

// <0126E15A> ../public/modellib/modelbuilder.h:141
inline void Animation_t::Animation_t()
{
} /* size: 0 */

// <0125F9D9> ../public/modellib/modelbuilder.h:141
void Animation_t::~Animation_t()
{
} /* size: 0 */

// <0125F9BD> ../public/modellib/modelbuilder.h:141
inline void Animation_t::~Animation_t()
{
} /* size: 0 */

// <01339A24> ../public/modellib/modelbuilder.h:151
inline void CAnimationGroupBuilder::AddAnimation()
{
} /* size: 0 */

// <01339995> ../public/modellib/modelbuilder.h:156
// variables: 5
inline void CAnimationGroupBuilder::AddFrame(int nAnimation, CTransformUnaligned* pBoneTransforms, int nNumBoneTransforms)
{
	const char   __FUNCTION__; // 46727
	Animation_t& anim; // 159
	CUtlVector<CTransform, CUtlMemory<CTransform, int> >& frames; // 160
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 158
	}
	{
		int i; // 163
	}
} /* size: 0, variables: 3 */

// <0133992F> ../public/modellib/modelbuilder.h:169
// variables: 3
inline void CAnimationGroupBuilder::SetName(int nAnimation, const char* pName)
{
	const char   __FUNCTION__; // 46700
	Animation_t& anim; // 172
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 171
	}
} /* size: 0, variables: 2 */

// <013398C9> ../public/modellib/modelbuilder.h:176
// variables: 3
inline void CAnimationGroupBuilder::SetFrameRate(int nAnimation, float fps)
{
	const char   __FUNCTION__; // 46830
	Animation_t& anim; // 179
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 178
	}
} /* size: 0, variables: 2 */

// <01339863> ../public/modellib/modelbuilder.h:183
// variables: 3
inline void CAnimationGroupBuilder::SetLooping(int nAnimation, bool looping)
{
	const char   __FUNCTION__; // 46776
	Animation_t& anim; // 186
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 185
	}
} /* size: 0, variables: 2 */

// <013397FD> ../public/modellib/modelbuilder.h:190
// variables: 3
inline void CAnimationGroupBuilder::SetDelta(int nAnimation, bool delta)
{
	const char   __FUNCTION__; // 46727
	Animation_t& anim; // 193
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 192
	}
} /* size: 0, variables: 2 */

// <01339797> ../public/modellib/modelbuilder.h:197
// variables: 3
inline void CAnimationGroupBuilder::SetDisableInterpolation(int nAnimation, bool disableInterpolation)
{
	const char   __FUNCTION__; // 47127
	Animation_t& anim; // 200
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 199
	}
} /* size: 0, variables: 2 */

// <04BCD709> ../public/modellib/modelbuilder.h:210
void CModelSkeletonSorter::~CModelSkeletonSorter()
{
} /* size: 0 */

// <04BCD6ED> ../public/modellib/modelbuilder.h:210
inline void CModelSkeletonSorter::~CModelSkeletonSorter()
{
} /* size: 0 */

// <04B61599> ../public/modellib/modelbuilder.h:210
// member functions: 38
// member variables: 5
// class size: 112
class CModelSkeletonSorter {
	/* ../public/modellib/modelbuilder.h:213 */
	void CModelSkeletonSorter(CModelSkeletonSorter* , CModelSkeletonBuilder& );
	/* ../public/modellib/modelbuilder.h:214 */
	int GetBoneCount(const CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:215 */
	bool IsIdentity(const CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:216 */
	bool SortBones(CModelSkeletonSorter* );
protected:
	/* ../public/modellib/modelbuilder.h:219 */
	void AddAllBones(CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:220 */
	void ForceSimBonesToAllLods(CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:221 */
	void PackLodBonesTogether(CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:224 */
	void ChainBoneFlagsToParents(CModelSkeletonSorter* );
	/* ../public/modellib/modelbuilder.h:225 */
	void AddBoneAndItsParents(CModelSkeletonSorter* , int, BoneFlags_t, BoneFlags_t);
private:
	CModelSkeletonBuilder & m_skeleton; /* 0 8 */
	CUtlVector<int, CUtlMemory<int, int> > m_arrSorted; /* 8 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_mapOldToNew; /* 40 32 */
	CUtlVector<bool, CUtlMemory<bool, int> > m_addedOldBone; /* 72 32 */
	BoneFlags_t m_nMaxLodMaskEncountered; /* 104 4 */
	/* ../public/modellib/modelbuilder.h:238 */
	void RemapArray(CModelSkeletonSorter* , CUtlVector<short int, CUtlMemory<short int, int> >& );
	/* ../public/modellib/modelbuilder.h:239 */
	void RemapBones(CModelSkeletonSorter* , BoneDict_t& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<Quaternion>(CModelSkeletonSorter* , CUtlVector<Quaternion, CUtlMemory<Quaternion, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<Vector>(CModelSkeletonSorter* , CUtlVector<Vector, CUtlMemory<Vector, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<CModelSkeleton::BoneFlags_t>(CModelSkeletonSorter* , CUtlVector<CModelSkeleton::BoneFlags_t, CUtlMemory<CModelSkeleton::BoneFlags_t, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<float>(CModelSkeletonSorter* , CUtlVector<float, CUtlMemory<float, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<unsigned int>(CModelSkeletonSorter* , CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<short int>(CModelSkeletonSorter* , CUtlVector<short int, CUtlMemory<short int, int> >& );
	/* modellib/modelbuilder.cpp:1082 */
	void ReorderArray<CUtlString>(CModelSkeletonSorter* , CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >& );
	void ~CModelSkeletonSorter(CModelSkeletonSorter* );
	void CModelSkeletonSorter(class CModelSkeletonSorter *, class CModelSkeletonBuilder &); /* linkage=_ZN20CModelSkeletonSorterC4ER21CModelSkeletonBuilder */
	/* <4be0183> modellib/modelbuilder.cpp:814 */
	int GetBoneCount(const class CModelSkeletonSorter  *); /* linkage=_ZNK20CModelSkeletonSorter12GetBoneCountEv */
	/* <4be020d> modellib/modelbuilder.cpp:819 */
	bool IsIdentity(const class CModelSkeletonSorter  *); /* linkage=_ZNK20CModelSkeletonSorter10IsIdentityEv */
	bool SortBones(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorter9SortBonesEv */
	/* <4be1baa> modellib/modelbuilder.cpp:878 */
	void AddAllBones(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorter11AddAllBonesEv */
	void ForceSimBonesToAllLods(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorter22ForceSimBonesToAllLodsEv */
	void PackLodBonesTogether(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorter20PackLodBonesTogetherEv */
	void ChainBoneFlagsToParents(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorter23ChainBoneFlagsToParentsEv */
	void AddBoneAndItsParents(class CModelSkeletonSorter *, int, enum BoneFlags_t, enum BoneFlags_t); /* linkage=_ZN20CModelSkeletonSorter20AddBoneAndItsParentsEiN14CModelSkeleton11BoneFlags_tES1_ */
	/* <4be02fe> modellib/modelbuilder.cpp:1103 */
	void RemapArray(class CModelSkeletonSorter *, class CUtlVector<short int, CUtlMemory<short int, int> > &); /* linkage=_ZN20CModelSkeletonSorter10RemapArrayER10CUtlVectorIs10CUtlMemoryIsiEE */
	void RemapBones(class CModelSkeletonSorter *, class BoneDict_t &); /* linkage=_ZN20CModelSkeletonSorter10RemapBonesERN14CModelSkeleton10BoneDict_tE */
	void ReorderArray<Quaternion>(class CModelSkeletonSorter *, class CUtlVector<Quaternion, CUtlMemory<Quaternion, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayI10QuaternionEEvR10CUtlVectorIT_10CUtlMemoryIS3_iEE */
	void ReorderArray<Vector>(class CModelSkeletonSorter *, class CUtlVector<Vector, CUtlMemory<Vector, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayI6VectorEEvR10CUtlVectorIT_10CUtlMemoryIS3_iEE */
	void ReorderArray<CModelSkeleton::BoneFlags_t>(class CModelSkeletonSorter *, class CUtlVector<CModelSkeleton::BoneFlags_t, CUtlMemory<CModelSkeleton::BoneFlags_t, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayIN14CModelSkeleton11BoneFlags_tEEEvR10CUtlVectorIT_10CUtlMemoryIS4_iEE */
	void ReorderArray<float>(class CModelSkeletonSorter *, class CUtlVector<float, CUtlMemory<float, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayIfEEvR10CUtlVectorIT_10CUtlMemoryIS2_iEE */
	void ReorderArray<unsigned int>(class CModelSkeletonSorter *, class CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayIjEEvR10CUtlVectorIT_10CUtlMemoryIS2_iEE */
	void ReorderArray<short int>(class CModelSkeletonSorter *, class CUtlVector<short int, CUtlMemory<short int, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayIsEEvR10CUtlVectorIT_10CUtlMemoryIS2_iEE */
	void ReorderArray<CUtlString>(class CModelSkeletonSorter *, class CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > &); /* linkage=_ZN20CModelSkeletonSorter12ReorderArrayI10CUtlStringEEvR10CUtlVectorIT_10CUtlMemoryIS3_iEE */
	void ~CModelSkeletonSorter(class CModelSkeletonSorter *); /* linkage=_ZN20CModelSkeletonSorterD4Ev */
};

// <04BA53E3> ../public/modellib/modelbuilder.h:245
void BuilderModelBoneFlexDriverControl_t::BuilderModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <04BA53C7> ../public/modellib/modelbuilder.h:245
inline void BuilderModelBoneFlexDriverControl_t::BuilderModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <04BA537F> ../public/modellib/modelbuilder.h:245
void BuilderModelBoneFlexDriverControl_t::BuilderModelBoneFlexDriverControl_t(const BuilderModelBoneFlexDriverControl_t &)
{
} /* size: 0 */

// <04BA535E> ../public/modellib/modelbuilder.h:245
inline void BuilderModelBoneFlexDriverControl_t::BuilderModelBoneFlexDriverControl_t(const BuilderModelBoneFlexDriverControl_t &)
{
} /* size: 0 */

// <01851125> ../public/modellib/modelbuilder.h:245
void BuilderModelBoneFlexDriverControl_t::~BuilderModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <01851109> ../public/modellib/modelbuilder.h:245
inline void BuilderModelBoneFlexDriverControl_t::~BuilderModelBoneFlexDriverControl_t()
{
} /* size: 0 */

// <010D38C5> ../public/modellib/modelbuilder.h:245
// member function: 1
// member variables: 4
// struct size: 24
struct BuilderModelBoneFlexDriverControl_t {
	BoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	float m_flMin; /* 16 4 */
	float m_flMax; /* 20 4 */
	void ~BuilderModelBoneFlexDriverControl_t(BuilderModelBoneFlexDriverControl_t* );
};

// <01EA6746> ../public/modellib/modelbuilder.h:245
// member functions: 2
// member variables: 4
// struct size: 24
struct BuilderModelBoneFlexDriverControl_t {
	BoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	float m_flMin; /* 16 4 */
	float m_flMax; /* 20 4 */
	void BuilderModelBoneFlexDriverControl_t(BuilderModelBoneFlexDriverControl_t* , const BuilderModelBoneFlexDriverControl_t& );
	void BuilderModelBoneFlexDriverControl_t(BuilderModelBoneFlexDriverControl_t* );
};

// <0014972B> ../public/modellib/modelbuilder.h:245
// member variables: 4
// struct size: 24
struct BuilderModelBoneFlexDriverControl_t {
	BoneFlexComponent_t m_nBoneComponent; /* 0 4 */
	CUtlString m_flexController; /* 8 8 */
	float m_flMin; /* 16 4 */
	float m_flMax; /* 20 4 */
};

// <04BAB760> ../public/modellib/modelbuilder.h:253
void BuilderModelBoneFlexDriver_t::BuilderModelBoneFlexDriver_t()
{
} /* size: 0 */

// <04BAB744> ../public/modellib/modelbuilder.h:253
inline void BuilderModelBoneFlexDriver_t::BuilderModelBoneFlexDriver_t()
{
} /* size: 0 */

// <018526F1> ../public/modellib/modelbuilder.h:253
void BuilderModelBoneFlexDriver_t::~BuilderModelBoneFlexDriver_t()
{
} /* size: 0 */

// <018526D5> ../public/modellib/modelbuilder.h:253
inline void BuilderModelBoneFlexDriver_t::~BuilderModelBoneFlexDriver_t()
{
} /* size: 0 */

// <010D504E> ../public/modellib/modelbuilder.h:253
// member function: 1
// member variables: 2
// struct size: 40
struct BuilderModelBoneFlexDriver_t {
	CUtlString m_boneName; /* 0 8 */
	CUtlVector<BuilderModelBoneFlexDriverControl_t, CUtlMemory<BuilderModelBoneFlexDriverControl_t, int> > m_controls; /* 8 32 */
	void ~BuilderModelBoneFlexDriver_t(BuilderModelBoneFlexDriver_t* );
};

// <01EA7ED9> ../public/modellib/modelbuilder.h:253
// member function: 1
// member variables: 2
// struct size: 40
struct BuilderModelBoneFlexDriver_t {
	CUtlString m_boneName; /* 0 8 */
	CUtlVector<BuilderModelBoneFlexDriverControl_t, CUtlMemory<BuilderModelBoneFlexDriverControl_t, int> > m_controls; /* 8 32 */
	void BuilderModelBoneFlexDriver_t(BuilderModelBoneFlexDriver_t* );
};

// <0014AE2C> ../public/modellib/modelbuilder.h:253
// member variables: 2
// struct size: 40
struct BuilderModelBoneFlexDriver_t {
	CUtlString m_boneName; /* 0 8 */
	CUtlVector<BuilderModelBoneFlexDriverControl_t, CUtlMemory<BuilderModelBoneFlexDriverControl_t, int> > m_controls; /* 8 32 */
};

// <010D67BA> ../public/modellib/modelbuilder.h:259
// member variable: 1
// struct size: 32
struct BuilderModelBoneFlexDriverList_t {
	CUtlVector<BuilderModelBoneFlexDriver_t, CUtlMemory<BuilderModelBoneFlexDriver_t, int> > m_drivers; /* 0 32 */
};

// <01872A21> ../public/modellib/modelbuilder.h:273
void CModelBuilder::~CModelBuilder()
{
} /* size: 0 */

// <01872A04> ../public/modellib/modelbuilder.h:273
inline void CModelBuilder::~CModelBuilder()
{
} /* size: 0 */

// <010D67FE> ../public/modellib/modelbuilder.h:273
// member functions: 85
// member variables: 25
// class size: 1,096
class CModelBuilder {
	/* ../public/modellib/modelbuilder.h:365 */
	struct CompileTimeMesh_t {
		HRenderMesh_InternalStrong m_hExtref; /* 0 8 */
		CUtlString m_EmbeddedName; /* 8 8 */
		const void * m_pEmbeddedDataBlock; /* 16 8 */
		int m_nEmbeddedDataBlockLength; /* 24 4 */
		const void * m_pEmbeddedMorphBlock; /* 32 8 */
		int m_nEmbeddedMorphBlockLength; /* 40 4 */
		void ~CompileTimeMesh_t(CompileTimeMesh_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/modellib/modelbuilder.h:276 */
	void CModelBuilder(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:278 */
	void SetName(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:280 */
	void SetModelInfo(CModelBuilder* , const CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:283 */
	void AddRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:285 */
	void AddSharedRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:287 */
	void AddCompileTimeExtrefMesh(CModelBuilder* , HRenderMesh_Internal);
	/* ../public/modellib/modelbuilder.h:289 */
	int AddCompileTimeEmbeddedMesh(CModelBuilder* , const char* , const void* , int, const void* , int);
	/* ../public/modellib/modelbuilder.h:290 */
	void AddCompileTimeEmbeddedAnimData(CModelBuilder* , const CAnimationGroup* );
	/* ../public/modellib/modelbuilder.h:292 */
	int GetRunTimeMeshCount(const CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:294 */
	CRenderMesh* GetRunTimeMesh(const CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:296 */
	void AddHiddenBodyGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:297 */
	void SetMeshGroupMaskForMesh(CModelBuilder* , int, MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:299 */
	void SetLODGroupMaskForMesh(CModelBuilder* , int, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:301 */
	void SetDefaultMeshGroupMask(CModelBuilder* , MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:304 */
	void SetPhysicsBody_Runtime(CModelBuilder* , const CPhysBodyDesc& );
	/* ../public/modellib/modelbuilder.h:305 */
	void SetPhysics_Runtime(CModelBuilder* , CPhysAggregateData* );
	/* ../public/modellib/modelbuilder.h:307 */
	void SetPhysics_CompileTimeExternal(CModelBuilder* , HPhysAggregateData_Internal);
	/* ../public/modellib/modelbuilder.h:309 */
	void AddAnimationGroupRef(CModelBuilder* , HAnimationGroup_Internal);
	/* ../public/modellib/modelbuilder.h:310 */
	void AddAnimationGroupRuntime(CModelBuilder* , CAnimationGroupResource* );
	/* ../public/modellib/modelbuilder.h:311 */
	void AppendAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:312 */
	void ReplaceAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:314 */
	int AddMeshGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:316 */
	CBuilderMaterialGroup* AddMaterialGroup(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:318 */
	int FindOrAddBone(CModelBuilder* , uint32, uint32, float, BoneFlags_t, const Vector& , const Quaternion& , const char* );
	/* ../public/modellib/modelbuilder.h:320 */
	int FindOrAddBone(CModelBuilder* , const char* , const char* , float, BoneFlags_t, const Vector& , const Quaternion& );
	/* ../public/modellib/modelbuilder.h:322 */
	void AddFlexController(CModelBuilder* , const CFlexController* );
	/* ../public/modellib/modelbuilder.h:324 */
	void CreateRemappingTableForMesh(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:325 */
	void CreateRemappingTableForMeshFromOldData(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:327 */
	void CreateEmptyRemappingTable(CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:331 */
	void AppendSkeletonsFromChildResources(CModelBuilder* , bool);
	/* ../public/modellib/modelbuilder.h:333 */
	void AppendFlexControllers(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:334 */
	void AppendFlexControllersFromOldData(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:336 */
	void AppendFlexControllers(CModelBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:338 */
	void AddBoneFlexDriver(CModelBuilder* , const char* , int, const BuilderModelBoneFlexDriverControl_t* );
	/* ../public/modellib/modelbuilder.h:339 */
	void AddBoneFlexDrivers(CModelBuilder* , const BuilderModelBoneFlexDriverList_t* );
	/* ../public/modellib/modelbuilder.h:342 */
	void InitFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:344 */
	void FillInPermData(CModelBuilder* , PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:346 */
	PermModelData_t* AllocateAndCompile(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:348 */
	void DestroyPermDataPointer(const PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:356 */
	void ValidateBuilderType(CModelBuilder* , EBuildertype_t);
	CUtlString m_name; /* 0 8 */
	CBuilderModelInfo m_modelInfo; /* 8 96 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 104 32 */
	CUtlVector<CSmartPtr<CRenderMesh, CRefCountAccessor>, CUtlMemory<CSmartPtr<CRenderMesh, CRefCountAccessor>, int> > m_RunTimeMeshes; /* 136 32 */
	CUtlVector<CModelBuilder::CompileTimeMesh_t, CUtlMemory<CModelBuilder::CompileTimeMesh_t, int> > m_CompileTimeMeshes; /* 168 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 200 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 232 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 264 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 296 32 */
	CUtlVector<CBuilderMaterialGroup, CUtlMemory<CBuilderMaterialGroup, int> > m_materialGroups; /* 328 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask; /* 360 8 */
	CModelSkeletonBuilder m_skeletonBuilder; /* 368 288 */
	CUtlStringMap<int, CUtlSymbolTable> m_namedFlexControllers; /* 656 176 */
	CUtlVector<const CFlexController*, CUtlMemory<const CFlexController*, int> > m_flexControllers; /* 832 32 */
	CUtlVector<CUtlVector<short int, CUtlMemory<short int, int> >, CUtlMemory<CUtlVector<short int, CUtlMemory<short int, int> >, int> > m_remappingTables; /* 864 32 */
	CUtlVector<BuilderModelBoneFlexDriver_t, CUtlMemory<BuilderModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 896 32 */
	HPhysAggregateData_InternalStrong m_hCompileTimeExternalPhysics; /* 928 8 */
	void * m_pCompileTimeEmbeddedPhysicsData; /* 936 8 */
	int m_nCompileTimeEmbeddedPhysicsDataSize; /* 944 4 */
	CPhysAggregateDataHandle m_RunTimePhysicsData; /* 952 8 */
	const class CAnimationGroup * m_pCompileTime_EmbeddedAnimGroup; /* 960 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_CompileTimeAnimGroups; /* 968 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_RuntimeAnimGroups; /* 1000 32 */
private:
	/* ../public/modellib/modelbuilder.h:411 */
	void CreateRemappingTableForMorphSetData(CModelBuilder* , RemappingTable_t& , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:394 */
	typedef struct CUtlVector<short int, CUtlMemory<short int, int> > RemappingTable_t;
	CUtlVector<int, CUtlMemory<int, int> > m_traceIndices; /* 1032 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_traceVertices; /* 1064 32 */
	void ~CModelBuilder(CModelBuilder* );
	void CModelBuilder(class CModelBuilder *); /* linkage=_ZN13CModelBuilderC4Ev */
	void SetName(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder7SetNameEPKc */
	void SetModelInfo(class CModelBuilder *, const class CBuilderModelInfo  *); /* linkage=_ZN13CModelBuilder12SetModelInfoEPK17CBuilderModelInfo */
	void AddRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder14AddRunTimeMeshEP11CRenderMeshyh */
	void AddSharedRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder20AddSharedRunTimeMeshEP11CRenderMeshyh */
	void AddCompileTimeExtrefMesh(class CModelBuilder *, HRenderMesh_Internal); /* linkage=_ZN13CModelBuilder24AddCompileTimeExtrefMeshE11CWeakHandleI30InfoForResourceTypeCRenderMeshE */
	int AddCompileTimeEmbeddedMesh(class CModelBuilder *, const char  *, const void  *, int, const void  *, int); /* linkage=_ZN13CModelBuilder26AddCompileTimeEmbeddedMeshEPKcPKviS3_i */
	void AddCompileTimeEmbeddedAnimData(class CModelBuilder *, const class CAnimationGroup  *); /* linkage=_ZN13CModelBuilder30AddCompileTimeEmbeddedAnimDataEPK15CAnimationGroup */
	/* <4be04bc> modellib/modelbuilder.cpp:1209 */
	int GetRunTimeMeshCount(const class CModelBuilder  *); /* linkage=_ZNK13CModelBuilder19GetRunTimeMeshCountEv */
	/* <4be0516> modellib/modelbuilder.cpp:1214 */
	class CRenderMesh * GetRunTimeMesh(const class CModelBuilder  *, int); /* linkage=_ZNK13CModelBuilder14GetRunTimeMeshEi */
	void AddHiddenBodyGroup(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder18AddHiddenBodyGroupEPKc */
	/* <4be05df> modellib/modelbuilder.cpp:1224 */
	void SetMeshGroupMaskForMesh(class CModelBuilder *, int, MeshGroupMask_t); /* linkage=_ZN13CModelBuilder23SetMeshGroupMaskForMeshEiy */
	/* <4be067a> modellib/modelbuilder.cpp:1229 */
	void SetLODGroupMaskForMesh(class CModelBuilder *, int, LODGroupMask_t); /* linkage=_ZN13CModelBuilder22SetLODGroupMaskForMeshEih */
	void SetDefaultMeshGroupMask(class CModelBuilder *, MeshGroupMask_t); /* linkage=_ZN13CModelBuilder23SetDefaultMeshGroupMaskEy */
	void SetPhysicsBody_Runtime(class CModelBuilder *, const class CPhysBodyDesc  &); /* linkage=_ZN13CModelBuilder22SetPhysicsBody_RuntimeERK13CPhysBodyDesc */
	/* <4be0715> modellib/modelbuilder.cpp:1245 */
	void SetPhysics_Runtime(class CModelBuilder *, class CPhysAggregateData *); /* linkage=_ZN13CModelBuilder18SetPhysics_RuntimeEP18CPhysAggregateData */
	void SetPhysics_CompileTimeExternal(class CModelBuilder *, HPhysAggregateData_Internal); /* linkage=_ZN13CModelBuilder30SetPhysics_CompileTimeExternalE11CWeakHandleI37InfoForResourceTypeCPhysAggregateDataE */
	void AddAnimationGroupRef(class CModelBuilder *, HAnimationGroup_Internal); /* linkage=_ZN13CModelBuilder20AddAnimationGroupRefE11CWeakHandleI34InfoForResourceTypeCAnimationGroupE */
	/* <4be1cc7> modellib/modelbuilder.cpp:1261 */
	void AddAnimationGroupRuntime(class CModelBuilder *, class CAnimationGroupResource *); /* linkage=_ZN13CModelBuilder24AddAnimationGroupRuntimeEP23CAnimationGroupResource */
	void AppendAnimationsFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder25AppendAnimationsFromModelEPK6CModel */
	void ReplaceAnimationsFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder26ReplaceAnimationsFromModelEPK6CModel */
	int AddMeshGroup(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder12AddMeshGroupEPKc */
	class CBuilderMaterialGroup * AddMaterialGroup(class CModelBuilder *); /* linkage=_ZN13CModelBuilder16AddMaterialGroupEv */
	int FindOrAddBone(class CModelBuilder *, uint32, uint32, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &, const char  *); /* linkage=_ZN13CModelBuilder13FindOrAddBoneEjjfN14CModelSkeleton11BoneFlags_tERK6VectorRK10QuaternionPKc */
	int FindOrAddBone(class CModelBuilder *, const char  *, const char  *, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &); /* linkage=_ZN13CModelBuilder13FindOrAddBoneEPKcS1_fN14CModelSkeleton11BoneFlags_tERK6VectorRK10Quaternion */
	void AddFlexController(class CModelBuilder *, const class CFlexController  *); /* linkage=_ZN13CModelBuilder17AddFlexControllerEPK15CFlexController */
	void CreateRemappingTableForMesh(class CModelBuilder *, int, const class CRenderMesh  *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder27CreateRemappingTableForMeshEiPK11CRenderMeshPK13CMorphSetData */
	void CreateRemappingTableForMeshFromOldData(class CModelBuilder *, int, const class CRenderMesh  *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder38CreateRemappingTableForMeshFromOldDataEiPK11CRenderMeshPK13CMorphSetData */
	void CreateEmptyRemappingTable(class CModelBuilder *, int); /* linkage=_ZN13CModelBuilder25CreateEmptyRemappingTableEi */
	void AppendSkeletonsFromChildResources(class CModelBuilder *, bool); /* linkage=_ZN13CModelBuilder33AppendSkeletonsFromChildResourcesEb */
	/* <4be186b> modellib/modelbuilder.cpp:1484 */
	void AppendFlexControllers(class CModelBuilder *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder21AppendFlexControllersEPK13CMorphSetData */
	void AppendFlexControllersFromOldData(class CModelBuilder *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder32AppendFlexControllersFromOldDataEPK13CMorphSetData */
	/* <4be1987> modellib/modelbuilder.cpp:1497 */
	void AppendFlexControllers(class CModelBuilder *, const class CRenderMesh  *); /* linkage=_ZN13CModelBuilder21AppendFlexControllersEPK11CRenderMesh */
	void AddBoneFlexDriver(class CModelBuilder *, const char  *, int, const class BuilderModelBoneFlexDriverControl_t  *); /* linkage=_ZN13CModelBuilder17AddBoneFlexDriverEPKciPK35BuilderModelBoneFlexDriverControl_t */
	void AddBoneFlexDrivers(class CModelBuilder *, const class BuilderModelBoneFlexDriverList_t  *); /* linkage=_ZN13CModelBuilder18AddBoneFlexDriversEPK32BuilderModelBoneFlexDriverList_t */
	void InitFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder13InitFromModelEPK6CModel */
	void FillInPermData(class CModelBuilder *, class PermModelData_t *); /* linkage=_ZN13CModelBuilder14FillInPermDataEP15PermModelData_t */
	class PermModelData_t * AllocateAndCompile(class CModelBuilder *); /* linkage=_ZN13CModelBuilder18AllocateAndCompileEv */
	void DestroyPermDataPointer(const class PermModelData_t  *); /* linkage=_ZN13CModelBuilder22DestroyPermDataPointerEPK15PermModelData_t */
	void ValidateBuilderType(class CModelBuilder *, enum EBuildertype_t); /* linkage=_ZN13CModelBuilder19ValidateBuilderTypeE14EBuildertype_t */
	void CreateRemappingTableForMorphSetData(class CModelBuilder *, RemappingTable_t &, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder35CreateRemappingTableForMorphSetDataER10CUtlVectorIs10CUtlMemoryIsiEEPK13CMorphSetData */
	void ~CModelBuilder(class CModelBuilder *); /* linkage=_ZN13CModelBuilderD4Ev */
};

// <04B64862> ../public/modellib/modelbuilder.h:273
// member functions: 84
// member variables: 25
// class size: 1,096
class CModelBuilder {
	/* ../public/modellib/modelbuilder.h:365 */
	struct CompileTimeMesh_t {
		HRenderMesh_InternalStrong m_hExtref; /* 0 8 */
		CUtlString m_EmbeddedName; /* 8 8 */
		const void * m_pEmbeddedDataBlock; /* 16 8 */
		int m_nEmbeddedDataBlockLength; /* 24 4 */
		const void * m_pEmbeddedMorphBlock; /* 32 8 */
		int m_nEmbeddedMorphBlockLength; /* 40 4 */
		void CompileTimeMesh_t(CompileTimeMesh_t* );
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/modellib/modelbuilder.h:276 */
	void CModelBuilder(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:278 */
	void SetName(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:280 */
	void SetModelInfo(CModelBuilder* , const CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:283 */
	void AddRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:285 */
	void AddSharedRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:287 */
	void AddCompileTimeExtrefMesh(CModelBuilder* , HRenderMesh_Internal);
	/* ../public/modellib/modelbuilder.h:289 */
	int AddCompileTimeEmbeddedMesh(CModelBuilder* , const char* , const void* , int, const void* , int);
	/* ../public/modellib/modelbuilder.h:290 */
	void AddCompileTimeEmbeddedAnimData(CModelBuilder* , const CAnimationGroup* );
	/* ../public/modellib/modelbuilder.h:292 */
	int GetRunTimeMeshCount(const CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:294 */
	CRenderMesh* GetRunTimeMesh(const CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:296 */
	void AddHiddenBodyGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:297 */
	void SetMeshGroupMaskForMesh(CModelBuilder* , int, MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:299 */
	void SetLODGroupMaskForMesh(CModelBuilder* , int, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:301 */
	void SetDefaultMeshGroupMask(CModelBuilder* , MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:304 */
	void SetPhysicsBody_Runtime(CModelBuilder* , const CPhysBodyDesc& );
	/* ../public/modellib/modelbuilder.h:305 */
	void SetPhysics_Runtime(CModelBuilder* , CPhysAggregateData* );
	/* ../public/modellib/modelbuilder.h:307 */
	void SetPhysics_CompileTimeExternal(CModelBuilder* , HPhysAggregateData_Internal);
	/* ../public/modellib/modelbuilder.h:309 */
	void AddAnimationGroupRef(CModelBuilder* , HAnimationGroup_Internal);
	/* ../public/modellib/modelbuilder.h:310 */
	void AddAnimationGroupRuntime(CModelBuilder* , CAnimationGroupResource* );
	/* ../public/modellib/modelbuilder.h:311 */
	void AppendAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:312 */
	void ReplaceAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:314 */
	int AddMeshGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:316 */
	CBuilderMaterialGroup* AddMaterialGroup(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:318 */
	int FindOrAddBone(CModelBuilder* , uint32, uint32, float, BoneFlags_t, const Vector& , const Quaternion& , const char* );
	/* ../public/modellib/modelbuilder.h:320 */
	int FindOrAddBone(CModelBuilder* , const char* , const char* , float, BoneFlags_t, const Vector& , const Quaternion& );
	/* ../public/modellib/modelbuilder.h:322 */
	void AddFlexController(CModelBuilder* , const CFlexController* );
	/* ../public/modellib/modelbuilder.h:324 */
	void CreateRemappingTableForMesh(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:325 */
	void CreateRemappingTableForMeshFromOldData(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:327 */
	void CreateEmptyRemappingTable(CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:331 */
	void AppendSkeletonsFromChildResources(CModelBuilder* , bool);
	/* ../public/modellib/modelbuilder.h:333 */
	void AppendFlexControllers(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:334 */
	void AppendFlexControllersFromOldData(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:336 */
	void AppendFlexControllers(CModelBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:338 */
	void AddBoneFlexDriver(CModelBuilder* , const char* , int, const BuilderModelBoneFlexDriverControl_t* );
	/* ../public/modellib/modelbuilder.h:339 */
	void AddBoneFlexDrivers(CModelBuilder* , const BuilderModelBoneFlexDriverList_t* );
	/* ../public/modellib/modelbuilder.h:342 */
	void InitFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:344 */
	void FillInPermData(CModelBuilder* , PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:346 */
	PermModelData_t* AllocateAndCompile(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:348 */
	void DestroyPermDataPointer(const PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:356 */
	void ValidateBuilderType(CModelBuilder* , EBuildertype_t);
	CUtlString m_name; /* 0 8 */
	CBuilderModelInfo m_modelInfo; /* 8 96 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 104 32 */
	CUtlVector<CSmartPtr<CRenderMesh, CRefCountAccessor>, CUtlMemory<CSmartPtr<CRenderMesh, CRefCountAccessor>, int> > m_RunTimeMeshes; /* 136 32 */
	CUtlVector<CModelBuilder::CompileTimeMesh_t, CUtlMemory<CModelBuilder::CompileTimeMesh_t, int> > m_CompileTimeMeshes; /* 168 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 200 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 232 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 264 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 296 32 */
	CUtlVector<CBuilderMaterialGroup, CUtlMemory<CBuilderMaterialGroup, int> > m_materialGroups; /* 328 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask; /* 360 8 */
	CModelSkeletonBuilder m_skeletonBuilder; /* 368 288 */
	CUtlStringMap<int, CUtlSymbolTable> m_namedFlexControllers; /* 656 176 */
	CUtlVector<const CFlexController*, CUtlMemory<const CFlexController*, int> > m_flexControllers; /* 832 32 */
	CUtlVector<CUtlVector<short int, CUtlMemory<short int, int> >, CUtlMemory<CUtlVector<short int, CUtlMemory<short int, int> >, int> > m_remappingTables; /* 864 32 */
	CUtlVector<BuilderModelBoneFlexDriver_t, CUtlMemory<BuilderModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 896 32 */
	HPhysAggregateData_InternalStrong m_hCompileTimeExternalPhysics; /* 928 8 */
	void * m_pCompileTimeEmbeddedPhysicsData; /* 936 8 */
	int m_nCompileTimeEmbeddedPhysicsDataSize; /* 944 4 */
	CPhysAggregateDataHandle m_RunTimePhysicsData; /* 952 8 */
	const class CAnimationGroup * m_pCompileTime_EmbeddedAnimGroup; /* 960 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_CompileTimeAnimGroups; /* 968 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_RuntimeAnimGroups; /* 1000 32 */
private:
	/* ../public/modellib/modelbuilder.h:411 */
	void CreateRemappingTableForMorphSetData(CModelBuilder* , RemappingTable_t& , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:394 */
	typedef struct CUtlVector<short int, CUtlMemory<short int, int> > RemappingTable_t;
	CUtlVector<int, CUtlMemory<int, int> > m_traceIndices; /* 1032 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_traceVertices; /* 1064 32 */
	void CModelBuilder(class CModelBuilder *); /* linkage=_ZN13CModelBuilderC4Ev */
	void SetName(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder7SetNameEPKc */
	void SetModelInfo(class CModelBuilder *, const class CBuilderModelInfo  *); /* linkage=_ZN13CModelBuilder12SetModelInfoEPK17CBuilderModelInfo */
	void AddRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder14AddRunTimeMeshEP11CRenderMeshyh */
	void AddSharedRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder20AddSharedRunTimeMeshEP11CRenderMeshyh */
	void AddCompileTimeExtrefMesh(class CModelBuilder *, HRenderMesh_Internal); /* linkage=_ZN13CModelBuilder24AddCompileTimeExtrefMeshE11CWeakHandleI30InfoForResourceTypeCRenderMeshE */
	int AddCompileTimeEmbeddedMesh(class CModelBuilder *, const char  *, const void  *, int, const void  *, int); /* linkage=_ZN13CModelBuilder26AddCompileTimeEmbeddedMeshEPKcPKviS3_i */
	void AddCompileTimeEmbeddedAnimData(class CModelBuilder *, const class CAnimationGroup  *); /* linkage=_ZN13CModelBuilder30AddCompileTimeEmbeddedAnimDataEPK15CAnimationGroup */
	/* <4be04bc> modellib/modelbuilder.cpp:1209 */
	int GetRunTimeMeshCount(const class CModelBuilder  *); /* linkage=_ZNK13CModelBuilder19GetRunTimeMeshCountEv */
	/* <4be0516> modellib/modelbuilder.cpp:1214 */
	class CRenderMesh * GetRunTimeMesh(const class CModelBuilder  *, int); /* linkage=_ZNK13CModelBuilder14GetRunTimeMeshEi */
	void AddHiddenBodyGroup(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder18AddHiddenBodyGroupEPKc */
	/* <4be05df> modellib/modelbuilder.cpp:1224 */
	void SetMeshGroupMaskForMesh(class CModelBuilder *, int, MeshGroupMask_t); /* linkage=_ZN13CModelBuilder23SetMeshGroupMaskForMeshEiy */
	/* <4be067a> modellib/modelbuilder.cpp:1229 */
	void SetLODGroupMaskForMesh(class CModelBuilder *, int, LODGroupMask_t); /* linkage=_ZN13CModelBuilder22SetLODGroupMaskForMeshEih */
	void SetDefaultMeshGroupMask(class CModelBuilder *, MeshGroupMask_t); /* linkage=_ZN13CModelBuilder23SetDefaultMeshGroupMaskEy */
	void SetPhysicsBody_Runtime(class CModelBuilder *, const class CPhysBodyDesc  &); /* linkage=_ZN13CModelBuilder22SetPhysicsBody_RuntimeERK13CPhysBodyDesc */
	/* <4be0715> modellib/modelbuilder.cpp:1245 */
	void SetPhysics_Runtime(class CModelBuilder *, class CPhysAggregateData *); /* linkage=_ZN13CModelBuilder18SetPhysics_RuntimeEP18CPhysAggregateData */
	void SetPhysics_CompileTimeExternal(class CModelBuilder *, HPhysAggregateData_Internal); /* linkage=_ZN13CModelBuilder30SetPhysics_CompileTimeExternalE11CWeakHandleI37InfoForResourceTypeCPhysAggregateDataE */
	void AddAnimationGroupRef(class CModelBuilder *, HAnimationGroup_Internal); /* linkage=_ZN13CModelBuilder20AddAnimationGroupRefE11CWeakHandleI34InfoForResourceTypeCAnimationGroupE */
	/* <4be1cc7> modellib/modelbuilder.cpp:1261 */
	void AddAnimationGroupRuntime(class CModelBuilder *, class CAnimationGroupResource *); /* linkage=_ZN13CModelBuilder24AddAnimationGroupRuntimeEP23CAnimationGroupResource */
	void AppendAnimationsFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder25AppendAnimationsFromModelEPK6CModel */
	void ReplaceAnimationsFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder26ReplaceAnimationsFromModelEPK6CModel */
	int AddMeshGroup(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder12AddMeshGroupEPKc */
	class CBuilderMaterialGroup * AddMaterialGroup(class CModelBuilder *); /* linkage=_ZN13CModelBuilder16AddMaterialGroupEv */
	int FindOrAddBone(class CModelBuilder *, uint32, uint32, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &, const char  *); /* linkage=_ZN13CModelBuilder13FindOrAddBoneEjjfN14CModelSkeleton11BoneFlags_tERK6VectorRK10QuaternionPKc */
	int FindOrAddBone(class CModelBuilder *, const char  *, const char  *, float, enum BoneFlags_t, const class Vector  &, const class Quaternion  &); /* linkage=_ZN13CModelBuilder13FindOrAddBoneEPKcS1_fN14CModelSkeleton11BoneFlags_tERK6VectorRK10Quaternion */
	void AddFlexController(class CModelBuilder *, const class CFlexController  *); /* linkage=_ZN13CModelBuilder17AddFlexControllerEPK15CFlexController */
	void CreateRemappingTableForMesh(class CModelBuilder *, int, const class CRenderMesh  *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder27CreateRemappingTableForMeshEiPK11CRenderMeshPK13CMorphSetData */
	void CreateRemappingTableForMeshFromOldData(class CModelBuilder *, int, const class CRenderMesh  *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder38CreateRemappingTableForMeshFromOldDataEiPK11CRenderMeshPK13CMorphSetData */
	void CreateEmptyRemappingTable(class CModelBuilder *, int); /* linkage=_ZN13CModelBuilder25CreateEmptyRemappingTableEi */
	void AppendSkeletonsFromChildResources(class CModelBuilder *, bool); /* linkage=_ZN13CModelBuilder33AppendSkeletonsFromChildResourcesEb */
	/* <4be186b> modellib/modelbuilder.cpp:1484 */
	void AppendFlexControllers(class CModelBuilder *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder21AppendFlexControllersEPK13CMorphSetData */
	void AppendFlexControllersFromOldData(class CModelBuilder *, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder32AppendFlexControllersFromOldDataEPK13CMorphSetData */
	/* <4be1987> modellib/modelbuilder.cpp:1497 */
	void AppendFlexControllers(class CModelBuilder *, const class CRenderMesh  *); /* linkage=_ZN13CModelBuilder21AppendFlexControllersEPK11CRenderMesh */
	void AddBoneFlexDriver(class CModelBuilder *, const char  *, int, const class BuilderModelBoneFlexDriverControl_t  *); /* linkage=_ZN13CModelBuilder17AddBoneFlexDriverEPKciPK35BuilderModelBoneFlexDriverControl_t */
	void AddBoneFlexDrivers(class CModelBuilder *, const class BuilderModelBoneFlexDriverList_t  *); /* linkage=_ZN13CModelBuilder18AddBoneFlexDriversEPK32BuilderModelBoneFlexDriverList_t */
	void InitFromModel(class CModelBuilder *, const class CModel  *); /* linkage=_ZN13CModelBuilder13InitFromModelEPK6CModel */
	void FillInPermData(class CModelBuilder *, class PermModelData_t *); /* linkage=_ZN13CModelBuilder14FillInPermDataEP15PermModelData_t */
	class PermModelData_t * AllocateAndCompile(class CModelBuilder *); /* linkage=_ZN13CModelBuilder18AllocateAndCompileEv */
	void DestroyPermDataPointer(const class PermModelData_t  *); /* linkage=_ZN13CModelBuilder22DestroyPermDataPointerEPK15PermModelData_t */
	void ValidateBuilderType(class CModelBuilder *, enum EBuildertype_t); /* linkage=_ZN13CModelBuilder19ValidateBuilderTypeE14EBuildertype_t */
	void CreateRemappingTableForMorphSetData(class CModelBuilder *, RemappingTable_t &, const class CMorphSetData  *); /* linkage=_ZN13CModelBuilder35CreateRemappingTableForMorphSetDataER10CUtlVectorIs10CUtlMemoryIsiEEPK13CMorphSetData */
	void ~CModelBuilder(class CModelBuilder *); /* linkage=_ZN13CModelBuilderD4Ev */
};

// <0014C58D> ../public/modellib/modelbuilder.h:273
// member functions: 83
// member variables: 25
// class size: 1,096
class CModelBuilder {
	/* ../public/modellib/modelbuilder.h:365 */
	struct CompileTimeMesh_t {
		HRenderMesh_InternalStrong m_hExtref; /* 0 8 */
		CUtlString m_EmbeddedName; /* 8 8 */
		const void * m_pEmbeddedDataBlock; /* 16 8 */
		int m_nEmbeddedDataBlockLength; /* 24 4 */
		const void * m_pEmbeddedMorphBlock; /* 32 8 */
		int m_nEmbeddedMorphBlockLength; /* 40 4 */
	};
	/* tag__fprintf: const_type tag not supported! */;
	/* ../public/modellib/modelbuilder.h:276 */
	void CModelBuilder(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:278 */
	void SetName(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:280 */
	void SetModelInfo(CModelBuilder* , const CBuilderModelInfo* );
	/* ../public/modellib/modelbuilder.h:283 */
	void AddRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:285 */
	void AddSharedRunTimeMesh(CModelBuilder* , CRenderMesh* , MeshGroupMask_t, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:287 */
	void AddCompileTimeExtrefMesh(CModelBuilder* , HRenderMesh_Internal);
	/* ../public/modellib/modelbuilder.h:289 */
	int AddCompileTimeEmbeddedMesh(CModelBuilder* , const char* , const void* , int, const void* , int);
	/* ../public/modellib/modelbuilder.h:290 */
	void AddCompileTimeEmbeddedAnimData(CModelBuilder* , const CAnimationGroup* );
	/* ../public/modellib/modelbuilder.h:292 */
	int GetRunTimeMeshCount(const CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:294 */
	CRenderMesh* GetRunTimeMesh(const CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:296 */
	void AddHiddenBodyGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:297 */
	void SetMeshGroupMaskForMesh(CModelBuilder* , int, MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:299 */
	void SetLODGroupMaskForMesh(CModelBuilder* , int, LODGroupMask_t);
	/* ../public/modellib/modelbuilder.h:301 */
	void SetDefaultMeshGroupMask(CModelBuilder* , MeshGroupMask_t);
	/* ../public/modellib/modelbuilder.h:304 */
	void SetPhysicsBody_Runtime(CModelBuilder* , const CPhysBodyDesc& );
	/* ../public/modellib/modelbuilder.h:305 */
	void SetPhysics_Runtime(CModelBuilder* , CPhysAggregateData* );
	/* ../public/modellib/modelbuilder.h:307 */
	void SetPhysics_CompileTimeExternal(CModelBuilder* , HPhysAggregateData_Internal);
	/* ../public/modellib/modelbuilder.h:309 */
	void AddAnimationGroupRef(CModelBuilder* , HAnimationGroup_Internal);
	/* ../public/modellib/modelbuilder.h:310 */
	void AddAnimationGroupRuntime(CModelBuilder* , CAnimationGroupResource* );
	/* ../public/modellib/modelbuilder.h:311 */
	void AppendAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:312 */
	void ReplaceAnimationsFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:314 */
	int AddMeshGroup(CModelBuilder* , const char* );
	/* ../public/modellib/modelbuilder.h:316 */
	CBuilderMaterialGroup* AddMaterialGroup(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:318 */
	int FindOrAddBone(CModelBuilder* , uint32, uint32, float, BoneFlags_t, const Vector& , const Quaternion& , const char* );
	/* ../public/modellib/modelbuilder.h:320 */
	int FindOrAddBone(CModelBuilder* , const char* , const char* , float, BoneFlags_t, const Vector& , const Quaternion& );
	/* ../public/modellib/modelbuilder.h:322 */
	void AddFlexController(CModelBuilder* , const CFlexController* );
	/* ../public/modellib/modelbuilder.h:324 */
	void CreateRemappingTableForMesh(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:325 */
	void CreateRemappingTableForMeshFromOldData(CModelBuilder* , int, const CRenderMesh* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:327 */
	void CreateEmptyRemappingTable(CModelBuilder* , int);
	/* ../public/modellib/modelbuilder.h:331 */
	void AppendSkeletonsFromChildResources(CModelBuilder* , bool);
	/* ../public/modellib/modelbuilder.h:333 */
	void AppendFlexControllers(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:334 */
	void AppendFlexControllersFromOldData(CModelBuilder* , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:336 */
	void AppendFlexControllers(CModelBuilder* , const CRenderMesh* );
	/* ../public/modellib/modelbuilder.h:338 */
	void AddBoneFlexDriver(CModelBuilder* , const char* , int, const BuilderModelBoneFlexDriverControl_t* );
	/* ../public/modellib/modelbuilder.h:339 */
	void AddBoneFlexDrivers(CModelBuilder* , const BuilderModelBoneFlexDriverList_t* );
	/* ../public/modellib/modelbuilder.h:342 */
	void InitFromModel(CModelBuilder* , const CModel* );
	/* ../public/modellib/modelbuilder.h:344 */
	void FillInPermData(CModelBuilder* , PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:346 */
	PermModelData_t* AllocateAndCompile(CModelBuilder* );
	/* ../public/modellib/modelbuilder.h:348 */
	void DestroyPermDataPointer(const PermModelData_t* );
	/* ../public/modellib/modelbuilder.h:356 */
	void ValidateBuilderType(CModelBuilder* , EBuildertype_t);
	CUtlString m_name; /* 0 8 */
	CBuilderModelInfo m_modelInfo; /* 8 96 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_BodyGroupsHiddenInTools; /* 104 32 */
	CUtlVector<CSmartPtr<CRenderMesh, CRefCountAccessor>, CUtlMemory<CSmartPtr<CRenderMesh, CRefCountAccessor>, int> > m_RunTimeMeshes; /* 136 32 */
	CUtlVector<CModelBuilder::CompileTimeMesh_t, CUtlMemory<CModelBuilder::CompileTimeMesh_t, int> > m_CompileTimeMeshes; /* 168 32 */
	CUtlVector<long long unsigned int, CUtlMemory<long long unsigned int, int> > m_refMeshGroupMasks; /* 200 32 */
	CUtlVector<unsigned char, CUtlMemory<unsigned char, int> > m_refLODGroupMasks; /* 232 32 */
	CUtlVector<float, CUtlMemory<float, int> > m_lodGroupSwitchDistances; /* 264 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_meshGroups; /* 296 32 */
	CUtlVector<CBuilderMaterialGroup, CUtlMemory<CBuilderMaterialGroup, int> > m_materialGroups; /* 328 32 */
	MeshGroupMask_t m_nDefaultMeshGroupMask; /* 360 8 */
	CModelSkeletonBuilder m_skeletonBuilder; /* 368 288 */
	CUtlStringMap<int, CUtlSymbolTable> m_namedFlexControllers; /* 656 176 */
	CUtlVector<const CFlexController*, CUtlMemory<const CFlexController*, int> > m_flexControllers; /* 832 32 */
	CUtlVector<CUtlVector<short int, CUtlMemory<short int, int> >, CUtlMemory<CUtlVector<short int, CUtlMemory<short int, int> >, int> > m_remappingTables; /* 864 32 */
	CUtlVector<BuilderModelBoneFlexDriver_t, CUtlMemory<BuilderModelBoneFlexDriver_t, int> > m_boneFlexDrivers; /* 896 32 */
	HPhysAggregateData_InternalStrong m_hCompileTimeExternalPhysics; /* 928 8 */
	void * m_pCompileTimeEmbeddedPhysicsData; /* 936 8 */
	int m_nCompileTimeEmbeddedPhysicsDataSize; /* 944 4 */
	CPhysAggregateDataHandle m_RunTimePhysicsData; /* 952 8 */
	const class CAnimationGroup * m_pCompileTime_EmbeddedAnimGroup; /* 960 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_CompileTimeAnimGroups; /* 968 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_RuntimeAnimGroups; /* 1000 32 */
private:
	/* ../public/modellib/modelbuilder.h:411 */
	void CreateRemappingTableForMorphSetData(CModelBuilder* , RemappingTable_t& , const CMorphSetData* );
	/* ../public/modellib/modelbuilder.h:394 */
	typedef struct CUtlVector<short int, CUtlMemory<short int, int> > RemappingTable_t;
	CUtlVector<int, CUtlMemory<int, int> > m_traceIndices; /* 1032 32 */
	CUtlVector<Vector, CUtlMemory<Vector, int> > m_traceVertices; /* 1064 32 */
	void CModelBuilder(class CModelBuilder *); /* linkage=_ZN13CModelBuilderC4Ev */
	void SetName(class CModelBuilder *, const char  *); /* linkage=_ZN13CModelBuilder7SetNameEPKc */
	void SetModelInfo(class CModelBuilder *, const class CBuilderModelInfo  *); /* linkage=_ZN13CModelBuilder12SetModelInfoEPK17CBuilderModelInfo */
	void AddRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder14AddRunTimeMeshEP11CRenderMeshyh */
	void AddSharedRunTimeMesh(class CModelBuilder *, class CRenderMesh *, MeshGroupMask_t, LODGroupMask_t); /* linkage=_ZN13CModelBuilder20AddSharedRunTimeMeshEP11CRenderMeshyh */
	void AddCompileTimeExtrefMesh(class CModelBuilder *, HRenderMesh_Internal); /* linkage=_ZN13CModelBuilder24AddCompileTimeExtrefMeshE11CWeakHandleI30InfoForResourceTypeCRenderMeshE */
