
//
// public/modellib/vrskeletalinputsettings.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 31
//	classes: 19
//

// <053A26DD> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:16
void CFingerSource::CFingerSource()
{
} /* size: 0 */

// <053A26C1> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:16
inline void CFingerSource::CFingerSource()
{
} /* size: 0 */

// <049CC8B5> ../public/modellib/vrskeletalinputsettings.h:16
// member functions: 27
// member variables: 2
// static member variable: 1
// class size: 8
class CFingerSource {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	CFingerSource* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_CompileTimeVerificationFunction(CFingerSource* );
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerSource* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	CFingerSource* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad(CFingerSource* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave_CFingerSource(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad_CFingerSource(CFingerSource* , CKV3TransferLoadContext* );
	AnimVRFinger_t m_nFingerIndex; /* 0 4 */
	float m_flFingerWeight; /* 4 4 */
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN13CFingerSource17GetPrimaryBindingEv */
	class CFingerSource * Schema_MarkHelperFn(void); /* linkage=_ZN13CFingerSource19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN13CFingerSource15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a350f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:91 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN13CFingerSource32Schema_VerifyBindingIsRegisteredEv */
	/* <53a34e5> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:34 */
	void Schema_CompileTimeVerificationFunction(class CFingerSource *); /* linkage=_ZN13CFingerSource38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN13CFingerSource20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN13CFingerSource22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerSource  *); /* linkage=_ZNK13CFingerSource21Schema_DynamicBindingEv */
	class CFingerSource * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN13CFingerSource32KV3TransferAllocateClassInstanceEPKc */
	/* <53a355d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:99 */
	void KV3TransferSave(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a35b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:110 */
	void KV3TransferLoad(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerSource(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource29KV3TransferSave_CFingerSourceEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerSource(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource29KV3TransferLoad_CFingerSourceEP23CKV3TransferLoadContext */
	void CFingerSource(class CFingerSource *); /* linkage=_ZN13CFingerSourceC4Ev */
};

// <04F25A12> ../public/modellib/vrskeletalinputsettings.h:16
// member functions: 28
// member variables: 2
// static member variable: 1
// class size: 8
class CFingerSource {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	CFingerSource* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_CompileTimeVerificationFunction(CFingerSource* );
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerSource* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	CFingerSource* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad(CFingerSource* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave_CFingerSource(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad_CFingerSource(CFingerSource* , CKV3TransferLoadContext* );
	AnimVRFinger_t m_nFingerIndex; /* 0 4 */
	float m_flFingerWeight; /* 4 4 */
	void CFingerSource(CFingerSource* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN13CFingerSource17GetPrimaryBindingEv */
	class CFingerSource * Schema_MarkHelperFn(void); /* linkage=_ZN13CFingerSource19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN13CFingerSource15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a350f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:91 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN13CFingerSource32Schema_VerifyBindingIsRegisteredEv */
	/* <53a34e5> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:34 */
	void Schema_CompileTimeVerificationFunction(class CFingerSource *); /* linkage=_ZN13CFingerSource38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN13CFingerSource20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN13CFingerSource22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerSource  *); /* linkage=_ZNK13CFingerSource21Schema_DynamicBindingEv */
	class CFingerSource * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN13CFingerSource32KV3TransferAllocateClassInstanceEPKc */
	/* <53a355d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:99 */
	void KV3TransferSave(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a35b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:110 */
	void KV3TransferLoad(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerSource(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource29KV3TransferSave_CFingerSourceEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerSource(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource29KV3TransferLoad_CFingerSourceEP23CKV3TransferLoadContext */
	void CFingerSource(class CFingerSource *); /* linkage=_ZN13CFingerSourceC4Ev */
};

// <0537D112> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:16
// member functions: 28
// member variables: 2
// static member variable: 1
// class size: 8
class CFingerSource {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	CFingerSource* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	void Schema_CompileTimeVerificationFunction(CFingerSource* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerSource* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	CFingerSource* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad(CFingerSource* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferSave_CFingerSource(const CFingerSource* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:19 */
	void KV3TransferLoad_CFingerSource(CFingerSource* , CKV3TransferLoadContext* );
	AnimVRFinger_t m_nFingerIndex; /* 0 4 */
	float m_flFingerWeight; /* 4 4 */
	void CFingerSource(CFingerSource* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN13CFingerSource17GetPrimaryBindingEv */
	class CFingerSource * Schema_MarkHelperFn(void); /* linkage=_ZN13CFingerSource19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN13CFingerSource15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a350f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:91 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN13CFingerSource32Schema_VerifyBindingIsRegisteredEv */
	/* <53a34e5> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:34 */
	void Schema_CompileTimeVerificationFunction(class CFingerSource *); /* linkage=_ZN13CFingerSource38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN13CFingerSource20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN13CFingerSource22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerSource  *); /* linkage=_ZNK13CFingerSource21Schema_DynamicBindingEv */
	class CFingerSource * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN13CFingerSource32KV3TransferAllocateClassInstanceEPKc */
	/* <53a355d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:99 */
	void KV3TransferSave(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a35b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:110 */
	void KV3TransferLoad(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerSource(const class CFingerSource  *, class CKV3TransferSaveContext *); /* linkage=_ZNK13CFingerSource29KV3TransferSave_CFingerSourceEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerSource(class CFingerSource *, class CKV3TransferLoadContext *); /* linkage=_ZN13CFingerSource29KV3TransferLoad_CFingerSourceEP23CKV3TransferLoadContext */
	void CFingerSource(class CFingerSource *); /* linkage=_ZN13CFingerSourceC4Ev */
};

// <053A27C3> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <053A27BD> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <053A27A4> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:18
inline void CFingerSource::Schema_DynamicBinding()
{
} /* size: 0 */

// <053A0B78> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
inline void CFingerBone::operator=(const CFingerBone &)
{
} /* size: 0 */

// <053A0B61> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
void CFingerBone::CFingerBone()
{
} /* size: 0 */

// <053A0B45> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
inline void CFingerBone::CFingerBone()
{
} /* size: 0 */

// <053A0B2E> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
void CFingerBone::~CFingerBone()
{
} /* size: 0 */

// <053A0B12> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
inline void CFingerBone::~CFingerBone()
{
} /* size: 0 */

// <049CCA60> ../public/modellib/vrskeletalinputsettings.h:30
// member functions: 29
// member variables: 7
// static member variable: 1
// class size: 56
class CFingerBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	CFingerBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_CompileTimeVerificationFunction(CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	CFingerBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad(CFingerBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave_CFingerBone(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad_CFingerBone(CFingerBone* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	Vector m_hingeAxis; /* 8 12 */
	Vector m_vCapsulePos1; /* 20 12 */
	Vector m_vCapsulePos2; /* 32 12 */
	float m_flMinAngle; /* 44 4 */
	float m_flMaxAngle; /* 48 4 */
	float m_flRadius; /* 52 4 */
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN11CFingerBone17GetPrimaryBindingEv */
	class CFingerBone * Schema_MarkHelperFn(void); /* linkage=_ZN11CFingerBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN11CFingerBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a360f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:201 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN11CFingerBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerBone *); /* linkage=_ZN11CFingerBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN11CFingerBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN11CFingerBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerBone  *); /* linkage=_ZNK11CFingerBone21Schema_DynamicBindingEv */
	class CFingerBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN11CFingerBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a365d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:209 */
	void KV3TransferSave(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a36b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:225 */
	void KV3TransferLoad(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerBone(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone27KV3TransferSave_CFingerBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerBone(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone27KV3TransferLoad_CFingerBoneEP23CKV3TransferLoadContext */
	class CFingerBone & operator=(class CFingerBone *, const class CFingerBone  &); /* linkage=_ZN11CFingerBoneaSERKS_ */
	void ~CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneD4Ev */
	void CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneC4Ev */
};

// <04F25BD9> ../public/modellib/vrskeletalinputsettings.h:30
// member functions: 32
// member variables: 7
// static member variable: 1
// class size: 56
class CFingerBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	CFingerBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_CompileTimeVerificationFunction(CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	CFingerBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad(CFingerBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave_CFingerBone(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad_CFingerBone(CFingerBone* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	Vector m_hingeAxis; /* 8 12 */
	Vector m_vCapsulePos1; /* 20 12 */
	Vector m_vCapsulePos2; /* 32 12 */
	float m_flMinAngle; /* 44 4 */
	float m_flMaxAngle; /* 48 4 */
	float m_flRadius; /* 52 4 */
	CFingerBone& operator=(CFingerBone* , const CFingerBone& );
	void ~CFingerBone(CFingerBone* );
	void CFingerBone(CFingerBone* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN11CFingerBone17GetPrimaryBindingEv */
	class CFingerBone * Schema_MarkHelperFn(void); /* linkage=_ZN11CFingerBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN11CFingerBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a360f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:201 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN11CFingerBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerBone *); /* linkage=_ZN11CFingerBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN11CFingerBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN11CFingerBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerBone  *); /* linkage=_ZNK11CFingerBone21Schema_DynamicBindingEv */
	class CFingerBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN11CFingerBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a365d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:209 */
	void KV3TransferSave(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a36b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:225 */
	void KV3TransferLoad(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerBone(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone27KV3TransferSave_CFingerBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerBone(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone27KV3TransferLoad_CFingerBoneEP23CKV3TransferLoadContext */
	class CFingerBone & operator=(class CFingerBone *, const class CFingerBone  &); /* linkage=_ZN11CFingerBoneaSERKS_ */
	void ~CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneD4Ev */
	void CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneC4Ev */
};

// <0537D2F8> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:30
// member functions: 32
// member variables: 7
// static member variable: 1
// class size: 56
class CFingerBone {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	CFingerBone* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_CompileTimeVerificationFunction(CFingerBone* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerBone* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	CFingerBone* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad(CFingerBone* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave_CFingerBone(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad_CFingerBone(CFingerBone* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	Vector m_hingeAxis; /* 8 12 */
	Vector m_vCapsulePos1; /* 20 12 */
	Vector m_vCapsulePos2; /* 32 12 */
	float m_flMinAngle; /* 44 4 */
	float m_flMaxAngle; /* 48 4 */
	float m_flRadius; /* 52 4 */
	void ~CFingerBone(CFingerBone* );
	void CFingerBone(CFingerBone* );
	CFingerBone& operator=(CFingerBone* , const CFingerBone& );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN11CFingerBone17GetPrimaryBindingEv */
	class CFingerBone * Schema_MarkHelperFn(void); /* linkage=_ZN11CFingerBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN11CFingerBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a360f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:201 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN11CFingerBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerBone *); /* linkage=_ZN11CFingerBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN11CFingerBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN11CFingerBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerBone  *); /* linkage=_ZNK11CFingerBone21Schema_DynamicBindingEv */
	class CFingerBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN11CFingerBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a365d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:209 */
	void KV3TransferSave(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a36b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:225 */
	void KV3TransferLoad(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerBone(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone27KV3TransferSave_CFingerBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerBone(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone27KV3TransferLoad_CFingerBoneEP23CKV3TransferLoadContext */
	class CFingerBone & operator=(class CFingerBone *, const class CFingerBone  &); /* linkage=_ZN11CFingerBoneaSERKS_ */
	void ~CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneD4Ev */
	void CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneC4Ev */
};

// <011C7C16> ../public/modellib/vrskeletalinputsettings.h:30
// member functions: 30
// member variables: 7
// static member variable: 1
// class size: 56
class CFingerBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	CFingerBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	void Schema_CompileTimeVerificationFunction(CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	CFingerBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad(CFingerBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferSave_CFingerBone(const CFingerBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:33 */
	void KV3TransferLoad_CFingerBone(CFingerBone* , CKV3TransferLoadContext* );
	CUtlString m_boneName; /* 0 8 */
	Vector m_hingeAxis; /* 8 12 */
	Vector m_vCapsulePos1; /* 20 12 */
	Vector m_vCapsulePos2; /* 32 12 */
	float m_flMinAngle; /* 44 4 */
	float m_flMaxAngle; /* 48 4 */
	float m_flRadius; /* 52 4 */
	void ~CFingerBone(CFingerBone* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN11CFingerBone17GetPrimaryBindingEv */
	class CFingerBone * Schema_MarkHelperFn(void); /* linkage=_ZN11CFingerBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN11CFingerBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a360f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:201 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN11CFingerBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerBone *); /* linkage=_ZN11CFingerBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN11CFingerBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN11CFingerBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerBone  *); /* linkage=_ZNK11CFingerBone21Schema_DynamicBindingEv */
	class CFingerBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN11CFingerBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a365d> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:209 */
	void KV3TransferSave(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a36b6> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:225 */
	void KV3TransferLoad(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerBone(const class CFingerBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK11CFingerBone27KV3TransferSave_CFingerBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerBone(class CFingerBone *, class CKV3TransferLoadContext *); /* linkage=_ZN11CFingerBone27KV3TransferLoad_CFingerBoneEP23CKV3TransferLoadContext */
	class CFingerBone & operator=(class CFingerBone *, const class CFingerBone  &); /* linkage=_ZN11CFingerBoneaSERKS_ */
	void ~CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneD4Ev */
	void CFingerBone(class CFingerBone *); /* linkage=_ZN11CFingerBoneC4Ev */
};

// <053A277F> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:32
inline void CFingerBone::Schema_DynamicBinding()
{
} /* size: 0 */

// <053A3972> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
// function calls: 50
void CFingerChain::operator=(const CFingerChain &)
{
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::Count(); // 573
	CUtlMemory<CFingerSource, int>::Base(); // 112
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::Base(); // 102
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::begin(); // 574
	CUtlMemory<CFingerSource, int>::Base(); // 113
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::Base(); // 105
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::Count(); // 105
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<CFingerSource>(const CFingerSource* pFrom,
						const CFingerSource* pFromEnd,
						CFingerSource* pTo);  // 173
	UtlTraitsCopyRange<CFingerSource>(const CFingerSource* pFrom,
						const CFingerSource* pFromEnd,
						CFingerSource* pTo);  // 574
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::operator=(
			const CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >& other);  // 565
	CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::operator=(
			const CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >& other);  // 452
	CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> >::operator=(
			const CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> >& src);  // 49
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Count(); // 573
	CUtlMemory<CFingerBone, int>::Base(); // 112
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Base(); // 102
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::begin(); // 574
	CUtlMemory<CFingerBone, int>::Base(); // 113
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Base(); // 105
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Count(); // 105
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::end(); // 574
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 30
	Vector::operator=(
			const Vector& vOther);  // 30
	Vector::operator=(
			const Vector& vOther);  // 30
	Vector::operator=(
			const Vector& vOther);  // 30
	CFingerBone::operator=(
			const CFingerBone  &);  // 209
	UtlTraitsCopyRange<CFingerBone>(const CFingerBone* pFrom,
					const CFingerBone* pFromEnd,
					CFingerBone* pTo);  // 200
	UtlTraitsCopyRange<CFingerBone>(const CFingerBone* pFrom,
					const CFingerBone* pFromEnd,
					CFingerBone* pTo);  // 574
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::operator=(
			const CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >& other);  // 565
	CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::operator=(
			const CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >& other);  // 452
	CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> >::operator=(
			const CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> >& src);  // 49
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 49
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 49
	Vector::operator=(
			const Vector& vOther);  // 49
	V_strlen(const char* str); // 393
	CUtlString::Length(); // 161
	CUtlString::Get(); // 161
	CUtlString::operator=(
			const CUtlString& src);  // 49
	Vector::operator=(
			const Vector& vOther);  // 49
} /* size: 638, inline expansions: 50 (2403 bytes) */

// <0539CE60> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
inline void CFingerChain::operator=(const CFingerChain &)
{
} /* size: 0 */

// <0539CDE1> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
void CFingerChain::CFingerChain()
{
} /* size: 0 */

// <0539CDC5> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
inline void CFingerChain::CFingerChain()
{
} /* size: 0 */

// <0539CDAE> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
void CFingerChain::~CFingerChain()
{
} /* size: 0 */

// <0539CD92> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
inline void CFingerChain::~CFingerChain()
{
} /* size: 0 */

// <049CCC56> ../public/modellib/vrskeletalinputsettings.h:49
// member functions: 33
// member variables: 10
// static member variable: 1
// class size: 128
class CFingerChain {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	CFingerChain* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_CompileTimeVerificationFunction(CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	CFingerChain* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave_CFingerChain(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad_CFingerChain(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:56 */
	const CUtlString& GetKnuckleBoneName(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:57 */
	AnimVRFinger_t GetPrimaryInfluence(const CFingerChain* );
	CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> > m_targets; /* 0 32 */
	CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> > m_bones; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_tipParentBoneName; /* 72 8 */
	Vector m_vTipOffset; /* 80 12 */
	CUtlString m_metacarpalBoneName; /* 96 8 */
	Vector m_vSplayHingeAxis; /* 104 12 */
	float m_flSplayMinAngle; /* 116 4 */
	float m_flSplayMaxAngle; /* 120 4 */
	float m_flFingerScaleRatio; /* 124 4 */
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN12CFingerChain17GetPrimaryBindingEv */
	class CFingerChain * Schema_MarkHelperFn(void); /* linkage=_ZN12CFingerChain19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN12CFingerChain15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a370f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:330 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN12CFingerChain32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerChain *); /* linkage=_ZN12CFingerChain38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN12CFingerChain20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN12CFingerChain22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain21Schema_DynamicBindingEv */
	class CFingerChain * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN12CFingerChain32KV3TransferAllocateClassInstanceEPKc */
	/* <53a3919> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:338 */
	void KV3TransferSave(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a4416> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:357 */
	void KV3TransferLoad(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerChain(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain28KV3TransferSave_CFingerChainEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerChain(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain28KV3TransferLoad_CFingerChainEP23CKV3TransferLoadContext */
	const class CUtlString  & GetKnuckleBoneName(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain18GetKnuckleBoneNameEv */
	enum AnimVRFinger_t GetPrimaryInfluence(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain19GetPrimaryInfluenceEv */
	class CFingerChain & operator=(class CFingerChain *, const class CFingerChain  &); /* linkage=_ZN12CFingerChainaSERKS_ */
	void ~CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainD4Ev */
	void CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainC4Ev */
};

// <04F25E2A> ../public/modellib/vrskeletalinputsettings.h:49
// member functions: 36
// member variables: 10
// static member variable: 1
// class size: 128
class CFingerChain {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	CFingerChain* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_CompileTimeVerificationFunction(CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	CFingerChain* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave_CFingerChain(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad_CFingerChain(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:56 */
	const CUtlString& GetKnuckleBoneName(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:57 */
	AnimVRFinger_t GetPrimaryInfluence(const CFingerChain* );
	CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> > m_targets; /* 0 32 */
	CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> > m_bones; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_tipParentBoneName; /* 72 8 */
	Vector m_vTipOffset; /* 80 12 */
	CUtlString m_metacarpalBoneName; /* 96 8 */
	Vector m_vSplayHingeAxis; /* 104 12 */
	float m_flSplayMinAngle; /* 116 4 */
	float m_flSplayMaxAngle; /* 120 4 */
	float m_flFingerScaleRatio; /* 124 4 */
	CFingerChain& operator=(CFingerChain* , const CFingerChain& );
	void ~CFingerChain(CFingerChain* );
	void CFingerChain(CFingerChain* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN12CFingerChain17GetPrimaryBindingEv */
	class CFingerChain * Schema_MarkHelperFn(void); /* linkage=_ZN12CFingerChain19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN12CFingerChain15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a370f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:330 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN12CFingerChain32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerChain *); /* linkage=_ZN12CFingerChain38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN12CFingerChain20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN12CFingerChain22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain21Schema_DynamicBindingEv */
	class CFingerChain * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN12CFingerChain32KV3TransferAllocateClassInstanceEPKc */
	/* <53a3919> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:338 */
	void KV3TransferSave(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a4416> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:357 */
	void KV3TransferLoad(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerChain(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain28KV3TransferSave_CFingerChainEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerChain(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain28KV3TransferLoad_CFingerChainEP23CKV3TransferLoadContext */
	const class CUtlString  & GetKnuckleBoneName(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain18GetKnuckleBoneNameEv */
	enum AnimVRFinger_t GetPrimaryInfluence(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain19GetPrimaryInfluenceEv */
	class CFingerChain & operator=(class CFingerChain *, const class CFingerChain  &); /* linkage=_ZN12CFingerChainaSERKS_ */
	void ~CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainD4Ev */
	void CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainC4Ev */
};

// <0537D568> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:49
// member functions: 36
// member variables: 10
// static member variable: 1
// class size: 128
class CFingerChain {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	CFingerChain* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_CompileTimeVerificationFunction(CFingerChain* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerChain* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	CFingerChain* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad(CFingerChain* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave_CFingerChain(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad_CFingerChain(CFingerChain* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:56 */
	const CUtlString& GetKnuckleBoneName(const CFingerChain* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:57 */
	AnimVRFinger_t GetPrimaryInfluence(const CFingerChain* );
	CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> > m_targets; /* 0 32 */
	CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> > m_bones; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_tipParentBoneName; /* 72 8 */
	Vector m_vTipOffset; /* 80 12 */
	CUtlString m_metacarpalBoneName; /* 96 8 */
	Vector m_vSplayHingeAxis; /* 104 12 */
	float m_flSplayMinAngle; /* 116 4 */
	float m_flSplayMaxAngle; /* 120 4 */
	float m_flFingerScaleRatio; /* 124 4 */
	void ~CFingerChain(CFingerChain* );
	void CFingerChain(CFingerChain* );
	CFingerChain& operator=(CFingerChain* , const CFingerChain& );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN12CFingerChain17GetPrimaryBindingEv */
	class CFingerChain * Schema_MarkHelperFn(void); /* linkage=_ZN12CFingerChain19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN12CFingerChain15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a370f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:330 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN12CFingerChain32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerChain *); /* linkage=_ZN12CFingerChain38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN12CFingerChain20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN12CFingerChain22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain21Schema_DynamicBindingEv */
	class CFingerChain * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN12CFingerChain32KV3TransferAllocateClassInstanceEPKc */
	/* <53a3919> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:338 */
	void KV3TransferSave(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a4416> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:357 */
	void KV3TransferLoad(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerChain(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain28KV3TransferSave_CFingerChainEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerChain(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain28KV3TransferLoad_CFingerChainEP23CKV3TransferLoadContext */
	const class CUtlString  & GetKnuckleBoneName(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain18GetKnuckleBoneNameEv */
	enum AnimVRFinger_t GetPrimaryInfluence(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain19GetPrimaryInfluenceEv */
	class CFingerChain & operator=(class CFingerChain *, const class CFingerChain  &); /* linkage=_ZN12CFingerChainaSERKS_ */
	void ~CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainD4Ev */
	void CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainC4Ev */
};

// <011C7E29> ../public/modellib/vrskeletalinputsettings.h:49
// member functions: 34
// member variables: 10
// static member variable: 1
// class size: 128
class CFingerChain {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	CFingerChain* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	void Schema_CompileTimeVerificationFunction(CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:51 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	CFingerChain* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferSave_CFingerChain(const CFingerChain* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:52 */
	void KV3TransferLoad_CFingerChain(CFingerChain* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:56 */
	const CUtlString& GetKnuckleBoneName(const CFingerChain* );
	/* ../public/modellib/vrskeletalinputsettings.h:57 */
	AnimVRFinger_t GetPrimaryInfluence(const CFingerChain* );
	CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> > m_targets; /* 0 32 */
	CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> > m_bones; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_tipParentBoneName; /* 72 8 */
	Vector m_vTipOffset; /* 80 12 */
	CUtlString m_metacarpalBoneName; /* 96 8 */
	Vector m_vSplayHingeAxis; /* 104 12 */
	float m_flSplayMinAngle; /* 116 4 */
	float m_flSplayMaxAngle; /* 120 4 */
	float m_flFingerScaleRatio; /* 124 4 */
	void ~CFingerChain(CFingerChain* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN12CFingerChain17GetPrimaryBindingEv */
	class CFingerChain * Schema_MarkHelperFn(void); /* linkage=_ZN12CFingerChain19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN12CFingerChain15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a370f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:330 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN12CFingerChain32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CFingerChain *); /* linkage=_ZN12CFingerChain38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN12CFingerChain20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN12CFingerChain22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain21Schema_DynamicBindingEv */
	class CFingerChain * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN12CFingerChain32KV3TransferAllocateClassInstanceEPKc */
	/* <53a3919> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:338 */
	void KV3TransferSave(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a4416> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:357 */
	void KV3TransferLoad(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CFingerChain(const class CFingerChain  *, class CKV3TransferSaveContext *); /* linkage=_ZNK12CFingerChain28KV3TransferSave_CFingerChainEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CFingerChain(class CFingerChain *, class CKV3TransferLoadContext *); /* linkage=_ZN12CFingerChain28KV3TransferLoad_CFingerChainEP23CKV3TransferLoadContext */
	const class CUtlString  & GetKnuckleBoneName(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain18GetKnuckleBoneNameEv */
	enum AnimVRFinger_t GetPrimaryInfluence(const class CFingerChain  *); /* linkage=_ZNK12CFingerChain19GetPrimaryInfluenceEv */
	class CFingerChain & operator=(class CFingerChain *, const class CFingerChain  &); /* linkage=_ZN12CFingerChainaSERKS_ */
	void ~CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainD4Ev */
	void CFingerChain(class CFingerChain *); /* linkage=_ZN12CFingerChainC4Ev */
};

// <053A275A> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:51
inline void CFingerChain::Schema_DynamicBinding()
{
} /* size: 0 */

// <05395238> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
inline void CWristBone::operator=(const CWristBone &)
{
} /* size: 0 */

// <05395221> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
void CWristBone::CWristBone()
{
} /* size: 0 */

// <05395205> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
inline void CWristBone::CWristBone()
{
} /* size: 0 */

// <053951EE> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
void CWristBone::~CWristBone()
{
} /* size: 0 */

// <053951D2> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
inline void CWristBone::~CWristBone()
{
} /* size: 0 */

// <049CFC07> ../public/modellib/vrskeletalinputsettings.h:74
// member functions: 29
// member variables: 4
// static member variable: 1
// class size: 48
class CWristBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	CWristBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_CompileTimeVerificationFunction(CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	CWristBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad(CWristBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave_CWristBone(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad_CWristBone(CWristBone* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	Vector m_vForwardLS; /* 8 12 */
	Vector m_vUpLS; /* 20 12 */
	Vector m_vOffset; /* 32 12 */
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN10CWristBone17GetPrimaryBindingEv */
	class CWristBone * Schema_MarkHelperFn(void); /* linkage=_ZN10CWristBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN10CWristBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a375e> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:447 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN10CWristBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CWristBone *); /* linkage=_ZN10CWristBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN10CWristBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN10CWristBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CWristBone  *); /* linkage=_ZNK10CWristBone21Schema_DynamicBindingEv */
	class CWristBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN10CWristBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a37ad> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:455 */
	void KV3TransferSave(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a3806> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:468 */
	void KV3TransferLoad(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CWristBone(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone26KV3TransferSave_CWristBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CWristBone(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone26KV3TransferLoad_CWristBoneEP23CKV3TransferLoadContext */
	class CWristBone & operator=(class CWristBone *, const class CWristBone  &); /* linkage=_ZN10CWristBoneaSERKS_ */
	void ~CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneD4Ev */
	void CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneC4Ev */
};

// <04F28F18> ../public/modellib/vrskeletalinputsettings.h:74
// member functions: 32
// member variables: 4
// static member variable: 1
// class size: 48
class CWristBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	CWristBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_CompileTimeVerificationFunction(CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	CWristBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad(CWristBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave_CWristBone(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad_CWristBone(CWristBone* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	Vector m_vForwardLS; /* 8 12 */
	Vector m_vUpLS; /* 20 12 */
	Vector m_vOffset; /* 32 12 */
	CWristBone& operator=(CWristBone* , const CWristBone& );
	void ~CWristBone(CWristBone* );
	void CWristBone(CWristBone* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN10CWristBone17GetPrimaryBindingEv */
	class CWristBone * Schema_MarkHelperFn(void); /* linkage=_ZN10CWristBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN10CWristBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a375e> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:447 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN10CWristBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CWristBone *); /* linkage=_ZN10CWristBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN10CWristBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN10CWristBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CWristBone  *); /* linkage=_ZNK10CWristBone21Schema_DynamicBindingEv */
	class CWristBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN10CWristBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a37ad> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:455 */
	void KV3TransferSave(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a3806> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:468 */
	void KV3TransferLoad(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CWristBone(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone26KV3TransferSave_CWristBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CWristBone(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone26KV3TransferLoad_CWristBoneEP23CKV3TransferLoadContext */
	class CWristBone & operator=(class CWristBone *, const class CWristBone  &); /* linkage=_ZN10CWristBoneaSERKS_ */
	void ~CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneD4Ev */
	void CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneC4Ev */
};

// <05380679> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:74
// member functions: 32
// member variables: 4
// static member variable: 1
// class size: 48
class CWristBone {
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	CWristBone* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_CompileTimeVerificationFunction(CWristBone* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CWristBone* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	CWristBone* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave(const CWristBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad(CWristBone* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave_CWristBone(const CWristBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad_CWristBone(CWristBone* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	Vector m_vForwardLS; /* 8 12 */
	Vector m_vUpLS; /* 20 12 */
	Vector m_vOffset; /* 32 12 */
	void ~CWristBone(CWristBone* );
	void CWristBone(CWristBone* );
	CWristBone& operator=(CWristBone* , const CWristBone& );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN10CWristBone17GetPrimaryBindingEv */
	class CWristBone * Schema_MarkHelperFn(void); /* linkage=_ZN10CWristBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN10CWristBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a375e> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:447 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN10CWristBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CWristBone *); /* linkage=_ZN10CWristBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN10CWristBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN10CWristBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CWristBone  *); /* linkage=_ZNK10CWristBone21Schema_DynamicBindingEv */
	class CWristBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN10CWristBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a37ad> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:455 */
	void KV3TransferSave(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a3806> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:468 */
	void KV3TransferLoad(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CWristBone(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone26KV3TransferSave_CWristBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CWristBone(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone26KV3TransferLoad_CWristBoneEP23CKV3TransferLoadContext */
	class CWristBone & operator=(class CWristBone *, const class CWristBone  &); /* linkage=_ZN10CWristBoneaSERKS_ */
	void ~CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneD4Ev */
	void CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneC4Ev */
};

// <011CAECF> ../public/modellib/vrskeletalinputsettings.h:74
// member functions: 30
// member variables: 4
// static member variable: 1
// class size: 48
class CWristBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	CWristBone* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	void Schema_CompileTimeVerificationFunction(CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:76 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CWristBone* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	CWristBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad(CWristBone* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferSave_CWristBone(const CWristBone* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:77 */
	void KV3TransferLoad_CWristBone(CWristBone* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	Vector m_vForwardLS; /* 8 12 */
	Vector m_vUpLS; /* 20 12 */
	Vector m_vOffset; /* 32 12 */
	void ~CWristBone(CWristBone* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN10CWristBone17GetPrimaryBindingEv */
	class CWristBone * Schema_MarkHelperFn(void); /* linkage=_ZN10CWristBone19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN10CWristBone15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a375e> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:447 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN10CWristBone32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CWristBone *); /* linkage=_ZN10CWristBone38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN10CWristBone20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN10CWristBone22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CWristBone  *); /* linkage=_ZNK10CWristBone21Schema_DynamicBindingEv */
	class CWristBone * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN10CWristBone32KV3TransferAllocateClassInstanceEPKc */
	/* <53a37ad> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:455 */
	void KV3TransferSave(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone15KV3TransferSaveEP23CKV3TransferSaveContext */
	/* <53a3806> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:468 */
	void KV3TransferLoad(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CWristBone(const class CWristBone  *, class CKV3TransferSaveContext *); /* linkage=_ZNK10CWristBone26KV3TransferSave_CWristBoneEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CWristBone(class CWristBone *, class CKV3TransferLoadContext *); /* linkage=_ZN10CWristBone26KV3TransferLoad_CWristBoneEP23CKV3TransferLoadContext */
	class CWristBone & operator=(class CWristBone *, const class CWristBone  &); /* linkage=_ZN10CWristBoneaSERKS_ */
	void ~CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneD4Ev */
	void CWristBone(class CWristBone *); /* linkage=_ZN10CWristBoneC4Ev */
};

// <053A2735> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:76
inline void CWristBone::Schema_DynamicBinding()
{
} /* size: 0 */

// <05393008> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
inline void CVrSkeletalInputSettings::operator=(const CVrSkeletalInputSettings &)
{
} /* size: 0 */

// <05392F7D> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
void CVrSkeletalInputSettings::CVrSkeletalInputSettings()
{
} /* size: 0 */

// <05392F61> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
inline void CVrSkeletalInputSettings::CVrSkeletalInputSettings()
{
} /* size: 0 */

// <053923A5> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
// variables: 3
// function calls: 57
void CVrSkeletalInputSettings::~CVrSkeletalInputSettings()
{
	CUtlString::~CUtlString(); // 98
	CUtlString::~CUtlString(); // 98
	CUtlString::~CUtlString(); // 98
	{
		int i; // 1721
		CUtlMemory<CFingerChain, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CFingerChain, CUtlMemory<CFingerChain, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 49
		CUtlString::~CUtlString(); // 49
		CUtlString::~CUtlString(); // 49
		{
			int i; // 1721
			CUtlMemory<CFingerBone, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Element(
				int i);  // 1723
			CUtlString::~CUtlString(); // 30
			CFingerBone::~CFingerBone(); // 1526
			Destruct<CFingerBone>(CFingerBone* pMemory); // 1723
		}
		CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::RemoveAll(); // 1798
		CUtlMemory<CFingerBone, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CFingerBone, int>::Purge(); // 903
		CUtlMemory<CFingerBone, int>::Purge(); // 1799
		CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::Purge(); // 560
		ValidateAlignment<CFingerBone>(void); // 508
		CUtlMemory<CFingerBone, int>::Purge(); // 510
		CUtlMemory<CFingerBone, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CFingerBone, CUtlMemory<CFingerBone, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CFingerBone, CUtlMemory<CFingerBone, int> >::~CUtlVector(); // 49
		CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::RemoveAll(); // 1798
		CUtlMemory<CFingerSource, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CFingerSource, int>::Purge(); // 903
		CUtlMemory<CFingerSource, int>::Purge(); // 1799
		CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::Purge(); // 560
		ValidateAlignment<CFingerSource>(void); // 508
		CUtlMemory<CFingerSource, int>::Purge(); // 510
		CUtlMemory<CFingerSource, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CFingerSource, CUtlMemory<CFingerSource, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CFingerSource, CUtlMemory<CFingerSource, int> >::~CUtlVector(); // 49
		CFingerChain::~CFingerChain(); // 1526
		Destruct<CFingerChain>(CFingerChain* pMemory); // 1723
	}
	CUtlVectorBase<CFingerChain, CUtlMemory<CFingerChain, int> >::RemoveAll(); // 1798
	CUtlMemory<CFingerChain, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CFingerChain, int>::Purge(); // 903
	CUtlMemory<CFingerChain, int>::Purge(); // 1799
	CUtlVectorBase<CFingerChain, CUtlMemory<CFingerChain, int> >::Purge(); // 560
	ValidateAlignment<CFingerChain>(void); // 508
	CUtlMemory<CFingerChain, int>::Purge(); // 510
	CUtlMemory<CFingerChain, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CFingerChain, CUtlMemory<CFingerChain, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CFingerChain, CUtlMemory<CFingerChain, int> >::~CUtlVector(); // 98
	{
		int i; // 1721
		CUtlMemory<CWristBone, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CWristBone, CUtlMemory<CWristBone, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 74
		CWristBone::~CWristBone(); // 1526
		Destruct<CWristBone>(CWristBone* pMemory); // 1723
	}
	CUtlVectorBase<CWristBone, CUtlMemory<CWristBone, int> >::RemoveAll(); // 1798
	CUtlMemory<CWristBone, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CWristBone, int>::Purge(); // 903
	CUtlMemory<CWristBone, int>::Purge(); // 1799
	CUtlVectorBase<CWristBone, CUtlMemory<CWristBone, int> >::Purge(); // 560
	CUtlVectorBase<CWristBone, CUtlMemory<CWristBone, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CWristBone, CUtlMemory<CWristBone, int> >::~CUtlVector(); // 98
} /* size: 472, inline expansions: 20 (1548 bytes) */

// <05392389> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
inline void CVrSkeletalInputSettings::~CVrSkeletalInputSettings()
{
} /* size: 0 */

// <01295B69> ../public/modellib/vrskeletalinputsettings.h:98
void CVrSkeletalInputSettings::~CVrSkeletalInputSettings()
{
} /* size: 0 */

// <049CFDD0> ../public/modellib/vrskeletalinputsettings.h:98
// member functions: 30
// member variables: 6
// static member variable: 1
// class size: 96
class CVrSkeletalInputSettings {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	CVrSkeletalInputSettings* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_CompileTimeVerificationFunction(CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	CVrSkeletalInputSettings* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave_CVrSkeletalInputSettings(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad_CVrSkeletalInputSettings(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	CUtlVector<CWristBone, CUtlMemory<CWristBone, int> > m_wristBones; /* 0 32 */
	CUtlVector<CFingerChain, CUtlMemory<CFingerChain, int> > m_fingers; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_outerKnuckle1; /* 72 8 */
	CUtlString m_outerKnuckle2; /* 80 8 */
	AnimVRHand_t m_eHand; /* 88 4 */
	void CVrSkeletalInputSettings(CVrSkeletalInputSettings* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings17GetPrimaryBindingEv */
	class CVrSkeletalInputSettings * Schema_MarkHelperFn(void); /* linkage=_ZN24CVrSkeletalInputSettings19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN24CVrSkeletalInputSettings15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a385f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:558 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN24CVrSkeletalInputSettings32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettings38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN24CVrSkeletalInputSettings22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CVrSkeletalInputSettings  *); /* linkage=_ZNK24CVrSkeletalInputSettings21Schema_DynamicBindingEv */
	class CVrSkeletalInputSettings * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN24CVrSkeletalInputSettings32KV3TransferAllocateClassInstanceEPKc */
	void KV3TransferSave(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings15KV3TransferSaveEP23CKV3TransferSaveContext */
	void KV3TransferLoad(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CVrSkeletalInputSettings(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings40KV3TransferSave_CVrSkeletalInputSettingsEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CVrSkeletalInputSettings(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings40KV3TransferLoad_CVrSkeletalInputSettingsEP23CKV3TransferLoadContext */
	void CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsC4Ev */
	void ~CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsD4Ev */
	class CVrSkeletalInputSettings & operator=(class CVrSkeletalInputSettings *, const class CVrSkeletalInputSettings  &); /* linkage=_ZN24CVrSkeletalInputSettingsaSERKS_ */
};

// <053808BC> ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:98
// member functions: 32
// member variables: 6
// static member variable: 1
// class size: 96
class CVrSkeletalInputSettings {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	CVrSkeletalInputSettings* Schema_MarkHelperFn(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_CompileTimeVerificationFunction(CVrSkeletalInputSettings* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CVrSkeletalInputSettings* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:101 */
	CVrSkeletalInputSettings* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave_CVrSkeletalInputSettings(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../_generated_code/modellib/linuxsteamrt64/release/../../../../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad_CVrSkeletalInputSettings(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	CUtlVector<CWristBone, CUtlMemory<CWristBone, int> > m_wristBones; /* 0 32 */
	CUtlVector<CFingerChain, CUtlMemory<CFingerChain, int> > m_fingers; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_outerKnuckle1; /* 72 8 */
	CUtlString m_outerKnuckle2; /* 80 8 */
	AnimVRHand_t m_eHand; /* 88 4 */
	void ~CVrSkeletalInputSettings(CVrSkeletalInputSettings* );
	void CVrSkeletalInputSettings(CVrSkeletalInputSettings* );
	CVrSkeletalInputSettings& operator=(CVrSkeletalInputSettings* , const CVrSkeletalInputSettings& );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings17GetPrimaryBindingEv */
	class CVrSkeletalInputSettings * Schema_MarkHelperFn(void); /* linkage=_ZN24CVrSkeletalInputSettings19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN24CVrSkeletalInputSettings15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a385f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:558 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN24CVrSkeletalInputSettings32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettings38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN24CVrSkeletalInputSettings22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CVrSkeletalInputSettings  *); /* linkage=_ZNK24CVrSkeletalInputSettings21Schema_DynamicBindingEv */
	class CVrSkeletalInputSettings * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN24CVrSkeletalInputSettings32KV3TransferAllocateClassInstanceEPKc */
	void KV3TransferSave(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings15KV3TransferSaveEP23CKV3TransferSaveContext */
	void KV3TransferLoad(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CVrSkeletalInputSettings(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings40KV3TransferSave_CVrSkeletalInputSettingsEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CVrSkeletalInputSettings(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings40KV3TransferLoad_CVrSkeletalInputSettingsEP23CKV3TransferLoadContext */
	void CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsC4Ev */
	void ~CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsD4Ev */
	class CVrSkeletalInputSettings & operator=(class CVrSkeletalInputSettings *, const class CVrSkeletalInputSettings  &); /* linkage=_ZN24CVrSkeletalInputSettingsaSERKS_ */
};

// <00D6D49C> ../public/modellib/vrskeletalinputsettings.h:98
// member functions: 29
// member variables: 6
// static member variable: 1
// class size: 96
class CVrSkeletalInputSettings {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	CVrSkeletalInputSettings* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_CompileTimeVerificationFunction(CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	CVrSkeletalInputSettings* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave_CVrSkeletalInputSettings(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad_CVrSkeletalInputSettings(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	CUtlVector<CWristBone, CUtlMemory<CWristBone, int> > m_wristBones; /* 0 32 */
	CUtlVector<CFingerChain, CUtlMemory<CFingerChain, int> > m_fingers; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_outerKnuckle1; /* 72 8 */
	CUtlString m_outerKnuckle2; /* 80 8 */
	AnimVRHand_t m_eHand; /* 88 4 */
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings17GetPrimaryBindingEv */
	class CVrSkeletalInputSettings * Schema_MarkHelperFn(void); /* linkage=_ZN24CVrSkeletalInputSettings19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN24CVrSkeletalInputSettings15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a385f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:558 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN24CVrSkeletalInputSettings32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettings38Schema_CompileTimeVerificationFunctionEv */
	const class CSchemaClassInfo  * Schema_StaticBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings20Schema_StaticBindingEv */
	const char  * Schema_StaticClassname(void); /* linkage=_ZN24CVrSkeletalInputSettings22Schema_StaticClassnameEv */
	const class CSchemaClassInfo  * Schema_DynamicBinding(const class CVrSkeletalInputSettings  *); /* linkage=_ZNK24CVrSkeletalInputSettings21Schema_DynamicBindingEv */
	class CVrSkeletalInputSettings * KV3TransferAllocateClassInstance(const char  *); /* linkage=_ZN24CVrSkeletalInputSettings32KV3TransferAllocateClassInstanceEPKc */
	void KV3TransferSave(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings15KV3TransferSaveEP23CKV3TransferSaveContext */
	void KV3TransferLoad(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings15KV3TransferLoadEP23CKV3TransferLoadContext */
	void KV3TransferSave_CVrSkeletalInputSettings(const class CVrSkeletalInputSettings  *, class CKV3TransferSaveContext *); /* linkage=_ZNK24CVrSkeletalInputSettings40KV3TransferSave_CVrSkeletalInputSettingsEP23CKV3TransferSaveContext */
	void KV3TransferLoad_CVrSkeletalInputSettings(class CVrSkeletalInputSettings *, class CKV3TransferLoadContext *); /* linkage=_ZN24CVrSkeletalInputSettings40KV3TransferLoad_CVrSkeletalInputSettingsEP23CKV3TransferLoadContext */
	void CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsC4Ev */
	void ~CVrSkeletalInputSettings(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettingsD4Ev */
	class CVrSkeletalInputSettings & operator=(class CVrSkeletalInputSettings *, const class CVrSkeletalInputSettings  &); /* linkage=_ZN24CVrSkeletalInputSettingsaSERKS_ */
};

// <011CB0B5> ../public/modellib/vrskeletalinputsettings.h:98
// member functions: 30
// member variables: 6
// static member variable: 1
// class size: 96
class CVrSkeletalInputSettings {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	CVrSkeletalInputSettings* Schema_MarkHelperFn(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	void Schema_CompileTimeVerificationFunction(CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const char* Schema_StaticClassname(void);
	/* ../public/modellib/vrskeletalinputsettings.h:100 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CVrSkeletalInputSettings* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	CVrSkeletalInputSettings* KV3TransferAllocateClassInstance(const char* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferSave_CVrSkeletalInputSettings(const CVrSkeletalInputSettings* , CKV3TransferSaveContext* );
	/* ../public/modellib/vrskeletalinputsettings.h:101 */
	void KV3TransferLoad_CVrSkeletalInputSettings(CVrSkeletalInputSettings* , CKV3TransferLoadContext* );
	CUtlVector<CWristBone, CUtlMemory<CWristBone, int> > m_wristBones; /* 0 32 */
	CUtlVector<CFingerChain, CUtlMemory<CFingerChain, int> > m_fingers; /* 32 32 */
	CUtlString m_name; /* 64 8 */
	CUtlString m_outerKnuckle1; /* 72 8 */
	CUtlString m_outerKnuckle2; /* 80 8 */
	AnimVRHand_t m_eHand; /* 88 4 */
	void ~CVrSkeletalInputSettings(CVrSkeletalInputSettings* );
	const class CSchemaClassInfo  * GetPrimaryBinding(void); /* linkage=_ZN24CVrSkeletalInputSettings17GetPrimaryBindingEv */
	class CVrSkeletalInputSettings * Schema_MarkHelperFn(void); /* linkage=_ZN24CVrSkeletalInputSettings19Schema_MarkHelperFnEv */
	void * Schema_ClassOps(enum SchemaGenClassOp_t, void *, void *); /* linkage=_ZN24CVrSkeletalInputSettings15Schema_ClassOpsE18SchemaGenClassOp_tPvS1_ */
	/* <53a385f> ../_generated_code/modellib/linuxsteamrt64/release/vrskeletalinputsettings_h_schema.gen_cpp:558 */
	void Schema_VerifyBindingIsRegistered(void); /* linkage=_ZN24CVrSkeletalInputSettings32Schema_VerifyBindingIsRegisteredEv */
	void Schema_CompileTimeVerificationFunction(class CVrSkeletalInputSettings *); /* linkage=_ZN24CVrSkeletalInputSettings38Schema_CompileTimeVerificationFunctionEv */
