
//
// public/animationsystem/animationgroupresource.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 117
//	class: 1
//	structs: 34
//

// <0550426F> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
inline void CAnimBone::operator=(const CAnimBone &)
{
} /* size: 0 */

// <05504258> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
void CAnimBone::CAnimBone()
{
} /* size: 0 */

// <0550423C> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
inline void CAnimBone::CAnimBone()
{
} /* size: 0 */

// <05504225> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
void CAnimBone::~CAnimBone()
{
} /* size: 0 */

// <05504209> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
inline void CAnimBone::~CAnimBone()
{
} /* size: 0 */

// <03E65944> ../public/animationsystem/animationgroupresource.h:46
// member functions: 15
// member variables: 6
// static member variable: 1
// struct size: 72
struct CAnimBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	CAnimBone* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_CompileTimeVerificationFunction(CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	CAnimBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad(CAnimBone* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave_CAnimBone(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad_CAnimBone(CAnimBone* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:52 */
	const char* GetName(const CAnimBone* );
	int32 m_parent; /* 16 4 */
	Vector m_pos; /* 20 12 */
	Quaternion m_quat; /* 32 16 */
	Quaternion m_qAlignment; /* 48 16 */
	int32 m_flags; /* 64 4 */
	void ~CAnimBone(CAnimBone* );
};

// <054B579A> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 72
struct CAnimBone {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	CAnimBone* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void Schema_CompileTimeVerificationFunction(CAnimBone* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimBone* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	CAnimBone* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad(CAnimBone* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave_CAnimBone(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad_CAnimBone(CAnimBone* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:52 */
	const char* GetName(const CAnimBone* );
	int32 m_parent; /* 16 4 */
	Vector m_pos; /* 20 12 */
	Quaternion m_quat; /* 32 16 */
	Quaternion m_qAlignment; /* 48 16 */
	int32 m_flags; /* 64 4 */
	void ~CAnimBone(CAnimBone* );
	void CAnimBone(CAnimBone* );
	CAnimBone& operator=(CAnimBone* , const CAnimBone& );
};

// <002229D1> ../public/animationsystem/animationgroupresource.h:46
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 72
struct CAnimBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	CAnimBone* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_CompileTimeVerificationFunction(CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	CAnimBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad(CAnimBone* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave_CAnimBone(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad_CAnimBone(CAnimBone* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:52 */
	const char* GetName(const CAnimBone* );
	int32 m_parent; /* 16 4 */
	Vector m_pos; /* 20 12 */
	Quaternion m_quat; /* 32 16 */
	Quaternion m_qAlignment; /* 48 16 */
	int32 m_flags; /* 64 4 */
	CAnimBone& operator=(CAnimBone* , const CAnimBone& );
	void CAnimBone(CAnimBone* );
	void ~CAnimBone(CAnimBone* );
};

// <00919861> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:46
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 72
struct CAnimBone {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	CAnimBone* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	void Schema_CompileTimeVerificationFunction(CAnimBone* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimBone* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	CAnimBone* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave(const CAnimBone* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad(CAnimBone* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave_CAnimBone(const CAnimBone* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad_CAnimBone(CAnimBone* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:52 */
	const char* GetName(const CAnimBone* );
	int32 m_parent; /* 16 4 */
	Vector m_pos; /* 20 12 */
	Quaternion m_quat; /* 32 16 */
	Quaternion m_qAlignment; /* 48 16 */
	int32 m_flags; /* 64 4 */
	void ~CAnimBone(CAnimBone* );
	void CAnimBone(CAnimBone* );
	CAnimBone& operator=(CAnimBone* , const CAnimBone& );
};

// <00B5DD52> ../public/animationsystem/animationgroupresource.h:46
// member functions: 16
// member variables: 6
// static member variable: 1
// struct size: 72
struct CAnimBone {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	CAnimBone* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	void Schema_CompileTimeVerificationFunction(CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimBone* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	CAnimBone* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad(CAnimBone* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferSave_CAnimBone(const CAnimBone* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:49 */
	void KV3TransferLoad_CAnimBone(CAnimBone* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:52 */
	const char* GetName(const CAnimBone* );
	int32 m_parent; /* 16 4 */
	Vector m_pos; /* 20 12 */
	Quaternion m_quat; /* 32 16 */
	Quaternion m_qAlignment; /* 48 16 */
	int32 m_flags; /* 64 4 */
	void CAnimBone(CAnimBone* );
	void ~CAnimBone(CAnimBone* );
};

// <055074E9> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <055074E3> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <055074CA> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:48
inline void CAnimBone::Schema_DynamicBinding()
{
} /* size: 0 */

// <04BDC63A> ../public/animationsystem/animationgroupresource.h:52
inline void CAnimBone::GetName()
{
} /* size: 0 */

// <05501373> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
inline void CAnimUser::operator=(const CAnimUser &)
{
} /* size: 0 */

// <0550135C> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
void CAnimUser::CAnimUser()
{
} /* size: 0 */

// <05501340> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
inline void CAnimUser::CAnimUser()
{
} /* size: 0 */

// <05501329> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
void CAnimUser::~CAnimUser()
{
} /* size: 0 */

// <0550130D> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
inline void CAnimUser::~CAnimUser()
{
} /* size: 0 */

// <03E65B68> ../public/animationsystem/animationgroupresource.h:67
// member functions: 15
// member variables: 2
// static member variable: 1
// struct size: 24
struct CAnimUser {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	CAnimUser* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void Schema_CompileTimeVerificationFunction(CAnimUser* );
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimUser* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	CAnimUser* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad(CAnimUser* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave_CAnimUser(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad_CAnimUser(CAnimUser* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:73 */
	const char* GetName(const CAnimUser* );
	int32 m_nType; /* 16 4 */
	void ~CAnimUser(CAnimUser* );
};

// <054B5A19> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
// member functions: 17
// member variables: 2
// static member variable: 1
// struct size: 24
struct CAnimUser {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	CAnimUser* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void Schema_CompileTimeVerificationFunction(CAnimUser* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimUser* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	CAnimUser* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad(CAnimUser* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave_CAnimUser(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad_CAnimUser(CAnimUser* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:73 */
	const char* GetName(const CAnimUser* );
	int32 m_nType; /* 16 4 */
	void ~CAnimUser(CAnimUser* );
	void CAnimUser(CAnimUser* );
	CAnimUser& operator=(CAnimUser* , const CAnimUser& );
};

// <00222C34> ../public/animationsystem/animationgroupresource.h:67
// member functions: 17
// member variables: 2
// static member variable: 1
// struct size: 24
struct CAnimUser {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	CAnimUser* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	void Schema_CompileTimeVerificationFunction(CAnimUser* );
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimUser* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	CAnimUser* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad(CAnimUser* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave_CAnimUser(const CAnimUser* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad_CAnimUser(CAnimUser* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:73 */
	const char* GetName(const CAnimUser* );
	int32 m_nType; /* 16 4 */
	CAnimUser& operator=(CAnimUser* , const CAnimUser& );
	void CAnimUser(CAnimUser* );
	void ~CAnimUser(CAnimUser* );
};

// <00919ADF> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:67
// member functions: 17
// member variables: 2
// static member variable: 1
// struct size: 24
struct CAnimUser {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	CAnimUser* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	void Schema_CompileTimeVerificationFunction(CAnimUser* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimUser* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	CAnimUser* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave(const CAnimUser* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad(CAnimUser* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferSave_CAnimUser(const CAnimUser* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:70 */
	void KV3TransferLoad_CAnimUser(CAnimUser* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:73 */
	const char* GetName(const CAnimUser* );
	int32 m_nType; /* 16 4 */
	void ~CAnimUser(CAnimUser* );
	void CAnimUser(CAnimUser* );
	CAnimUser& operator=(CAnimUser* , const CAnimUser& );
};

// <055074A5> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:69
inline void CAnimUser::Schema_DynamicBinding()
{
} /* size: 0 */

// <0550F1EF> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
// function calls: 78
void CAnimDataChannelDesc::operator=(const CAnimDataChannelDesc &)
{
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Count(); // 573
	CUtlMemory<CBufferString, int>::Base(); // 112
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Base(); // 102
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::begin(); // 574
	CUtlMemory<CBufferString, int>::Base(); // 113
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Base(); // 105
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Count(); // 105
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 209
	UtlTraitsCopyRange<CBufferString>(const CBufferString* pFrom,
						const CBufferString* pFromEnd,
						CBufferString* pTo);  // 200
	UtlTraitsCopyRange<CBufferString>(const CBufferString* pFrom,
						const CBufferString* pFromEnd,
						CBufferString* pTo);  // 574
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >& other);  // 565
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >& other);  // 452
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >& src);  // 81
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 573
	CUtlMemory<int, int>::Base(); // 112
	CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 102
	CUtlVectorBase<int, CUtlMemory<int, int> >::begin(); // 574
	CUtlMemory<int, int>::Base(); // 113
	CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 105
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 105
	CUtlVectorBase<int, CUtlMemory<int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 574
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator=(
			const CUtlVectorBase<int, CUtlMemory<int, int> >& other);  // 565
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator=(
			const CUtlVectorBase<int, CUtlMemory<int, int> >& other);  // 452
	CUtlVector<int, CUtlMemory<int, int> >::operator=(
			const CUtlVector<int, CUtlMemory<int, int> >& src);  // 81
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 573
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 102
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::begin(); // 574
	CUtlMemory<unsigned int, int>::Base(); // 113
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 173
	UtlTraitsCopyRange<unsigned int>(const unsigned int* pFrom,
					const unsigned int* pFromEnd,
					unsigned int* pTo);  // 574
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 565
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 452
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& src);  // 81
} /* size: 0, inline expansions: 78 (0 bytes) */

// <05500BD6> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
inline void CAnimDataChannelDesc::operator=(const CAnimDataChannelDesc &)
{
} /* size: 0 */

// <05500B8B> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
void CAnimDataChannelDesc::CAnimDataChannelDesc()
{
} /* size: 0 */

// <05500B6F> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
inline void CAnimDataChannelDesc::CAnimDataChannelDesc()
{
} /* size: 0 */

// <05500B58> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
void CAnimDataChannelDesc::~CAnimDataChannelDesc()
{
} /* size: 0 */

// <05500B3C> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
inline void CAnimDataChannelDesc::~CAnimDataChannelDesc()
{
} /* size: 0 */

// <00A42555> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
// variable: 1
// function calls: 38
void CAnimDataChannelDesc::~CAnimDataChannelDesc()
{
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
	ValidateAlignment<unsigned int>(void); // 508
	CUtlMemory<unsigned int, int>::Purge(); // 510
	CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 81
	CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1798
	CUtlMemory<int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 1799
	CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
	ValidateAlignment<int>(void); // 508
	CUtlMemory<int, int>::Purge(); // 510
	CUtlMemory<int, int>::~CUtlMemory(); // 562
	CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
	CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 81
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 81
	CBufferString::~CBufferString(); // 81
	CBufferString::~CBufferString(); // 81
	CBufferString::~CBufferString(); // 81
	CBufferString::~CBufferString(); // 81
} /* size: 241, inline expansions: 34 (762 bytes) */

// <00358C90> ../public/animationsystem/animationgroupresource.h:81
// function calls: 78
void CAnimDataChannelDesc::operator=(const CAnimDataChannelDesc &)
{
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 81
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Count(); // 573
	CUtlMemory<CBufferString, int>::Base(); // 112
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Base(); // 102
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::begin(); // 574
	CUtlMemory<CBufferString, int>::Base(); // 113
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Base(); // 105
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Count(); // 105
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::end(); // 574
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 1108
	CBufferString::WriteBuffer(); // 1390
	CBufferString::WriteBuffer(); // 1101
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 1108
	CBufferString::operator=(
			const CBufferString& src);  // 209
	UtlTraitsCopyRange<CBufferString>(const CBufferString* pFrom,
						const CBufferString* pFromEnd,
						CBufferString* pTo);  // 200
	UtlTraitsCopyRange<CBufferString>(const CBufferString* pFrom,
						const CBufferString* pFromEnd,
						CBufferString* pTo);  // 574
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >& other);  // 565
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >& other);  // 452
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::operator=(
			const CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >& src);  // 81
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 573
	CUtlMemory<int, int>::Base(); // 112
	CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 102
	CUtlVectorBase<int, CUtlMemory<int, int> >::begin(); // 574
	CUtlMemory<int, int>::Base(); // 113
	CUtlVectorBase<int, CUtlMemory<int, int> >::Base(); // 105
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 105
	CUtlVectorBase<int, CUtlMemory<int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<int>(const int* pFrom,
				const int* pFromEnd,
				int* pTo);  // 574
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator=(
			const CUtlVectorBase<int, CUtlMemory<int, int> >& other);  // 565
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator=(
			const CUtlVectorBase<int, CUtlMemory<int, int> >& other);  // 452
	CUtlVector<int, CUtlMemory<int, int> >::operator=(
			const CUtlVector<int, CUtlMemory<int, int> >& src);  // 81
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 573
	CUtlMemory<unsigned int, int>::Base(); // 112
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 102
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::begin(); // 574
	CUtlMemory<unsigned int, int>::Base(); // 113
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Base(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 105
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::end(); // 574
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<float>(const float* pFrom,
					const float* pFromEnd,
					float* pTo);  // 173
	UtlTraitsCopyRange<unsigned int>(const unsigned int* pFrom,
					const unsigned int* pFromEnd,
					unsigned int* pTo);  // 574
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 565
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >& other);  // 452
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::operator=(
			const CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >& src);  // 81
} /* size: 798, inline expansions: 78 (2873 bytes) */

// <03E65D50> ../public/animationsystem/animationgroupresource.h:81
// member functions: 14
// member variables: 9
// static member variable: 1
// struct size: 168
struct CAnimDataChannelDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	CAnimDataChannelDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_CompileTimeVerificationFunction(CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	CAnimDataChannelDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave_CAnimDataChannelDesc(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad_CAnimDataChannelDesc(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	AnimString_t m_szChannelClass; /* 0 16 */
	AnimString_t m_szVariableName; /* 16 16 */
	int32 m_nFlags; /* 32 4 */
	int32 m_nType; /* 36 4 */
	AnimString_t m_szGrouping; /* 40 16 */
	AnimString_t m_szDescription; /* 56 16 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szElementNameArray; /* 72 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElementIndexArray; /* 104 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nElementMaskArray; /* 136 32 */
	void ~CAnimDataChannelDesc(CAnimDataChannelDesc* );
};

// <054B5C5C> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
// member functions: 16
// member variables: 9
// static member variable: 1
// struct size: 168
struct CAnimDataChannelDesc {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	CAnimDataChannelDesc* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void Schema_CompileTimeVerificationFunction(CAnimDataChannelDesc* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimDataChannelDesc* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	CAnimDataChannelDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave_CAnimDataChannelDesc(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad_CAnimDataChannelDesc(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	AnimString_t m_szChannelClass; /* 0 16 */
	AnimString_t m_szVariableName; /* 16 16 */
	int32 m_nFlags; /* 32 4 */
	int32 m_nType; /* 36 4 */
	AnimString_t m_szGrouping; /* 40 16 */
	AnimString_t m_szDescription; /* 56 16 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szElementNameArray; /* 72 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElementIndexArray; /* 104 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nElementMaskArray; /* 136 32 */
	void ~CAnimDataChannelDesc(CAnimDataChannelDesc* );
	void CAnimDataChannelDesc(CAnimDataChannelDesc* );
	CAnimDataChannelDesc& operator=(CAnimDataChannelDesc* , const CAnimDataChannelDesc& );
};

// <00222E5B> ../public/animationsystem/animationgroupresource.h:81
// member functions: 16
// member variables: 9
// static member variable: 1
// struct size: 168
struct CAnimDataChannelDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	CAnimDataChannelDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_CompileTimeVerificationFunction(CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	CAnimDataChannelDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave_CAnimDataChannelDesc(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad_CAnimDataChannelDesc(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	AnimString_t m_szChannelClass; /* 0 16 */
	AnimString_t m_szVariableName; /* 16 16 */
	int32 m_nFlags; /* 32 4 */
	int32 m_nType; /* 36 4 */
	AnimString_t m_szGrouping; /* 40 16 */
	AnimString_t m_szDescription; /* 56 16 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szElementNameArray; /* 72 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElementIndexArray; /* 104 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nElementMaskArray; /* 136 32 */
	CAnimDataChannelDesc& operator=(CAnimDataChannelDesc* , const CAnimDataChannelDesc& );
	void CAnimDataChannelDesc(CAnimDataChannelDesc* );
	void ~CAnimDataChannelDesc(CAnimDataChannelDesc* );
};

// <00919D21> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:81
// member functions: 16
// member variables: 9
// static member variable: 1
// struct size: 168
struct CAnimDataChannelDesc {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	CAnimDataChannelDesc* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	void Schema_CompileTimeVerificationFunction(CAnimDataChannelDesc* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimDataChannelDesc* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	CAnimDataChannelDesc* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave_CAnimDataChannelDesc(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad_CAnimDataChannelDesc(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	AnimString_t m_szChannelClass; /* 0 16 */
	AnimString_t m_szVariableName; /* 16 16 */
	int32 m_nFlags; /* 32 4 */
	int32 m_nType; /* 36 4 */
	AnimString_t m_szGrouping; /* 40 16 */
	AnimString_t m_szDescription; /* 56 16 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szElementNameArray; /* 72 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElementIndexArray; /* 104 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nElementMaskArray; /* 136 32 */
	void ~CAnimDataChannelDesc(CAnimDataChannelDesc* );
	void CAnimDataChannelDesc(CAnimDataChannelDesc* );
	CAnimDataChannelDesc& operator=(CAnimDataChannelDesc* , const CAnimDataChannelDesc& );
};

// <00B5E17F> ../public/animationsystem/animationgroupresource.h:81
// member functions: 15
// member variables: 9
// static member variable: 1
// struct size: 168
struct CAnimDataChannelDesc {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	CAnimDataChannelDesc* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	void Schema_CompileTimeVerificationFunction(CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:83 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimDataChannelDesc* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	CAnimDataChannelDesc* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferSave_CAnimDataChannelDesc(const CAnimDataChannelDesc* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:84 */
	void KV3TransferLoad_CAnimDataChannelDesc(CAnimDataChannelDesc* , CKV3TransferLoadContext* );
	AnimString_t m_szChannelClass; /* 0 16 */
	AnimString_t m_szVariableName; /* 16 16 */
	int32 m_nFlags; /* 32 4 */
	int32 m_nType; /* 36 4 */
	AnimString_t m_szGrouping; /* 40 16 */
	AnimString_t m_szDescription; /* 56 16 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szElementNameArray; /* 72 32 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElementIndexArray; /* 104 32 */
	CUtlVector<unsigned int, CUtlMemory<unsigned int, int> > m_nElementMaskArray; /* 136 32 */
	void CAnimDataChannelDesc(CAnimDataChannelDesc* );
	void ~CAnimDataChannelDesc(CAnimDataChannelDesc* );
};

// <05507480> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:83
inline void CAnimDataChannelDesc::Schema_DynamicBinding()
{
} /* size: 0 */

// <05505F5F> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
// variables: 5
// function calls: 97
void CAnimKeyData::~CAnimKeyData()
{
	{
		int i; // 1721
		CUtlMemory<CAnimDataChannelDesc, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::Element(
			int i);  // 1723
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
		CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned int, int>::Purge(); // 903
		CUtlMemory<unsigned int, int>::Purge(); // 1799
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 560
		ValidateAlignment<unsigned int>(void); // 508
		CUtlMemory<unsigned int, int>::Purge(); // 510
		CUtlMemory<unsigned int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<unsigned int, CUtlMemory<unsigned int, int> >::~CUtlVector(); // 81
		CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1798
		CUtlMemory<int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<int, int>::Purge(); // 903
		CUtlMemory<int, int>::Purge(); // 1799
		CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
		ValidateAlignment<int>(void); // 508
		CUtlMemory<int, int>::Purge(); // 510
		CUtlMemory<int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 81
		{
			int i; // 1721
			CUtlMemory<CBufferString, int>::operator[](
					int i);  // 602
			CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
				int i);  // 1723
			CBufferString::~CBufferString(); // 1526
			Destruct<CBufferString>(CBufferString* pMemory); // 1723
		}
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
		CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
		CUtlMemory<CBufferString, int>::Purge(); // 903
		CUtlMemory<CBufferString, int>::Purge(); // 1799
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
		ValidateAlignment<CBufferString>(void); // 508
		CUtlMemory<CBufferString, int>::Purge(); // 510
		CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
		CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 81
		CBufferString::~CBufferString(); // 81
		CBufferString::~CBufferString(); // 81
		CBufferString::~CBufferString(); // 81
		CBufferString::~CBufferString(); // 81
		CAnimDataChannelDesc::~CAnimDataChannelDesc(); // 1526
		Destruct<CAnimDataChannelDesc>(CAnimDataChannelDesc* pMemory); // 1723
	}
	CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimDataChannelDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 903
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 1799
	CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::Purge(); // 560
	ValidateAlignment<CAnimDataChannelDesc>(void); // 508
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 510
	CUtlMemory<CAnimDataChannelDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CAnimUser, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 67
		CAnimUser::~CAnimUser(); // 1526
		Destruct<CAnimUser>(CAnimUser* pMemory); // 1723
	}
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimUser, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimUser, int>::Purge(); // 903
	CUtlMemory<CAnimUser, int>::Purge(); // 1799
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::Purge(); // 560
	ValidateAlignment<CAnimUser>(void); // 508
	CUtlMemory<CAnimUser, int>::Purge(); // 510
	CUtlMemory<CAnimUser, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CAnimBone, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 46
		CAnimBone::~CAnimBone(); // 1526
		Destruct<CAnimBone>(CAnimBone* pMemory); // 1723
	}
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimBone, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimBone, int>::Purge(); // 903
	CUtlMemory<CAnimBone, int>::Purge(); // 1799
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::Purge(); // 560
	ValidateAlignment<CAnimBone>(void); // 508
	CUtlMemory<CAnimBone, int>::Purge(); // 510
	CUtlMemory<CAnimBone, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> >::~CUtlVector(); // 104
	CBufferString::~CBufferString(); // 104
} /* size: 0, inline expansions: 41 (0 bytes) */

// <05505F43> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
inline void CAnimKeyData::~CAnimKeyData()
{
} /* size: 0 */

// <054F9331> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
inline void CAnimKeyData::operator=(const CAnimKeyData &)
{
} /* size: 0 */

// <054F931A> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
void CAnimKeyData::CAnimKeyData()
{
} /* size: 0 */

// <054F92FE> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
inline void CAnimKeyData::CAnimKeyData()
{
} /* size: 0 */

// <0547DC70> ../public/animationsystem/animationgroupresource.h:104
// variables: 3
// function calls: 54
void CAnimKeyData::~CAnimKeyData()
{
	CUtlMemory<CAnimDataChannelDesc, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 903
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 1799
	CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::Purge(); // 560
	ValidateAlignment<CAnimDataChannelDesc>(void); // 508
	CUtlMemory<CAnimDataChannelDesc, int>::Purge(); // 510
	CUtlMemory<CAnimDataChannelDesc, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CAnimUser, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 67
		CAnimUser::~CAnimUser(); // 1526
		Destruct<CAnimUser>(CAnimUser* pMemory); // 1723
	}
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimUser, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimUser, int>::Purge(); // 903
	CUtlMemory<CAnimUser, int>::Purge(); // 1799
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::Purge(); // 560
	ValidateAlignment<CAnimUser>(void); // 508
	CUtlMemory<CAnimUser, int>::Purge(); // 510
	CUtlMemory<CAnimUser, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimUser, CUtlMemory<CAnimUser, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> >::~CUtlVector(); // 104
	{
		int i; // 1721
		CUtlMemory<CAnimBone, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 46
		CAnimBone::~CAnimBone(); // 1526
		Destruct<CAnimBone>(CAnimBone* pMemory); // 1723
	}
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimBone, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimBone, int>::Purge(); // 903
	CUtlMemory<CAnimBone, int>::Purge(); // 1799
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::Purge(); // 560
	ValidateAlignment<CAnimBone>(void); // 508
	CUtlMemory<CAnimBone, int>::Purge(); // 510
	CUtlMemory<CAnimBone, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimBone, CUtlMemory<CAnimBone, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> >::~CUtlVector(); // 104
	CBufferString::~CBufferString(); // 104
} /* size: 0, inline expansions: 40 (0 bytes) */

// <03E65F81> ../public/animationsystem/animationgroupresource.h:104
// member functions: 15
// member variables: 6
// static member variable: 1
// struct size: 152
struct CAnimKeyData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	CAnimKeyData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void Schema_CompileTimeVerificationFunction(CAnimKeyData* );
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimKeyData* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	CAnimKeyData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad(CAnimKeyData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave_CAnimKeyData(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad_CAnimKeyData(CAnimKeyData* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:110 */
	const char* GetName(const CAnimKeyData* );
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> > m_boneArray; /* 16 32 */
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> > m_userArray; /* 48 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_morphArray; /* 80 32 */
	int32 m_nChannelElements; /* 112 4 */
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> > m_dataChannelArray; /* 120 32 */
	void ~CAnimKeyData(CAnimKeyData* );
};

// <054B5EE8> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 152
struct CAnimKeyData {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	CAnimKeyData* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void Schema_CompileTimeVerificationFunction(CAnimKeyData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimKeyData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	CAnimKeyData* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad(CAnimKeyData* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave_CAnimKeyData(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad_CAnimKeyData(CAnimKeyData* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:110 */
	const char* GetName(const CAnimKeyData* );
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> > m_boneArray; /* 16 32 */
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> > m_userArray; /* 48 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_morphArray; /* 80 32 */
	int32 m_nChannelElements; /* 112 4 */
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> > m_dataChannelArray; /* 120 32 */
	void CAnimKeyData(CAnimKeyData* );
	CAnimKeyData& operator=(CAnimKeyData* , const CAnimKeyData& );
	void ~CAnimKeyData(CAnimKeyData* );
};

// <00919FAC> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:104
// member functions: 17
// member variables: 6
// static member variable: 1
// struct size: 152
struct CAnimKeyData {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	CAnimKeyData* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	void Schema_CompileTimeVerificationFunction(CAnimKeyData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimKeyData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	CAnimKeyData* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad(CAnimKeyData* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave_CAnimKeyData(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad_CAnimKeyData(CAnimKeyData* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:110 */
	const char* GetName(const CAnimKeyData* );
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> > m_boneArray; /* 16 32 */
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> > m_userArray; /* 48 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_morphArray; /* 80 32 */
	int32 m_nChannelElements; /* 112 4 */
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> > m_dataChannelArray; /* 120 32 */
	void CAnimKeyData(CAnimKeyData* );
	CAnimKeyData& operator=(CAnimKeyData* , const CAnimKeyData& );
	void ~CAnimKeyData(CAnimKeyData* );
};

// <00B5E3CE> ../public/animationsystem/animationgroupresource.h:104
// member functions: 16
// member variables: 6
// static member variable: 1
// struct size: 152
struct CAnimKeyData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	CAnimKeyData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	void Schema_CompileTimeVerificationFunction(CAnimKeyData* );
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:106 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimKeyData* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	CAnimKeyData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad(CAnimKeyData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferSave_CAnimKeyData(const CAnimKeyData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:107 */
	void KV3TransferLoad_CAnimKeyData(CAnimKeyData* , CKV3TransferLoadContext* );
	AnimString_t m_name; /* 0 16 */
	/* ../public/animationsystem/animationgroupresource.h:110 */
	const char* GetName(const CAnimKeyData* );
	CUtlVector<CAnimBone, CUtlMemory<CAnimBone, int> > m_boneArray; /* 16 32 */
	CUtlVector<CAnimUser, CUtlMemory<CAnimUser, int> > m_userArray; /* 48 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_morphArray; /* 80 32 */
	int32 m_nChannelElements; /* 112 4 */
	CUtlVector<CAnimDataChannelDesc, CUtlMemory<CAnimDataChannelDesc, int> > m_dataChannelArray; /* 120 32 */
	void CAnimKeyData(CAnimKeyData* );
	void ~CAnimKeyData(CAnimKeyData* );
};

// <0550745B> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:106
inline void CAnimKeyData::Schema_DynamicBinding()
{
} /* size: 0 */

// <054F31E3> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
inline void CAnimRetargetElementData::operator=(const CAnimRetargetElementData &)
{
} /* size: 0 */

// <054F31CC> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
void CAnimRetargetElementData::CAnimRetargetElementData()
{
} /* size: 0 */

// <054F31B0> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
inline void CAnimRetargetElementData::CAnimRetargetElementData()
{
} /* size: 0 */

// <054F3199> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
void CAnimRetargetElementData::~CAnimRetargetElementData()
{
} /* size: 0 */

// <054F317D> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
inline void CAnimRetargetElementData::~CAnimRetargetElementData()
{
} /* size: 0 */

// <03E6A6DB> ../public/animationsystem/animationgroupresource.h:124
// member functions: 14
// member variables: 13
// static member variable: 1
// struct size: 168
struct CAnimRetargetElementData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	CAnimRetargetElementData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetElementData* );
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetElementData* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	CAnimRetargetElementData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave_CAnimRetargetElementData(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad_CAnimRetargetElementData(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	int32 m_nElementType; /* 0 4 */
	int32 m_nGroupType; /* 4 4 */
	int32 m_nChainType; /* 8 4 */
	int32 m_nChainIndex; /* 12 4 */
	int32 m_nChainInvIndex; /* 16 4 */
	int32 m_nBoneIndex; /* 20 4 */
	AnimString_t m_boneName; /* 24 16 */
	matrix3x4_t m_transform; /* 40 48 */
	matrix3x4_t m_invTransform; /* 88 48 */
	float m_flDistance; /* 136 4 */
	Vector m_vecMin; /* 140 12 */
	Vector m_vecMax; /* 152 12 */
	float m_flMass; /* 164 4 */
	void ~CAnimRetargetElementData(CAnimRetargetElementData* );
};

// <054BA6AD> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
// member functions: 16
// member variables: 13
// static member variable: 1
// struct size: 168
struct CAnimRetargetElementData {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	CAnimRetargetElementData* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetElementData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetElementData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	CAnimRetargetElementData* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave_CAnimRetargetElementData(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad_CAnimRetargetElementData(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	int32 m_nElementType; /* 0 4 */
	int32 m_nGroupType; /* 4 4 */
	int32 m_nChainType; /* 8 4 */
	int32 m_nChainIndex; /* 12 4 */
	int32 m_nChainInvIndex; /* 16 4 */
	int32 m_nBoneIndex; /* 20 4 */
	AnimString_t m_boneName; /* 24 16 */
	matrix3x4_t m_transform; /* 40 48 */
	matrix3x4_t m_invTransform; /* 88 48 */
	float m_flDistance; /* 136 4 */
	Vector m_vecMin; /* 140 12 */
	Vector m_vecMax; /* 152 12 */
	float m_flMass; /* 164 4 */
	void ~CAnimRetargetElementData(CAnimRetargetElementData* );
	void CAnimRetargetElementData(CAnimRetargetElementData* );
	CAnimRetargetElementData& operator=(CAnimRetargetElementData* , const CAnimRetargetElementData& );
};

// <00227834> ../public/animationsystem/animationgroupresource.h:124
// member functions: 16
// member variables: 13
// static member variable: 1
// struct size: 168
struct CAnimRetargetElementData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	CAnimRetargetElementData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetElementData* );
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetElementData* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	CAnimRetargetElementData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave_CAnimRetargetElementData(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad_CAnimRetargetElementData(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	int32 m_nElementType; /* 0 4 */
	int32 m_nGroupType; /* 4 4 */
	int32 m_nChainType; /* 8 4 */
	int32 m_nChainIndex; /* 12 4 */
	int32 m_nChainInvIndex; /* 16 4 */
	int32 m_nBoneIndex; /* 20 4 */
	AnimString_t m_boneName; /* 24 16 */
	matrix3x4_t m_transform; /* 40 48 */
	matrix3x4_t m_invTransform; /* 88 48 */
	float m_flDistance; /* 136 4 */
	Vector m_vecMin; /* 140 12 */
	Vector m_vecMax; /* 152 12 */
	float m_flMass; /* 164 4 */
	CAnimRetargetElementData& operator=(CAnimRetargetElementData* , const CAnimRetargetElementData& );
	void CAnimRetargetElementData(CAnimRetargetElementData* );
	void ~CAnimRetargetElementData(CAnimRetargetElementData* );
};

// <0091E771> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:124
// member functions: 16
// member variables: 13
// static member variable: 1
// struct size: 168
struct CAnimRetargetElementData {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	CAnimRetargetElementData* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetElementData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetElementData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	CAnimRetargetElementData* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferSave_CAnimRetargetElementData(const CAnimRetargetElementData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:127 */
	void KV3TransferLoad_CAnimRetargetElementData(CAnimRetargetElementData* , CKV3TransferLoadContext* );
	int32 m_nElementType; /* 0 4 */
	int32 m_nGroupType; /* 4 4 */
	int32 m_nChainType; /* 8 4 */
	int32 m_nChainIndex; /* 12 4 */
	int32 m_nChainInvIndex; /* 16 4 */
	int32 m_nBoneIndex; /* 20 4 */
	AnimString_t m_boneName; /* 24 16 */
	matrix3x4_t m_transform; /* 40 48 */
	matrix3x4_t m_invTransform; /* 88 48 */
	float m_flDistance; /* 136 4 */
	Vector m_vecMin; /* 140 12 */
	Vector m_vecMax; /* 152 12 */
	float m_flMass; /* 164 4 */
	void ~CAnimRetargetElementData(CAnimRetargetElementData* );
	void CAnimRetargetElementData(CAnimRetargetElementData* );
	CAnimRetargetElementData& operator=(CAnimRetargetElementData* , const CAnimRetargetElementData& );
};

// <05507436> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:126
inline void CAnimRetargetElementData::Schema_DynamicBinding()
{
} /* size: 0 */

// <054ED19B> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
inline void CAnimRetargetChainData::operator=(const CAnimRetargetChainData &)
{
} /* size: 0 */

// <054ED184> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
void CAnimRetargetChainData::CAnimRetargetChainData()
{
} /* size: 0 */

// <054ED168> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
inline void CAnimRetargetChainData::CAnimRetargetChainData()
{
} /* size: 0 */

// <054ED151> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
void CAnimRetargetChainData::~CAnimRetargetChainData()
{
} /* size: 0 */

// <054ED135> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
inline void CAnimRetargetChainData::~CAnimRetargetChainData()
{
} /* size: 0 */

// <03E6A94B> ../public/animationsystem/animationgroupresource.h:149
// member functions: 14
// member variables: 4
// static member variable: 1
// struct size: 56
struct CAnimRetargetChainData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	CAnimRetargetChainData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetChainData* );
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetChainData* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	CAnimRetargetChainData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave_CAnimRetargetChainData(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad_CAnimRetargetChainData(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	AnimString_t m_sChainName; /* 0 16 */
	int32 m_nGroupType; /* 16 4 */
	int32 m_nChainType; /* 20 4 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElement; /* 24 32 */
	void ~CAnimRetargetChainData(CAnimRetargetChainData* );
};

// <054BA978> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
// member functions: 16
// member variables: 4
// static member variable: 1
// struct size: 56
struct CAnimRetargetChainData {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	CAnimRetargetChainData* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetChainData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetChainData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	CAnimRetargetChainData* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave_CAnimRetargetChainData(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad_CAnimRetargetChainData(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	AnimString_t m_sChainName; /* 0 16 */
	int32 m_nGroupType; /* 16 4 */
	int32 m_nChainType; /* 20 4 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElement; /* 24 32 */
	void ~CAnimRetargetChainData(CAnimRetargetChainData* );
	void CAnimRetargetChainData(CAnimRetargetChainData* );
	CAnimRetargetChainData& operator=(CAnimRetargetChainData* , const CAnimRetargetChainData& );
};

// <00227AE3> ../public/animationsystem/animationgroupresource.h:149
// member functions: 16
// member variables: 4
// static member variable: 1
// struct size: 56
struct CAnimRetargetChainData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	CAnimRetargetChainData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetChainData* );
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetChainData* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	CAnimRetargetChainData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave_CAnimRetargetChainData(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad_CAnimRetargetChainData(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	AnimString_t m_sChainName; /* 0 16 */
	int32 m_nGroupType; /* 16 4 */
	int32 m_nChainType; /* 20 4 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElement; /* 24 32 */
	CAnimRetargetChainData& operator=(CAnimRetargetChainData* , const CAnimRetargetChainData& );
	void CAnimRetargetChainData(CAnimRetargetChainData* );
	void ~CAnimRetargetChainData(CAnimRetargetChainData* );
};

// <0091EA3B> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:149
// member functions: 16
// member variables: 4
// static member variable: 1
// struct size: 56
struct CAnimRetargetChainData {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	CAnimRetargetChainData* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetChainData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetChainData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	CAnimRetargetChainData* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferSave_CAnimRetargetChainData(const CAnimRetargetChainData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:152 */
	void KV3TransferLoad_CAnimRetargetChainData(CAnimRetargetChainData* , CKV3TransferLoadContext* );
	AnimString_t m_sChainName; /* 0 16 */
	int32 m_nGroupType; /* 16 4 */
	int32 m_nChainType; /* 20 4 */
	CUtlVector<int, CUtlMemory<int, int> > m_nElement; /* 24 32 */
	void ~CAnimRetargetChainData(CAnimRetargetChainData* );
	void CAnimRetargetChainData(CAnimRetargetChainData* );
	CAnimRetargetChainData& operator=(CAnimRetargetChainData* , const CAnimRetargetChainData& );
};

// <05507411> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:151
inline void CAnimRetargetChainData::Schema_DynamicBinding()
{
} /* size: 0 */

// <05505531> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
// variables: 3
// function calls: 51
void CAnimRetargetData::~CAnimRetargetData()
{
	{
		int i; // 1721
		CUtlMemory<CBufferString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 1526
		Destruct<CBufferString>(CBufferString* pMemory); // 1723
	}
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::RemoveAll(); // 1798
	CUtlMemory<CBufferString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CBufferString, int>::Purge(); // 903
	CUtlMemory<CBufferString, int>::Purge(); // 1799
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::Purge(); // 560
	ValidateAlignment<CBufferString>(void); // 508
	CUtlMemory<CBufferString, int>::Purge(); // 510
	CUtlMemory<CBufferString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> >::~CUtlVector(); // 162
	{
		int i; // 1721
		CUtlMemory<CAnimRetargetChainData, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> >::Element(
			int i);  // 1723
		CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1798
		CUtlMemory<int, int>::IsExternallyAllocated(); // 905
		CUtlMemory<int, int>::Purge(); // 903
		CUtlMemory<int, int>::Purge(); // 1799
		CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 560
		ValidateAlignment<int>(void); // 508
		CUtlMemory<int, int>::Purge(); // 510
		CUtlMemory<int, int>::~CUtlMemory(); // 562
		CUtlVectorBase<int, CUtlMemory<int, int> >::~CUtlVectorBase(); // 410
		CUtlVector<int, CUtlMemory<int, int> >::~CUtlVector(); // 149
		CBufferString::~CBufferString(); // 149
		CAnimRetargetChainData::~CAnimRetargetChainData(); // 1526
		Destruct<CAnimRetargetChainData>(CAnimRetargetChainData* pMemory); // 1723
	}
	CUtlVectorBase<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimRetargetChainData, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimRetargetChainData, int>::Purge(); // 903
	CUtlMemory<CAnimRetargetChainData, int>::Purge(); // 1799
	CUtlVectorBase<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> >::Purge(); // 560
	ValidateAlignment<CAnimRetargetChainData>(void); // 508
	CUtlMemory<CAnimRetargetChainData, int>::Purge(); // 510
	CUtlMemory<CAnimRetargetChainData, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> >::~CUtlVector(); // 162
	{
		int i; // 1721
		CUtlMemory<CAnimRetargetElementData, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> >::Element(
			int i);  // 1723
		CBufferString::~CBufferString(); // 124
		CAnimRetargetElementData::~CAnimRetargetElementData(); // 1526
		Destruct<CAnimRetargetElementData>(CAnimRetargetElementData* pMemory); // 1723
	}
	CUtlVectorBase<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> >::RemoveAll(); // 1798
	CUtlMemory<CAnimRetargetElementData, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CAnimRetargetElementData, int>::Purge(); // 903
	CUtlMemory<CAnimRetargetElementData, int>::Purge(); // 1799
	CUtlVectorBase<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> >::Purge(); // 560
	CUtlVectorBase<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> >::~CUtlVector(); // 162
} /* size: 0, inline expansions: 27 (0 bytes) */

// <05505515> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
inline void CAnimRetargetData::~CAnimRetargetData()
{
} /* size: 0 */

// <054E9E47> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
inline void CAnimRetargetData::operator=(const CAnimRetargetData &)
{
} /* size: 0 */

// <054E9E30> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
void CAnimRetargetData::CAnimRetargetData()
{
} /* size: 0 */

// <0547DBD5> ../public/animationsystem/animationgroupresource.h:162
void CAnimRetargetData::~CAnimRetargetData()
{
} /* size: 0 */

// <03E6AB30> ../public/animationsystem/animationgroupresource.h:162
// member functions: 14
// member variables: 5
// static member variable: 1
// struct size: 104
struct CAnimRetargetData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	CAnimRetargetData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetData* );
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetData* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	CAnimRetargetData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad(CAnimRetargetData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave_CAnimRetargetData(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad_CAnimRetargetData(CAnimRetargetData* , CKV3TransferLoadContext* );
	int32 m_bEnableRetarget; /* 0 4 */
	int32 m_nRetargetStyle; /* 4 4 */
	CUtlVector<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> > m_element; /* 8 32 */
	CUtlVector<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> > m_chain; /* 40 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_replicated; /* 72 32 */
	void ~CAnimRetargetData(CAnimRetargetData* );
};

// <054BABB8> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 104
struct CAnimRetargetData {
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	CAnimRetargetData* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetData* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	CAnimRetargetData* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad(CAnimRetargetData* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave_CAnimRetargetData(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad_CAnimRetargetData(CAnimRetargetData* , CKV3TransferLoadContext* );
	int32 m_bEnableRetarget; /* 0 4 */
	int32 m_nRetargetStyle; /* 4 4 */
	CUtlVector<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> > m_element; /* 8 32 */
	CUtlVector<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> > m_chain; /* 40 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_replicated; /* 72 32 */
	void CAnimRetargetData(CAnimRetargetData* );
	CAnimRetargetData& operator=(CAnimRetargetData* , const CAnimRetargetData& );
	void ~CAnimRetargetData(CAnimRetargetData* );
};

// <0091EC7A> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:162
// member functions: 16
// member variables: 5
// static member variable: 1
// struct size: 104
struct CAnimRetargetData {
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	CAnimRetargetData* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetData* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	CAnimRetargetData* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad(CAnimRetargetData* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave_CAnimRetargetData(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad_CAnimRetargetData(CAnimRetargetData* , CKV3TransferLoadContext* );
	int32 m_bEnableRetarget; /* 0 4 */
	int32 m_nRetargetStyle; /* 4 4 */
	CUtlVector<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> > m_element; /* 8 32 */
	CUtlVector<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> > m_chain; /* 40 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_replicated; /* 72 32 */
	void CAnimRetargetData(CAnimRetargetData* );
	CAnimRetargetData& operator=(CAnimRetargetData* , const CAnimRetargetData& );
	void ~CAnimRetargetData(CAnimRetargetData* );
};

// <00B62FB0> ../public/animationsystem/animationgroupresource.h:162
// member functions: 15
// member variables: 5
// static member variable: 1
// struct size: 104
struct CAnimRetargetData {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	CAnimRetargetData* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	void Schema_CompileTimeVerificationFunction(CAnimRetargetData* );
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:164 */
	const CSchemaClassInfo* Schema_DynamicBinding(const CAnimRetargetData* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	CAnimRetargetData* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad(CAnimRetargetData* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferSave_CAnimRetargetData(const CAnimRetargetData* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:165 */
	void KV3TransferLoad_CAnimRetargetData(CAnimRetargetData* , CKV3TransferLoadContext* );
	int32 m_bEnableRetarget; /* 0 4 */
	int32 m_nRetargetStyle; /* 4 4 */
	CUtlVector<CAnimRetargetElementData, CUtlMemory<CAnimRetargetElementData, int> > m_element; /* 8 32 */
	CUtlVector<CAnimRetargetChainData, CUtlMemory<CAnimRetargetChainData, int> > m_chain; /* 40 32 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_replicated; /* 72 32 */
	void CAnimRetargetData(CAnimRetargetData* );
	void ~CAnimRetargetData(CAnimRetargetData* );
};

// <055073EC> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:164
inline void CAnimRetargetData::Schema_DynamicBinding()
{
} /* size: 0 */

// <03DD4B69> ../public/animationsystem/animationgroupresource.h:180
// member functions: 17
// member variables: 13
// static member variable: 1
// vtable entry: 1
// struct size: 472
struct CAnimationGroup : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	CAnimationGroup* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void Schema_CompileTimeVerificationFunction(CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	CAnimationGroup* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferSave(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferLoad(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferSave_CAnimationGroup(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferLoad_CAnimationGroup(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:185 */
	void CAnimationGroup(CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:258 */
	virtual void ~CAnimationGroup(CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:188 */
	void Initalize(CAnimationGroup* , CConvertOldDiskCtx& );
	uint32 m_nFlags; /* 12 4 */
	AnimString_t m_name; /* 16 16 */
	/* ../public/animationsystem/animationgroupresource.h:193 */
	const char* GetName(const CAnimationGroup* );
	CUtlVector<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, CUtlMemory<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, int> > m_localHAnimArray; /* 32 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_includedGroupArray; /* 64 32 */
	unique_ptr<CSequenceGroupResource, std::default_delete<CSequenceGroupResource> > m_directHSeqGroup; /* 96 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimData>, int> > m_localHAnimArray_Handle; /* 104 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_includedGroupArray_Handle; /* 136 32 */
	HSequenceGroup_InternalStrong m_directHSeqGroup_Handle; /* 168 8 */
	CAnimKeyData m_decodeKey; /* 176 152 */
	CAnimRetargetData m_retarget; /* 328 104 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szScripts; /* 432 32 */
	bool m_bInitialized; /* 464 1 */
};

// <054955C4> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:180
// member functions: 18
// member variables: 13
// static member variable: 1
// vtable entry: 1
// struct size: 472
struct CAnimationGroup : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
	void CAnimationGroup(CAnimationGroup* , const CAnimationGroup& );
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	CAnimationGroup* Schema_MarkHelperFn(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:959 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:1000 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:913 */
	void Schema_CompileTimeVerificationFunction(CAnimationGroup* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CAnimationGroup* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:183 */
	CAnimationGroup* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:1008 */
	void KV3TransferSave(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:1025 */
	void KV3TransferLoad(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:1013 */
	void KV3TransferSave_CAnimationGroup(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:1030 */
	void KV3TransferLoad_CAnimationGroup(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:185 */
	void CAnimationGroup(CAnimationGroup* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:258 */
	virtual void ~CAnimationGroup(CAnimationGroup* );
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:188 */
	void Initalize(CAnimationGroup* , CConvertOldDiskCtx& );
	uint32 m_nFlags; /* 12 4 */
	AnimString_t m_name; /* 16 16 */
	/* ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:193 */
	const char* GetName(const CAnimationGroup* );
	CUtlVector<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, CUtlMemory<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, int> > m_localHAnimArray; /* 32 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_includedGroupArray; /* 64 32 */
	unique_ptr<CSequenceGroupResource, std::default_delete<CSequenceGroupResource> > m_directHSeqGroup; /* 96 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimData>, int> > m_localHAnimArray_Handle; /* 104 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_includedGroupArray_Handle; /* 136 32 */
	HSequenceGroup_InternalStrong m_directHSeqGroup_Handle; /* 168 8 */
	CAnimKeyData m_decodeKey; /* 176 152 */
	CAnimRetargetData m_retarget; /* 328 104 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szScripts; /* 432 32 */
	bool m_bInitialized; /* 464 1 */
};

// <008E2D22> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:180
// member functions: 18
// member variables: 13
// static member variable: 1
// vtable entry: 1
// struct size: 472
struct CAnimationGroup : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
	void CAnimationGroup(CAnimationGroup* , const CAnimationGroup& );
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	CAnimationGroup* Schema_MarkHelperFn(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:902 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:930 */
	void Schema_VerifyBindingIsRegistered(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:856 */
	void Schema_CompileTimeVerificationFunction(CAnimationGroup* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	const char* Schema_StaticClassname(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CAnimationGroup* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:183 */
	CAnimationGroup* KV3TransferAllocateClassInstance(const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:938 */
	void KV3TransferSave(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:955 */
	void KV3TransferLoad(CAnimationGroup* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:943 */
	void KV3TransferSave_CAnimationGroup(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/animationgroupresource_h_schema.gen_cpp:960 */
	void KV3TransferLoad_CAnimationGroup(CAnimationGroup* , CKV3TransferLoadContext* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:185 */
	void CAnimationGroup(CAnimationGroup* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:258 */
	virtual void ~CAnimationGroup(CAnimationGroup* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:188 */
	void Initalize(CAnimationGroup* , CConvertOldDiskCtx& );
	uint32 m_nFlags; /* 12 4 */
	AnimString_t m_name; /* 16 16 */
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:193 */
	const char* GetName(const CAnimationGroup* );
	CUtlVector<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, CUtlMemory<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, int> > m_localHAnimArray; /* 32 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_includedGroupArray; /* 64 32 */
	unique_ptr<CSequenceGroupResource, std::default_delete<CSequenceGroupResource> > m_directHSeqGroup; /* 96 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimData>, int> > m_localHAnimArray_Handle; /* 104 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_includedGroupArray_Handle; /* 136 32 */
	HSequenceGroup_InternalStrong m_directHSeqGroup_Handle; /* 168 8 */
	CAnimKeyData m_decodeKey; /* 176 152 */
	CAnimRetargetData m_retarget; /* 328 104 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szScripts; /* 432 32 */
	bool m_bInitialized; /* 464 1 */
};

// <00AF2F7D> ../public/animationsystem/animationgroupresource.h:180
// member functions: 18
// member variables: 13
// static member variable: 1
// vtable entry: 1
// struct size: 472
struct CAnimationGroup : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
	/* ../public/animationsystem/animationgroupresource.h:183 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
	void CAnimationGroup(CAnimationGroup* , const CAnimationGroup& );
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	CAnimationGroup* Schema_MarkHelperFn(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	void Schema_CompileTimeVerificationFunction(CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	const char* Schema_StaticClassname(void);
	/* ../public/animationsystem/animationgroupresource.h:182 */
	virtual const CSchemaClassInfo* Schema_DynamicBinding(const CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	CAnimationGroup* KV3TransferAllocateClassInstance(const char* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferSave(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferLoad(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferSave_CAnimationGroup(const CAnimationGroup* , CKV3TransferSaveContext* );
	/* ../public/animationsystem/animationgroupresource.h:183 */
	void KV3TransferLoad_CAnimationGroup(CAnimationGroup* , CKV3TransferLoadContext* );
	/* ../public/animationsystem/animationgroupresource.h:185 */
	void CAnimationGroup(CAnimationGroup* );
	/* ../public/animationsystem/animationgroupresource.h:258 */
	virtual void ~CAnimationGroup(CAnimationGroup* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animationgroupresource.cpp:21 */
	void Initalize(CAnimationGroup* , CConvertOldDiskCtx& );
	uint32 m_nFlags; /* 12 4 */
	AnimString_t m_name; /* 16 16 */
	/* ../public/animationsystem/animationgroupresource.h:193 */
	const char* GetName(const CAnimationGroup* );
	CUtlVector<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, CUtlMemory<std::unique_ptr<CAnimationResource, std::default_delete<CAnimationResource> >, int> > m_localHAnimArray; /* 32 32 */
	CUtlVector<CAnimationGroupResource*, CUtlMemory<CAnimationGroupResource*, int> > m_includedGroupArray; /* 64 32 */
	unique_ptr<CSequenceGroupResource, std::default_delete<CSequenceGroupResource> > m_directHSeqGroup; /* 96 8 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimData>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimData>, int> > m_localHAnimArray_Handle; /* 104 32 */
	CUtlVector<CStrongHandle<InfoForResourceTypeCAnimationGroup>, CUtlMemory<CStrongHandle<InfoForResourceTypeCAnimationGroup>, int> > m_includedGroupArray_Handle; /* 136 32 */
	HSequenceGroup_InternalStrong m_directHSeqGroup_Handle; /* 168 8 */
	CAnimKeyData m_decodeKey; /* 176 152 */
	CAnimRetargetData m_retarget; /* 328 104 */
	CUtlVector<CBufferString, CUtlMemory<CBufferString, int> > m_szScripts; /* 432 32 */
	bool m_bInitialized; /* 464 1 */
};

// <0550846E> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182
// function calls: 3
void CAnimationGroup::Schema_DynamicBinding()
{
	GetPrimaryBinding(void); // 1000
	Schema_VerifyBindingIsRegistered(void); // 182
	GetPrimaryBinding(void); // 182
} /* size: 0, inline expansions: 3 (0 bytes) */

// <055073C7> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182
inline void CAnimationGroup::Schema_DynamicBinding()
{
} /* size: 0 */

// <0547E896> ../public/animationsystem/animationgroupresource.h:182
// function call: 1
void CAnimationGroup::Schema_DynamicBinding()
{
	GetPrimaryBinding(void); // 182
} /* size: 0, inline expansions: 1 (0 bytes) */

// <00A4C495> _vpc_/unity_animationsystem/linuxsteamrt64/../../../../_generated_code/animationsystem/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:182
// function calls: 3
void CAnimationGroup::Schema_DynamicBinding()
{
	GetPrimaryBinding(void); // 930
	Schema_VerifyBindingIsRegistered(void); // 182
	GetPrimaryBinding(void); // 182
} /* size: 0, inline expansions: 3 (0 bytes) */

// <00D20407> ../public/animationsystem/animationgroupresource.h:183
inline void KV3TransferAllocateClassInstance(const char* pDerivedClassName)
{
} /* size: 0 */

// <054E5015> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:185
void CAnimationGroup::CAnimationGroup()
{
} /* size: 0 */

// <054E4FFC> ../_generated_code/bonesetup/linuxsteamrt64/release/../../../../public/animationsystem/animationgroupresource.h:185
inline void CAnimationGroup::CAnimationGroup()
{
} /* size: 0 */

// <00D1C922> ../public/animationsystem/animationgroupresource.h:225
void CAnimationGroupResource::CAnimationGroupResource()
{
} /* size: 0 */

// <00D1C906> ../public/animationsystem/animationgroupresource.h:225
inline void CAnimationGroupResource::CAnimationGroupResource()
{
} /* size: 0 */

// <00B0C209> ../public/animationsystem/animationgroupresource.h:225
// member functions: 16
// member variables: 3
// class size: 32
class CAnimationGroupResource : public CRefCounted<CRefCountServiceBase<true, CRefMT> > {
public:
	/* class CRefCounted<CRefCountServiceBase<true, CRefMT> > <ancestor>; */ /* 0 16 */
	void CAnimationGroupResource(CAnimationGroupResource* , const CAnimationGroupResource& );
	void CAnimationGroupResource(CAnimationGroupResource* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animationgroupresource.cpp:84 */
	void InitFromV0Data(CAnimationGroupResource* , CConvertOldDiskCtx& , CAnimationGroup* , const char* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animationgroupresource.cpp:102 */
	void InitFromV0DataEmbedded(CAnimationGroupResource* , CConvertOldDiskCtx& , CAnimationGroup* , CAnimData* , CSequenceGroupData* , const char* );
	/* ../public/animationsystem/animationgroupresource.h:232 */
	const CAnimationGroup* GetData(const CAnimationGroupResource* );
	/* ../public/animationsystem/animationgroupresource.h:237 */
	const CAnimationResource* pLocalHAnim(const CAnimationGroupResource* , int);
	/* ../public/animationsystem/animationgroupresource.h:242 */
	const char* GetName(const CAnimationGroupResource* );
private:
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animationgroupresource.cpp:95 */
	virtual void ~CAnimationGroupResource(CAnimationGroupResource* );
	CSmartPtr<CAnimationGroup, CRefCountAccessor> m_pAnimationGroupResourceData; /* 16 8 */
	CUtlString m_Name; /* 24 8 */
	const class CAnimationResource  * pLocalHAnim(const class CAnimationGroupResource  *, int); /* linkage=_ZNK23CAnimationGroupResource11pLocalHAnimEi */
	const char  * GetName(const class CAnimationGroupResource  *); /* linkage=_ZNK23CAnimationGroupResource7GetNameEv */
	const class CAnimationGroup  * GetData(const class CAnimationGroupResource  *); /* linkage=_ZNK23CAnimationGroupResource7GetDataEv */
	void CAnimationGroupResource(class CAnimationGroupResource *, const class CAnimationGroupResource  &); /* linkage=_ZN23CAnimationGroupResourceC4ERKS_ */
	void CAnimationGroupResource(class CAnimationGroupResource *); /* linkage=_ZN23CAnimationGroupResourceC4Ev */
	void InitFromV0Data(class CAnimationGroupResource *, class CConvertOldDiskCtx &, class CAnimationGroup *, const char  *); /* linkage=_ZN23CAnimationGroupResource14InitFromV0DataER18CConvertOldDiskCtxP15CAnimationGroupPKc */
