
//
// public/animationsystem/ieventanimtag.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmeshsystem.so
//
//	functions: 24
//	class: 1
//

// <01310FC9> ../public/animationsystem/ieventanimtag.h:11
void IEventAnimTag::IEventAnimTag()
{
} /* size: 0 */

// <01310FAD> ../public/animationsystem/ieventanimtag.h:11
inline void IEventAnimTag::IEventAnimTag()
{
} /* size: 0 */

// <006787D9> ../public/animationsystem/ieventanimtag.h:11
inline void IEventAnimTag::operator=(const IEventAnimTag &)
{
} /* size: 0 */

// <012FBD55> ../public/animationsystem/ieventanimtag.h:11
// member functions: 20
// member variable: 1
// static member variable: 1
// vtable entries: 4
// class size: 8
class IEventAnimTag {
	void IEventAnimTag(IEventAnimTag* , IEventAnimTag& );
	void IEventAnimTag(IEventAnimTag* , const IEventAnimTag& );
	void IEventAnimTag(IEventAnimTag* );
	void ~IEventAnimTag(IEventAnimTag* );
	int ()(void) * * _vptr.IEventAnimTag; /* 0 8 */
private:
	static class CClassInfoT<IEventAnimTag> m_classInfoIEventAnimTag; /* 0 0 */
	/* ../public/animationsystem/ieventanimtag.h:13 */
	const ClassID MyTypeID(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animgraph/eventanimtag.cpp:8 */
	const CClassInfo& MyTypeInfo(void);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animgraph/eventanimtag.cpp:8 */
	virtual const CClassInfo& GetTypeInfo(const IEventAnimTag* );
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animgraph/eventanimtag.cpp:8 */
	virtual void* CastToBase(IEventAnimTag* , ClassID);
	/* _vpc_/unity_animationsystem/linuxsteamrt64/../../../animgraph/eventanimtag.cpp:8 */
	virtual const void* CastToBase(const IEventAnimTag* , ClassID);
	/* ../public/animationsystem/ieventanimtag.h:16 */
	virtual const char* GetIdentifier(const IEventAnimTag* );
	const class ClassID  MyTypeID(void); /* linkage=_ZN13IEventAnimTag8MyTypeIDEv */
	void IEventAnimTag(class IEventAnimTag *, class IEventAnimTag &); /* linkage=_ZN13IEventAnimTagC4EOS_ */
	void IEventAnimTag(class IEventAnimTag *, const class IEventAnimTag  &); /* linkage=_ZN13IEventAnimTagC4ERKS_ */
	void IEventAnimTag(class IEventAnimTag *); /* linkage=_ZN13IEventAnimTagC4Ev */
	void ~IEventAnimTag(class IEventAnimTag *); /* linkage=_ZN13IEventAnimTagD4Ev */
	/* <131f7fe> _vpc_/unity_animationsystem/linuxsteamrt64/../../../animgraph/eventanimtag.cpp:8 */
	const class CClassInfo  & MyTypeInfo(void); /* linkage=_ZN13IEventAnimTag10MyTypeInfoEv */
	virtual const class CClassInfo  & GetTypeInfo(const class IEventAnimTag  *); /* linkage=_ZNK13IEventAnimTag11GetTypeInfoEv */
	virtual void * CastToBase(class IEventAnimTag *, class ClassID); /* linkage=_ZN13IEventAnimTag10CastToBaseEN10Reflection7ClassIDE */
	virtual const void  * CastToBase(const class IEventAnimTag  *, class ClassID); /* linkage=_ZNK13IEventAnimTag10CastToBaseEN10Reflection7ClassIDE */
	virtual const char  * GetIdentifier(const class IEventAnimTag  *); /* linkage=_ZNK13IEventAnimTag13GetIdentifierEv */
};

// <06581745> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 9134
} /* size: 0, variables: 2 */

// <0401DDDB> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 47679
} /* size: 0, variables: 2 */

// <03EA3CA2> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 30995
} /* size: 0, variables: 2 */

// <0355A4A2> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 21496
} /* size: 0, variables: 2 */

// <03303058> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 112
} /* size: 0, variables: 2 */

// <02F2250A> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 64620
} /* size: 0, variables: 2 */

// <02619E7C> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 24313
} /* size: 0, variables: 2 */

// <022B3A9F> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 20260
} /* size: 0, variables: 2 */

// <01F53C81> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 35560
} /* size: 0, variables: 2 */

// <01E85590> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 59935
} /* size: 0, variables: 2 */

// <01DBB49E> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 46112
} /* size: 0, variables: 2 */

// <01CCFD6F> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 40290
} /* size: 0, variables: 2 */

// <01A05EB9> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 939
} /* size: 0, variables: 2 */

// <0194524B> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 56395
} /* size: 0, variables: 2 */

// <0171B9C5> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 9381
} /* size: 0, variables: 2 */

// <01657A47> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 10916
} /* size: 0, variables: 2 */

// <014D7E58> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 10559
} /* size: 0, variables: 2 */

// <013359CB> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 48027
} /* size: 0, variables: 2 */

// <00B3AC75> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 62565
} /* size: 0, variables: 2 */

// <0067F271> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 64483
} /* size: 0, variables: 2 */

// <004E775C> ../public/animationsystem/ieventanimtag.h:13
// variables: 2
inline void MyTypeID(void)
{
	ClassID sID; // 13
	const char   __PRETTY_FUNCTION__; // 4770
} /* size: 0, variables: 2 */

