
//
// public/materialsystem2/material_resource_data.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//
//	functions: 50
//	structs: 37
//

// <05D53CAF> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
inline void MaterialParam_t::operator=(const MaterialParam_t &)
{
} /* size: 0 */

// <05D53C8C> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
void MaterialParam_t::MaterialParam_t()
{
} /* size: 0 */

// <05D53C70> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
inline void MaterialParam_t::MaterialParam_t()
{
} /* size: 0 */

// <05D53C59> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
void MaterialParam_t::~MaterialParam_t()
{
} /* size: 0 */

// <05D53C3D> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
inline void MaterialParam_t::~MaterialParam_t()
{
} /* size: 0 */

// <05B7E859> ../public/materialsystem2/material_resource_data.h:22
// member functions: 14
// member variable: 1
// static member variable: 1
// struct size: 8
struct MaterialParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	MaterialParam_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_CompileTimeVerificationFunction(MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	MaterialParam_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad(MaterialParam_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave_MaterialParam_t(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad_MaterialParam_t(MaterialParam_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	void ~MaterialParam_t(MaterialParam_t* );
};

// <05D276EC> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
// member functions: 16
// member variable: 1
// static member variable: 1
// struct size: 8
struct MaterialParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	MaterialParam_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void Schema_CompileTimeVerificationFunction(MaterialParam_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParam_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	MaterialParam_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad(MaterialParam_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave_MaterialParam_t(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad_MaterialParam_t(MaterialParam_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	void ~MaterialParam_t(MaterialParam_t* );
	void MaterialParam_t(MaterialParam_t* );
	MaterialParam_t& operator=(MaterialParam_t* , const MaterialParam_t& );
};

// <0013953A> ../public/materialsystem2/material_resource_data.h:22
// member functions: 13
// member variable: 1
// static member variable: 1
// struct size: 8
struct MaterialParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	MaterialParam_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_CompileTimeVerificationFunction(MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	MaterialParam_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad(MaterialParam_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave_MaterialParam_t(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad_MaterialParam_t(MaterialParam_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
};

// <0065949E> ../public/materialsystem2/material_resource_data.h:22
// member functions: 16
// member variable: 1
// static member variable: 1
// struct size: 8
struct MaterialParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	MaterialParam_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	void Schema_CompileTimeVerificationFunction(MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParam_t* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	MaterialParam_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad(MaterialParam_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave_MaterialParam_t(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad_MaterialParam_t(MaterialParam_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	MaterialParam_t& operator=(MaterialParam_t* , const MaterialParam_t& );
	void ~MaterialParam_t(MaterialParam_t* );
	void MaterialParam_t(MaterialParam_t* );
};

// <006B3BF3> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:22
// member functions: 16
// member variable: 1
// static member variable: 1
// struct size: 8
struct MaterialParam_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	MaterialParam_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	void Schema_CompileTimeVerificationFunction(MaterialParam_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParam_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	MaterialParam_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad(MaterialParam_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferSave_MaterialParam_t(const MaterialParam_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:25 */
	void KV3TransferLoad_MaterialParam_t(MaterialParam_t* , CKV3TransferLoadContext* );
	CUtlString m_name; /* 0 8 */
	void ~MaterialParam_t(MaterialParam_t* );
	void MaterialParam_t(MaterialParam_t* );
	MaterialParam_t& operator=(MaterialParam_t* , const MaterialParam_t& );
};

// <05D53E0E> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24
inline void GetPrimaryBinding(void)
{
} /* size: 0 */

// <05D53E08> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24
inline void Schema_StaticClassname(void)
{
} /* size: 0 */

// <05D53DEF> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:24
inline void MaterialParam_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D53330> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
inline void MaterialParamInt_t::operator=(const MaterialParamInt_t &)
{
} /* size: 0 */

// <05D53319> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
void MaterialParamInt_t::MaterialParamInt_t()
{
} /* size: 0 */

// <05D532FD> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
inline void MaterialParamInt_t::MaterialParamInt_t()
{
} /* size: 0 */

// <05D532E6> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
void MaterialParamInt_t::~MaterialParamInt_t()
{
} /* size: 0 */

// <05D532CA> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
inline void MaterialParamInt_t::~MaterialParamInt_t()
{
} /* size: 0 */

// <05B7EA14> ../public/materialsystem2/material_resource_data.h:30
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamInt_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	MaterialParamInt_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_CompileTimeVerificationFunction(MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	MaterialParamInt_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad(MaterialParamInt_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave_MaterialParamInt_t(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad_MaterialParamInt_t(MaterialParamInt_t* , CKV3TransferLoadContext* );
	int32 m_nValue; /* 8 4 */
	void ~MaterialParamInt_t(MaterialParamInt_t* );
};

// <05D278E8> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamInt_t : public MaterialParam_t {
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	MaterialParamInt_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void Schema_CompileTimeVerificationFunction(MaterialParamInt_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamInt_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	MaterialParamInt_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad(MaterialParamInt_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave_MaterialParamInt_t(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad_MaterialParamInt_t(MaterialParamInt_t* , CKV3TransferLoadContext* );
	int32 m_nValue; /* 8 4 */
	void ~MaterialParamInt_t(MaterialParamInt_t* );
	void MaterialParamInt_t(MaterialParamInt_t* );
	MaterialParamInt_t& operator=(MaterialParamInt_t* , const MaterialParamInt_t& );
};

// <001396D9> ../public/materialsystem2/material_resource_data.h:30
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamInt_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	MaterialParamInt_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_CompileTimeVerificationFunction(MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	MaterialParamInt_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad(MaterialParamInt_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave_MaterialParamInt_t(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad_MaterialParamInt_t(MaterialParamInt_t* , CKV3TransferLoadContext* );
	int32 m_nValue; /* 8 4 */
};

// <00659696> ../public/materialsystem2/material_resource_data.h:30
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamInt_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	MaterialParamInt_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	void Schema_CompileTimeVerificationFunction(MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamInt_t* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	MaterialParamInt_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad(MaterialParamInt_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave_MaterialParamInt_t(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad_MaterialParamInt_t(MaterialParamInt_t* , CKV3TransferLoadContext* );
	int32 m_nValue; /* 8 4 */
	MaterialParamInt_t& operator=(MaterialParamInt_t* , const MaterialParamInt_t& );
	void ~MaterialParamInt_t(MaterialParamInt_t* );
	void MaterialParamInt_t(MaterialParamInt_t* );
};

// <006B3DEF> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:30
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamInt_t : public MaterialParam_t {
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	MaterialParamInt_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	void Schema_CompileTimeVerificationFunction(MaterialParamInt_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamInt_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	MaterialParamInt_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad(MaterialParamInt_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferSave_MaterialParamInt_t(const MaterialParamInt_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:33 */
	void KV3TransferLoad_MaterialParamInt_t(MaterialParamInt_t* , CKV3TransferLoadContext* );
	int32 m_nValue; /* 8 4 */
	void ~MaterialParamInt_t(MaterialParamInt_t* );
	void MaterialParamInt_t(MaterialParamInt_t* );
	MaterialParamInt_t& operator=(MaterialParamInt_t* , const MaterialParamInt_t& );
};

// <05D53DCA> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:32
inline void MaterialParamInt_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D51E19> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
inline void MaterialParamFloat_t::operator=(const MaterialParamFloat_t &)
{
} /* size: 0 */

// <05D51E02> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
void MaterialParamFloat_t::MaterialParamFloat_t()
{
} /* size: 0 */

// <05D51DE6> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
inline void MaterialParamFloat_t::MaterialParamFloat_t()
{
} /* size: 0 */

// <05D51DCF> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
void MaterialParamFloat_t::~MaterialParamFloat_t()
{
} /* size: 0 */

// <05D51DB3> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
inline void MaterialParamFloat_t::~MaterialParamFloat_t()
{
} /* size: 0 */

// <05B7EBD8> ../public/materialsystem2/material_resource_data.h:38
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamFloat_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	MaterialParamFloat_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_CompileTimeVerificationFunction(MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	MaterialParamFloat_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave_MaterialParamFloat_t(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad_MaterialParamFloat_t(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	float32 m_flValue; /* 8 4 */
	void ~MaterialParamFloat_t(MaterialParamFloat_t* );
};

// <05D27B03> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamFloat_t : public MaterialParam_t {
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	MaterialParamFloat_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void Schema_CompileTimeVerificationFunction(MaterialParamFloat_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamFloat_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	MaterialParamFloat_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave_MaterialParamFloat_t(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad_MaterialParamFloat_t(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	float32 m_flValue; /* 8 4 */
	void ~MaterialParamFloat_t(MaterialParamFloat_t* );
	void MaterialParamFloat_t(MaterialParamFloat_t* );
	MaterialParamFloat_t& operator=(MaterialParamFloat_t* , const MaterialParamFloat_t& );
};

// <00139881> ../public/materialsystem2/material_resource_data.h:38
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamFloat_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	MaterialParamFloat_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_CompileTimeVerificationFunction(MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	MaterialParamFloat_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave_MaterialParamFloat_t(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad_MaterialParamFloat_t(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	float32 m_flValue; /* 8 4 */
};

// <00659897> ../public/materialsystem2/material_resource_data.h:38
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamFloat_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	MaterialParamFloat_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	void Schema_CompileTimeVerificationFunction(MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamFloat_t* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	MaterialParamFloat_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave_MaterialParamFloat_t(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad_MaterialParamFloat_t(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	float32 m_flValue; /* 8 4 */
	MaterialParamFloat_t& operator=(MaterialParamFloat_t* , const MaterialParamFloat_t& );
	void ~MaterialParamFloat_t(MaterialParamFloat_t* );
	void MaterialParamFloat_t(MaterialParamFloat_t* );
};

// <006B400A> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:38
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamFloat_t : public MaterialParam_t {
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	MaterialParamFloat_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	void Schema_CompileTimeVerificationFunction(MaterialParamFloat_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamFloat_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	MaterialParamFloat_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferSave_MaterialParamFloat_t(const MaterialParamFloat_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:41 */
	void KV3TransferLoad_MaterialParamFloat_t(MaterialParamFloat_t* , CKV3TransferLoadContext* );
	float32 m_flValue; /* 8 4 */
	void ~MaterialParamFloat_t(MaterialParamFloat_t* );
	void MaterialParamFloat_t(MaterialParamFloat_t* );
	MaterialParamFloat_t& operator=(MaterialParamFloat_t* , const MaterialParamFloat_t& );
};

// <05D53DA5> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:40
inline void MaterialParamFloat_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D508E6> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
inline void MaterialParamVector_t::operator=(const MaterialParamVector_t &)
{
} /* size: 0 */

// <05D508CF> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
void MaterialParamVector_t::MaterialParamVector_t()
{
} /* size: 0 */

// <05D508B3> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
inline void MaterialParamVector_t::MaterialParamVector_t()
{
} /* size: 0 */

// <05D5089C> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
void MaterialParamVector_t::~MaterialParamVector_t()
{
} /* size: 0 */

// <05D50880> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
inline void MaterialParamVector_t::~MaterialParamVector_t()
{
} /* size: 0 */

// <05B7ED9C> ../public/materialsystem2/material_resource_data.h:46
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 24
struct MaterialParamVector_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	MaterialParamVector_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_CompileTimeVerificationFunction(MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	MaterialParamVector_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad(MaterialParamVector_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave_MaterialParamVector_t(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad_MaterialParamVector_t(MaterialParamVector_t* , CKV3TransferLoadContext* );
	Vector4D m_value; /* 8 16 */
	void ~MaterialParamVector_t(MaterialParamVector_t* );
};

// <05D27D1E> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 24
struct MaterialParamVector_t : public MaterialParam_t {
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	MaterialParamVector_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void Schema_CompileTimeVerificationFunction(MaterialParamVector_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamVector_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	MaterialParamVector_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad(MaterialParamVector_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave_MaterialParamVector_t(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad_MaterialParamVector_t(MaterialParamVector_t* , CKV3TransferLoadContext* );
	Vector4D m_value; /* 8 16 */
	void ~MaterialParamVector_t(MaterialParamVector_t* );
	void MaterialParamVector_t(MaterialParamVector_t* );
	MaterialParamVector_t& operator=(MaterialParamVector_t* , const MaterialParamVector_t& );
};

// <00139A29> ../public/materialsystem2/material_resource_data.h:46
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 24
struct MaterialParamVector_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	MaterialParamVector_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_CompileTimeVerificationFunction(MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	MaterialParamVector_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad(MaterialParamVector_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave_MaterialParamVector_t(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad_MaterialParamVector_t(MaterialParamVector_t* , CKV3TransferLoadContext* );
	Vector4D m_value; /* 8 16 */
};

// <00659A98> ../public/materialsystem2/material_resource_data.h:46
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 24
struct MaterialParamVector_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	MaterialParamVector_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	void Schema_CompileTimeVerificationFunction(MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamVector_t* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	MaterialParamVector_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad(MaterialParamVector_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave_MaterialParamVector_t(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad_MaterialParamVector_t(MaterialParamVector_t* , CKV3TransferLoadContext* );
	Vector4D m_value; /* 8 16 */
	MaterialParamVector_t& operator=(MaterialParamVector_t* , const MaterialParamVector_t& );
	void ~MaterialParamVector_t(MaterialParamVector_t* );
	void MaterialParamVector_t(MaterialParamVector_t* );
};

// <006B4225> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:46
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 24
struct MaterialParamVector_t : public MaterialParam_t {
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	MaterialParamVector_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	void Schema_CompileTimeVerificationFunction(MaterialParamVector_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamVector_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	MaterialParamVector_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad(MaterialParamVector_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferSave_MaterialParamVector_t(const MaterialParamVector_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:49 */
	void KV3TransferLoad_MaterialParamVector_t(MaterialParamVector_t* , CKV3TransferLoadContext* );
	Vector4D m_value; /* 8 16 */
	void ~MaterialParamVector_t(MaterialParamVector_t* );
	void MaterialParamVector_t(MaterialParamVector_t* );
	MaterialParamVector_t& operator=(MaterialParamVector_t* , const MaterialParamVector_t& );
};

// <05D53D80> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:48
inline void MaterialParamVector_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D4F610> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
inline void MaterialParamTexture_t::operator=(const MaterialParamTexture_t &)
{
} /* size: 0 */

// <05D4F5F9> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
void MaterialParamTexture_t::MaterialParamTexture_t()
{
} /* size: 0 */

// <05D4F5DD> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
inline void MaterialParamTexture_t::MaterialParamTexture_t()
{
} /* size: 0 */

// <05D4F5C6> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
void MaterialParamTexture_t::~MaterialParamTexture_t()
{
} /* size: 0 */

// <05D4F5AA> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
inline void MaterialParamTexture_t::~MaterialParamTexture_t()
{
} /* size: 0 */

// <05B7EF60> ../public/materialsystem2/material_resource_data.h:54
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamTexture_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	MaterialParamTexture_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_CompileTimeVerificationFunction(MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	MaterialParamTexture_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave_MaterialParamTexture_t(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad_MaterialParamTexture_t(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	HRenderTextureStrong m_pValue; /* 8 8 */
	void ~MaterialParamTexture_t(MaterialParamTexture_t* );
};

// <05D27F39> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamTexture_t : public MaterialParam_t {
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	MaterialParamTexture_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void Schema_CompileTimeVerificationFunction(MaterialParamTexture_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamTexture_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	MaterialParamTexture_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave_MaterialParamTexture_t(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad_MaterialParamTexture_t(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	HRenderTextureStrong m_pValue; /* 8 8 */
	void ~MaterialParamTexture_t(MaterialParamTexture_t* );
	void MaterialParamTexture_t(MaterialParamTexture_t* );
	MaterialParamTexture_t& operator=(MaterialParamTexture_t* , const MaterialParamTexture_t& );
};

// <00139BD1> ../public/materialsystem2/material_resource_data.h:54
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamTexture_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	MaterialParamTexture_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_CompileTimeVerificationFunction(MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	MaterialParamTexture_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave_MaterialParamTexture_t(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad_MaterialParamTexture_t(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	HRenderTextureStrong m_pValue; /* 8 8 */
};

// <00659C99> ../public/materialsystem2/material_resource_data.h:54
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamTexture_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	MaterialParamTexture_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	void Schema_CompileTimeVerificationFunction(MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamTexture_t* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	MaterialParamTexture_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave_MaterialParamTexture_t(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad_MaterialParamTexture_t(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	HRenderTextureStrong m_pValue; /* 8 8 */
	MaterialParamTexture_t& operator=(MaterialParamTexture_t* , const MaterialParamTexture_t& );
	void ~MaterialParamTexture_t(MaterialParamTexture_t* );
	void MaterialParamTexture_t(MaterialParamTexture_t* );
};

// <006B4440> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:54
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamTexture_t : public MaterialParam_t {
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	MaterialParamTexture_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	void Schema_CompileTimeVerificationFunction(MaterialParamTexture_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamTexture_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	MaterialParamTexture_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferSave_MaterialParamTexture_t(const MaterialParamTexture_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:57 */
	void KV3TransferLoad_MaterialParamTexture_t(MaterialParamTexture_t* , CKV3TransferLoadContext* );
	HRenderTextureStrong m_pValue; /* 8 8 */
	void ~MaterialParamTexture_t(MaterialParamTexture_t* );
	void MaterialParamTexture_t(MaterialParamTexture_t* );
	MaterialParamTexture_t& operator=(MaterialParamTexture_t* , const MaterialParamTexture_t& );
};

// <05D53D5B> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:56
inline void MaterialParamTexture_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D4E1BB> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
inline void MaterialParamString_t::operator=(const MaterialParamString_t &)
{
} /* size: 0 */

// <05D4E1A4> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
void MaterialParamString_t::MaterialParamString_t()
{
} /* size: 0 */

// <05D4E188> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
inline void MaterialParamString_t::MaterialParamString_t()
{
} /* size: 0 */

// <05D4E171> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
void MaterialParamString_t::~MaterialParamString_t()
{
} /* size: 0 */

// <05D4E155> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
inline void MaterialParamString_t::~MaterialParamString_t()
{
} /* size: 0 */

// <05B7F180> ../public/materialsystem2/material_resource_data.h:62
// member functions: 14
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamString_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	MaterialParamString_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_CompileTimeVerificationFunction(MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	MaterialParamString_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad(MaterialParamString_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave_MaterialParamString_t(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad_MaterialParamString_t(MaterialParamString_t* , CKV3TransferLoadContext* );
	CUtlString m_value; /* 8 8 */
	void ~MaterialParamString_t(MaterialParamString_t* );
};

// <05D28194> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamString_t : public MaterialParam_t {
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	MaterialParamString_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void Schema_CompileTimeVerificationFunction(MaterialParamString_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamString_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	MaterialParamString_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad(MaterialParamString_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave_MaterialParamString_t(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad_MaterialParamString_t(MaterialParamString_t* , CKV3TransferLoadContext* );
	CUtlString m_value; /* 8 8 */
	void ~MaterialParamString_t(MaterialParamString_t* );
	void MaterialParamString_t(MaterialParamString_t* );
	MaterialParamString_t& operator=(MaterialParamString_t* , const MaterialParamString_t& );
};

// <00139D79> ../public/materialsystem2/material_resource_data.h:62
// member functions: 13
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamString_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	MaterialParamString_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_CompileTimeVerificationFunction(MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	MaterialParamString_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad(MaterialParamString_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave_MaterialParamString_t(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad_MaterialParamString_t(MaterialParamString_t* , CKV3TransferLoadContext* );
	CUtlString m_value; /* 8 8 */
};

// <00659E9A> ../public/materialsystem2/material_resource_data.h:62
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamString_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	MaterialParamString_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	void Schema_CompileTimeVerificationFunction(MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamString_t* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	MaterialParamString_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad(MaterialParamString_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave_MaterialParamString_t(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad_MaterialParamString_t(MaterialParamString_t* , CKV3TransferLoadContext* );
	CUtlString m_value; /* 8 8 */
	MaterialParamString_t& operator=(MaterialParamString_t* , const MaterialParamString_t& );
	void ~MaterialParamString_t(MaterialParamString_t* );
	void MaterialParamString_t(MaterialParamString_t* );
};

// <006B469B> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:62
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 16
struct MaterialParamString_t : public MaterialParam_t {
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	MaterialParamString_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	void Schema_CompileTimeVerificationFunction(MaterialParamString_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamString_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	MaterialParamString_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad(MaterialParamString_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferSave_MaterialParamString_t(const MaterialParamString_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:65 */
	void KV3TransferLoad_MaterialParamString_t(MaterialParamString_t* , CKV3TransferLoadContext* );
	CUtlString m_value; /* 8 8 */
	void ~MaterialParamString_t(MaterialParamString_t* );
	void MaterialParamString_t(MaterialParamString_t* );
	MaterialParamString_t& operator=(MaterialParamString_t* , const MaterialParamString_t& );
};

// <05D53D36> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:64
inline void MaterialParamString_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D4CE65> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
inline void MaterialParamBuffer_t::operator=(const MaterialParamBuffer_t &)
{
} /* size: 0 */

// <05D4CE0F> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
void MaterialParamBuffer_t::MaterialParamBuffer_t()
{
} /* size: 0 */

// <05D4CDDC> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
void MaterialParamBuffer_t::~MaterialParamBuffer_t()
{
} /* size: 0 */

// <05D4CDC0> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
inline void MaterialParamBuffer_t::~MaterialParamBuffer_t()
{
} /* size: 0 */

// <05D283AF> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 32
struct MaterialParamBuffer_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	MaterialParamBuffer_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void Schema_CompileTimeVerificationFunction(MaterialParamBuffer_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamBuffer_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	MaterialParamBuffer_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferSave(const MaterialParamBuffer_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferLoad(MaterialParamBuffer_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferSave_MaterialParamBuffer_t(const MaterialParamBuffer_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferLoad_MaterialParamBuffer_t(MaterialParamBuffer_t* , CKV3TransferLoadContext* );
	CUtlBinaryBlock m_value; /* 8 24 */
	void ~MaterialParamBuffer_t(MaterialParamBuffer_t* );
	void MaterialParamBuffer_t(MaterialParamBuffer_t* );
	MaterialParamBuffer_t& operator=(MaterialParamBuffer_t* , const MaterialParamBuffer_t& );
};

// <006B48B6> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:70
// member functions: 16
// member variables: 2
// static member variable: 1
// struct size: 32
struct MaterialParamBuffer_t : public MaterialParam_t {
public:
	/* struct MaterialParam_t <ancestor>; */ /* 0 8 */
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	MaterialParamBuffer_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	void Schema_CompileTimeVerificationFunction(MaterialParamBuffer_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialParamBuffer_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	MaterialParamBuffer_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferSave(const MaterialParamBuffer_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferLoad(MaterialParamBuffer_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferSave_MaterialParamBuffer_t(const MaterialParamBuffer_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:73 */
	void KV3TransferLoad_MaterialParamBuffer_t(MaterialParamBuffer_t* , CKV3TransferLoadContext* );
	CUtlBinaryBlock m_value; /* 8 24 */
	void ~MaterialParamBuffer_t(MaterialParamBuffer_t* );
	void MaterialParamBuffer_t(MaterialParamBuffer_t* );
	MaterialParamBuffer_t& operator=(MaterialParamBuffer_t* , const MaterialParamBuffer_t& );
};

// <05D53D11> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:72
inline void MaterialParamBuffer_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <05D4AF6C> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
inline void MaterialResourceData_t::operator=(const MaterialResourceData_t &)
{
} /* size: 0 */

// <05D4AE11> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
void MaterialResourceData_t::MaterialResourceData_t()
{
} /* size: 0 */

// <05D4ADF5> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
inline void MaterialResourceData_t::MaterialResourceData_t()
{
} /* size: 0 */

// <05D48C7D> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
// variables: 10
// function calls: 163
void MaterialResourceData_t::~MaterialResourceData_t()
{
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 560
	ValidateAlignment<CUtlString>(void); // 508
	CUtlMemory<CUtlString, int>::Purge(); // 510
	CUtlMemory<CUtlString, int>::~CUtlMemory(); // 562
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVectorBase(); // 410
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamString_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 62
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 62
		MaterialParamString_t::~MaterialParamString_t(); // 1526
		Destruct<MaterialParamString_t>(MaterialParamString_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamString_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamString_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamString_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamString_t>(void); // 508
	CUtlMemory<MaterialParamString_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamString_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamTexture_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 54
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 54
		MaterialParamTexture_t::~MaterialParamTexture_t(); // 1526
		Destruct<MaterialParamTexture_t>(MaterialParamTexture_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamTexture_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamTexture_t>(void); // 508
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamTexture_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamVector_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 46
		MaterialParamVector_t::~MaterialParamVector_t(); // 1526
		Destruct<MaterialParamVector_t>(MaterialParamVector_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamVector_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamVector_t>(void); // 508
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamVector_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamFloat_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 38
		MaterialParamFloat_t::~MaterialParamFloat_t(); // 1526
		Destruct<MaterialParamFloat_t>(MaterialParamFloat_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamFloat_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamFloat_t>(void); // 508
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamFloat_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamInt_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 30
		MaterialParamInt_t::~MaterialParamInt_t(); // 1526
		Destruct<MaterialParamInt_t>(MaterialParamInt_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamInt_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamInt_t>(void); // 508
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamInt_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamTexture_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::Element(
			int i);  // 1723
		CStrongHandle<InfoForResourceTypeCTextureBase>::~CStrongHandle(); // 54
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 54
		MaterialParamTexture_t::~MaterialParamTexture_t(); // 1526
		Destruct<MaterialParamTexture_t>(MaterialParamTexture_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamTexture_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamTexture_t>(void); // 508
	CUtlMemory<MaterialParamTexture_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamTexture_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamVector_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 46
		MaterialParamVector_t::~MaterialParamVector_t(); // 1526
		Destruct<MaterialParamVector_t>(MaterialParamVector_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamVector_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamVector_t>(void); // 508
	CUtlMemory<MaterialParamVector_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamVector_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamFloat_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 38
		MaterialParamFloat_t::~MaterialParamFloat_t(); // 1526
		Destruct<MaterialParamFloat_t>(MaterialParamFloat_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamFloat_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamFloat_t>(void); // 508
	CUtlMemory<MaterialParamFloat_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamFloat_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> >::~CUtlVector(); // 78
	{
		int i; // 1721
		CUtlMemory<MaterialParamInt_t, int>::operator[](
				int i);  // 602
		CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 22
		MaterialParam_t::~MaterialParam_t(); // 30
		MaterialParamInt_t::~MaterialParamInt_t(); // 1526
		Destruct<MaterialParamInt_t>(MaterialParamInt_t* pMemory); // 1723
	}
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::RemoveAll(); // 1798
	CUtlMemory<MaterialParamInt_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 903
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 1799
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::Purge(); // 560
	ValidateAlignment<MaterialParamInt_t>(void); // 508
	CUtlMemory<MaterialParamInt_t, int>::Purge(); // 510
	CUtlMemory<MaterialParamInt_t, int>::~CUtlMemory(); // 562
	CUtlVectorBase<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::~CUtlVectorBase(); // 410
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> >::~CUtlVector(); // 78
	CUtlString::~CUtlString(); // 78
	CUtlString::~CUtlString(); // 78
} /* size: 0, inline expansions: 102 (0 bytes) */

// <05D48C61> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
inline void MaterialResourceData_t::~MaterialResourceData_t()
{
} /* size: 0 */

// <05B7F344> ../public/materialsystem2/material_resource_data.h:78
// member functions: 15
// member variables: 13
// static member variable: 1
// struct size: 344
struct MaterialResourceData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	MaterialResourceData_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_CompileTimeVerificationFunction(MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	MaterialResourceData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad(MaterialResourceData_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave_MaterialResourceData_t(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad_MaterialResourceData_t(MaterialResourceData_t* , CKV3TransferLoadContext* );
	CUtlString m_materialName; /* 0 8 */
	CUtlString m_shaderName; /* 8 8 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intParams; /* 16 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatParams; /* 48 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorParams; /* 80 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureParams; /* 112 32 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intAttributes; /* 144 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatAttributes; /* 176 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorAttributes; /* 208 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureAttributes; /* 240 32 */
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> > m_stringAttributes; /* 272 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_renderAttributesUsed; /* 304 32 */
	int32 m_shaderVersion; /* 336 4 */
	void ~MaterialResourceData_t(MaterialResourceData_t* );
	void MaterialResourceData_t(MaterialResourceData_t* );
};

// <05D285B4> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
// member functions: 16
// member variables: 13
// static member variable: 1
// struct size: 344
struct MaterialResourceData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	MaterialResourceData_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void Schema_CompileTimeVerificationFunction(MaterialResourceData_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialResourceData_t* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	MaterialResourceData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad(MaterialResourceData_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave_MaterialResourceData_t(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad_MaterialResourceData_t(MaterialResourceData_t* , CKV3TransferLoadContext* );
	CUtlString m_materialName; /* 0 8 */
	CUtlString m_shaderName; /* 8 8 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intParams; /* 16 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatParams; /* 48 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorParams; /* 80 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureParams; /* 112 32 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intAttributes; /* 144 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatAttributes; /* 176 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorAttributes; /* 208 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureAttributes; /* 240 32 */
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> > m_stringAttributes; /* 272 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_renderAttributesUsed; /* 304 32 */
	int32 m_shaderVersion; /* 336 4 */
	void ~MaterialResourceData_t(MaterialResourceData_t* );
	void MaterialResourceData_t(MaterialResourceData_t* );
	MaterialResourceData_t& operator=(MaterialResourceData_t* , const MaterialResourceData_t& );
};

// <00139F21> ../public/materialsystem2/material_resource_data.h:78
// member functions: 13
// member variables: 13
// static member variable: 1
// struct size: 344
struct MaterialResourceData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	MaterialResourceData_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_CompileTimeVerificationFunction(MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	MaterialResourceData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad(MaterialResourceData_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave_MaterialResourceData_t(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad_MaterialResourceData_t(MaterialResourceData_t* , CKV3TransferLoadContext* );
	CUtlString m_materialName; /* 0 8 */
	CUtlString m_shaderName; /* 8 8 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intParams; /* 16 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatParams; /* 48 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorParams; /* 80 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureParams; /* 112 32 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intAttributes; /* 144 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatAttributes; /* 176 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorAttributes; /* 208 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureAttributes; /* 240 32 */
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> > m_stringAttributes; /* 272 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_renderAttributesUsed; /* 304 32 */
	int32 m_shaderVersion; /* 336 4 */
};

// <00338E10> ../public/materialsystem2/material_resource_data.h:78
// member functions: 14
// member variables: 13
// static member variable: 1
// struct size: 344
struct MaterialResourceData_t {
	/* ../public/materialsystem2/material_resource_data.h:81 */
	enum {
		KV3TRANSFER_BEHAVIOR = 1,
	};
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	MaterialResourceData_t* Schema_MarkHelperFn(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	void Schema_CompileTimeVerificationFunction(MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const char* Schema_StaticClassname(void);
	/* ../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialResourceData_t* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	MaterialResourceData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad(MaterialResourceData_t* , CKV3TransferLoadContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave_MaterialResourceData_t(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad_MaterialResourceData_t(MaterialResourceData_t* , CKV3TransferLoadContext* );
	CUtlString m_materialName; /* 0 8 */
	CUtlString m_shaderName; /* 8 8 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intParams; /* 16 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatParams; /* 48 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorParams; /* 80 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureParams; /* 112 32 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intAttributes; /* 144 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatAttributes; /* 176 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorAttributes; /* 208 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureAttributes; /* 240 32 */
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> > m_stringAttributes; /* 272 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_renderAttributesUsed; /* 304 32 */
	int32 m_shaderVersion; /* 336 4 */
	void ~MaterialResourceData_t(MaterialResourceData_t* );
};

// <006B4ABB> ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:78
// member functions: 16
// member variables: 13
// static member variable: 1
// struct size: 344
struct MaterialResourceData_t {
private:
	static class CSchemaClassInfo * s_pSchemaBindingForLocalModule; /* 0 0 */
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* GetPrimaryBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	MaterialResourceData_t* Schema_MarkHelperFn(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void* Schema_ClassOps(SchemaGenClassOp_t, void* , void* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void Schema_VerifyBindingIsRegistered(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	void Schema_CompileTimeVerificationFunction(MaterialResourceData_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_StaticBinding(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const char* Schema_StaticClassname(void);
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80 */
	const CSchemaClassInfo* Schema_DynamicBinding(const MaterialResourceData_t* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	MaterialResourceData_t* KV3TransferAllocateClassInstance(const char* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad(MaterialResourceData_t* , CKV3TransferLoadContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferSave_MaterialResourceData_t(const MaterialResourceData_t* , CKV3TransferSaveContext* );
	/* ../_generated_code/materialsystem2/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:81 */
	void KV3TransferLoad_MaterialResourceData_t(MaterialResourceData_t* , CKV3TransferLoadContext* );
	CUtlString m_materialName; /* 0 8 */
	CUtlString m_shaderName; /* 8 8 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intParams; /* 16 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatParams; /* 48 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorParams; /* 80 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureParams; /* 112 32 */
	CUtlVector<MaterialParamInt_t, CUtlMemory<MaterialParamInt_t, int> > m_intAttributes; /* 144 32 */
	CUtlVector<MaterialParamFloat_t, CUtlMemory<MaterialParamFloat_t, int> > m_floatAttributes; /* 176 32 */
	CUtlVector<MaterialParamVector_t, CUtlMemory<MaterialParamVector_t, int> > m_vectorAttributes; /* 208 32 */
	CUtlVector<MaterialParamTexture_t, CUtlMemory<MaterialParamTexture_t, int> > m_textureAttributes; /* 240 32 */
	CUtlVector<MaterialParamString_t, CUtlMemory<MaterialParamString_t, int> > m_stringAttributes; /* 272 32 */
	CUtlVector<CUtlString, CUtlMemory<CUtlString, int> > m_renderAttributesUsed; /* 304 32 */
	int32 m_shaderVersion; /* 336 4 */
	void ~MaterialResourceData_t(MaterialResourceData_t* );
	void MaterialResourceData_t(MaterialResourceData_t* );
	MaterialResourceData_t& operator=(MaterialResourceData_t* , const MaterialResourceData_t& );
};

// <05D53CEC> ../_generated_code/meshutils/linuxsteamrt64/release/../../../../public/materialsystem2/material_resource_data.h:80
inline void MaterialResourceData_t::Schema_DynamicBinding()
{
} /* size: 0 */

// <0034ACFD> ../public/materialsystem2/material_resource_data.h:81
inline void KV3TransferAllocateClassInstance(const char* pDerivedClassName)
{
} /* size: 0 */

