
//
// vfx/vfx_common.cpp
//
//	referenced by: libengine2.so
//				   libmaterialsystem2.so
//				   librendersystemvulkan.so
//				   libvfx_vulkan.so
//
//	functions: 326
//	classes: 3
//	struct: 1
//

// <068DB240> vfx/vfx_common.cpp:39
bool VfxUpdateVariableLoads(void *, uint32, const CVfxVariableDescription *, int, uint32)
{
} /* size: 0 */

// <0696B9E0> vfx/vfx_common.cpp:135
// variable: 1
// function calls: 4
bool VfxHashValueLess(const CVfxHashValue& hash0, const CVfxHashValue& hash1)
{
	{
		int i; // 137
		LoadLittleDWord(const uint32* base,
				unsigned int dwordIndex);  // 308
		CVfxHashValue::GetHashUint32(
				uint index);  // 139
		LoadLittleDWord(const uint32* base,
				unsigned int dwordIndex);  // 308
		CVfxHashValue::GetHashUint32(
				uint index);  // 139
	}
} /* size: 46 */

// <0696B7C7> vfx/vfx_common.cpp:154
// variables: 4
// function calls: 2
void VfxInit(void)
{
	bool s_bInitCalled; // 156
	const char   __FUNCTION__; // 62449
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 159
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 167
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 160
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 168
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <01608449> vfx/vfx_common.cpp:154
// variables: 4
// function calls: 2
void VfxInit(void)
{
	bool s_bInitCalled; // 156
	const char   __FUNCTION__; // 42790
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 159
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 167
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 160
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 168
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <004D2CE6> vfx/vfx_common.cpp:154
// variables: 4
// function calls: 2
void VfxInit(void)
{
	bool s_bInitCalled; // 156
	const char   __FUNCTION__; // 43296
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 159
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 167
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 160
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 168
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <0696B787> vfx/vfx_common.cpp:173
const char* VfxGetUIStringForType(VfxUiType_t uiType)
{
} /* size: 0 */

// <0696B747> vfx/vfx_common.cpp:185
const char* VfxGetVariableNameForType(VfxVariableType_t variableType)
{
} /* size: 0 */

// <0696B0B0> vfx/vfx_common.cpp:198
// variables: 6
// function calls: 16
const CVfxHashValue& VfxGetVariableDescriptionVersionHash(int nVariableSourceMax)
{
	CVfxHashValue s_variableDescriptionVersionHash; // 200
	int s_nLastVariableSourceMax; // 201
	{
		CVfxVariableDescription dummyVar; // 209
		MD5Context_t md5Context; // 216
		int nVersion; // 229
		{
			int i; // 238
			V_strlen(const char* str); // 242
		}
		CUtlStringToken::CUtlStringToken(); // 560
		CVfxVariableDescription::CVfxVariableDescription(); // 209
		memset(void* __dest,
			int __ch,
			size_t __len);  // 67
		V_memset(void* dest,
			int fill,
			size_t count);  // 213
		CUtlString::IsEmpty(); // 223
		CVfxVariableDescription::~CVfxVariableDescription(); // 253
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 225
	}
	LoadLittleDWord(const uint32* base,
			unsigned int dwordIndex);  // 308
	CVfxHashValue::GetHashUint32(
			uint index);  // 281
	CVfxHashValue::IsValid(); // 203
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 286
	CVfxHashValue::Reset(); // 276
	CVfxHashValue::CVfxHashValue(); // 200
} /* size: 704, variables: 2, inline expansions: 7 (134 bytes) */

// <0696B07E> vfx/vfx_common.cpp:259
// variable: 1
int VfxGetStaticComboSourceByName(const char* pszName)
{
	{
		int i; // 264
	}
} /* size: 0 */

// <0696B04C> vfx/vfx_common.cpp:277
// variable: 1
int VfxGetDynamicComboSourceByName(const char* pszName)
{
	{
		int i; // 282
	}
} /* size: 0 */

// <0696AF92> vfx/vfx_common.cpp:295
// variable: 1
// function call: 1
int VfxGetVariableSourceByName(const char* pszName)
{
	{
		int i; // 300
		V_strcmp(const char* s1,
			const char* s2);  // 302
	}
} /* size: 0 */

// <0696AF72> vfx/vfx_common.cpp:316
bool IsEndOfLine(char ch)
{
} /* size: 0 */

// <0696AF55> vfx/vfx_common.cpp:324
void ClearLineToSpaces(char* line)
{
} /* size: 0 */

// <0696AF34> vfx/vfx_common.cpp:336
char* GetPtrToNextLine(char* line)
{
} /* size: 0 */

// <0696AEF9> vfx/vfx_common.cpp:353
// variables: 2
char* GetNextToken(char* line)
{
	const char* szTokenSeparatorsAndEndOfLine; // 356
	const char* szTokenSeparators; // 357
} /* size: 0, variables: 2 */

// <0696AEBE> vfx/vfx_common.cpp:363
// variables: 2
char* GetNextTokenInParens(char* line)
{
	const char* szTokenSeparatorsAndEndOfLine; // 366
	const char* szTokenSeparators; // 367
} /* size: 0, variables: 2 */

// <0696AE90> vfx/vfx_common.cpp:373
char* GetNextQuotedString(char* line, int* pResultStringLength)
{
} /* size: 0 */

// <0696AE62> vfx/vfx_common.cpp:388
// variable: 1
char* SkipWhitespace(char* line)
{
	const char* szTokenSeparators; // 391
} /* size: 0, variables: 1 */

// <0696AE42> vfx/vfx_common.cpp:396
bool IsCrcWhitespace(char ch)
{
} /* size: 0 */

// <0696AE14> vfx/vfx_common.cpp:401
// variable: 1
int GetCurrentTokenLength(char* line)
{
	const char* szTokenSeparators; // 403
} /* size: 0, variables: 1 */

// <0696AD7D> vfx/vfx_common.cpp:407
// variables: 3
void VfxMaskComments(char* pszFile)
{
	const char   __FUNCTION__; // 62660
	char* line; // 417
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 411
	}
} /* size: 0, variables: 2 */

// <016079FF> vfx/vfx_common.cpp:407
// variables: 3
void VfxMaskComments(char* pszFile)
{
	const char   __FUNCTION__; // 43001
	char* line; // 417
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 411
	}
} /* size: 0, variables: 2 */

// <004D229C> vfx/vfx_common.cpp:407
// variables: 3
void VfxMaskComments(char* pszFile)
{
	const char   __FUNCTION__; // 43507
	char* line; // 417
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 411
	}
} /* size: 0, variables: 2 */

// <008266AE> vfx/vfx_common.cpp:407
// variables: 3
void VfxMaskComments(char* pszFile)
{
	const char   __FUNCTION__; // 21978
	char* line; // 417
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 411
	}
} /* size: 0, variables: 2 */

// <0696ABB1> vfx/vfx_common.cpp:466
// variables: 3
// function calls: 3
void VfxRemovePreprocessorLines(char* pszFile)
{
	bool bCleanNextLine; // 471
	char* line; // 472
	{
		char lastNonWhitespaceChar; // 495
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 480
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 487
	}
	SkipWhitespace(char* line); // 475
} /* size: 0, variables: 2, inline expansions: 1 (0 bytes) */

// <0696AB35> vfx/vfx_common.cpp:529
// variables: 3
void VfxCollapseWhiteSpaceForCrc(char* pszFile)
{
	char* pOld; // 531
	char* pNew; // 532
	bool bJustWroteSpace; // 534
} /* size: 95, variables: 3 */

// <016063C5> vfx/vfx_common.cpp:560
// variables: 13
// function calls: 57
bool VfxMaskUnusedParts(char* pszFile, VfxProgram_t programType, bool bIsForCrc)
{
	char* line; // 562
	int nLineNumber; // 572
	{
		bool bRemoveEntireSection; // 579
		bool bLeaveEntireSectionAsIs; // 580
		bool bRemoveSurroundingJunk; // 581
		bool bRemoveAnnotationsInStruct; // 582
		bool bLeaveThisLine; // 583
		{
			bool bKeepContentsOfLine; // 592
			char pLineToken; // 593
			strcpy(char* __dest,
				const char* __src);  // 124
			V_strcpy(char* dest,
				const char* src);  // 598
			ClearLineToSpaces(char* line); // 324
			ClearLineToSpaces(char* line); // 608
			ClearLineToSpaces(char* line); // 324
			ClearLineToSpaces(char* line); // 654
			V_strcspn(const char* s1,
					const char* search);  // 339
			GetPtrToNextLine(char* line); // 612
			SkipWhitespace(char* line); // 621
			V_strlen(const char* str); // 622
			V_strncmp<int>(const char* s1,
					const char* s2,
					int count);  // 622
			Color::SetColor(
				int _r,
				int _g,
				int _b,
				int _a);  // 50
			Color::Color(
				int _r,
				int _g,
				int _b,
				int _a);  // 633
			ClearLineToSpaces(char* line); // 324
			ClearLineToSpaces(char* line); // 616
		}
		{
			char* pLine; // 854
			{
				char pszTmp; // 857
				V_strncpy<int>(char* pDest,
						const char* pSrc,
						int maxLenInChars);  // 858
				Color::SetColor(
					int _r,
					int _g,
					int _b,
					int _a);  // 50
				Color::Color(
					int _r,
					int _g,
					int _b,
					int _a);  // 859
			}
			SkipWhitespace(char* line); // 854
		}
		{
			bool bFoundEndOfStruct; // 873
			ClearLineToSpaces(char* line); // 324
			ClearLineToSpaces(char* line); // 877
		}
		{
			bool bFoundEndOfStruct; // 918
			ClearLineToSpaces(char* line); // 324
			ClearLineToSpaces(char* line); // 923
		}
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 590
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 712
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 724
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 724
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 742
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 742
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 753
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 791
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 803
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 815
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 827
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 839
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 779
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 765
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 712
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 697
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 686
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 679
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 672
		V_strncmp<int>(const char* s1,
				const char* s2,
				int count);  // 661
		ClearLineToSpaces(char* line); // 324
		ClearLineToSpaces(char* line); // 867
		V_strcspn(const char* s1,
				const char* search);  // 339
		GetPtrToNextLine(char* line); // 871
		V_strcspn(const char* s1,
				const char* search);  // 339
		GetPtrToNextLine(char* line); // 933
		ClearLineToSpaces(char* line); // 324
		ClearLineToSpaces(char* line); // 912
		V_strcspn(const char* s1,
				const char* search);  // 339
		GetPtrToNextLine(char* line); // 916
		ClearLineToSpaces(char* line); // 324
		ClearLineToSpaces(char* line); // 949
	}
	V_strcspn(const char* s1,
			const char* search);  // 339
	GetPtrToNextLine(char* line); // 952
} /* size: 0, variables: 2, inline expansions: 2 (0 bytes) */

// <06968EC3> vfx/vfx_common.cpp:962
// variables: 5
// function calls: 31
bool ReadEmbeddedVfxFile(const char* pFileName, CUtlBuffer& buf)
{
	CUtlBuffer pEncryptedBuf; // 964
	{
		EmbeddedShader_t shader; // 966
		const EmbeddedShader_t& __for_range; // 11984
		const EmbeddedShader_t* __for_begin; // 11990
		const EmbeddedShader_t* __for_end; // 11990
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		EmbeddedShader_t::EmbeddedShader_t(
				const EmbeddedShader_t  &);  // 966
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 968
		V_strcmp(const char* s1,
			const char* s2);  // 968
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
		CBufferString::Length(); // 970
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 970
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
	}
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 976
} /* size: 443, variables: 1, inline expansions: 6 (104 bytes) */

// <01605B45> vfx/vfx_common.cpp:962
// variables: 5
// function calls: 31
bool ReadEmbeddedVfxFile(const char* pFileName, CUtlBuffer& buf)
{
	CUtlBuffer pEncryptedBuf; // 964
	{
		EmbeddedShader_t shader; // 966
		const EmbeddedShader_t& __for_range; // 57861
		const EmbeddedShader_t* __for_begin; // 57867
		const EmbeddedShader_t* __for_end; // 57867
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		EmbeddedShader_t::EmbeddedShader_t(
				const EmbeddedShader_t  &);  // 966
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 968
		V_strcmp(const char* s1,
			const char* s2);  // 968
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
		CBufferString::Length(); // 970
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 970
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
	}
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 976
} /* size: 0, variables: 1, inline expansions: 6 (0 bytes) */

// <004D03E2> vfx/vfx_common.cpp:962
// variables: 5
// function calls: 31
bool ReadEmbeddedVfxFile(const char* pFileName, CUtlBuffer& buf)
{
	CUtlBuffer pEncryptedBuf; // 964
	{
		EmbeddedShader_t shader; // 966
		const EmbeddedShader_t& __for_range; // 58367
		const EmbeddedShader_t* __for_begin; // 58373
		const EmbeddedShader_t* __for_end; // 58373
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		EmbeddedShader_t::EmbeddedShader_t(
				const EmbeddedShader_t  &);  // 966
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 968
		V_strcmp(const char* s1,
			const char* s2);  // 968
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
		CBufferString::Length(); // 970
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 970
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
	}
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 976
} /* size: 443, variables: 1, inline expansions: 6 (104 bytes) */

// <008247F4> vfx/vfx_common.cpp:962
// variables: 5
// function calls: 31
bool ReadEmbeddedVfxFile(const char* pFileName, CUtlBuffer& buf)
{
	CUtlBuffer pEncryptedBuf; // 964
	{
		EmbeddedShader_t shader; // 966
		const EmbeddedShader_t& __for_range; // 36838
		const EmbeddedShader_t* __for_begin; // 36844
		const EmbeddedShader_t* __for_end; // 36844
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		CBufferString::InitMinConstruct(
				bool bGrowable);  // 744
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 745
		CBufferString::Set(
			const char* pString,
			int nChars,
			bool bExact);  // 745
		CBufferString::CBufferString(
				const CBufferString& string);  // 17
		EmbeddedShader_t::EmbeddedShader_t(
				const EmbeddedShader_t  &);  // 966
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 968
		V_strcmp(const char* s1,
			const char* s2);  // 968
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
		CBufferString::Length(); // 970
		CBufferString::ReadBuffer(); // 1374
		CBufferString::ReadBuffer(); // 776
		CBufferString::String(); // 970
		CBufferString::~CBufferString(); // 17
		CBufferString::~CBufferString(); // 17
		EmbeddedShader_t::~EmbeddedShader_t(); // 973
	}
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 976
} /* size: 443, variables: 1, inline expansions: 6 (104 bytes) */

// <06968E91> vfx/vfx_common.cpp:978
bool HasUTF8BOM(const char* pBuffer, int nLen)
{
} /* size: 0 */

// <0160560F> vfx/vfx_common.cpp:983
// variables: 6
// function calls: 11
bool ReadVfxFile(const char* pFileName, CUtlBuffer& buf)
{
	CUtlString absFilename; // 985
	bool bBinary; // 987
	FileHandle_t fp; // 988
	char bom; // 1001
	int nBomRead; // 1002
	bool bSuccess; // 1010
	CBufferString::~CBufferString(); // 985
	CUtlBuffer::IsText(); // 987
	CUtlBuffer::ContainsCRLF(); // 987
	CUtlString::Get(); // 99
	CUtlString::String(); // 988
	HasUTF8BOM(const char* pBuffer,
			int nLen);  // 1005
	CFileSystemPassThru::ReadToBuffer(
			FileHandle_t hFile,
			CUtlBuffer& buf,
			int nMaxBytes,
			FSAllocFunc_t pfnAlloc);  // 190
	CFileSystemPassThru::ReadToBuffer(
			FileHandle_t hFile,
			CUtlBuffer& buf,
			int nMaxBytes,
			FSAllocFunc_t pfnAlloc);  // 190
	CFileSystemPassThru::ReadToBuffer(
			FileHandle_t hFile,
			CUtlBuffer& buf,
			int nMaxBytes,
			FSAllocFunc_t pfnAlloc);  // 190
	CFileSystemPassThru::ReadToBuffer(
			FileHandle_t hFile,
			CUtlBuffer& buf,
			int nMaxBytes,
			FSAllocFunc_t pfnAlloc);  // 1010
	CUtlString::~CUtlString(); // 1015
} /* size: 0, variables: 6, inline expansions: 11 (0 bytes) */

// <06967B41> vfx/vfx_common.cpp:1018
// variables: 6
// function calls: 49
bool VfxReadAndPrepForCrc(CUtlBuffer& buf, const char* pszVfxFullPath, VfxProgram_t programType)
{
	CUtlSymbolTable uniqueIncludesFound; // 1021
	{
		UtlSymId_t i; // 1024
		{
			CUtlBuffer fileBuf; // 1027
			char* pLine; // 1051
			{
				int nStringLen; // 1059
				CPathBufferString includePath; // 1063
				V_strcspn(const char* s1,
						const char* search);  // 376
				V_strcspn(const char* s1,
						const char* search);  // 384
				GetNextQuotedString(char* line,
							int* pResultStringLength);  // 1060
				CBufferString::Set(
					const char* pString,
					int nChars,
					bool bExact);  // 1064
				CBufferString::ReadBuffer(); // 1374
				CBufferString::ReadBuffer(); // 781
				CBufferString::operator char const*(); // 1067
				CBufferString::InitMinConstruct(
						bool bGrowable);  // 712
				CBufferString::CBufferString(); // 591
				CBufferStringN<200>::CBufferStringN(); // 1063
				CUtlSymbol::operator==(
						UtlSymId_t id);  // 1067
				CBufferString::~CBufferString(); // 587
				CBufferStringN<200>::~CBufferStringN(); // 1077
				CBufferString::ReadBuffer(); // 1374
				CBufferString::ReadBuffer(); // 781
				CBufferString::operator char const*(); // 1074
			}
			V_strncmp<int>(const char* s1,
					const char* s2,
					int count);  // 1056
			SkipWhitespace(char* line); // 1054
			CUtlSymbol::CUtlSymbol(
					UtlSymId_t id);  // 1028
			CUtlMemory<unsigned char, int>::Base(); // 1484
			CUtlBuffer::Base(); // 1038
			CUtlMemory<unsigned char, int>::Base(); // 1484
			CUtlBuffer::Base(); // 1051
			V_strcspn(const char* s1,
					const char* search);  // 339
			GetPtrToNextLine(char* line); // 1078
			CUtlMemory<unsigned char, int>::Base(); // 1484
			CUtlBuffer::Base(); // 1081
			CUtlMemory<unsigned char, int>::Base(); // 1484
			CUtlBuffer::Base(); // 1084
			V_strlen(const char* str); // 1084
			ValidateAlignment<unsigned char>(void); // 508
			CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
			CUtlMemory<unsigned char, int>::Purge(); // 903
			CUtlMemory<unsigned char, int>::Purge(); // 510
			CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
			CUtlBuffer::~CUtlBuffer(); // 1085
			ValidateAlignment<unsigned char>(void); // 508
			CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
			CUtlMemory<unsigned char, int>::Purge(); // 903
			CUtlMemory<unsigned char, int>::Purge(); // 510
			CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
			CUtlBuffer::~CUtlBuffer(); // 1085
			Color::SetColor(
				int _r,
				int _g,
				int _b,
				int _a);  // 50
			Color::Color(
				int _r,
				int _g,
				int _b,
				int _a);  // 1040
			CUtlSymbol::CUtlSymbol(
					UtlSymId_t id);  // 1030
			Color::SetColor(
				int _r,
				int _g,
				int _b,
				int _a);  // 50
			Color::Color(
				int _r,
				int _g,
				int _b,
				int _a);  // 1030
		}
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 102
		CUtlSymbolTable::GetNumStrings(); // 1024
	}
} /* size: 1025, variables: 1 */

// <06967AF5> vfx/vfx_common.cpp:1094
VfxCompileTarget_t VfxGetCompileTargetForDXSupportLevel(int nDXSupportLevel, VfxPlatformType_t nPlatformType)
{
} /* size: 0 */

// <06966E68> vfx/vfx_common.cpp:1130
// variables: 3
// function calls: 36
bool VfxGetUsedShaderProgramsFromVfxFile(CUtlVector<bool, CUtlMemory<bool, int> >& outShaderProgramUsed, CUtlBuffer& buffer)
{
	CUtlBuffer fileBuf; // 1135
	const char* s_szProgramTypeSectionStrings; // 1140
	{
		int nProgramIdx; // 1156
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 1158
		strstr(const char* __haystack,
			const char* __needle);  // 247
		V_strstr(const char* s1,
			const char* search);  // 1158
	}
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::RemoveAll(); // 1132
	CUtlMemory<bool, int>::NumAllocated(); // 782
	CUtlMemory<bool, int>::IsGrowable(); // 823
	CUtlMemory<bool, int>::IsExternallyAllocated(); // 859
	CUtlMemory<bool, int>::IsExternallyAllocated(); // 861
	CUtlMemory<bool, int>::Grow(
		int num);  // 806
	CUtlMemory<bool, int>::Base(); // 112
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::Base(); // 368
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::GrowMemory(
			int num);  // 784
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::GrowVector(
			int num);  // 1445
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1437
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::InsertMultipleBefore(
				int elem,
				int num);  // 1294
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::AddMultipleToTail(
				int num);  // 1319
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::SetCount(
		int count);  // 1133
	CUtlBuffer::TellPut(); // 1597
	CUtlMemory<unsigned char, int>::Base(); // 1479
	CUtlBuffer::Base(); // 1597
	CUtlBuffer::Clear(); // 1602
	CUtlBuffer::CopyBuffer(
			const void* pubData,
			int cubData);  // 1600
	CUtlBuffer::CopyBuffer(
			const void* pubData,
			int cubData);  // 1597
	CUtlBuffer::CopyBuffer(
			const CUtlBuffer& buffer);  // 1136
	CUtlMemory<unsigned char, int>::Base(); // 1484
	CUtlBuffer::Base(); // 1138
	CUtlMemory<bool, int>::operator[](
			int i);  // 588
	CUtlVectorBase<bool, CUtlMemory<bool, int> >::operator[](
			int i);  // 1153
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 1169
} /* size: 446, variables: 2, inline expansions: 32 (1554 bytes) */

// <06966E17> vfx/vfx_common.cpp:1172
// variable: 1
const VfxCompileTargetInfo_t& VfxGetCompileTargetInfo(VfxCompileTarget_t compileTarget)
{
	const VfxCompileTargetInfo_t   s_compileTargetInfo; // 1175
} /* size: 0, variables: 1 */

// <06966DE5> vfx/vfx_common.cpp:1186
bool VfxIsProgramTypeSupportedForCompileTarget(VfxProgram_t programType, VfxCompileTarget_t compileTarget)
{
} /* size: 0 */

// <06966D0A> vfx/vfx_common.cpp:1193
// variables: 2
// function call: 1
VfxCompileTarget_t VfxGetCompileTargetByName(const char* pName)
{
	{
		int i; // 1195
		{
			const VfxCompileTargetInfo_t& info; // 1197
			V_strcmp(const char* s1,
				const char* s2);  // 1198
		}
	}
} /* size: 0 */

// <06966A20> vfx/vfx_common.cpp:1210
// function calls: 10
void CVfxRule::Reset()
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1214
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1215
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1218
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1216
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1217
} /* size: 243, inline expansions: 10 (456 bytes) */

// <069668F2> vfx/vfx_common.cpp:1221
// function call: 1
void CVfxRule::IsTheSameAs(CVfxRule* pRule)
{
	V_strcmp(const char* s1,
		const char* s2);  // 1229
} /* size: 269, inline expansions: 1 (27 bytes) */

// <06966323> vfx/vfx_common.cpp:1239
// variables: 5
// function calls: 19
void CVfxRule::Serialize(CUtlBuffer& buf)
{
	{
		uint i; // 1244
		CUtlBuffer::IsText(); // 1253
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1256
		CUtlBuffer::WasLastCharacterCR(); // 1303
		{
			int i; // 1262
			CUtlMemory<unsigned char, int>::operator[](
					int i);  // 1166
			CUtlBuffer::PeekPut(
				int offset);  // 1210
			CUtlBuffer::PutTypeBin<char>(
					char src);  // 1204
			CUtlBuffer::PutTypeBin<char>(
					char src);  // 1264
		}
		CUtlBuffer::PutTabs(); // 1305
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1308
		CUtlBuffer::PutChar(
			char c);  // 1246
	}
	{
		uint i; // 1249
		CUtlBuffer::PutInt(
			int i);  // 1251
	}
	{
		uint i; // 1254
		CUtlBuffer::PutInt(
			int i);  // 1256
	}
	{
		uint i; // 1259
		CUtlBuffer::PutInt(
			int i);  // 1261
	}
	CUtlBuffer::PutInt(
		int i);  // 1241
	CUtlBuffer::PutInt(
		int i);  // 1242
} /* size: 424, inline expansions: 2 (22 bytes) */

// <06965944> vfx/vfx_common.cpp:1267
// variables: 6
// function calls: 33
void CVfxRule::Unserialize(CUtlBuffer& buf)
{
	{
		uint i; // 1275
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 690
		CUtlBuffer::BGetTypeBin<char>(
					char& dest);  // 672
		CUtlBuffer::BGetTypeBin<char>(
					char& dest);  // 1040
		CUtlBuffer::BGetChar(
			char* pOutChar);  // 937
		CUtlBuffer::GetChar(); // 1277
	}
	{
		uint i; // 1280
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 913
		StringToNumber<int>(char* pString,
					char** ppEnd,
					int nRadix);  // 915
		CUtlBuffer::BGetTypeText<int>(
					int& value,
					int nRadix);  // 929
		CUtlBuffer::BGetType<int>(
				int& dest);  // 926
		CUtlBuffer::IsText(); // 928
		CByteswap::IsSwappingBytes(); // 688
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 690
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<int>(int* output,
						int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<int>(
						int* outputBuffer,
						int* inputBuffer,
						int count);  // 170
		CByteswap::SwapBufferToTargetEndian<int>(
						int* outputBuffer,
						int* inputBuffer,
						int count);  // 694
		CUtlBuffer::BGetTypeBin<int>(
				int& dest);  // 672
		CUtlBuffer::BGetTypeBin<int>(
				int& dest);  // 930
		CUtlBuffer::BGetType<int>(
				int& dest);  // 1117
		CUtlBuffer::BGetInt(
			int* pOutInt);  // 965
		CUtlBuffer::GetInt(); // 1282
	}
	{
		uint i; // 1285
		CUtlBuffer::BGetInt(
			int* pOutInt);  // 965
		CUtlBuffer::GetInt(); // 1287
	}
	{
		uint i; // 1290
		CUtlBuffer::BGetInt(
			int* pOutInt);  // 965
		CUtlBuffer::GetInt(); // 1292
	}
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1270
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1273
} /* size: 560, inline expansions: 4 (54 bytes) */

// <0696558D> vfx/vfx_common.cpp:1301
// variable: 1
// function calls: 16
void CVfxCombo::Reset()
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1303
	CUtlStringToken::CUtlStringToken(); // 121
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1304
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1306
	{
		int i; // 1721
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Element(
			int i);  // 1723
		CUtlString::~CUtlString(); // 1526
		Destruct<CUtlString>(CUtlString* pMemory); // 1723
	}
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::RemoveAll(); // 1798
	CUtlMemory<CUtlString, int>::Purge(); // 903
	CUtlMemory<CUtlString, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CUtlString, int>::Purge(); // 1799
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Purge(); // 1315
} /* size: 282, inline expansions: 12 (408 bytes) */

// <06965495> vfx/vfx_common.cpp:1320
// function calls: 2
void CVfxCombo::IsTheSameAs(CVfxCombo* pCombo)
{
	V_strcmp(const char* s1,
		const char* s2);  // 1322
	V_strcmp(const char* s1,
		const char* s2);  // 1323
} /* size: 161, inline expansions: 2 (25 bytes) */

// <0697D1E6> vfx/vfx_common.cpp:1339
// function calls: 3
void CVfxCombo::IsTheSameAsWith00(CVfxCombo* pCombo)
{
	V_strcmp(const char* s1,
		const char* s2);  // 1341
	V_strcmp(const char* s1,
		const char* s2);  // 1342
	CVfxCombo::IsTheSameAsWith00(
				CVfxCombo* pCombo);  // 1339
} /* size: 182, inline expansions: 3 (112 bytes) */

// <0696546B> vfx/vfx_common.cpp:1339
void CVfxCombo::IsTheSameAsWith00(CVfxCombo* pCombo)
{
} /* size: 0 */

// <0696501B> vfx/vfx_common.cpp:1360
// variables: 2
// function calls: 14
void CVfxCombo::Serialize(CUtlBuffer& buf)
{
	{
		int stringId; // 1372
		{
			const CUtlString& str; // 1374
			V_strlen(const char* str); // 393
			CUtlString::Length(); // 1376
			CUtlString::Get(); // 99
			CUtlString::String(); // 1376
			CUtlMemory<CUtlString, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
					int i);  // 1374
		}
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Count(); // 1372
	}
	CUtlBuffer::PutInt(
		int i);  // 1364
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 1365
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 1366
	CUtlBuffer::PutInt(
		int i);  // 1367
	CUtlBuffer::PutInt(
		int i);  // 1368
	CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::Count(); // 1371
	CUtlBuffer::PutInt(
		int i);  // 1371
} /* size: 249, inline expansions: 7 (62 bytes) */

// <06964829> vfx/vfx_common.cpp:1386
// variables: 6
// function calls: 23
void CVfxCombo::Unserialize(CUtlBuffer& buf)
{
	uint nVal; // 1396
	const char   __FUNCTION__; // 62557
	int numStrings; // 1407
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1397
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1401
	}
	{
		int stringId; // 1409
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1411
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 1411
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1412
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 1412
	}
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1389
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1394
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1396
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1400
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1404
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1405
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1407
} /* size: 0, variables: 3, inline expansions: 15 (327 bytes) */

// <016014AB> vfx/vfx_common.cpp:1386
// variables: 6
// function calls: 23
void CVfxCombo::Unserialize(CUtlBuffer& buf)
{
	uint nVal; // 1396
	const char   __FUNCTION__; // 42898
	int numStrings; // 1407
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1397
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1401
	}
	{
		int stringId; // 1409
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1411
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 1411
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1412
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 1412
	}
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1389
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1394
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1396
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1400
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1404
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1405
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1407
} /* size: 0, variables: 3, inline expansions: 15 (0 bytes) */

// <004CBD48> vfx/vfx_common.cpp:1386
// variables: 6
// function calls: 23
void CVfxCombo::Unserialize(CUtlBuffer& buf)
{
	uint nVal; // 1396
	const char   __FUNCTION__; // 43404
	int numStrings; // 1407
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1397
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1401
	}
	{
		int stringId; // 1409
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1411
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 1411
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1412
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 1412
	}
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1389
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1394
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1396
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1400
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1404
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1405
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1407
} /* size: 0, variables: 3, inline expansions: 15 (0 bytes) */

// <0082015A> vfx/vfx_common.cpp:1386
// variables: 6
// function calls: 23
void CVfxCombo::Unserialize(CUtlBuffer& buf)
{
	uint nVal; // 1396
	const char   __FUNCTION__; // 21875
	int numStrings; // 1407
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1397
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1401
	}
	{
		int stringId; // 1409
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1411
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 624
		CUtlBuffer::PeekGet(
			int offset);  // 1411
		CUtlMemory<CUtlString, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CUtlString, CUtlMemory<CUtlString, int> >::operator[](
				int i);  // 1412
		V_strlen(const char* str); // 393
		CUtlString::Length(); // 1412
	}
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 1389
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1394
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1396
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1400
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1404
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1405
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1407
} /* size: 0, variables: 3, inline expansions: 15 (327 bytes) */

// <069643A9> vfx/vfx_common.cpp:1418
// variables: 2
// function calls: 8
void CVfxCombo::ScanRange(const char* pString, const char* pDesc, const char* pFileName)
{
	int nIntMin; // 1420
	int nIntMax; // 1420
	Color::SetColor(
		int _r,
		int _g,
		int _b,
		int _a);  // 50
	Color::Color(
		int _r,
		int _g,
		int _b,
		int _a);  // 1424
	Color::SetColor(
		int _r,
		int _g,
		int _b,
		int _a);  // 50
	Color::Color(
		int _r,
		int _g,
		int _b,
		int _a);  // 1439
	Color::SetColor(
		int _r,
		int _g,
		int _b,
		int _a);  // 50
	Color::Color(
		int _r,
		int _g,
		int _b,
		int _a);  // 1432
	Color::SetColor(
		int _r,
		int _g,
		int _b,
		int _a);  // 50
	Color::Color(
		int _r,
		int _g,
		int _b,
		int _a);  // 1448
} /* size: 420, variables: 2, inline expansions: 8 (0 bytes) */

// <06964171> vfx/vfx_common.cpp:1461
// function calls: 7
void CVfxVariableDescription::CVfxVariableDescription(const CVfxVariableDescription& other)
{
	CUtlStringToken::CUtlStringToken(); // 1461
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 1481
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 79
	V_memcpy(void* dest,
		const void* src,
		uint count);  // 1485
	CVfxVariableDescription::operator=(
			const CVfxVariableDescription& other);  // 1477
	CVfxVariableDescription::operator=(
			const CVfxVariableDescription& other);  // 1463
} /* size: 129, inline expansions: 7 (231 bytes) */

// <06964147> vfx/vfx_common.cpp:1461
void CVfxVariableDescription::CVfxVariableDescription(const CVfxVariableDescription& other)
{
} /* size: 0 */

// <06964104> vfx/vfx_common.cpp:1467
void CVfxVariableDescription::~CVfxVariableDescription()
{
} /* size: 25 */

// <0697D304> vfx/vfx_common.cpp:1477
// function calls: 5
void CVfxVariableDescription::operator=(const CVfxVariableDescription& other)
{
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 1481
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 79
	V_memcpy(void* dest,
		const void* src,
		uint count);  // 1485
	CVfxVariableDescription::operator=(
			const CVfxVariableDescription& other);  // 1477
} /* size: 107, inline expansions: 5 (114 bytes) */

// <069640BD> vfx/vfx_common.cpp:1477
void CVfxVariableDescription::operator=(const CVfxVariableDescription& other)
{
} /* size: 0 */

// <06963C01> vfx/vfx_common.cpp:1493
// function calls: 15
void CVfxVariableDescription::Reset()
{
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1495
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 583
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 584
	CVfxVariableDescription::SetAttributeName(
			const char* pAttributeName);  // 1501
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1497
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1518
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1534
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1535
} /* size: 0, inline expansions: 15 (629 bytes) */

// <06963A33> vfx/vfx_common.cpp:1539
// function calls: 4
void CVfxVariableDescription::SetCompiledExpression(const void* pExpressionBuffer, uint32 nBufferSize)
{
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 79
	V_memcpy(void* dest,
		const void* src,
		uint count);  // 1556
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 79
	V_memcpy(void* dest,
		const void* src,
		uint count);  // 1544
} /* size: 0, inline expansions: 4 (0 bytes) */

// <0697D4EC> vfx/vfx_common.cpp:1561
void CVfxVariableDescription::IsTexture()
{
} /* size: 0 */

// <069639E2> vfx/vfx_common.cpp:1579
void CVfxVariableDescription::IsUAV()
{
} /* size: 0 */

// <069636E1> vfx/vfx_common.cpp:1585
// function calls: 5
void CVfxVariableDescription::IsTheSameAs(const CVfxVariableDescription* pVariable)
{
	V_strcmp(const char* s1,
		const char* s2);  // 1588
	V_strcmp(const char* s1,
		const char* s2);  // 1589
	V_strcmp(const char* s1,
		const char* s2);  // 1598
	V_strcmp(const char* s1,
		const char* s2);  // 1610
	V_strcmp(const char* s1,
		const char* s2);  // 1611
} /* size: 693, inline expansions: 5 (85 bytes) */

// <0697D517> vfx/vfx_common.cpp:1625
// function call: 1
void CVfxVariableDescription::HasReferences()
{
	VfxVariableUsesTextureReference(int nVarType); // 1627
} /* size: 36, inline expansions: 1 (9 bytes) */

// <069636C4> vfx/vfx_common.cpp:1625
void CVfxVariableDescription::HasReferences()
{
} /* size: 0 */

// <0697D567> vfx/vfx_common.cpp:1631
void CVfxVariableDescription::CanBeInStaticConstantBuffer()
{
} /* size: 0 */

// <0697D592> vfx/vfx_common.cpp:1638
void CVfxVariableDescription::IsShaderConstant()
{
} /* size: 20 */

// <06963656> vfx/vfx_common.cpp:1644
void CVfxVariableDescription::IsRenderState()
{
} /* size: 0 */

// <0697D5BD> vfx/vfx_common.cpp:1650
// variable: 1
// function calls: 8
void CVfxVariableDescription::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap, const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap)
{
	VfxVariableUsesTextureReference(int nVarType); // 1653
	CUtlMemory<int, int>::operator[](
			int i);  // 595
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 1655
	CUtlMemory<int, int>::operator[](
			int i);  // 595
	CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
			int i);  // 1662
	{
		uint32 i; // 1665
		{
		}
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 1668
	}
	CVfxVariableDescription::RemapVariableIndices(
				const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap,
				const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap);  // 1650
} /* size: 0, inline expansions: 6 (169 bytes) */

// <069635EE> vfx/vfx_common.cpp:1650
// variables: 3
void CVfxVariableDescription::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap, const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap)
{
	const char   __FUNCTION__; // 62795
	{
		uint32 i; // 1665
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1667
		}
	}
} /* size: 0, variables: 1 */

// <01600270> vfx/vfx_common.cpp:1650
// variables: 3
void CVfxVariableDescription::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap, const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap)
{
	const char   __FUNCTION__; // 43136
	{
		uint32 i; // 1665
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1667
		}
	}
} /* size: 0, variables: 1 */

// <004CAB0D> vfx/vfx_common.cpp:1650
// variables: 3
void CVfxVariableDescription::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap, const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap)
{
	const char   __FUNCTION__; // 43642
	{
		uint32 i; // 1665
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1667
		}
	}
} /* size: 0, variables: 1 */

// <0081EF1F> vfx/vfx_common.cpp:1650
// variables: 3
void CVfxVariableDescription::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap, const CUtlVector<int, CUtlMemory<int, int> >& texProcessingIndexRemap)
{
	const char   __FUNCTION__; // 22113
	{
		uint32 i; // 1665
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 1667
		}
	}
} /* size: 0, variables: 1 */

// <069625AF> vfx/vfx_common.cpp:1674
// function calls: 45
void CVfxVariableDescription::Serialize(CUtlBuffer& buf, bool bSerializeForShaderCache)
{
	CUtlBuffer::PutInt(
		int i);  // 1679
	CUtlBuffer::PutFloat(
		float f);  // 1680
	CUtlBuffer::PutInt(
		int i);  // 1683
	VfxVariableIsUsingExpression(int nVarType); // 1684
	CUtlBuffer::PutInt(
		int i);  // 1689
	CUtlBuffer::PutInt(
		int i);  // 1690
	CUtlBuffer::PutInt(
		int i);  // 1691
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 1692
	CUtlBuffer::PutInt(
		int i);  // 1703
	CUtlBuffer::PutInt(
		int i);  // 1704
	CUtlBuffer::PutInt(
		int i);  // 1708
	CUtlBuffer::PutInt(
		int i);  // 1709
	CUtlBuffer::PutInt(
		int i);  // 1710
	CUtlBuffer::PutInt(
		int i);  // 1711
	CUtlBuffer::PutInt(
		int i);  // 1713
	CUtlBuffer::PutInt(
		int i);  // 1714
	CUtlBuffer::PutInt(
		int i);  // 1715
	CUtlBuffer::PutInt(
		int i);  // 1716
	CUtlBuffer::PutInt(
		int i);  // 1718
	CUtlBuffer::PutInt(
		int i);  // 1719
	CUtlBuffer::PutInt(
		int i);  // 1720
	CUtlBuffer::PutInt(
		int i);  // 1721
	CUtlBuffer::PutFloat(
		float f);  // 1723
	CUtlBuffer::PutFloat(
		float f);  // 1724
	CUtlBuffer::PutFloat(
		float f);  // 1725
	CUtlBuffer::PutFloat(
		float f);  // 1726
	CUtlBuffer::PutFloat(
		float f);  // 1728
	CUtlBuffer::PutFloat(
		float f);  // 1729
	CUtlBuffer::PutFloat(
		float f);  // 1730
	CUtlBuffer::PutFloat(
		float f);  // 1731
	CUtlBuffer::PutFloat(
		float f);  // 1733
	CUtlBuffer::PutFloat(
		float f);  // 1734
	CUtlBuffer::PutFloat(
		float f);  // 1735
	CUtlBuffer::PutFloat(
		float f);  // 1736
	CUtlBuffer::PutInt(
		int i);  // 1738
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 1739
	CUtlBuffer::PutInt(
		int i);  // 1741
	CUtlBuffer::PutInt(
		int i);  // 1742
	CUtlBuffer::PutInt(
		int i);  // 1743
	CUtlBuffer::PutInt(
		int i);  // 1744
	CUtlBuffer::PutInt(
		int i);  // 1746
	CUtlBuffer::PutInt(
		int i);  // 1747
	CUtlBuffer::PutInt(
		int i);  // 1699
	CUtlBuffer::PutInt(
		int i);  // 1700
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 1686
} /* size: 872, inline expansions: 45 (644 bytes) */

// <06960B94> vfx/vfx_common.cpp:1752
// variable: 1
// function calls: 94
void CVfxVariableDescription::Unserialize(CUtlBuffer& buf, bool bSerializeForShaderCache)
{
	char attributeName; // 1760
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1757
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1758
	V_strncpy<long unsigned int>(char* pDest,
					const char* pSrc,
					long unsigned int maxLenInChars);  // 583
	CUtlStringToken::CUtlStringToken(); // 121
	{
	}
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 119
	MakeStringToken(const char* pString,
			bool bWriteToDatabase);  // 584
	CVfxVariableDescription::SetAttributeName(
			const char* pAttributeName);  // 1762
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1764
	VfxVariableIsUsingExpression(int nVarType); // 1765
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1780
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1781
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1782
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1783
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1799
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1800
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1804
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1805
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1806
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1807
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1809
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1810
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1811
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1812
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1814
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1815
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1816
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1817
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1819
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1820
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1821
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1822
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1824
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1825
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1826
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1827
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1829
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1830
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1831
	CUtlBuffer::BGetFloat(
			float* pOutFloat);  // 1000
	CUtlBuffer::GetFloat(); // 1832
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1835
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1837
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1839
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1840
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1841
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1842
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1845
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1847
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1790
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1791
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 1767
} /* size: 0, variables: 1, inline expansions: 94 (2001 bytes) */

// <0697D828> vfx/vfx_common.cpp:1854
// variable: 1
// function calls: 2
void CVfxTextureChannelProcessor::Reset()
{
	{
		int i; // 1857
	}
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 1862
} /* size: 0, inline expansions: 2 (0 bytes) */

// <06960B6A> vfx/vfx_common.cpp:1854
// variable: 1
void CVfxTextureChannelProcessor::Reset()
{
	{
		int i; // 1857
	}
} /* size: 0 */

// <06960ACA> vfx/vfx_common.cpp:1866
// function call: 1
void CVfxTextureChannelProcessor::IsTheSameAs(const CVfxTextureChannelProcessor* pChannelProcessor)
{
	V_strcmp(const char* s1,
		const char* s2);  // 1871
} /* size: 83, inline expansions: 1 (16 bytes) */

// <0697D8E0> vfx/vfx_common.cpp:1882
// variable: 1
// function calls: 2
void CVfxTextureChannelProcessor::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap)
{
	{
		int i; // 1884
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 1888
	}
} /* size: 39 */

// <06960A93> vfx/vfx_common.cpp:1882
// variable: 1
void CVfxTextureChannelProcessor::RemapVariableIndices(const CUtlVector<int, CUtlMemory<int, int> >& variableIndexRemap)
{
	{
		int i; // 1884
	}
} /* size: 0 */

// <0695FBEE> vfx/vfx_common.cpp:1894
// variables: 5
// function calls: 58
void CVfxTextureChannelProcessor::Serialize(CUtlBuffer& buf)
{
	{
		int i; // 1900
		CUtlBuffer::PutInt(
			int i);  // 1902
	}
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 1896
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 1897
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 1898
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 1899
	CUtlBuffer::PutInt(
		int i);  // 1904
} /* size: 976, inline expansions: 41 (1886 bytes) */

// <0695F41C> vfx/vfx_common.cpp:1909
// variable: 1
// function calls: 28
void CVfxTextureChannelProcessor::Unserialize(CUtlBuffer& buf)
{
	{
		int i; // 1915
		CUtlBuffer::BGetInt(
			int* pOutInt);  // 965
		CUtlBuffer::GetInt(); // 1917
	}
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 690
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 672
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 1040
	CUtlBuffer::BGetChar(
		char* pOutChar);  // 937
	CUtlBuffer::GetChar(); // 1911
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 690
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 672
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 1040
	CUtlBuffer::BGetChar(
		char* pOutChar);  // 937
	CUtlBuffer::GetChar(); // 1912
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 690
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 672
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 1040
	CUtlBuffer::BGetChar(
		char* pOutChar);  // 937
	CUtlBuffer::GetChar(); // 1913
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 690
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 672
	CUtlBuffer::BGetTypeBin<char>(
				char& dest);  // 1040
	CUtlBuffer::BGetChar(
		char* pOutChar);  // 937
	CUtlBuffer::GetChar(); // 1914
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1919
} /* size: 376, inline expansions: 26 (858 bytes) */

// <0697D9B7> vfx/vfx_common.cpp:1926
// function calls: 4
void CVfxVariableIndexArray::Reset()
{
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 191
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 194
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Purge(); // 1928
} /* size: 0, inline expansions: 4 (0 bytes) */

// <0695F3FF> vfx/vfx_common.cpp:1926
void CVfxVariableIndexArray::Reset()
{
} /* size: 0 */

// <0695E364> vfx/vfx_common.cpp:1933
// variables: 8
// function calls: 63
void CVfxVariableIndexArray::Serialize(CUtlBuffer& buf, bool bSerializeRegisterOffsets)
{
	{
		int i; // 1941
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1941
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 1945
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 1944
		CUtlBuffer::IsText(); // 1238
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 1944
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 1945
	}
	{
		int i; // 1950
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1950
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 1953
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
		Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
			int i);  // 442
		operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 1953
	}
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1935
	CUtlBuffer::PutInt(
		int i);  // 1935
	CUtlBuffer::PutInt(
		int i);  // 1936
	CUtlBuffer::PutInt(
		int i);  // 1937
} /* size: 0, inline expansions: 4 (26 bytes) */

// <0695D9C9> vfx/vfx_common.cpp:1958
// variables: 5
// function calls: 42
void CVfxVariableIndexArray::Unserialize(CUtlBuffer& buf, bool bUnserializeRegisterOffsets)
{
	int nArraySize; // 1960
	{
		int i; // 1967
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1967
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
			int i);  // 438
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
				int i);  // 1969
		CUtlBuffer::BGetShort(
				short int* pOutShort);  // 951
		CUtlBuffer::GetShort(); // 1970
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
			int i);  // 438
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
				int i);  // 1970
		CUtlBuffer::BGetShort(
				short int* pOutShort);  // 951
		CUtlBuffer::GetShort(); // 1969
	}
	{
		int i; // 1975
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1975
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
			int i);  // 438
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
				int i);  // 1977
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
			int i);  // 438
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
				int i);  // 1978
		CUtlBuffer::BGetShort(
				short int* pOutShort);  // 951
		CUtlBuffer::GetShort(); // 1977
	}
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1960
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1961
	CUtlBuffer::BGetInt(
		int* pOutInt);  // 965
	CUtlBuffer::GetInt(); // 1962
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 516
	CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
		int nCount);  // 1963
} /* size: 695, variables: 1, inline expansions: 8 (609 bytes) */

// <0695D328> vfx/vfx_common.cpp:1983
// variables: 3
// function calls: 23
void CVfxVariableIndexRefArray::Set(VfxVariableIndexDataArray_t& dataArray, const CVfxVariableIndexArray& source)
{
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1985
	Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 1988
	AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 1989
	{
		int* _pCrash; // 675
	}
	LeafCodeInfo_t::LeafCodeInfo_t(
			const char* szFile,
			int nLine,
			const char* szFunction);  // 675
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 516
	CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
		int nCount);  // 679
	CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddMultipleToTail(
				int nSize);  // 691
	AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 692
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 85
	V_memcpy(void* dest,
		const void* src,
		ptrdiff_t count);  // 180
	UtlTraitsCopyRange<VfxVariableIndexData_t>(const VfxVariableIndexData_t* pFrom,
							const VfxVariableIndexData_t* pFromEnd,
							VfxVariableIndexData_t* pTo);  // 173
	UtlTraitsCopyRange<VfxVariableIndexData_t>(const VfxVariableIndexData_t* pFrom,
							const VfxVariableIndexData_t* pFromEnd,
							VfxVariableIndexData_t* pTo);  // 693
	CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddMultipleToTail(
				int nSize,
				const ElemType_t* pArray);  // 683
	CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddMultipleToTail(
				int nSize,
				const ElemType_t* pArray);  // 1989
} /* size: 762, inline expansions: 17 (2660 bytes) */

// <0695CD11> vfx/vfx_common.cpp:2005
// function calls: 22
CBufferString GetShaderFullPath(const char* pShaderFile)
{
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 771
	CBufferString::Get(); // 81
	CFmtStrN<256>::String(); // 2011
	CBufferString::~CBufferString(); // 587
	CBufferStringN<256>::~CBufferStringN(); // 41
	CFmtStrN<256>::~CFmtStrN(); // 2011
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 717
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 718
	CBufferString::CBufferString(
			const char* pString,
			int nChars,
			bool bExact,
			bool bGrowable);  // 2015
	CBufferString::ReadBuffer(); // 1374
	CBufferString::ReadBuffer(); // 771
	CBufferString::Get(); // 81
	CFmtStrN<256>::String(); // 2012
	CBufferString::InitMinConstruct(
			bool bGrowable);  // 717
	CBufferString::RemoveAll(); // 901
	CBufferString::Set(
		const char* pString,
		int nChars,
		bool bExact);  // 718
	CBufferString::CBufferString(
			const char* pString,
			int nChars,
			bool bExact,
			bool bGrowable);  // 2012
	CBufferString::~CBufferString(); // 587
	CBufferStringN<256>::~CBufferStringN(); // 41
	CFmtStrN<256>::~CFmtStrN(); // 2012
} /* size: 414, inline expansions: 22 (568 bytes) */

// <0695CBB1> vfx/vfx_common.cpp:2021
// variables: 10
bool VfxPopulateStaticComboDataCacheFromVcs(CVfx* pVfx, CVfxStaticComboData* pStaticComboData, VfxProgram_t programType, uint64 nStaticComboId, IRuntimeShaderCreateCallbacks* pRuntimeCallbacks, ICompiletimeShaderCreateCallbacks* pCompiletimeCallbacks)
{
	const char   __FUNCTION__; // 63256
	const CVfxStaticComboVcsEntry* pStaticComboVcsDictEntry; // 2027
	int nOffset; // 2033
	CUtlStreamBuffer buf; // 2034
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2024
	}
	{
		shared_ptr<CVfxStaticComboData::DecompressedComboData_t> pDecompressed; // 2039
	}
	{
		const CVfxProgramData& programData; // 2051
		const CUtlVector<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >& attributes; // 2052
		{
			int i; // 2053
			{
				const CVfxShaderAttribute& attr; // 2055
			}
		}
	}
} /* size: 0, variables: 4 */

// <015F9833> vfx/vfx_common.cpp:2021
// variables: 10
bool VfxPopulateStaticComboDataCacheFromVcs(CVfx* pVfx, CVfxStaticComboData* pStaticComboData, VfxProgram_t programType, uint64 nStaticComboId, IRuntimeShaderCreateCallbacks* pRuntimeCallbacks, ICompiletimeShaderCreateCallbacks* pCompiletimeCallbacks)
{
	const char   __FUNCTION__; // 43597
	const CVfxStaticComboVcsEntry* pStaticComboVcsDictEntry; // 2027
	int nOffset; // 2033
	CUtlStreamBuffer buf; // 2034
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2024
	}
	{
		shared_ptr<CVfxStaticComboData::DecompressedComboData_t> pDecompressed; // 2039
	}
	{
		const CVfxProgramData& programData; // 2051
		const CUtlVector<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >& attributes; // 2052
		{
			int i; // 2053
			{
				const CVfxShaderAttribute& attr; // 2055
			}
		}
	}
} /* size: 0, variables: 4 */

// <004C40D0> vfx/vfx_common.cpp:2021
// variables: 10
bool VfxPopulateStaticComboDataCacheFromVcs(CVfx* pVfx, CVfxStaticComboData* pStaticComboData, VfxProgram_t programType, uint64 nStaticComboId, IRuntimeShaderCreateCallbacks* pRuntimeCallbacks, ICompiletimeShaderCreateCallbacks* pCompiletimeCallbacks)
{
	const char   __FUNCTION__; // 44103
	const CVfxStaticComboVcsEntry* pStaticComboVcsDictEntry; // 2027
	int nOffset; // 2033
	CUtlStreamBuffer buf; // 2034
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2024
	}
	{
		shared_ptr<CVfxStaticComboData::DecompressedComboData_t> pDecompressed; // 2039
	}
	{
		const CVfxProgramData& programData; // 2051
		const CUtlVector<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >& attributes; // 2052
		{
			int i; // 2053
			{
				const CVfxShaderAttribute& attr; // 2055
			}
		}
	}
} /* size: 0, variables: 4 */

// <008184E2> vfx/vfx_common.cpp:2021
// variables: 10
bool VfxPopulateStaticComboDataCacheFromVcs(CVfx* pVfx, CVfxStaticComboData* pStaticComboData, VfxProgram_t programType, uint64 nStaticComboId, IRuntimeShaderCreateCallbacks* pRuntimeCallbacks, ICompiletimeShaderCreateCallbacks* pCompiletimeCallbacks)
{
	const char   __FUNCTION__; // 22574
	const CVfxStaticComboVcsEntry* pStaticComboVcsDictEntry; // 2027
	int nOffset; // 2033
	CUtlStreamBuffer buf; // 2034
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2024
	}
	{
		shared_ptr<CVfxStaticComboData::DecompressedComboData_t> pDecompressed; // 2039
	}
	{
		const CVfxProgramData& programData; // 2051
		const CUtlVector<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >& attributes; // 2052
		{
			int i; // 2053
			{
				const CVfxShaderAttribute& attr; // 2055
			}
		}
	}
} /* size: 0, variables: 4 */

// <0695B91E> vfx/vfx_common.cpp:2072
// variables: 2
// function calls: 100
void CVfxStaticComboData::Reset()
{
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 2077
	{
		int i; // 1721
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Element(
			int i);  // 1723
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 191
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 194
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Purge(); // 55
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::~CUtlLeanVectorFixedGrowableBase(); // 399
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::~CUtlLeanVectorImpl(); // 796
		CUtlLeanVectorFixedGrowable<VfxVariableIndexData_t, 2, int>::~CUtlLeanVectorFixedGrowable(); // 635
		CVfxVariableIndexArray::~CVfxVariableIndexArray(); // 1526
		Destruct<CVfxVariableIndexArray>(CVfxVariableIndexArray* pMemory); // 1723
	}
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::RemoveAll(); // 1798
	CUtlMemory<CVfxVariableIndexArray, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CVfxVariableIndexArray, int>::Purge(); // 903
	CUtlMemory<CVfxVariableIndexArray, int>::Purge(); // 1799
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Purge(); // 2078
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 191
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 194
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Purge(); // 2079
	CUtlMemory<CVfxVariableIndexRefArray, int>::Purge(); // 903
	CUtlMemory<CVfxVariableIndexRefArray, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CVfxVariableIndexRefArray, int>::Purge(); // 1799
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::RemoveAll(); // 1798
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Purge(); // 2080
	CUtlMemory<ConstantBufferBindInfo_t, int>::IsExternallyAllocated(); // 905
	CUtlMemory<ConstantBufferBindInfo_t, int>::Purge(); // 903
	CUtlMemory<ConstantBufferBindInfo_t, int>::Purge(); // 1799
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::RemoveAll(); // 1798
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Purge(); // 2081
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 191
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 194
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Purge(); // 1928
	CVfxVariableIndexArray::Reset(); // 2082
	CUtlMemory<RsRasterizerStateHandle_t__::Purge(); // 903
	CUtlMemory<RsRasterizerStateHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<RsRasterizerStateHandle_t__::Purge(); // 1799
	CUtlVectorBase<RsRasterizerStateHandle_t__::RemoveAll(); // 1798
	CUtlVectorBase<RsRasterizerStateHandle_t__::ResetDbgInfo(); // 1800
	CUtlVectorBase<RsRasterizerStateHandle_t__::Purge(); // 2085
	CUtlMemory<RsDepthStencilStateHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<RsDepthStencilStateHandle_t__::Purge(); // 903
	CUtlMemory<RsDepthStencilStateHandle_t__::Purge(); // 1799
	CUtlVectorBase<RsDepthStencilStateHandle_t__::RemoveAll(); // 1798
	CUtlVectorBase<RsDepthStencilStateHandle_t__::ResetDbgInfo(); // 1800
	CUtlVectorBase<RsDepthStencilStateHandle_t__::Purge(); // 2086
	CUtlMemory<RsBlendStateHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<RsBlendStateHandle_t__::Purge(); // 903
	CUtlMemory<RsBlendStateHandle_t__::Purge(); // 1799
	CUtlVectorBase<RsBlendStateHandle_t__::RemoveAll(); // 1798
	CUtlVectorBase<RsBlendStateHandle_t__::ResetDbgInfo(); // 1800
	CUtlVectorBase<RsBlendStateHandle_t__::Purge(); // 2087
	CUtlMemory<unsigned int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned int, int>::Purge(); // 903
	CUtlMemory<unsigned int, int>::Purge(); // 1799
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::RemoveAll(); // 1798
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Purge(); // 2088
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 1799
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::RemoveAll(); // 1798
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::Purge(); // 2089
	CUtlMemory<int, int>::IsExternallyAllocated(); // 905
	CUtlMemory<int, int>::Purge(); // 903
	CUtlMemory<int, int>::Purge(); // 1799
	CUtlVectorBase<int, CUtlMemory<int, int> >::RemoveAll(); // 1798
	CUtlVectorBase<int, CUtlMemory<int, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<int, CUtlMemory<int, int> >::Purge(); // 2090
	CUtlMemory<RenderShaderHandle_t__::IsExternallyAllocated(); // 905
	CUtlMemory<RenderShaderHandle_t__::Purge(); // 903
	CUtlMemory<RenderShaderHandle_t__::Purge(); // 1799
	CUtlVectorBase<RenderShaderHandle_t__::RemoveAll(); // 1798
	CUtlVectorBase<RenderShaderHandle_t__::ResetDbgInfo(); // 1800
	CUtlVectorBase<RenderShaderHandle_t__::Purge(); // 2091
	{
		int i; // 1721
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 602
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Element(
			int i);  // 1723
		CVfxShaderAttribute::FreeExpressionBuffer(); // 753
		CVfxShaderAttribute::FreeExpressionBuffer(); // 691
		CVfxShaderAttribute::~CVfxShaderAttribute(); // 1526
		Destruct<CVfxShaderAttribute>(CVfxShaderAttribute* pMemory); // 1723
	}
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::RemoveAll(); // 1798
	CUtlMemory<CVfxShaderAttribute, int>::Purge(); // 903
	CUtlMemory<CVfxShaderAttribute, int>::IsExternallyAllocated(); // 905
	CUtlMemory<CVfxShaderAttribute, int>::Purge(); // 1799
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::ResetDbgInfo(); // 1800
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Purge(); // 2092
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 2093
} /* size: 1172, inline expansions: 83 (2621 bytes) */

// <06959BF8> vfx/vfx_common.cpp:2097
// variables: 15
// function calls: 122
void CVfxStaticComboData::Append(const CVfxStaticComboData& src, const CUtlVector<int, CUtlMemory<int, int> >& variableRemap, const CUtlVector<int, CUtlMemory<int, int> >& vsInputSignatureIndexRemap, const CVfxProgramData& programData, VfxProgram_t programType)
{
	const char   __FUNCTION__; // 62422
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2100
	}
	{
		int i; // 2103
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2106
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2110
		}
		{
			int j; // 2112
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2112
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2112
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2114
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2114
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2116
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2116
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2103
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2108
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2108
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2111
		{
			ElemType_t* pNew; // 168
			ElemType_t* pBase; // 169
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 85
			V_memcpy(void* dest,
				const void* src,
				ptrdiff_t count);  // 91
			UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
										VfxVariableIndexData_t* pFromEnd,
										VfxVariableIndexData_t* pTo);  // 170
		}
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
				int nCapacity,
				bool bConservative);  // 516
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
			int nCount);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2118
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2110
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2110
	}
	{
		int i; // 2124
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2124
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2126
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2126
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2131
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2131
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2134
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2135
	}
	{
		int nOldSize; // 2141
		{
			int i; // 2143
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2143
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2145
		}
		{
			int i; // 2148
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2148
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2150
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
		}
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2141
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2142
	}
	{
		int i; // 2162
		{
			CVfxShaderAttribute attr; // 2164
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2167
			CVfxShaderAttribute::FreeExpressionBuffer(); // 753
			CVfxShaderAttribute::FreeExpressionBuffer(); // 691
			CVfxShaderAttribute::~CVfxShaderAttribute(); // 2170
			CUtlMemory<CVfxShaderAttribute, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
					int i);  // 2164
			CUtlStringToken::CUtlStringToken(); // 685
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 764
			{
				byte* pTmp; // 767
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 768
			}
			CVfxShaderAttribute::InitFrom(
				const CVfxShaderAttribute& other);  // 686
			CVfxShaderAttribute::CVfxShaderAttribute(
						const CVfxShaderAttribute& other);  // 2164
		}
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2162
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2100
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2102
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2123
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 2158
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 2173
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <015F687A> vfx/vfx_common.cpp:2097
// variables: 15
// function calls: 122
void CVfxStaticComboData::Append(const CVfxStaticComboData& src, const CUtlVector<int, CUtlMemory<int, int> >& variableRemap, const CUtlVector<int, CUtlMemory<int, int> >& vsInputSignatureIndexRemap, const CVfxProgramData& programData, VfxProgram_t programType)
{
	const char   __FUNCTION__; // 42763
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2100
	}
	{
		int i; // 2103
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2106
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2110
		}
		{
			int j; // 2112
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2112
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2112
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2114
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2114
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2116
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2116
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2103
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2108
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2108
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2111
		{
			ElemType_t* pNew; // 168
			ElemType_t* pBase; // 169
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 85
			V_memcpy(void* dest,
				const void* src,
				ptrdiff_t count);  // 91
			UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
										VfxVariableIndexData_t* pFromEnd,
										VfxVariableIndexData_t* pTo);  // 170
		}
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
				int nCapacity,
				bool bConservative);  // 516
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
			int nCount);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2118
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2110
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2110
	}
	{
		int i; // 2124
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2124
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2126
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2126
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2131
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2131
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2134
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2135
	}
	{
		int nOldSize; // 2141
		{
			int i; // 2143
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2143
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2145
		}
		{
			int i; // 2148
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2148
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2150
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
		}
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2141
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2142
	}
	{
		int i; // 2162
		{
			CVfxShaderAttribute attr; // 2164
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2167
			CVfxShaderAttribute::FreeExpressionBuffer(); // 753
			CVfxShaderAttribute::FreeExpressionBuffer(); // 691
			CVfxShaderAttribute::~CVfxShaderAttribute(); // 2170
			CUtlMemory<CVfxShaderAttribute, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
					int i);  // 2164
			CUtlStringToken::CUtlStringToken(); // 685
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 764
			{
				byte* pTmp; // 767
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 768
			}
			CVfxShaderAttribute::InitFrom(
				const CVfxShaderAttribute& other);  // 686
			CVfxShaderAttribute::CVfxShaderAttribute(
						const CVfxShaderAttribute& other);  // 2164
		}
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2162
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2100
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2102
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2123
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 2158
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 2173
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <004C1117> vfx/vfx_common.cpp:2097
// variables: 15
// function calls: 122
void CVfxStaticComboData::Append(const CVfxStaticComboData& src, const CUtlVector<int, CUtlMemory<int, int> >& variableRemap, const CUtlVector<int, CUtlMemory<int, int> >& vsInputSignatureIndexRemap, const CVfxProgramData& programData, VfxProgram_t programType)
{
	const char   __FUNCTION__; // 43269
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2100
	}
	{
		int i; // 2103
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2106
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2110
		}
		{
			int j; // 2112
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2112
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2112
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2114
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2114
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2116
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2116
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2103
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2108
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2108
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2111
		{
			ElemType_t* pNew; // 168
			ElemType_t* pBase; // 169
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 85
			V_memcpy(void* dest,
				const void* src,
				ptrdiff_t count);  // 91
			UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
										VfxVariableIndexData_t* pFromEnd,
										VfxVariableIndexData_t* pTo);  // 170
		}
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
				int nCapacity,
				bool bConservative);  // 516
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
			int nCount);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2118
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2110
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2110
	}
	{
		int i; // 2124
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2124
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2126
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2126
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2131
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2131
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2134
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2135
	}
	{
		int nOldSize; // 2141
		{
			int i; // 2143
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2143
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2145
		}
		{
			int i; // 2148
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2148
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2150
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
		}
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2141
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2142
	}
	{
		int i; // 2162
		{
			CVfxShaderAttribute attr; // 2164
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2167
			CVfxShaderAttribute::FreeExpressionBuffer(); // 753
			CVfxShaderAttribute::FreeExpressionBuffer(); // 691
			CVfxShaderAttribute::~CVfxShaderAttribute(); // 2170
			CUtlMemory<CVfxShaderAttribute, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
					int i);  // 2164
			CUtlStringToken::CUtlStringToken(); // 685
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 764
			{
				byte* pTmp; // 767
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 768
			}
			CVfxShaderAttribute::InitFrom(
				const CVfxShaderAttribute& other);  // 686
			CVfxShaderAttribute::CVfxShaderAttribute(
						const CVfxShaderAttribute& other);  // 2164
		}
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2162
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2100
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2102
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2123
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 2158
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 2173
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <00815529> vfx/vfx_common.cpp:2097
// variables: 15
// function calls: 122
void CVfxStaticComboData::Append(const CVfxStaticComboData& src, const CUtlVector<int, CUtlMemory<int, int> >& variableRemap, const CUtlVector<int, CUtlMemory<int, int> >& vsInputSignatureIndexRemap, const CVfxProgramData& programData, VfxProgram_t programType)
{
	const char   __FUNCTION__; // 21740
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2100
	}
	{
		int i; // 2103
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2106
		}
		{
			const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2110
		}
		{
			int j; // 2112
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2112
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2112
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2114
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2114
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2114
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2115
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2115
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
			Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
				int i);  // 442
			operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
					int i);  // 2116
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2116
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2116
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2103
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2106
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2106
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2108
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2108
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2111
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2111
		{
			ElemType_t* pNew; // 168
			ElemType_t* pBase; // 169
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 85
			V_memcpy(void* dest,
				const void* src,
				ptrdiff_t count);  // 91
			UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
										VfxVariableIndexData_t* pFromEnd,
										VfxVariableIndexData_t* pTo);  // 170
		}
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
				int nCapacity,
				bool bConservative);  // 516
		CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::SetCount(
			int nCount);  // 2111
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2118
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2119
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2110
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2110
	}
	{
		int i; // 2124
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2124
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2129
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2126
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2126
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2131
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2131
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2134
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 588
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2135
	}
	{
		int nOldSize; // 2141
		{
			int i; // 2143
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2143
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2145
		}
		{
			int i; // 2148
			CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2148
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2150
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
			CUtlMemory<int, int>::operator[](
					int i);  // 588
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2152
		}
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2141
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2142
	}
	{
		int i; // 2162
		{
			CVfxShaderAttribute attr; // 2164
			CUtlMemory<int, int>::operator[](
					int i);  // 595
			CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
					int i);  // 2167
			CVfxShaderAttribute::FreeExpressionBuffer(); // 753
			CVfxShaderAttribute::FreeExpressionBuffer(); // 691
			CVfxShaderAttribute::~CVfxShaderAttribute(); // 2170
			CUtlMemory<CVfxShaderAttribute, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
					int i);  // 2164
			CUtlStringToken::CUtlStringToken(); // 685
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 764
			{
				byte* pTmp; // 767
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 768
			}
			CVfxShaderAttribute::InitFrom(
				const CVfxShaderAttribute& other);  // 686
			CVfxShaderAttribute::CVfxShaderAttribute(
						const CVfxShaderAttribute& other);  // 2164
		}
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2162
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2100
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2102
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2123
	Max<unsigned int>(const unsigned int& val1,
				const unsigned int& val2);  // 2158
	ThreadInterlockedExchange(volatile int32* p,
					int32 value);  // 641
	CInterlockedIntT<int, 4>::operator=(
			int newValue);  // 2173
} /* size: 0, variables: 1, inline expansions: 7 (0 bytes) */

// <06959BAB> vfx/vfx_common.cpp:2180
bool UInt32LessFunc(const uint32& nArg0, const uint32& nArg1)
{
} /* size: 12 */

// <06957469> vfx/vfx_common.cpp:2186
// variables: 26
// function calls: 144
void CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData* pProgramData)
{
	const char   __FUNCTION__; // 63136
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int, bool (*)(unsigned int const&, unsigned int const&)> variableIndexSet; // 2213
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2188
	}
	{
		int nDynamicCombo; // 2216
		{
			const CVfxVariableIndexArray& variableIndexArray; // 2218
			int nNumVariables; // 2219
			{
				int i; // 2220
				{
					BindInfo_t bi; // 2222
					uint32 nVariableIndex; // 2223
					union SetIndex_t setIdx; // 2226
					int nIdx; // 2229
					{
						const CVfxVariableDescription& var; // 2237
						CUtlMemory<CVfxVariableDescription, int>::operator[](
								int i);  // 595
						CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
								int i);  // 2237
						CVfxVariableDescription::IsShaderConstant(); // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2246
						CVfxVariableDescription::IsTexture(); // 2252
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2248
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2254
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2256
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2240
					}
					Node_t::Node_t(
						const KeyType_t& k,
						const ElemType_t& e);  // 207
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1667
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
							int i);  // 539
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
						int i);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1669
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1677
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FindInsertionPosition(
								const Node_t& insert,
								bool bCheckForDuplicates,
								int& parent,
								bool& leftchild,
								bool& isDuplicate);  // 1693
					{
						int newNode; // 1696
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 1008
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1696
					}
					{
						int newNode; // 1709
						{
						}
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1709
					}
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const Node_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 207
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const KeyType_t& key,
						const ElemType_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 2232
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2223
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2225
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1913
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
							int i);  // 545
					Element(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
						int i);  // 1912
					CKeyLess::operator(
							const KeyType_t& left,
							const Node_t& right);  // 1912
					CKeyLess::operator(
							const Node_t& left,
							const KeyType_t& right);  // 1914
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1915
					FindAltKeyType<unsigned int, CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::CKeyLess>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
																const unsigned int& search,
																const CKeyLess& altLess); // 298
					FindAltKeyType<unsigned int>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
									const unsigned int& search);  // 243
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Find(
						const KeyType_t& key);  // 2229
				}
			}
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2218
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2219
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2216
	}
	{
		int i; // 2265
		{
			VfxVariableIndexData_t tmpData; // 2267
			union SetIndex_t setIdx; // 2268
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
					int i);  // 539
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
				int i);  // 94
			CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Key(
				IndexType_t i);  // 2269
			{
				ElemType_t* pNew; // 168
				ElemType_t* pBase; // 169
				AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 85
				V_memcpy(void* dest,
					const void* src,
					ptrdiff_t count);  // 91
				UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
											VfxVariableIndexData_t* pFromEnd,
											VfxVariableIndexData_t* pTo);  // 170
			}
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
					int nCapacity,
					bool bConservative);  // 629
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 630
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTailGetPtr(); // 638
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTail(
					const VfxVariableIndexData_t& src);  // 2273
		}
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 611
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1329
		FirstInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this); // 351
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FirstInorder()::BindInf this); // 2265
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 661
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 667
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 659
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1339
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1343
		{
			int left; // 1346
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1347
		}
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1352
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 617
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 633
		IsRightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1353
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1357
		NextInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 352
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::NextInorder(
				IndexType_t i);  // 2265
	}
	{
		int i; // 2281
		{
			const CVfxVariableDescription& var; // 2283
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2283
			CUtlMemory<CVfxVariableDescription, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
					int i);  // 2283
			CVfxVariableDescription::CanBeInStaticConstantBuffer(); // 2284
		}
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2281
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2188
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	ValidateGrowSize(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 475
	CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 489
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::ResetDbgInfo()::Bi this); // 491
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 2213
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 201
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			const LessFunc_t& func);  // 201
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			LessFunc_t func);  // 2214
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 2264
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 2263
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1248
	{
	}
	{
	}
	{
	}
	{
		Iterator_t it; // 1256
		First(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		Iterator_t::Iterator_t(
				int i);  // 86
		InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		{
			int i; // 1258
			IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 661
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 667
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 659
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1259
			Destruct<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::Node_t>(Node_t* pMemory); // 1261
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLeftChild(
					int i,
					int child);  // 1263
		}
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 82
		Next(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
			const Iterator_t& it);  // 1256
	}
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::RemoveAll()::Bi this); // 1285
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 1287
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Purge()::Bi this); // 509
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlRBTree()::Bi this); // 47
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlMap()::BindInfo_t, i this); // 2291
} /* size: 0, variables: 2, inline expansions: 25 (1846 bytes) */

// <015F40EB> vfx/vfx_common.cpp:2186
// variables: 26
// function calls: 144
void CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData* pProgramData)
{
	const char   __FUNCTION__; // 43477
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int, bool (*)(unsigned int const&, unsigned int const&)> variableIndexSet; // 2213
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2188
	}
	{
		int nDynamicCombo; // 2216
		{
			const CVfxVariableIndexArray& variableIndexArray; // 2218
			int nNumVariables; // 2219
			{
				int i; // 2220
				{
					BindInfo_t bi; // 2222
					uint32 nVariableIndex; // 2223
					union SetIndex_t setIdx; // 2226
					int nIdx; // 2229
					{
						const CVfxVariableDescription& var; // 2237
						CUtlMemory<CVfxVariableDescription, int>::operator[](
								int i);  // 595
						CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
								int i);  // 2237
						CVfxVariableDescription::IsShaderConstant(); // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2246
						CVfxVariableDescription::IsTexture(); // 2252
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2248
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2254
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2256
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2240
					}
					Node_t::Node_t(
						const KeyType_t& k,
						const ElemType_t& e);  // 207
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1667
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
							int i);  // 539
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
						int i);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1669
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1677
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FindInsertionPosition(
								const Node_t& insert,
								bool bCheckForDuplicates,
								int& parent,
								bool& leftchild,
								bool& isDuplicate);  // 1693
					{
						int newNode; // 1696
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 1008
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1696
					}
					{
						int newNode; // 1709
						{
						}
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1709
					}
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const Node_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 207
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const KeyType_t& key,
						const ElemType_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 2232
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2223
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2225
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1913
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
							int i);  // 545
					Element(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
						int i);  // 1912
					CKeyLess::operator(
							const KeyType_t& left,
							const Node_t& right);  // 1912
					CKeyLess::operator(
							const Node_t& left,
							const KeyType_t& right);  // 1914
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1915
					FindAltKeyType<unsigned int, CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::CKeyLess>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
																const unsigned int& search,
																const CKeyLess& altLess); // 298
					FindAltKeyType<unsigned int>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
									const unsigned int& search);  // 243
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Find(
						const KeyType_t& key);  // 2229
				}
			}
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2218
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2219
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2216
	}
	{
		int i; // 2265
		{
			VfxVariableIndexData_t tmpData; // 2267
			union SetIndex_t setIdx; // 2268
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
					int i);  // 539
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
				int i);  // 94
			CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Key(
				IndexType_t i);  // 2269
			{
				ElemType_t* pNew; // 168
				ElemType_t* pBase; // 169
				AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 85
				V_memcpy(void* dest,
					const void* src,
					ptrdiff_t count);  // 91
				UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
											VfxVariableIndexData_t* pFromEnd,
											VfxVariableIndexData_t* pTo);  // 170
			}
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
					int nCapacity,
					bool bConservative);  // 629
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 630
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTailGetPtr(); // 638
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTail(
					const VfxVariableIndexData_t& src);  // 2273
		}
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 611
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1329
		FirstInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this); // 351
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FirstInorder()::BindInf this); // 2265
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 661
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 667
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 659
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1339
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1343
		{
			int left; // 1346
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1347
		}
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1352
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 617
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 633
		IsRightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1353
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1357
		NextInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 352
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::NextInorder(
				IndexType_t i);  // 2265
	}
	{
		int i; // 2281
		{
			const CVfxVariableDescription& var; // 2283
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2283
			CUtlMemory<CVfxVariableDescription, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
					int i);  // 2283
			CVfxVariableDescription::CanBeInStaticConstantBuffer(); // 2284
		}
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2281
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2188
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	ValidateGrowSize(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 475
	CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 489
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::ResetDbgInfo()::Bi this); // 491
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 2213
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 201
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			const LessFunc_t& func);  // 201
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			LessFunc_t func);  // 2214
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 2264
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 2263
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1248
	{
	}
	{
	}
	{
	}
	{
		Iterator_t it; // 1256
		First(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		Iterator_t::Iterator_t(
				int i);  // 86
		InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		{
			int i; // 1258
			IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 661
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 667
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 659
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1259
			Destruct<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::Node_t>(Node_t* pMemory); // 1261
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLeftChild(
					int i,
					int child);  // 1263
		}
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 82
		Next(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
			const Iterator_t& it);  // 1256
	}
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::RemoveAll()::Bi this); // 1285
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 1287
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Purge()::Bi this); // 509
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlRBTree()::Bi this); // 47
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlMap()::BindInfo_t, i this); // 2291
} /* size: 0, variables: 2, inline expansions: 25 (0 bytes) */

// <004BE988> vfx/vfx_common.cpp:2186
// variables: 26
// function calls: 144
void CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData* pProgramData)
{
	const char   __FUNCTION__; // 43983
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int, bool (*)(unsigned int const&, unsigned int const&)> variableIndexSet; // 2213
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2188
	}
	{
		int nDynamicCombo; // 2216
		{
			const CVfxVariableIndexArray& variableIndexArray; // 2218
			int nNumVariables; // 2219
			{
				int i; // 2220
				{
					BindInfo_t bi; // 2222
					uint32 nVariableIndex; // 2223
					union SetIndex_t setIdx; // 2226
					int nIdx; // 2229
					{
						const CVfxVariableDescription& var; // 2237
						CUtlMemory<CVfxVariableDescription, int>::operator[](
								int i);  // 595
						CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
								int i);  // 2237
						CVfxVariableDescription::IsShaderConstant(); // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2246
						CVfxVariableDescription::IsTexture(); // 2252
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2248
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2254
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2256
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2240
					}
					Node_t::Node_t(
						const KeyType_t& k,
						const ElemType_t& e);  // 207
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1667
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
							int i);  // 539
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
						int i);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1669
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1677
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FindInsertionPosition(
								const Node_t& insert,
								bool bCheckForDuplicates,
								int& parent,
								bool& leftchild,
								bool& isDuplicate);  // 1693
					{
						int newNode; // 1696
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 1008
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1696
					}
					{
						int newNode; // 1709
						{
						}
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1709
					}
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const Node_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 207
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const KeyType_t& key,
						const ElemType_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 2232
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2223
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2225
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1913
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
							int i);  // 545
					Element(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
						int i);  // 1912
					CKeyLess::operator(
							const KeyType_t& left,
							const Node_t& right);  // 1912
					CKeyLess::operator(
							const Node_t& left,
							const KeyType_t& right);  // 1914
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1915
					FindAltKeyType<unsigned int, CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::CKeyLess>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
																const unsigned int& search,
																const CKeyLess& altLess); // 298
					FindAltKeyType<unsigned int>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
									const unsigned int& search);  // 243
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Find(
						const KeyType_t& key);  // 2229
				}
			}
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2218
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2219
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2216
	}
	{
		int i; // 2265
		{
			VfxVariableIndexData_t tmpData; // 2267
			union SetIndex_t setIdx; // 2268
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
					int i);  // 539
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
				int i);  // 94
			CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Key(
				IndexType_t i);  // 2269
			{
				ElemType_t* pNew; // 168
				ElemType_t* pBase; // 169
				AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 85
				V_memcpy(void* dest,
					const void* src,
					ptrdiff_t count);  // 91
				UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
											VfxVariableIndexData_t* pFromEnd,
											VfxVariableIndexData_t* pTo);  // 170
			}
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
					int nCapacity,
					bool bConservative);  // 629
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 630
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTailGetPtr(); // 638
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTail(
					const VfxVariableIndexData_t& src);  // 2273
		}
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 611
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1329
		FirstInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this); // 351
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FirstInorder()::BindInf this); // 2265
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 661
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 667
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 659
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1339
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1343
		{
			int left; // 1346
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1347
		}
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1352
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 617
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 633
		IsRightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1353
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1357
		NextInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 352
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::NextInorder(
				IndexType_t i);  // 2265
	}
	{
		int i; // 2281
		{
			const CVfxVariableDescription& var; // 2283
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2283
			CUtlMemory<CVfxVariableDescription, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
					int i);  // 2283
			CVfxVariableDescription::CanBeInStaticConstantBuffer(); // 2284
		}
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2281
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2188
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	ValidateGrowSize(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 475
	CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 489
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::ResetDbgInfo()::Bi this); // 491
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 2213
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 201
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			const LessFunc_t& func);  // 201
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			LessFunc_t func);  // 2214
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 2264
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 2263
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1248
	{
	}
	{
	}
	{
	}
	{
		Iterator_t it; // 1256
		First(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		Iterator_t::Iterator_t(
				int i);  // 86
		InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		{
			int i; // 1258
			IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 661
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 667
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 659
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1259
			Destruct<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::Node_t>(Node_t* pMemory); // 1261
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLeftChild(
					int i,
					int child);  // 1263
		}
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 82
		Next(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
			const Iterator_t& it);  // 1256
	}
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::RemoveAll()::Bi this); // 1285
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 1287
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Purge()::Bi this); // 509
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlRBTree()::Bi this); // 47
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlMap()::BindInfo_t, i this); // 2291
} /* size: 0, variables: 2, inline expansions: 25 (0 bytes) */

// <00812D9A> vfx/vfx_common.cpp:2186
// variables: 26
// function calls: 144
void CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData* pProgramData)
{
	const char   __FUNCTION__; // 22454
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int, bool (*)(unsigned int const&, unsigned int const&)> variableIndexSet; // 2213
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2188
	}
	{
		int nDynamicCombo; // 2216
		{
			const CVfxVariableIndexArray& variableIndexArray; // 2218
			int nNumVariables; // 2219
			{
				int i; // 2220
				{
					BindInfo_t bi; // 2222
					uint32 nVariableIndex; // 2223
					union SetIndex_t setIdx; // 2226
					int nIdx; // 2229
					{
						const CVfxVariableDescription& var; // 2237
						CUtlMemory<CVfxVariableDescription, int>::operator[](
								int i);  // 595
						CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
								int i);  // 2237
						CVfxVariableDescription::IsShaderConstant(); // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2238
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2246
						CVfxVariableDescription::IsTexture(); // 2252
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2248
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 539
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							int i);  // 90
						CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
							IndexType_t i);  // 2254
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2256
						Color::SetColor(
							int _r,
							int _g,
							int _b,
							int _a);  // 50
						Color::Color(
							int _r,
							int _g,
							int _b,
							int _a);  // 2240
					}
					Node_t::Node_t(
						const KeyType_t& k,
						const ElemType_t& e);  // 207
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1667
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
							int i);  // 539
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
						int i);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1665
					CKeyLess::operator(
							const Node_t& left,
							const Node_t& right);  // 1669
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1677
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FindInsertionPosition(
								const Node_t& insert,
								bool bCheckForDuplicates,
								int& parent,
								bool& leftchild,
								bool& isDuplicate);  // 1693
					{
						int newNode; // 1696
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 1008
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1696
					}
					{
						int newNode; // 1709
						{
						}
						operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
								int i);  // 737
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Links(
							int i);  // 999
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::LinkToParent(
								int i,
								int parent,
								bool isLeft);  // 984
						CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::InsertAt(
							int parent,
							bool leftchild,
							const Node_t* pCopyFrom);  // 1709
					}
					CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const Node_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 207
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Insert(
						const KeyType_t& key,
						const ElemType_t& insert,
						ERBTreeInsertBehavior eInsertBehavior);  // 2232
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2223
					CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 452
					Element(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
						int i);  // 442
					operator[](const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this,
							int i);  // 2225
					LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1913
					operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
							int i);  // 545
					Element(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
						int i);  // 1912
					CKeyLess::operator(
							const KeyType_t& left,
							const Node_t& right);  // 1912
					CKeyLess::operator(
							const Node_t& left,
							const KeyType_t& right);  // 1914
					RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
							int i);  // 1915
					FindAltKeyType<unsigned int, CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::CKeyLess>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
																const unsigned int& search,
																const CKeyLess& altLess); // 298
					FindAltKeyType<unsigned int>(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
									const unsigned int& search);  // 243
					CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Find(
						const KeyType_t& key);  // 2229
				}
			}
			CUtlMemory<CVfxVariableIndexArray, int>::operator[](
					int i);  // 588
			CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
					int i);  // 2218
			Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2219
		}
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2216
	}
	{
		int i; // 2265
		{
			VfxVariableIndexData_t tmpData; // 2267
			union SetIndex_t setIdx; // 2268
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
					int i);  // 539
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Element(
				int i);  // 94
			CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Key(
				IndexType_t i);  // 2269
			{
				ElemType_t* pNew; // 168
				ElemType_t* pBase; // 169
				AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
				CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
				memcpy(void* __dest,
					const void* __src,
					size_t __len);  // 85
				V_memcpy(void* dest,
					const void* src,
					ptrdiff_t count);  // 91
				UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
											VfxVariableIndexData_t* pFromEnd,
											VfxVariableIndexData_t* pTo);  // 170
			}
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
					int nCapacity,
					bool bConservative);  // 629
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 630
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTailGetPtr(); // 638
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::AddToTail(
					const VfxVariableIndexData_t& src);  // 2273
		}
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 611
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1329
		FirstInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this); // 351
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::FirstInorder()::BindInf this); // 2265
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 661
		LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 667
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 659
		IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1339
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1343
		{
			int left; // 1346
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1347
		}
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1352
		operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 617
		RightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 633
		IsRightChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 1353
		Parent(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
			int i);  // 1357
		NextInorder(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
				int i);  // 352
		CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::NextInorder(
				IndexType_t i);  // 2265
	}
	{
		int i; // 2281
		{
			const CVfxVariableDescription& var; // 2283
			AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
			CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 447
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::Element(
				int i);  // 438
			CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, int>::operator[](
					int i);  // 2283
			CUtlMemory<CVfxVariableDescription, int>::operator[](
					int i);  // 595
			CUtlVectorBase<CVfxVariableDescription, CUtlMemory<CVfxVariableDescription, int> >::operator[](
					int i);  // 2283
			CVfxVariableDescription::CanBeInStaticConstantBuffer(); // 2284
		}
		Count(const CUtlLeanVectorImpl<CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>, VfxVariableIndexData_t, i this); // 2281
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2188
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 63
	ValidateGrowSize(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 475
	CUtlMemory(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this,
			int nGrowSize,
			int nInitAllocationCount);  // 484
	InvalidIndex(void); // 486
	InvalidIndex(void); // 488
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 489
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::ResetDbgInfo()::Bi this); // 491
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlRBTree(
			int growSize,
			int initSize,
			const LessFunc_t& lessfunc);  // 63
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::CUtlMap(
		int growSize,
		int initSize,
		LessFunc_t lessfunc);  // 2213
	CKeyLess::CKeyLess(
		LessFunc_t lessFunc);  // 201
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			const LessFunc_t& func);  // 201
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLessFunc(
			LessFunc_t func);  // 2214
	{
		ElemType_t* pNew; // 168
		ElemType_t* pBase; // 169
		AlignedByteArrayExplicit_t<2, VfxVariableIndexData_t, 2>::Base(); // 74
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 64
		CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::Base(); // 169
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 85
		V_memcpy(void* dest,
			const void* src,
			ptrdiff_t count);  // 91
		UtlTraitsMoveRawMemoryRange<VfxVariableIndexData_t>(VfxVariableIndexData_t* pFrom,
									VfxVariableIndexData_t* pFromEnd,
									VfxVariableIndexData_t* pTo);  // 170
	}
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::EnsureCapacity(
			int nCapacity,
			bool bConservative);  // 2264
	CUtlLeanVectorFixedGrowableBase<VfxVariableIndexData_t, 2, int>::RemoveAll(); // 2263
	Iterator_t::Iterator_t(
			int i);  // 86
	InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1248
	{
	}
	{
	}
	{
	}
	{
		Iterator_t it; // 1256
		First(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		Iterator_t::Iterator_t(
				int i);  // 86
		InvalidIterator(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this); // 1256
		{
			int i; // 1258
			IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 661
			operator[](const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
					int i);  // 611
			LeftChild(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 667
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 659
			IsValidIndex(const CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData this,
					int i);  // 1259
			Destruct<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData*)::BindInfo_t, int>::Node_t>(Node_t* pMemory); // 1261
			CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::SetLeftChild(
					int i,
					int child);  // 1263
		}
		IsIdxValid(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
				int i);  // 82
		Next(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const this,
			const Iterator_t& it);  // 1256
	}
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::RemoveAll()::Bi this); // 1285
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 903
	Purge(const CUtlMemory<UtlRBTreeNode_t<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxP this); // 1287
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::Purge()::Bi this); // 509
	CUtlRBTree<CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlRBTree()::Bi this); // 47
	CUtlMap<unsigned int, CVfxStaticComboData::ComputeVariablesUsedInStaticCombo(const CVfxProgramData::~CUtlMap()::BindInfo_t, i this); // 2291
} /* size: 0, variables: 2, inline expansions: 25 (0 bytes) */

// <0695743F> vfx/vfx_common.cpp:2294
void SerializeUInt32BackwardsCompatible(CUtlBuffer& buf, uint32 nVal)
{
} /* size: 0 */

// <0697C476> vfx/vfx_common.cpp:2308
// variables: 3
// function calls: 22
uint32 UnserializeUint32BackwardCompatible(CUtlBuffer& buf)
{
	uint16 nTmp; // 2310
	CUtlBuffer::IsText(); // 928
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 913
	StringToNumber<short unsigned int>(char* pString,
						char** ppEnd,
						int nRadix);  // 915
	CUtlBuffer::BGetTypeText<short unsigned int>(
					short unsigned int& value,
					int nRadix);  // 929
	CUtlBuffer::BGetType<short unsigned int>(
					short unsigned int& dest);  // 926
	CByteswap::IsSwappingBytes(); // 688
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 624
	CUtlBuffer::PeekGet(
		int offset);  // 690
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 694
	CUtlBuffer::BGetTypeBin<short unsigned int>(
					short unsigned int& dest);  // 672
	CUtlBuffer::BGetTypeBin<short unsigned int>(
					short unsigned int& dest);  // 930
	CUtlBuffer::BGetType<short unsigned int>(
					short unsigned int& dest);  // 1116
	CUtlBuffer::BGetUnsignedShort(
				short unsigned int* pOutUShort);  // 958
	CUtlBuffer::GetUnsignedShort(); // 2310
	CUtlBuffer::BGetUnsignedInt(
			uint* pOutUint);  // 993
	CUtlBuffer::GetUnsignedInt(); // 2313
	UnserializeUint32BackwardCompatible(CUtlBuffer& buf); // 2308
} /* size: 265, variables: 1, inline expansions: 19 (938 bytes) */

// <06957411> vfx/vfx_common.cpp:2308
// variable: 1
uint32 UnserializeUint32BackwardCompatible(CUtlBuffer& buf)
{
	uint16 nTmp; // 2310
} /* size: 0, variables: 1 */

// <06953514> vfx/vfx_common.cpp:2319
// variables: 36
// function calls: 217
void CVfxStaticComboData::Serialize(CUtlBuffer& buf, const CVfxByteCodeManager* pByteCodeManager, VfxProgram_t programType, uint64 nStaticComboId)
{
	const char   __FUNCTION__; // 62503
	CUtlBuffer tmpBuf; // 2327
	int nUnCompressedSize; // 2388
	VfxCompression_t compression; // 2389
	const int  nZstdCompressionLevel; // 2404
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2321
	}
	{
		int i; // 2341
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2341
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
				int i);  // 2343
	}
	{
		int i; // 2353
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2353
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 2355
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 2355
	}
	{
		int i; // 2366
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2366
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2368
	}
	{
		int i; // 2374
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2374
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		CUtlBuffer::IsText(); // 1313
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2377
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2376
		CUtlBuffer::IsText(); // 1313
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2376
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2377
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2399
	}
	{
		CUtlBuffer compressedBuffer; // 2417
		int nMaxCompressedSize; // 2418
		int nActualCompressedSize; // 2420
	}
	{
		CUtlBuffer compressedBuffer; // 2429
		int nMaxCompressedSize; // 2430
		int nActualCompressedSize; // 2432
	}
	{
		ZSTD_CDict* pCdict; // 2442
		CUtlBuffer compressedBuffer; // 2444
		int nMaxCompressedSize; // 2445
		ZSTD_CCtx* cctx; // 2448
		int nActualCompressedSize; // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlBuffer::PutInt(
			int i);  // 2452
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2453
		ValidateAlignment<unsigned char>(void); // 508
		CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned char, int>::Purge(); // 903
		CUtlMemory<unsigned char, int>::Purge(); // 510
		CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
		CUtlBuffer::~CUtlBuffer(); // 2454
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2458
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2321
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2340
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short int>(short int* output,
						short int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1240
	GetFmtStr<short int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<short int>(
				short int src);  // 1236
	CUtlBuffer::PutType<short int>(
				short int src);  // 1325
	CUtlBuffer::PutShort(
		short int s);  // 2340
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2352
	CUtlBuffer::IsText(); // 1238
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2352
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2365
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2365
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<float>(
				float src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<unsigned int>(unsigned int* output,
						unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<unsigned int>(
				unsigned int src);  // 1240
	GetFmtStr<unsigned int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1236
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1345
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2381
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 2382
	CUtlBuffer::TellPut(); // 2388
	CUtlBuffer::PutInt(
		int i);  // 2400
	CUtlBuffer::PutInt(
		int i);  // 2401
	CUtlBuffer::PutInt(
		int i);  // 2410
	CUtlMemory<unsigned char, int>::Base(); // 1484
	CUtlBuffer::Base(); // 2411
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 2460
} /* size: 0, variables: 5, inline expansions: 136 (7778 bytes) */

// <015F0196> vfx/vfx_common.cpp:2319
// variables: 36
// function calls: 217
void CVfxStaticComboData::Serialize(CUtlBuffer& buf, const CVfxByteCodeManager* pByteCodeManager, VfxProgram_t programType, uint64 nStaticComboId)
{
	const char   __FUNCTION__; // 42844
	CUtlBuffer tmpBuf; // 2327
	int nUnCompressedSize; // 2388
	VfxCompression_t compression; // 2389
	const int  nZstdCompressionLevel; // 2404
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2321
	}
	{
		int i; // 2341
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2341
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
				int i);  // 2343
	}
	{
		int i; // 2353
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2353
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 2355
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 2355
	}
	{
		int i; // 2366
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2366
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2368
	}
	{
		int i; // 2374
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2374
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		CUtlBuffer::IsText(); // 1313
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2377
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2376
		CUtlBuffer::IsText(); // 1313
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2376
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2377
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2399
	}
	{
		CUtlBuffer compressedBuffer; // 2417
		int nMaxCompressedSize; // 2418
		int nActualCompressedSize; // 2420
	}
	{
		CUtlBuffer compressedBuffer; // 2429
		int nMaxCompressedSize; // 2430
		int nActualCompressedSize; // 2432
	}
	{
		ZSTD_CDict* pCdict; // 2442
		CUtlBuffer compressedBuffer; // 2444
		int nMaxCompressedSize; // 2445
		ZSTD_CCtx* cctx; // 2448
		int nActualCompressedSize; // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlBuffer::PutInt(
			int i);  // 2452
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2453
		ValidateAlignment<unsigned char>(void); // 508
		CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned char, int>::Purge(); // 903
		CUtlMemory<unsigned char, int>::Purge(); // 510
		CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
		CUtlBuffer::~CUtlBuffer(); // 2454
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2458
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2321
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2340
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short int>(short int* output,
						short int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1240
	GetFmtStr<short int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<short int>(
				short int src);  // 1236
	CUtlBuffer::PutType<short int>(
				short int src);  // 1325
	CUtlBuffer::PutShort(
		short int s);  // 2340
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2352
	CUtlBuffer::IsText(); // 1238
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2352
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2365
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2365
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<float>(
				float src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<unsigned int>(unsigned int* output,
						unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<unsigned int>(
				unsigned int src);  // 1240
	GetFmtStr<unsigned int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1236
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1345
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2381
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 2382
	CUtlBuffer::TellPut(); // 2388
	CUtlBuffer::PutInt(
		int i);  // 2400
	CUtlBuffer::PutInt(
		int i);  // 2401
	CUtlBuffer::PutInt(
		int i);  // 2410
	CUtlMemory<unsigned char, int>::Base(); // 1484
	CUtlBuffer::Base(); // 2411
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 2460
} /* size: 0, variables: 5, inline expansions: 136 (0 bytes) */

// <004BAA33> vfx/vfx_common.cpp:2319
// variables: 36
// function calls: 217
void CVfxStaticComboData::Serialize(CUtlBuffer& buf, const CVfxByteCodeManager* pByteCodeManager, VfxProgram_t programType, uint64 nStaticComboId)
{
	const char   __FUNCTION__; // 43350
	CUtlBuffer tmpBuf; // 2327
	int nUnCompressedSize; // 2388
	VfxCompression_t compression; // 2389
	const int  nZstdCompressionLevel; // 2404
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2321
	}
	{
		int i; // 2341
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2341
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
				int i);  // 2343
	}
	{
		int i; // 2353
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2353
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 2355
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 2355
	}
	{
		int i; // 2366
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2366
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2368
	}
	{
		int i; // 2374
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2374
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		CUtlBuffer::IsText(); // 1313
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2377
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2376
		CUtlBuffer::IsText(); // 1313
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2376
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2377
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2399
	}
	{
		CUtlBuffer compressedBuffer; // 2417
		int nMaxCompressedSize; // 2418
		int nActualCompressedSize; // 2420
	}
	{
		CUtlBuffer compressedBuffer; // 2429
		int nMaxCompressedSize; // 2430
		int nActualCompressedSize; // 2432
	}
	{
		ZSTD_CDict* pCdict; // 2442
		CUtlBuffer compressedBuffer; // 2444
		int nMaxCompressedSize; // 2445
		ZSTD_CCtx* cctx; // 2448
		int nActualCompressedSize; // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlBuffer::PutInt(
			int i);  // 2452
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2453
		ValidateAlignment<unsigned char>(void); // 508
		CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned char, int>::Purge(); // 903
		CUtlMemory<unsigned char, int>::Purge(); // 510
		CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
		CUtlBuffer::~CUtlBuffer(); // 2454
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2458
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2321
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2340
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short int>(short int* output,
						short int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1240
	GetFmtStr<short int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<short int>(
				short int src);  // 1236
	CUtlBuffer::PutType<short int>(
				short int src);  // 1325
	CUtlBuffer::PutShort(
		short int s);  // 2340
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2352
	CUtlBuffer::IsText(); // 1238
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2352
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2365
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2365
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<float>(
				float src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<unsigned int>(unsigned int* output,
						unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<unsigned int>(
				unsigned int src);  // 1240
	GetFmtStr<unsigned int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1236
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1345
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2381
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 2382
	CUtlBuffer::TellPut(); // 2388
	CUtlBuffer::PutInt(
		int i);  // 2400
	CUtlBuffer::PutInt(
		int i);  // 2401
	CUtlBuffer::PutInt(
		int i);  // 2410
	CUtlMemory<unsigned char, int>::Base(); // 1484
	CUtlBuffer::Base(); // 2411
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 2460
} /* size: 0, variables: 5, inline expansions: 136 (0 bytes) */

// <0080EE45> vfx/vfx_common.cpp:2319
// variables: 36
// function calls: 217
void CVfxStaticComboData::Serialize(CUtlBuffer& buf, const CVfxByteCodeManager* pByteCodeManager, VfxProgram_t programType, uint64 nStaticComboId)
{
	const char   __FUNCTION__; // 21821
	CUtlBuffer tmpBuf; // 2327
	int nUnCompressedSize; // 2388
	VfxCompression_t compression; // 2389
	const int  nZstdCompressionLevel; // 2404
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2321
	}
	{
		int i; // 2341
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2341
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
				int i);  // 2343
	}
	{
		int i; // 2353
		CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2353
		CByteswap::IsSwappingBytes(); // 1208
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1204
		{
		}
		{
			int i; // 200
			{
				int i; // 214
			}
			memcpy(void* __dest,
				const void* __src,
				size_t __len);  // 91
			V_memcpy(void* dest,
				const void* src,
				size_t count);  // 218
			LowLevelByteSwap<short int>(short int* output,
							short int* input);  // 202
		}
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 170
		CByteswap::SwapBufferToTargetEndian<short int>(
							short int* outputBuffer,
							short int* inputBuffer,
							int count);  // 1214
		CUtlBuffer::PutTypeBin<short int>(
					short int src);  // 1240
		CUtlBuffer::IsText(); // 1238
		GetFmtStr<short int>(int nRadix,
					bool bPrint);  // 1244
		CUtlBuffer::PutType<short int>(
					short int src);  // 1236
		CUtlBuffer::PutType<short int>(
					short int src);  // 1325
		CUtlBuffer::PutShort(
			short int s);  // 2355
		CUtlMemory<int, int>::operator[](
				int i);  // 595
		CUtlVectorBase<int, CUtlMemory<int, int> >::operator[](
				int i);  // 2355
	}
	{
		int i; // 2366
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2366
		CUtlMemory<CVfxVariableIndexArray, int>::operator[](
				int i);  // 595
		CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::operator[](
				int i);  // 2368
	}
	{
		int i; // 2374
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2374
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		CUtlBuffer::IsText(); // 1313
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2377
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2376
		CUtlBuffer::IsText(); // 1313
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1204
		CUtlBuffer::PutTypeBin<unsigned char>(
						unsigned char src);  // 1315
		GetFmtStr<short unsigned int>(int nRadix,
						bool bPrint);  // 1244
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1236
		CUtlBuffer::PutType<short unsigned int>(
						short unsigned int src);  // 1330
		CUtlBuffer::PutUnsignedShort(
				short unsigned int s);  // 1319
		CUtlBuffer::PutUnsignedChar(
				unsigned char c);  // 2376
		CUtlMemory<ConstantBufferBindInfo_t, int>::operator[](
				int i);  // 595
		CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::operator[](
				int i);  // 2377
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2399
	}
	{
		CUtlBuffer compressedBuffer; // 2417
		int nMaxCompressedSize; // 2418
		int nActualCompressedSize; // 2420
	}
	{
		CUtlBuffer compressedBuffer; // 2429
		int nMaxCompressedSize; // 2430
		int nActualCompressedSize; // 2432
	}
	{
		ZSTD_CDict* pCdict; // 2442
		CUtlBuffer compressedBuffer; // 2444
		int nMaxCompressedSize; // 2445
		ZSTD_CCtx* cctx; // 2448
		int nActualCompressedSize; // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2449
		CUtlBuffer::PutInt(
			int i);  // 2452
		CUtlMemory<unsigned char, int>::Base(); // 1484
		CUtlBuffer::Base(); // 2453
		ValidateAlignment<unsigned char>(void); // 508
		CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
		CUtlMemory<unsigned char, int>::Purge(); // 903
		CUtlMemory<unsigned char, int>::Purge(); // 510
		CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
		CUtlBuffer::~CUtlBuffer(); // 2454
	}
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 2458
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 2321
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2340
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short int>(short int* output,
						short int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short int>(
						short int* outputBuffer,
						short int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1240
	GetFmtStr<short int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<short int>(
				short int src);  // 1236
	CUtlBuffer::PutType<short int>(
				short int src);  // 1325
	CUtlBuffer::PutShort(
		short int s);  // 2340
	CUtlVectorBase<int, CUtlMemory<int, int> >::Count(); // 2352
	CUtlBuffer::IsText(); // 1238
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2352
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 2365
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2365
	CUtlVectorBase<ConstantBufferBindInfo_t, CUtlMemory<ConstantBufferBindInfo_t, int> >::Count(); // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<short unsigned int>(short unsigned int* output,
							short unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2298
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<short int>(
				short int src);  // 1204
	{
	}
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 194
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 170
	CByteswap::SwapBufferToTargetEndian<short unsigned int>(
							short unsigned int* outputBuffer,
							short unsigned int* inputBuffer,
							int count);  // 1214
	CUtlBuffer::PutTypeBin<short unsigned int>(
					short unsigned int src);  // 1240
	GetFmtStr<short unsigned int>(int nRadix,
					bool bPrint);  // 1244
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1236
	CUtlBuffer::PutType<short unsigned int>(
					short unsigned int src);  // 1330
	CUtlBuffer::PutUnsignedShort(
			short unsigned int s);  // 2302
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2303
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2294
	SerializeUInt32BackwardsCompatible(CUtlBuffer& buf,
						uint32 nVal);  // 2373
	CUtlBuffer::IsText(); // 1238
	CByteswap::IsSwappingBytes(); // 1208
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<float>(
				float src);  // 1204
	{
	}
	{
		int i; // 200
		{
			int i; // 214
		}
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 91
		V_memcpy(void* dest,
			const void* src,
			size_t count);  // 218
		LowLevelByteSwap<unsigned int>(unsigned int* output,
						unsigned int* input);  // 202
	}
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 170
	CByteswap::SwapBufferToTargetEndian<unsigned int>(
						unsigned int* outputBuffer,
						unsigned int* inputBuffer,
						int count);  // 1214
	CUtlBuffer::PutTypeBin<unsigned int>(
				unsigned int src);  // 1240
	GetFmtStr<unsigned int>(int nRadix,
				bool bPrint);  // 1244
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1236
	CUtlBuffer::PutType<unsigned int>(
				unsigned int src);  // 1345
	CUtlBuffer::PutUnsignedInt(
			unsigned int u);  // 2381
	CUtlBuffer::IsText(); // 1253
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1256
	CUtlBuffer::WasLastCharacterCR(); // 1303
	{
		int i; // 1262
		CUtlMemory<unsigned char, int>::operator[](
				int i);  // 1166
		CUtlBuffer::PeekPut(
			int offset);  // 1210
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1204
		CUtlBuffer::PutTypeBin<char>(
				char src);  // 1264
	}
	CUtlBuffer::PutTabs(); // 1305
	CUtlMemory<unsigned char, int>::operator[](
			int i);  // 1166
	CUtlBuffer::PeekPut(
		int offset);  // 1210
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1204
	CUtlBuffer::PutTypeBin<char>(
			char src);  // 1308
	CUtlBuffer::PutChar(
		char c);  // 2382
	CUtlBuffer::TellPut(); // 2388
	CUtlBuffer::PutInt(
		int i);  // 2400
	CUtlBuffer::PutInt(
		int i);  // 2401
	CUtlBuffer::PutInt(
		int i);  // 2410
	CUtlMemory<unsigned char, int>::Base(); // 1484
	CUtlBuffer::Base(); // 2411
	ValidateAlignment<unsigned char>(void); // 508
	CUtlMemory<unsigned char, int>::IsExternallyAllocated(); // 905
	CUtlMemory<unsigned char, int>::Purge(); // 903
	CUtlMemory<unsigned char, int>::Purge(); // 510
	CUtlMemory<unsigned char, int>::~CUtlMemory(); // 53
	CUtlBuffer::~CUtlBuffer(); // 2460
} /* size: 0, variables: 5, inline expansions: 136 (0 bytes) */

// <06952D19> vfx/vfx_common.cpp:2463
// variables: 2
// function calls: 36
void CVfxStaticComboData::AllocateShaderAndRenderStateHandles(VfxProgram_t programType)
{
	{
		int i; // 2467
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::Count(); // 2467
		CUtlMemory<unsigned int, int>::operator[](
				int i);  // 588
		CUtlVectorBase<unsigned int, CUtlMemory<unsigned int, int> >::operator[](
				int i);  // 2469
	}
	{
		int i; // 2478
		CUtlVectorBase<RsRasterizerStateHandle_t__::Count(); // 2478
		CUtlMemory<RsRasterizerStateHandle_t__::operator[](
				int i);  // 588
		CUtlVectorBase<RsRasterizerStateHandle_t__::operator[](
				int i);  // 2480
		CUtlMemory<RsDepthStencilStateHandle_t__::operator[](
				int i);  // 588
		CUtlVectorBase<RsDepthStencilStateHandle_t__::operator[](
				int i);  // 2481
		CUtlMemory<RsBlendStateHandle_t__::operator[](
				int i);  // 588
		CUtlVectorBase<RsBlendStateHandle_t__::operator[](
				int i);  // 2482
	}
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 896
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 898
	CVfxStaticComboData::GetDynamicComboCount(); // 2466
	VfxProgramHasRenderState(VfxProgram_t programType); // 2473
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 896
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 898
	CVfxStaticComboData::GetDynamicComboCount(); // 2475
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 896
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 898
	CVfxStaticComboData::GetDynamicComboCount(); // 2476
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 896
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 898
	CVfxStaticComboData::GetDynamicComboCount(); // 2477
	CUtlVectorBase<CVfxVariableIndexRefArray, CUtlMemory<CVfxVariableIndexRefArray, int> >::Count(); // 892
	CVfxStaticComboData::IsDynamicComboVariableDataCompact(); // 896
	CUtlVectorBase<CVfxVariableIndexArray, CUtlMemory<CVfxVariableIndexArray, int> >::Count(); // 898
	CVfxStaticComboData::GetDynamicComboCount(); // 2488
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::Count(); // 2489
	CUtlMemory<unsigned char, int>::Base(); // 112
	CUtlVectorBase<unsigned char, CUtlMemory<unsigned char, int> >::Base(); // 2489
	memset(void* __dest,
		int __ch,
		size_t __len);  // 67
	V_memset(void* dest,
		int fill,
		size_t count);  // 2489
} /* size: 344, inline expansions: 26 (163 bytes) */

// <06952731> vfx/vfx_common.cpp:2494
// variables: 2
// function calls: 22
void CVfxStaticComboData::AddAttribute(const CVfxShaderAttribute& attr, bool* pFoundDuplicateInconsistentAttributeOut)
{
	{
		int i; // 2496
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2496
		CUtlMemory<CVfxShaderAttribute, int>::operator[](
				int i);  // 588
		CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::operator[](
				int i);  // 2498
		CUtlStringToken::operator!=(
				const CUtlStringToken& other);  // 7781
		CVfxShaderAttribute::IsTheSameAs(
				const CVfxShaderAttribute& other);  // 2498
		CVfxShaderAttribute::HasSameNameButDifferentValueAs(
						const CVfxShaderAttribute& other);  // 2502
	}
	CUtlMemory<CVfxShaderAttribute, int>::NumAllocated(); // 1196
	CUtlMemory<CVfxShaderAttribute, int>::operator[](
			int i);  // 602
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Element(
		int i);  // 1201
	CUtlStringToken::CUtlStringToken(); // 685
	memcpy(void* __dest,
		const void* __src,
		size_t __len);  // 91
	V_memcpy(void* dest,
		const void* src,
		size_t count);  // 764
	{
		byte* pTmp; // 767
		memcpy(void* __dest,
			const void* __src,
			size_t __len);  // 768
	}
	CVfxShaderAttribute::InitFrom(
		const CVfxShaderAttribute& other);  // 686
	CVfxShaderAttribute::CVfxShaderAttribute(
				const CVfxShaderAttribute& other);  // 1520
	CopyConstruct<CVfxShaderAttribute>(CVfxShaderAttribute* pMemory,
						const CVfxShaderAttribute& src);  // 1201
	CUtlMemory<CVfxShaderAttribute, int>::Base(); // 112
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Base(); // 368
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::ResetDbgInfo(); // 824
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::GrowMemory(
			int num);  // 1198
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::AddToTail(
			const CVfxShaderAttribute& src);  // 2509
	CUtlVectorBase<CVfxShaderAttribute, CUtlMemory<CVfxShaderAttribute, int> >::Count(); // 2511
} /* size: 436, inline expansions: 15 (964 bytes) */

// <068DDCC7> vfx/vfx_common.cpp:2517
void DecompressedComboData_t::DecompressedComboData_t()
{
} /* size: 0 */

// <068DDCAA> vfx/vfx_common.cpp:2517
inline void DecompressedComboData_t::DecompressedComboData_t()
{
} /* size: 0 */

// <068DC2A0> vfx/vfx_common.cpp:2517
void DecompressedComboData_t::~DecompressedComboData_t()
{
} /* size: 0 */

// <068DC283> vfx/vfx_common.cpp:2517
inline void DecompressedComboData_t::~DecompressedComboData_t()
{
} /* size: 0 */

// <068D8660> vfx/vfx_common.cpp:2524
// member functions: 10
// member variables: 4
// vtable entries: 2
// class size: 40
class CVfxShaderBuffer : public IRenderShaderByteCode {
public:
	/* class IRenderShaderByteCode <ancestor>; */ /* 0 8 */
	void CVfxShaderBuffer(CVfxShaderBuffer* , const CVfxShaderBuffer& );
	/* vfx/vfx_common.cpp:2527 */
	void CVfxShaderBuffer(CVfxShaderBuffer* , const shared_ptr<CVfxStaticComboData::DecompressedComboData_t>& , const void* , uint);
	/* vfx/vfx_common.cpp:2538 */
	virtual void ~CVfxShaderBuffer(CVfxShaderBuffer* );
	/* vfx/vfx_common.cpp:2542 */
	virtual uint32 GetSize(const CVfxShaderBuffer* );
	/* vfx/vfx_common.cpp:2547 */
	virtual const void* GetBits(const CVfxShaderBuffer* );
private:
	shared_ptr<CVfxStaticComboData::DecompressedComboData_t> m_pShaderData; /* 8 16 */
	const uint m_nBufferSize; /* 24 4 */
	const const void * m_pBuffer; /* 32 8 */
	void CVfxShaderBuffer(class CVfxShaderBuffer *, const class CVfxShaderBuffer  &); /* linkage=_ZN16CVfxShaderBufferC4ERKS_ */
	void CVfxShaderBuffer(class CVfxShaderBuffer *, const class shared_ptr<CVfxStaticComboData::DecompressedComboData_t>  &, const void  *, uint); /* linkage=_ZN16CVfxShaderBufferC4ERKSt10shared_ptrIN19CVfxStaticComboData23DecompressedComboData_tEEPKvj */
	virtual void ~CVfxShaderBuffer(class CVfxShaderBuffer *); /* linkage=_ZN16CVfxShaderBufferD4Ev */
	virtual uint32 GetSize(const class CVfxShaderBuffer  *); /* linkage=_ZNK16CVfxShaderBuffer7GetSizeEv */
	virtual const void  * GetBits(const class CVfxShaderBuffer  *); /* linkage=_ZNK16CVfxShaderBuffer7GetBitsEv */
};

// <06952655> vfx/vfx_common.cpp:2527
void CVfxShaderBuffer::CVfxShaderBuffer(const shared_ptr<CVfxStaticComboData::DecompressedComboData_t>& pShaderData, const void* pBuffer, uint nBufferSize)
{
	{
		{
		}
		{
		}
	}
} /* size: 0 */

// <069525C8> vfx/vfx_common.cpp:2527
// variables: 3
