
//
// public/kv3lib/kv3transfer_schema.h
//
//	referenced by: libanimationsystem.so
//				   libengine2.so
//				   libmaterialsystem2.so
//				   libmeshsystem.so
//
//	functions: 174
//	classes: 2
//

// <05216779> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CBaseConstraint* KV3TransferSchema_AllocateClassInstance<CBaseConstraint>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 55338
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <010FABAF> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
WorldNode_t* KV3TransferSchema_AllocateClassInstance<WorldNode_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 55087
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00F2C28A> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
World_t* KV3TransferSchema_AllocateClassInstance<World_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 53130
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00E72DA4> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
PermEntityLumpData_t* KV3TransferSchema_AllocateClassInstance<PermEntityLumpData_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 43287
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <009F6066> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
VPhysXAggregateData_t* KV3TransferSchema_AllocateClassInstance<VPhysXAggregateData_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 58267
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0239D194> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CBaseConstraint* KV3TransferSchema_AllocateClassInstance<CBaseConstraint>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 4410
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <01273255> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimStateList* KV3TransferSchema_AllocateClassInstance<CAnimStateList>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 10512
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00F5EDA9> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimNodeList* KV3TransferSchema_AllocateClassInstance<CAnimNodeList>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 38310
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00C8417C> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimData* KV3TransferSchema_AllocateClassInstance<CAnimData>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 22683
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00C84061> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CSequenceGroupData* KV3TransferSchema_AllocateClassInstance<CSequenceGroupData>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 22683
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00C83F39> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimationGroup* KV3TransferSchema_AllocateClassInstance<CAnimationGroup>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 22683
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00C8251F> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimationSubGraph* KV3TransferSchema_AllocateClassInstance<CAnimationSubGraph>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 22683
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00C82269> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimGraphDebugReplay* KV3TransferSchema_AllocateClassInstance<CAnimGraphDebugReplay>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 22683
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0084736F> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimStateConditionBase* KV3TransferSchema_AllocateClassInstance<CAnimStateConditionBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 15667
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00847217> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimStateTransition* KV3TransferSchema_AllocateClassInstance<CAnimStateTransition>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 15667
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0074E5E3> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimMotorBase* KV3TransferSchema_AllocateClassInstance<CAnimMotorBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 26391
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <006B0965> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CMotionClip* KV3TransferSchema_AllocateClassInstance<CMotionClip>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 49978
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <006773E8> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimTagBase* KV3TransferSchema_AllocateClassInstance<CAnimTagBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 65148
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <005A89A3> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CMotionClipGroup* KV3TransferSchema_AllocateClassInstance<CMotionClipGroup>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 41426
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <005A8849> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CMotionMetricBase* KV3TransferSchema_AllocateClassInstance<CMotionMetricBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 41426
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <004C3BFF> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimTagSpan* KV3TransferSchema_AllocateClassInstance<CAnimTagSpan>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 55721
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041E719> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimParameterBase* KV3TransferSchema_AllocateClassInstance<CAnimParameterBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041E5C2> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimParameterList* KV3TransferSchema_AllocateClassInstance<CAnimParameterList>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041E46B> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CParameterValue* KV3TransferSchema_AllocateClassInstance<CParameterValue>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041E314> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CActivityValues* KV3TransferSchema_AllocateClassInstance<CActivityValues>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041E1BD> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CActivityValueList* KV3TransferSchema_AllocateClassInstance<CActivityValueList>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041DC7D> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimNodeBase* KV3TransferSchema_AllocateClassInstance<CAnimNodeBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041DB26> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimNodeManager* KV3TransferSchema_AllocateClassInstance<CAnimNodeManager>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041D9CF> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimTagManager* KV3TransferSchema_AllocateClassInstance<CAnimTagManager>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041D878> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimMovementManager* KV3TransferSchema_AllocateClassInstance<CAnimMovementManager>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041D721> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimGraphSettingsGroup* KV3TransferSchema_AllocateClassInstance<CAnimGraphSettingsGroup>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041D5CA> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimGraphSettingsManager* KV3TransferSchema_AllocateClassInstance<CAnimGraphSettingsManager>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041D473> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CClipProperties* KV3TransferSchema_AllocateClassInstance<CClipProperties>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0041C6FC> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimState* KV3TransferSchema_AllocateClassInstance<CAnimState>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 13314
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0039B8F3> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimationGraph* KV3TransferSchema_AllocateClassInstance<CAnimationGraph>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 34462
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0039B799> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CAnimReplayFrame* KV3TransferSchema_AllocateClassInstance<CAnimReplayFrame>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 34462
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <011393BA> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CBaseConstraint* KV3TransferSchema_AllocateClassInstance<CBaseConstraint>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 4304
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0043D225> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CMorphSetData* KV3TransferSchema_AllocateClassInstance<CMorphSetData>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 40250
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0035A409> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
CBoneConstraintBase* KV3TransferSchema_AllocateClassInstance<CBoneConstraintBase>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 28069
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <0017023C> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
PermModelData_t* KV3TransferSchema_AllocateClassInstance<PermModelData_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 14011
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <00347392> ../public/kv3lib/kv3transfer_schema.h:18
// variables: 4
MaterialResourceData_t* KV3TransferSchema_AllocateClassInstance<MaterialResourceData_t>(const char* pDerivedClassName)
{
	const char   __FUNCTION__; // 55
	CSchemaType_DeclaredClass* pClassType; // 22
	ClassIntrospectionHandle_t pClass; // 40
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 20
	}
} /* size: 0, variables: 3 */

// <052167DB> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CBaseConstraint>(const CBaseConstraint* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 55064
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0185AE6F> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CRenderMesh>(const CRenderMesh* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 48944
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0239D1F6> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CBaseConstraint>(const CBaseConstraint* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 4136
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <012733B0> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CStateMachineAnimNode>(const CStateMachineAnimNode* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10243
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <012732B9> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimStateList>(const CAnimStateList* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10243
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00F5EE0D> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimNodeList>(const CAnimNodeList* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 38036
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00E2B2C9> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraphVisualizerText>(const CAnimationGraphVisualizerText* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10695
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00E2B1D2> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraphVisualizerSphere>(const CAnimationGraphVisualizerSphere* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10695
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00E2B0DB> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraphVisualizerLine>(const CAnimationGraphVisualizerLine* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10695
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00E2AFE4> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraphVisualizerPie>(const CAnimationGraphVisualizerPie* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10695
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00E2AEED> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraphVisualizerAxis>(const CAnimationGraphVisualizerAxis* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 10695
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00C82583> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationSubGraph>(const CAnimationSubGraph* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 22379
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00C822CD> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimGraphDebugReplay>(const CAnimGraphDebugReplay* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 22379
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <008473D1> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimStateConditionBase>(const CAnimStateConditionBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 15393
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <00847279> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimStateTransition>(const CAnimStateTransition* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 15393
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0074E646> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimMotorBase>(const CAnimMotorBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 26117
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <006B09C7> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CMotionClip>(const CMotionClip* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 49704
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <006777C6> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimMotorList>(const CAnimMotorList* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 64874
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <006776CF> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimMovementSettings>(const CAnimMovementSettings* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 64874
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0067744B> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimTagBase>(const CAnimTagBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 64874
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <005A8A06> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CMotionClipGroup>(const CMotionClipGroup* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 41152
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <005A88AC> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CMotionMetricBase>(const CMotionMetricBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 41152
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <005A7A41> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CSolveIKChainAnimNodeChainData>(const CSolveIKChainAnimNodeChainData* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 41152
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <004C41B1> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimInputDamping>(const CAnimInputDamping* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 55447
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <004C3C62> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimTagSpan>(const CAnimTagSpan* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 55447
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <004C3B08> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CBlend2DItem>(const CBlend2DItem* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 55447
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041E77B> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimParameterBase>(const CAnimParameterBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041E624> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimParameterList>(const CAnimParameterList* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041E4CD> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CParameterValue>(const CParameterValue* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041E376> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CActivityValues>(const CActivityValues* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041E21F> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CActivityValueList>(const CActivityValueList* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041DCDF> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimNodeBase>(const CAnimNodeBase* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041DB88> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimNodeManager>(const CAnimNodeManager* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041DA31> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimTagManager>(const CAnimTagManager* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041D8DA> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimMovementManager>(const CAnimMovementManager* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041D783> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimGraphSettingsGroup>(const CAnimGraphSettingsGroup* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041D62C> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimGraphSettingsManager>(const CAnimGraphSettingsManager* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041D4D5> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CClipProperties>(const CClipProperties* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0041C75E> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimState>(const CAnimState* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 13040
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0039B956> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimationGraph>(const CAnimationGraph* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 34188
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0039B7FC> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CAnimReplayFrame>(const CAnimReplayFrame* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 34188
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <0113941C> ../public/kv3lib/kv3transfer_schema.h:53
// variables: 4
bool KV3TransferSchema_ClassName<CBaseConstraint>(const CBaseConstraint* pObject, char& pOutPolymorphicClassName)
{
	const char   __FUNCTION__; // 4030
	const CSchemaClassInfo* pClassBinding; // 56
	const CSchemaClassInfo* pDerivedType; // 57
	{
		const _AssertCompileTimeConstantStruct_t  _assertionConstants; // 55
	}
	{
	}
} /* size: 0, variables: 3 */

// <06E48BD3> ../../public/kv3lib/kv3transfer_schema.h:70
type KV3Transfer_EnumeratorNameFromValue<vmix_filter_type_t>(vmix_filter_type_t nValue)
{
} /* size: 0 */

// <05388947> ../public/kv3lib/kv3transfer_schema.h:70
type KV3Transfer_EnumeratorNameFromValue<AnimVRFinger_t>(AnimVRFinger_t nValue)
{
} /* size: 0 */

// <05387F4B> ../public/kv3lib/kv3transfer_schema.h:70
type KV3Transfer_EnumeratorNameFromValue<AnimVRHand_t>(AnimVRHand_t nValue)
{
} /* size: 0 */

// <052DE3A2> ../public/kv3lib/kv3transfer_schema.h:70
type KV3Transfer_EnumeratorNameFromValue<FlexOpCode_t>(FlexOpCode_t nValue)
{
} /* size: 0 */

// <052DD4C7> ../public/kv3lib/kv3transfer_schema.h:70
type KV3Transfer_EnumeratorNameFromValue<MorphLookupType_t>(MorphLookupType_t nValue)
{
} /* size: 0 */

// <052DD49B> ../public/kv3lib/kv3transfer_schema.h:70
